Revit 2025 API
RebarBarType Methods
The RebarBarType type exposes the following members.
Methods
Name | Description
Create |  Creates a new RebarBarType object
CreateDefaultRebarBarType |  Creates a new RebarBarType object with a default name.
GetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
GetAutoCalculatedLapLength |  Identifies if the lap length is auto calculated for the specified Rebar Splice Type.
GetAutoCalculatedStaggerLength |  Identifies if the stagger length is auto calculated for the specified Rebar Splice Type.
GetHookLength |  Identifies the hook length for a hook type
GetHookOffsetLength |  Identifies the hook offset length for a hook type
GetHookPermission |  Identifies if a hook type is permitted for this bar type
GetHookTangentLength |  Identifies the hook tangent length for a hook type
GetLapLength |  Gets the lap length taking into account the specified Rebar Splice Type.
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetStaggerLength |  Gets the stagger length taking into account the specified Rebar Splice Type.
SetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
SetAutoCalculatedLapLength |  Sets if the lap length is auto calculated or not for the specified Rebar Splice Type.
SetAutoCalculatedStaggerLength |  Sets if the stagger length is auto calculated or not for the specified Rebar Splice Type.
SetBarTypeDiameters |  Sets all input diameters from diametersOptions in current RebarBarType.
SetHookLength |  Identifies the hook length for a hook type
SetHookOffsetLength |  Identifies the hook offset length for a hook type
SetHookPermission |  Identifies if a hook type is permitted for this bar type
SetHookTangentLength |  Identifies the hook tangent length for a hook type
SetLapLength |  Sets the lap length for the specified Rebar Splice Type.
SetStaggerLength |  Sets the stagger length for the specified Rebar Splice Type.
Top
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace