Revit 2025 API
RebarShape Class
 RebarShape specifies the shape type for a Rebar instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarShape
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class RebarShape : ElementType
Public Class RebarShape
	Inherits ElementType
public ref class RebarShape : public ElementType
type RebarShape =
    class
        inherit ElementType
    end
The RebarShape type exposes the following members.
Properties
Name | Description
HigherEnd |  Defines the higher end of rebar shape.
RebarStyle |  Whether the shape represents a standard bar or a stirrup.
ShapeFamilyId |  Get and return the rebar shape family id.
SimpleArc |  Check whether this shape consists of a single arc, possibly with hooks.
SimpleLine |  Check whether this shape consists of a single straight segment, possibly with hooks.
StirrupTieAttachment |  The attachment type of stirrup ties and rebars.
Top
Methods
Name | Description
Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32) |  Create a new instance of a Rebar Shape, which defines the shape of a rebar.
Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32, Double, Double, ElementId, ElementId) |  Create a new instance of a Rebar Shape, which defines the shape of a rebar.
GetAllowed |  Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
GetCurvesForBrowser |  Generate curves for the shape, as used in the shape browser.
GetDefaultHookAngle |  Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180).
GetDefaultHookOrientation |  Get the hook orientation.
GetEndTreatmentTypeId |  Gets the id of the EndTreatmentType at the specified rebar shape end.
GetHookRotationAngle |  Gets the out of plane hook rotation angle at the specified end.
GetMultiplanarDefinition |  The optional 3D structure of the shape.
GetRebarShapeDefinition |  Return the definition of the RebarShape.
HasEndTreatment |  Identifies if the rebar shape has end treatment at at least one end.
IsSameShapeIgnoringHooks |  Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties.
SetAllowed |  Specify which bar types can be used with this RebarShape. Bar types are allowed by default.
SetEndTreatmentTypeId |  Sets the EndTreatmentType id at the specified rebar shape end.
SetHookRotationAngle |  Sets the out of plane hook rotation angle at the specified end.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace