Revit 2025 API
GenericZone Class
 Provides access to the GenericZone Element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.GenericZone
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class GenericZone : Element
Public Class GenericZone
	Inherits Element
public ref class GenericZone : public Element
type GenericZone =
    class
        inherit Element
    end
The GenericZone type exposes the following members.
Properties
Name | Description
LevelOffset |  The offset distance from this zone to the associated level.
Top
Methods
Name | Description
Create |  Creates a new instance of a generic zone and adds it to the document.
GetBoundaries |  Gets the boundaries for the generic zone.
GetDomainData |  Gets the domain data for the generic zone.
Top
Remarks
 A generic zone is a tool that provides for a method of selecting elements that somehow come in contact with the zone object. A zone is a non-hierarchical structure of geometric information, area or volume definitions for the purpose of analysis. A generic zone will contain specific domain requirements provided at creation of the element.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace