Revit 2025 API
Zone Methods
The Zone type exposes the following members.
Methods
Name | Description
AddSpaces | Add a set of existing spaces to Zone element.
CreateAreaBasedLoad |  Creates a new instance of an area based load and adds it to the document.
GetDomainData |  Gets the domain data for the zone.
RemoveSpaces | Remove a set of existing spaces to the current Zone element.
Top
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace