Revit 2025 API
Ceiling Methods
The Ceiling type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId) |  Creates a new instance of ceiling within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Line, Double) |  Creates a new instance of ceiling within the project.
Top
See Also
Reference
Ceiling Class
Autodesk.Revit.DB Namespace