Revit 2025 API
SpatialElement Methods
The SpatialElement type exposes the following members.
Methods
Name | Description
GetBoundarySegments | Returns the boundary segments.
GetSpatialElementDomainData |  Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data.
Top
See Also
Reference
SpatialElement Class
Autodesk.Revit.DB Namespace