Revit 2025 API
DirectContext3DHandleSettings Methods
The DirectContext3DHandleSettings type exposes the following members.
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose
GetTransparency |  Gets the transparency value of the handle and the associated DirectContext3D graphics.
IsEqual |  Check if the contents of two instances of settings are equal.
SetTransparency |  Sets the transparency value of the handle and the associated DirectContext3D graphics.
Top
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace