Revit 2025 API
WallFoundation Class
 An object that represents a wall foundation element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.WallFoundation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class WallFoundation : HostObject
Public Class WallFoundation
	Inherits HostObject
public ref class WallFoundation : public HostObject
type WallFoundation =
    class
        inherit HostObject
    end
The WallFoundation type exposes the following members.
Properties
Name | Description
WallId |  Returns the id of the host wall.
Top
Methods
Name | Description
Create |  Creates a new wall foundation within the project.
Top
Example
public void GetInfo_WallFoundation(WallFoundation wallFoundation)
{
    string message = "Wall Foundation : ";
    // Get Footing type name
    Document doc = wallFoundation.Document;
    message += "\nFoundation type name is : " + doc.GetElement(wallFoundation.GetTypeId()).Name;
    TaskDialog.Show("Revit",message);
}
Public Sub GetInfo_WallFoundation(wallFoundation As WallFoundation)
   Dim message As String = "Wall Foundation : "
   ' Get Footing type name
   Dim doc As Document = wallFoundation.Document
   message += vbLf & "Foundation type name is : " & Convert.ToString(doc.GetElement(wallFoundation.GetTypeId()).Name)
   TaskDialog.Show("Revit", message)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB Namespace