Revit 2025 API
RoomTag Class
Provides access to the room tag in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementTag
 Autodesk.Revit.DB.Architecture.RoomTag
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class RoomTag : SpatialElementTag
Public Class RoomTag
	Inherits SpatialElementTag
public ref class RoomTag : public SpatialElementTag
type RoomTag =
    class
        inherit SpatialElementTag
    end
The RoomTag type exposes the following members.
Properties
Name | Description
IsInRoom | Identifies if the tag is located in a room.
Room | The room that the tag is associated with.
RoomTagType | The tag type.
TaggedLocalRoomId | The ElementId of the tagged room.
TaggedRoomId | The LinkElementId of the tagged room.
Top
Methods
Name | Description
Top
Example
private void Getinfo_RoomTag(RoomTag roomTag)
{
    string message = "Room Tag : ";
    //get the location of the roomtag
    LocationPoint location = roomTag.Location as LocationPoint;
    XYZ point = location.Point;
    message += "\nRoomTag location: (" + point.X + ", " +
                   point.Y + ", " + point.Z + ")";
    //get the name of the roomTag
    message += "\nName: " + roomTag.Name;
    //get the room that the tag is associated with
    Room room = roomTag.Room;
    message += "\nThe number of the room is : " + room.Number;
    //get the view in which the tag is placed
    Autodesk.Revit.DB.View view = roomTag.View;
    if (null != view)
    {
        message += "\nView Name: " + view.Name;
    }
    TaskDialog.Show("Revit",message);
}
Private Sub Getinfo_RoomTag(roomTag As RoomTag)
    Dim message As String = "Room Tag : "
    'get the location of the roomtag
    Dim location As LocationPoint = TryCast(roomTag.Location, LocationPoint)
    Dim point As XYZ = location.Point
    message += ((vbLf & "RoomTag location: (" + point.X & ", ") + point.Y & ", ") + point.Z & ")"
    'get the name of the roomTag
    message += vbLf & "Name: " & Convert.ToString(roomTag.Name)
    'get the room that the tag is associated with
    Dim room As Room = roomTag.Room
    message += vbLf & "The number of the room is : " + room.Number
    'get the view in which the tag is placed
    Dim view As Autodesk.Revit.DB.View = roomTag.View
    If view IsNot Nothing Then
        message += vbLf & "View Name: " + view.Name
    End If
    TaskDialog.Show("Revit", message)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace