Revit 2025 API
WireMaterialType Class
 Represents electrical wire material type definition information of wire type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.WireMaterialType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class WireMaterialType : ElementType
Public Class WireMaterialType
	Inherits ElementType
public ref class WireMaterialType : public ElementType
type WireMaterialType =
    class
        inherit ElementType
    end
The WireMaterialType type exposes the following members.
Properties
Name | Description
GroundConductorSizes |  Get all ground conductor size types defined in this wire material type.
IsInUse |  Indicate whether the wire material type is in use.
Name |  Get name of wire material type.
(Overrides ElementType.Name)
TemperatureRatings |  Get all temperature rating type definitions defined in this wire material type.
Top
Methods
Name | Description
AddGroundConductorSize |  Add new electrical ground conductor size type into this material type.
AddTemperatureRatingType |  Add a new temperature rating type into material type.
RemoveGroundConductorSize |  Remove an existing ground conductor size from this material type.
RemoveTemperatureRatingType |  Remove an existing temperature rating type from this material type.
Top
Remarks
 All the other properties of wire type are based on wire material type. Only the wire material types which are retrieved from ElectricalSetting can work well, so don't retrieve it from Revit project directly.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace