Revit 2025 API
InsulationType Class
 Represents electrical insulation type definition information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.InsulationType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class InsulationType : ElementType
Public Class InsulationType
	Inherits ElementType
public ref class InsulationType : public ElementType
type InsulationType =
    class
        inherit ElementType
    end
The InsulationType type exposes the following members.
Properties
Name | Description
IsInUse |  Indicate whether the insulation type is in use.
Name |  Get name of Insulation type.
(Overrides ElementType.Name)
Top
Methods
Name | Description
Top
Remarks
Insulation type is defined based on corresponding wire material type and temperature rating type.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace