Revit 2025 API
PointLoad Class
 An object that represents a force/moment applied to a single point. Data members
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadBase
 Autodesk.Revit.DB.Structure.PointLoad
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class PointLoad : LoadBase
Public Class PointLoad
	Inherits LoadBase
public ref class PointLoad : public LoadBase
type PointLoad =
    class
        inherit LoadBase
    end
The PointLoad type exposes the following members.
Properties
Name | Description
ForceVector |  The force vector applied to the point load, oriented according to OrientTo setting.
MomentVector |  The moment vector applied to the point load, oriented according to OrientTo setting.
Point |  Returns the position of point load, measured in decimal feet.
Top
Methods
Name | Description
Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) |  Creates a new hosted point load within the project.
Create(Document, ElementId, XYZ, XYZ, XYZ, PointLoadType) |  Creates a new custom hosted point load within the project using data at point.
IsPointInsideHostBoundaries |  Indicates if the point is inside panel's boundaries or if the point is on the member's curve..
IsValidHostId |  Indicates if the provided host id can host point loads The document containing both the host and the load The id of the analytical element that is about to host a point load True if a point load can be placed on the input host id
Top
Example
private void Getinfo_PointLoad(PointLoad pointLoad)
{
    string message = "Point Load :";
    // Get the load case name
    message += "\nLoad case for load: " + pointLoad.LoadCaseName;
    //get the three dimensional force applied to the point load
    message += "\nForce: (" + pointLoad.ForceVector.X + ", " +
             pointLoad.ForceVector.Y + ", " + pointLoad.ForceVector.Z + ")";
    //get the three dimensional moment application to the point load
    message += "\nMoment: (" + pointLoad.MomentVector.X + ", " +
             pointLoad.MomentVector.Y + ", " + pointLoad.MomentVector.Z + ")";
    //get the three dimensional coordinates of point load
    message += "\nPoint load location: (" + pointLoad.Point.X + ", " +
             pointLoad.Point.Y + ", " + pointLoad.Point.Z + ")";
    TaskDialog.Show("Revit",message);
}
Private Sub Getinfo_PointLoad(pointLoad As PointLoad)
    Dim message As String = "Point Load :"
    ' Get the load case name
    message += vbLf & "Load case for load: " & Convert.ToString(pointLoad.LoadCaseName)
    'get the three dimensional force applied to the point load
 message += vbLf & "Force: (" & Convert.ToString(pointLoad.ForceVector.X) & ", " & Convert.ToString(pointLoad.ForceVector.Y) & ", " & Convert.ToString(pointLoad.ForceVector.Z) & ")"
    'get the three dimensional moment application to the point load
 message += vbLf & "Moment: (" & Convert.ToString(pointLoad.MomentVector.X) & ", " & Convert.ToString(pointLoad.MomentVector.Y) & ", " & Convert.ToString(pointLoad.MomentVector.Z) & ")"
    'get the three dimensional coordinates of point load
    message += vbLf & "Point load location: (" & Convert.ToString(pointLoad.Point.X) & ", " & Convert.ToString(pointLoad.Point.Y) & ", " & Convert.ToString(pointLoad.Point.Z) & ")"
    TaskDialog.Show("Revit", message)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace