Revit 2025 API
RevolvedFace Class
A revolved face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.RevolvedFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class RevolvedFace : Face
Public Class RevolvedFace
	Inherits Face
public ref class RevolvedFace : public Face
type RevolvedFace =
    class
        inherit Face
    end
The RevolvedFace type exposes the following members.
Properties
Name | Description
Axis | Axis of the surface.
Curve | Profile curve of the surface.
Origin | Origin of the surface.
Radius | Radius of the surface.
Top
Methods
Name | Description
Top
Remarks
Revolved faces are defined by a profile curve and a local coordinate system. For details on the parameterization, refer to the documentation for RevolvedSurface
Example
private void GetRevolvedFaceInfo(Face face)
{
    RevolvedFace revolvedFace = face as RevolvedFace;
    if (null != revolvedFace)
    {
       XYZ origin = revolvedFace.Origin;
       XYZ axis = revolvedFace.Axis;
        Curve curve = revolvedFace.Curve;
        XYZ redius = revolvedFace.get_Radius(0);
    }
}
Private Sub GetRevolvedFaceInfo(face As Face)
    Dim revolvedFace As RevolvedFace = TryCast(face, RevolvedFace)
    If revolvedFace IsNot Nothing Then
        Dim origin As XYZ = revolvedFace.Origin
        Dim axis As XYZ = revolvedFace.Axis
        Dim curve As Curve = revolvedFace.Curve
        Dim redius As XYZ = revolvedFace.Radius(0)
    End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB Namespace