Revit 2025 API
ExternalDataInstanceRemovedFromDocumentEventArgs Properties
The ExternalDataInstanceRemovedFromDocumentEventArgs type exposes the following members.
Properties
Name | Description
TypeId |  The type id of the external data instance id that has been removed from Revit document.
Top
See Also
Reference
ExternalDataInstanceRemovedFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace