Revit 2025 API
GenericZone Methods
The GenericZone type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a generic zone and adds it to the document.
GetBoundaries |  Gets the boundaries for the generic zone.
GetDomainData |  Gets the domain data for the generic zone.
Top
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace