Revit 2025 API
RebarBarType Class
 A Rebar type object that is used in the generation of Rebar
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarBarType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class RebarBarType : ElementType
Public Class RebarBarType
	Inherits ElementType
public ref class RebarBarType : public ElementType
type RebarBarType =
    class
        inherit ElementType
    end
The RebarBarType type exposes the following members.
Properties
Name | Description
BarModelDiameter |  Defines bar model diameter of rebar
BarNominalDiameter |  Defines bar nominal diameter of rebar
DeformationType |  Defines bar deformation type.
MaximumBendRadius |  Defines maximum bend radius of rebar
StandardBendDiameter |  Defines bar bend diameter for rebar whose style is standard
StandardHookBendDiameter |  Defines hook bend diameter for rebar whose style is standard
StirrupTieBendDiameter |  Defines bar and hook bend diameter for rebar whose style is stirrup/tie
Top
Methods
Name | Description
Create |  Creates a new RebarBarType object
CreateDefaultRebarBarType |  Creates a new RebarBarType object with a default name.
GetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
GetAutoCalculatedLapLength |  Identifies if the lap length is auto calculated for the specified Rebar Splice Type.
GetAutoCalculatedStaggerLength |  Identifies if the stagger length is auto calculated for the specified Rebar Splice Type.
GetHookLength |  Identifies the hook length for a hook type
GetHookOffsetLength |  Identifies the hook offset length for a hook type
GetHookPermission |  Identifies if a hook type is permitted for this bar type
GetHookTangentLength |  Identifies the hook tangent length for a hook type
GetLapLength |  Gets the lap length taking into account the specified Rebar Splice Type.
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetStaggerLength |  Gets the stagger length taking into account the specified Rebar Splice Type.
SetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
SetAutoCalculatedLapLength |  Sets if the lap length is auto calculated or not for the specified Rebar Splice Type.
SetAutoCalculatedStaggerLength |  Sets if the stagger length is auto calculated or not for the specified Rebar Splice Type.
SetBarTypeDiameters |  Sets all input diameters from diametersOptions in current RebarBarType.
SetHookLength |  Identifies the hook length for a hook type
SetHookOffsetLength |  Identifies the hook offset length for a hook type
SetHookPermission |  Identifies if a hook type is permitted for this bar type
SetHookTangentLength |  Identifies the hook tangent length for a hook type
SetLapLength |  Sets the lap length for the specified Rebar Splice Type.
SetStaggerLength |  Sets the stagger length for the specified Rebar Splice Type.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace