Revit 2025 API
ExternalDataInstanceRemovedFromDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceRemovedFrom event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceRemovedFromDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExternalDataInstanceRemovedFromDocumentEventArgs : RevitAPIPostDocEventArgs
Public Class ExternalDataInstanceRemovedFromDocumentEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ExternalDataInstanceRemovedFromDocumentEventArgs : public RevitAPIPostDocEventArgs
type ExternalDataInstanceRemovedFromDocumentEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ExternalDataInstanceRemovedFromDocumentEventArgs type exposes the following members.
Properties
Name | Description
TypeId |  The type id of the external data instance id that has been removed from Revit document.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace