Revit 2025 API
GBXMLExportOptions Methods
The GBXMLExportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetMassIds |  Gets a list of masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
GetMassZoneIds |  Gets a list of mass zones to analyze in the exported gbXML.
Top
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace