Revit 2025 API
ProjectBrowserDataChangedEventArgs Class
 The event arguments used by the ProjectBrowserDataChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.ProjectBrowserDataChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ProjectBrowserDataChangedEventArgs : RevitAPISingleEventArgs
Public Class ProjectBrowserDataChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class ProjectBrowserDataChangedEventArgs : public RevitAPISingleEventArgs
type ProjectBrowserDataChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The ProjectBrowserDataChangedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace