Revit 2025 API
ExternalDataInstanceRemovingFromDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceRemovingFrom event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExternalDataInstanceRemovingFromDocumentEventArgs : RevitAPIPreDocEventArgs
Public Class ExternalDataInstanceRemovingFromDocumentEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ExternalDataInstanceRemovingFromDocumentEventArgs : public RevitAPIPreDocEventArgs
type ExternalDataInstanceRemovingFromDocumentEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ExternalDataInstanceRemovingFromDocumentEventArgs type exposes the following members.
Properties
Name | Description
InstanceId |  The Revit id of the external data instance being removed from Revit document.
TypeId |  The type id of the external data instance id being removed from Revit document.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace