Revit 2025 API
AreaLoad Class
 An object that represents a force applied across an area.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadBase
 Autodesk.Revit.DB.Structure.AreaLoad
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class AreaLoad : LoadBase
Public Class AreaLoad
	Inherits LoadBase
public ref class AreaLoad : public LoadBase
type AreaLoad =
    class
        inherit LoadBase
    end
The AreaLoad type exposes the following members.
Properties
Name | Description
Area |  Returns area of the area load.
ForceVector1 |  The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting.
ForceVector2 |  The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting.
ForceVector3 |  The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
IsProjected |  Indicates if the load is projected.
NumRefPoints |  Returns the total number of reference points for the area load.
Top
Methods
Name | Description
AreCurveLoopsValid |  Checks if curve loops are valid for creating an area load.
Create(Document, ElementId, XYZ, AreaLoadType) |  Creates a new hosted area load within the project.
Create(Document, ElementId, IList<CurveLoop>, XYZ, AreaLoadType) |  Creates a new custom area load within the project.
Create(Document, ElementId, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType) |  Creates a new custom area load within the project.
GetLoops |  Returns curve loops that define geometry of the area load.
GetRefPoint |  Returns the physical location of the reference point.
IsCurveLoopsInsideHostBoundaries |  Checks if contour loops is inside host boundaries.
IsValidHostId |  Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical element that is about to host an area load True if an area load can be placed on the input host id
SetLoops |  Sets curve loops that define geometry of the area load.
Top
Example
public void GetInfo_AreaLoad(AreaLoad areaLoad)
{
    string message = "AreaLoad Force : ";
    // Get areaload force1 position
    message += "\nAreaLoad Force1 position :(" + areaLoad.ForceVector1.X + ", "
        + areaLoad.ForceVector1.Y + ", " + areaLoad.ForceVector1.Z + ")";
    // Get areaload force2 position
    message += "\nAreaLoad Force2 position :(" + areaLoad.ForceVector2.X + ", "
        + areaLoad.ForceVector2.Y + ", " + areaLoad.ForceVector2.Z + ")";
    // Get areaload force3 position
    message += "\nAreaLoad Force3 position :(" + areaLoad.ForceVector3.X + ", "
        + areaLoad.ForceVector3.Y + ", " + areaLoad.ForceVector3.Z + ")";
    // Get Loops
    int loopIndex = 0;
    foreach (CurveLoop curveLoop in areaLoad.GetLoops())
    {
       message += "\nLoop " + loopIndex + " consist of following points :";
       foreach (Curve curve in curveLoop)
       {
          message += " (" + curve.GetEndPoint(0).X + ", " + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
       }
       loopIndex++;
    }
    // Get ref points information
    for (int k = 0; k < areaLoad.NumRefPoints; k++)
    {
        // Get areaload Ref point
        message += "\nAreaLoad Ref point :(" + areaLoad.GetRefPoint(k).X + ", "
            + areaLoad.GetRefPoint(k).Y + ", " + areaLoad.GetRefPoint(k).Z + ")";
    }
    TaskDialog.Show("Revit",message);
}
Public Sub GetInfo_AreaLoad(areaLoad As AreaLoad)
    Dim message As String = "AreaLoad Force : "
    ' Get areaload force1 position
 message += vbLf & "AreaLoad Force1 position :(" & Convert.ToString(areaLoad.ForceVector1.X) & ", " & Convert.ToString(areaLoad.ForceVector1.Y) & ", " & Convert.ToString(areaLoad.ForceVector1.Z) & ")"
    ' Get areaload force2 position
 message += vbLf & "AreaLoad Force2 position :(" & Convert.ToString(areaLoad.ForceVector2.X) & ", " & Convert.ToString(areaLoad.ForceVector2.Y) & ", " & Convert.ToString(areaLoad.ForceVector2.Z) & ")"
    ' Get areaload force3 position
 message += vbLf & "AreaLoad Force3 position :(" & Convert.ToString(areaLoad.ForceVector3.X) & ", " & Convert.ToString(areaLoad.ForceVector3.Y) & ", " & Convert.ToString(areaLoad.ForceVector3.Z) & ")"
    ' Get Loops
    Dim loopIndex As Integer = 0
    For Each curveLoop As CurveLoop In areaLoad.GetLoops()
        message += vbLf & "Loop " +  loopIndex + " consist of following points :"
        For Each curve As Autodesk.Revit.DB.Curve In curveLoop
            message += ((" (" + curve.GetEndPoint(0).X & ", ") + curve.GetEndPoint(0).Y & ", ") + curve.GetEndPoint(0).Z & ")"
        Next
         loopIndex =  loopIndex + 1
    Next
    ' Get ref points information
    For k As Integer = 0 To areaLoad.NumRefPoints - 1
        ' Get areaload Ref point
        message += ((vbLf & "AreaLoad Ref point :(" + areaLoad.GetRefPoint(k).X & ", ") + areaLoad.GetRefPoint(k).Y & ", ") + areaLoad.GetRefPoint(k).Z & ")"
    Next
    TaskDialog.Show("Revit", message)
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace