Revit 2025 API
MEPAnalyticalSegment Class
 Represents an analytical segment of the MEP analytical model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class MEPAnalyticalSegment : IDisposable
Public Class MEPAnalyticalSegment
	Implements IDisposable
public ref class MEPAnalyticalSegment : IDisposable
type MEPAnalyticalSegment =
    class
        interface IDisposable
    end
The MEPAnalyticalSegment type exposes the following members.
Properties
Name | Description
Area |  The area of the segment profile.
DemandFlow |  The designed flow value, in ft^3/s.
DomainType |  The connector domain type of this segment.
EndNode |  The id of the end analytical node.
Id |  The identity of this segment.
InnerDiameter |  The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RevitElementId |  The id of the owning Revit element.
Roughness |  The roughness of this segment, in ft.
SegmentType |  The analytical segment type.
StartNode |  The id of the start analytical node.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPAnalyticalSegment
GetNetworkSegmentId |  Gets the NetworkSegmentId.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace