Revit 2025 API
Toposolid Class
 An object that represents a Toposolid within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.Toposolid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class Toposolid : CeilingAndFloor
Public Class Toposolid
	Inherits CeilingAndFloor
public ref class Toposolid : public CeilingAndFloor
type Toposolid =
    class
        inherit CeilingAndFloor
    end
The Toposolid type exposes the following members.
Properties
Name | Description
HostTopoId |  The host toposolid id of the current toposolid subdivision. If the object is not a toposolid subdivision, hostTopoId will be InvalidElementId.
SketchId |  Returns id of the sketch.
Top
Methods
Name | Description
CanBeExcavatedBy |  Checks if the given element can be used to excavate the toposolid.
Create(Document, IList<CurveLoop>, ElementId, ElementId) |  Creates a new instance of toposolid within the project.
Create(Document, IList<XYZ>, ElementId, ElementId) |  Creates a new instance of toposolid within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, ElementId, ElementId) |  Creates a new instance of toposolid within the project.
CreateFromTopographySurface |  Creates a toposolid element from a host TopographySurface, and toposolid sub-divisions from its subregions.
CreateSubDivision |  Create a toposolid subdivision element with the current toposolid as its host.
ExcavateBy |  Excavates the toposolid by a given element.
GetIntersectingElementData |  Gets intersection data of all intersecting elements.
GetSlabShapeEditor |  Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid.
GetSubDivisionIds |  Get all element ids of toposolid subdivisions with the current toposolid as its host.
IsSmoothedSurfaceEnabled |  Get smoothed surface setting of Toposolid.
RemoveExcavationBy |  Remove the excavation between the given element and the toposolid.
SetSmoothedSurface |  Set smoothed surface setting of Toposolid.
Simplify |  Simplifies the toposolid by reducing the number of inner vertices to the given percentage.
Split |  Split the toposolid by the given curve loops.
Top
See Also
Reference
Autodesk.Revit.DB Namespace