Revit 2025 API
Toposolid Methods
The Toposolid type exposes the following members.
Methods
Name | Description
CanBeExcavatedBy |  Checks if the given element can be used to excavate the toposolid.
Create(Document, IList<CurveLoop>, ElementId, ElementId) |  Creates a new instance of toposolid within the project.
Create(Document, IList<XYZ>, ElementId, ElementId) |  Creates a new instance of toposolid within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, ElementId, ElementId) |  Creates a new instance of toposolid within the project.
CreateFromTopographySurface |  Creates a toposolid element from a host TopographySurface, and toposolid sub-divisions from its subregions.
CreateSubDivision |  Create a toposolid subdivision element with the current toposolid as its host.
ExcavateBy |  Excavates the toposolid by a given element.
GetIntersectingElementData |  Gets intersection data of all intersecting elements.
GetSlabShapeEditor |  Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid.
GetSubDivisionIds |  Get all element ids of toposolid subdivisions with the current toposolid as its host.
IsSmoothedSurfaceEnabled |  Get smoothed surface setting of Toposolid.
RemoveExcavationBy |  Remove the excavation between the given element and the toposolid.
SetSmoothedSurface |  Set smoothed surface setting of Toposolid.
Simplify |  Simplifies the toposolid by reducing the number of inner vertices to the given percentage.
Split |  Split the toposolid by the given curve loops.
Top
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace