Revit 2025 API
ExternalDataTypeServerFailureResolutionExecutingEventArgs Class
 The event arguments used by the ExternalDataTypeServerFailureResolutionExecuting event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataTypeServerFailureResolutionExecutingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExternalDataTypeServerFailureResolutionExecutingEventArgs : RevitAPIPreDocEventArgs
Public Class ExternalDataTypeServerFailureResolutionExecutingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ExternalDataTypeServerFailureResolutionExecutingEventArgs : public RevitAPIPreDocEventArgs
type ExternalDataTypeServerFailureResolutionExecutingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ExternalDataTypeServerFailureResolutionExecutingEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace