Revit 2025 API
EnergyAnalysisDetailModel Class
 Manage the analytical thermal model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class EnergyAnalysisDetailModel : Element
Public Class EnergyAnalysisDetailModel
	Inherits Element
public ref class EnergyAnalysisDetailModel : public Element
type EnergyAnalysisDetailModel =
    class
        inherit Element
    end
The EnergyAnalysisDetailModel type exposes the following members.
Properties
Name | Description
BuildingTypeId |  The building type element.
ExportCategory |  Export elements of this category in energy analysis.
ExportMullions |  Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces |  Indicates if to set and get the setting for if shading surfaces should be included.
SimplifyCurtainSystems |  Indicates if to specify the setting for simplified curtain systems.
Tier |  Level of computation for energy analysis model.
Top
Methods
Name | Description
Create |  Creates a new energy analysis detailed model.
GetAnalyticalOpenings |  The collection of analytical openings.
GetAnalyticalShadingSurfaces |  The collection of analytical shading surfaces.
GetAnalyticalSpaces |  The collection of analytical spaces.
GetAnalyticalSurfaces |  The collection of analytical surfaces.
GetMainEnergyAnalysisDetailModel |  Gets the EnergyAnalysisDetailModel in given document.
TransformModel |  Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north.
Top
Remarks
 The Export to gbXML and the Heating and Cooling Loads features produces an analytical thermal model from the physical model of a building. The analytical thermal model is composed of spaces, zones and planar surfaces that represent the actual volumetric elements of the building. If there are currently no EnergyAnalysisDetailModel elements in the document, when the first one is generated it will be considered the persistent energy model (and maybe removed and recreated by actions the user takes in the UI). If there is already a persistent EnergyAnalysisDetailModel element in the document, the API can generate other independent energy models, but they will not be affected by the actions the user takes in the UI. The EnergyAnalysisDetailModel will remain in the document until it is discarded (either by the actions of the user, or by a call to Document.Delete() ).
Example
// Collect space and surface data from the building's analytical thermal model
EnergyAnalysisDetailModelOptions options = new EnergyAnalysisDetailModelOptions();
options.Tier = EnergyAnalysisDetailModelTier.Final; // include constructions, schedules, and non-graphical data in the computation of the energy analysis model
options.EnergyModelType = EnergyModelType.SpatialElement;   // Energy model based on rooms or spaces
EnergyAnalysisDetailModel eadm = EnergyAnalysisDetailModel.Create(doc, options); // Create a new energy analysis detailed model from the physical model
IList<EnergyAnalysisSpace> spaces = eadm.GetAnalyticalSpaces();
StringBuilder builder = new StringBuilder();
builder.AppendLine("Spaces: " + spaces.Count);
foreach (EnergyAnalysisSpace space in spaces)
{
    SpatialElement spatialElement = doc.GetElement(space.CADObjectUniqueId) as SpatialElement;
    ElementId spatialElementId = spatialElement == null ? ElementId.InvalidElementId : spatialElement.Id;
    builder.AppendLine("   >>> " + space.SpaceName + " related to " + spatialElementId);
    IList<EnergyAnalysisSurface> surfaces = space.GetAnalyticalSurfaces();
    builder.AppendLine("       has " + surfaces.Count + " surfaces.");
    foreach (EnergyAnalysisSurface surface in surfaces)
    {
        builder.AppendLine("            +++ Surface from " + surface.OriginatingElementDescription);
    }
}
Autodesk.Revit.UI.TaskDialog.Show("EAM", builder.ToString());
' Collect space and surface data from the building's analytical thermal model
Dim options As New EnergyAnalysisDetailModelOptions()
options.Tier = EnergyAnalysisDetailModelTier.Final
' include constructions, schedules, and non-graphical data in the computation of the energy analysis model
options.EnergyModelType = EnergyModelType.SpatialElement
' Energy model based on rooms or spaces
Dim eadm As EnergyAnalysisDetailModel = EnergyAnalysisDetailModel.Create(doc, options)
' Create a new energy analysis detailed model from the physical model
Dim spaces As IList(Of EnergyAnalysisSpace) = eadm.GetAnalyticalSpaces()
Dim builder As New StringBuilder()
builder.AppendLine("Spaces: " + spaces.Count)
For Each space As EnergyAnalysisSpace In spaces
    Dim spatialElement As SpatialElement = TryCast(doc.GetElement(space.CADObjectUniqueId), SpatialElement)
    Dim spatialElementId As ElementId = If(spatialElement Is Nothing, ElementId.InvalidElementId, spatialElement.Id)
    builder.AppendLine("   >>> " + space.SpaceName + " related to " + spatialElementId.ToString())
    Dim surfaces As IList(Of EnergyAnalysisSurface) = space.GetAnalyticalSurfaces()
    builder.AppendLine("       has " + surfaces.Count + " surfaces.")
    For Each surface As EnergyAnalysisSurface In surfaces
        builder.AppendLine("            +++ Surface from " + surface.OriginatingElementDescription)
    Next
Next
UI.TaskDialog.Show("EAM", builder.ToString())
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace