Revit 2025 API
ExternalDataInstanceAddingIntoDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceAddingInto event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceAddingIntoDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExternalDataInstanceAddingIntoDocumentEventArgs : RevitAPIPreDocEventArgs
Public Class ExternalDataInstanceAddingIntoDocumentEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ExternalDataInstanceAddingIntoDocumentEventArgs : public RevitAPIPreDocEventArgs
type ExternalDataInstanceAddingIntoDocumentEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ExternalDataInstanceAddingIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
TypeId |  The type id of the newl external data instance that is being added.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace