Revit 2025 API
ExternalDataInstanceRemovingFromDocumentEventArgs Properties
The ExternalDataInstanceRemovingFromDocumentEventArgs type exposes the following members.
Properties
Name | Description
InstanceId |  The Revit id of the external data instance being removed from Revit document.
TypeId |  The type id of the external data instance id being removed from Revit document.
Top
See Also
Reference
ExternalDataInstanceRemovingFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace