Revit 2025 API
NurbsSurfaceData Methods
The NurbsSurfaceData type exposes the following members.
Methods
Name | Description
Create |  Construct NurbsSurfaceData based on NURBS surface data, where the weights are supplied. The NURBS surface will be (piecewise) polynomial if all the weights are equal, rational if not. Note: A rational polynomial is a quotient of two polynomials; this includes a polynomial, which can be thought of as a quotient with denominator equal to 1.
Dispose
GetControlPoints |  Get the list of control points.
GetKnotsU |  Get the list of knots in the u-direction.
GetKnotsV |  Get the list of knots in the v-direction.
GetWeights |  Get the list of weights.
IsValid |  Check if the object contains a valid NurbsSurfaceData.
Top
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace