Revit 2025 API
MEPAnalyticalSegment Methods
The MEPAnalyticalSegment type exposes the following members.
Methods
Name | Description
Dispose
GetNetworkSegmentId |  Gets the NetworkSegmentId.
Top
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace