Revit 2025 API
ExternalDataInstanceAddingIntoDocumentEventArgs Properties
The ExternalDataInstanceAddingIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
TypeId |  The type id of the newl external data instance that is being added.
Top
See Also
Reference
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace