Revit 2025 API
EnergyAnalysisOpening Methods
The EnergyAnalysisOpening type exposes the following members.
Methods
Name | Description
GetAnalyticalSurface |  Gets the associative analytical parent surface element.
GetConstruction |  Gets the analytic construction this surface is associated with. Null when this surface is a window.
GetPolyloop |  Gets the planar polygon describing the opening geometry.
GetPolyloops |  Gets the collection of planar polygons describing the opening geometry.
GetWindowType |  Gets the analytic window type this surface is associated with. Null when this surface is not a window.
Top
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace