Revit 2025 API
FabricationNetworkChangeService Methods
The FabricationNetworkChangeService type exposes the following members.
Methods
Name | Description
ApplyChange |  Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both.
ChangeService(ISet<ElementId>, Int32, Int32) |  Changes the service of the selection of fabrication parts.
ChangeService(ISet<ElementId>, Int32, Int32, Boolean) |  Changes the service of the selection of fabrication parts.
ChangeSize |  Changes the size of the selection of fabrication parts.
Dispose
GetElementsThatFailed |  Gets the set of fabrication parts that had failures due to either there was no corresponding part in the service, the size was out of range, or a connection could not be made.
GetInLinePartTypes |  Get a set of element identifiers of fabrication part types for in-line parts.
GetMapOfAllSizesForStraights |  Get a set of FabricationPartSizeMapSet of all straight sizes for all services.
GetStraightsThatWereNotChanged |  Gets the set of fabrication part straights that were not changed due to either there was no corresponding part in the service or the size was out of range.
SetMapOfInLinePartTypes |  Set the mapping of fabrication part types for in-line parts for the service and palette to change to.
SetMapOfSizesForStraights |  Set the mapping for sizes of fabrication part straights to change the sizes to.
SetPaletteId |  Set the fabrication palette identifier to change the elements to.
SetRestrictPalette |  Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier.
SetSelection |  Set the element selection to change the service or size for.
SetServiceId |  Set the fabrication service identifier to change the elements to.
Top
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace