Revit 2025 API
GBXMLExportOptions Class
 Green-Building XML Export options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GBXMLExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class GBXMLExportOptions : IDisposable
Public Class GBXMLExportOptions
	Implements IDisposable
public ref class GBXMLExportOptions : IDisposable
type GBXMLExportOptions =
    class
        interface IDisposable
    end
The GBXMLExportOptions type exposes the following members.
Constructors
Name | Description
GBXMLExportOptions() |  Constructs a new instance of the options used to export a model in gbXML (green-building) format.
GBXMLExportOptions(IList<ElementId>, IList<ElementId>) |  Constructs a new instance of the options used to export a mass model to gbXML.
Top
Properties
Name | Description
Encoding |  The encoding options to go into the processing instruction for the exported gbXML file.
ExportAnalyticalSystems |  Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
ExportEnergyModelType |  The energy model type from which gbXML will be exported.
IsConceptual |  Indicates if the exported gbXML is based on a conceptual energy analytical model from a conceptual mass model.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the GBXMLExportOptions
GetMassIds |  Gets a list of masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
GetMassZoneIds |  Gets a list of mass zones to analyze in the exported gbXML.
Top
See Also
Reference
Autodesk.Revit.DB Namespace