Revit 2025 API
EnergyAnalysisZone Class
 Analytical zone.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisZone
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class EnergyAnalysisZone : Element
Public Class EnergyAnalysisZone
	Inherits Element
public ref class EnergyAnalysisZone : public Element
type EnergyAnalysisZone =
    class
        inherit Element
    end
The EnergyAnalysisZone type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace