Revit 2025 API
Zone Class
 A zone is a collection of one or more spaces.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.Zone
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class Zone : Element
Public Class Zone
	Inherits Element
public ref class Zone : public Element
type Zone =
    class
        inherit Element
    end
The Zone type exposes the following members.
Properties
Name | Description
Area | Get the Area of the Zone.
Boundary | Returns the boundary of the Zone.
CalculatedCoolingLoad | Get the Calculated Cooling Load of the Zone.
CalculatedHeatingLoad | Get the Calculated Heating Load of the Zone.
CalculatedSupplyAirflow | Get the Calculated Supply Airflow of the Zone.
CoolingAirTemperature | Get or set the Cooling Air Temperature of the Zone.
CoolingSetPoint | Get or set the Cooling Set Point of the Zone.
DehumidificationSetPoint | Get or set the DeHumidification Set Point of the Zone.
GrossArea | Get the Gross Area of the Zone.
GrossVolume | Get the Gross Volume of the Zone.
HeatingAirTemperature | Get or set the Heating Air Temperature of the Zone.
HeatingSetPoint | Get or set the Heating Set Point of the Zone.
HumidificationSetPoint | Get or set the Humidification Set Point of the Zone.
IsDefaultZone | Reports whether this zone is default or not.
Name | Get or Set the Name of the Zone.
(Overrides Element.Name)
Perimeter | Get the Perimeter of the Zone.
Phase | Get the Phase of the Zone.
ServiceType | Get or set the Service Type of the Zone.
Spaces | Get the Spaces of the Zone.
Volume | Get the Volume of the Zone.
Top
Methods
Name | Description
AddSpaces | Add a set of existing spaces to Zone element.
CreateAreaBasedLoad |  Creates a new instance of an area based load and adds it to the document.
GetDomainData |  Gets the domain data for the zone.
RemoveSpaces | Remove a set of existing spaces to the current Zone element.
Top
Remarks
 The concept of zones is central to the way in which engineers design HVAC systems. When you are designing HVAC systems, you relate to zones as spaces that are under the same thermostatic control. Conceptually, zones are an arbitrary set of areas or volumes within a building that is controlled by one thermostat. An area based load is a collection of one or more electrical load areas. When it has the AreaBasedLoadData, it is an area based load, otherwise, it is a zone.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace