Revit 2025 API
ExternalDataInstanceAddedIntoDocumentEventArgs Class
 The event arguments used by the ExternalDataInstanceAddedInto event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExternalDataInstanceAddedIntoDocumentEventArgs : RevitAPIPostDocEventArgs
Public Class ExternalDataInstanceAddedIntoDocumentEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ExternalDataInstanceAddedIntoDocumentEventArgs : public RevitAPIPostDocEventArgs
type ExternalDataInstanceAddedIntoDocumentEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ExternalDataInstanceAddedIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
ItemId |  The id of the external data item to which a new reference has been added.
NewInstanceId |  The newly added external data instance id.
ProjectId |  The id of the external project of the external data item to which a new reference has been added.
TypeId |  The type id of the newly added external data instance id.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace