Revit 2025 API
ReinforcementSettings Class
 Provides access to project-wide reinforcement settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.ReinforcementSettings
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ReinforcementSettings : Element
Public Class ReinforcementSettings
	Inherits Element
public ref class ReinforcementSettings : public Element
type ReinforcementSettings =
    class
        inherit Element
    end
The ReinforcementSettings type exposes the following members.
Properties
Name | Description
HostStructuralRebar |  Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar.
NumberVaryingLengthRebarsIndividually |  Use this option to modify the way varying length bars are numbered (individually or as a whole).
RebarPresentationInSection |  The default presentation mode for rebar sets, when:
The view direction is perpendicular to the rebar normal and the rebar set is cut.
The view direction is not perpendicular to the rebar normal and the view direction is not parallel to the rebar normal.
RebarPresentationInView |  The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut.
RebarShapeDefinesEndTreatments |  End Treatments are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
RebarShapeDefinesHooks |  Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
RebarVaryingLengthNumberSuffix |  A unique identifier used for a bar within a variable length rebar set.
Top
Methods
Name | Description
GetFabricRoundingManager |  Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
GetRebarRoundingManager |  Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
GetReinforcementAbbreviationTag |  Gets one abbreviation tag for desired ReinforcementAbbreviationTagType.
GetReinforcementAbbreviationTags |  Gets a list of abbreviation tags for desired reinforcement object type.
GetReinforcementSettings |  Obtains the ReinforcementSettings object for the specified project document.
IsEqual |  Checks if Reinforcement Settings is equal to other
SetReinforcementAbbreviationTag |  Sets one abbreviation tag for desired ReinforcementAbbreviationTagType.
Top
Example
private bool SetEndTreatmentType(Document doc, RebarShape rebarShape)
{
    bool set = false;
    // check if end treatments are defined by rebar shape
    ReinforcementSettings settings = ReinforcementSettings.GetReinforcementSettings(doc);
    if (!settings.RebarShapeDefinesEndTreatments)
    {
        try
        {
            // can only be changed if document contains no rebars, area reinforcement or path reinforcement
            settings.RebarShapeDefinesEndTreatments = true;
        }
        catch (Exception e)
        {
            // cannot change the settings value
            TaskDialog.Show("Revit", e.Message);
        }
    }
    if (settings.RebarShapeDefinesEndTreatments)
    {
        EndTreatmentType treatmentType = EndTreatmentType.Create(doc, "Flame Cut");
        rebarShape.SetEndTreatmentTypeId(treatmentType.Id, 0);
        ElementId treatmentTypeId = EndTreatmentType.CreateDefaultEndTreatmentType(doc);
        rebarShape.SetEndTreatmentTypeId(treatmentTypeId, 1);
        set = true;
    }
    return set;
}
Private Function SetEndTreatmentType(doc As Document, rebarShape As RebarShape) As Boolean
    Dim [set] As Boolean = False
    ' check if end treatments are defined by rebar shape
    Dim settings As ReinforcementSettings = ReinforcementSettings.GetReinforcementSettings(doc)
    If Not settings.RebarShapeDefinesEndTreatments Then
        Try
            ' can only be changed if document contains no rebars, area reinforcement or path reinforcement
            settings.RebarShapeDefinesEndTreatments = True
        Catch e As Exception
            ' cannot change the settings value
            TaskDialog.Show("Revit", e.Message)
        End Try
    End If
    If settings.RebarShapeDefinesEndTreatments Then
        Dim treatmentType As EndTreatmentType = EndTreatmentType.Create(doc, "Flame Cut")
        rebarShape.SetEndTreatmentTypeId(treatmentType.Id, 0)
        Dim treatmentTypeId As ElementId = EndTreatmentType.CreateDefaultEndTreatmentType(doc)
        rebarShape.SetEndTreatmentTypeId(treatmentTypeId, 1)
        [set] = True
    End If
    Return [set]
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace