Revit 2025 API
DesignOption Methods
The DesignOption type exposes the following members.
Methods
Name | Description
GetActiveDesignOptionId |  Gets the active design option id for the current design option set.
Top
See Also
Reference
DesignOption Class
Autodesk.Revit.DB Namespace