Revit 2025 API
CylindricalFace Class
A cylindrical face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.CylindricalFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class CylindricalFace : Face
Public Class CylindricalFace
	Inherits Face
public ref class CylindricalFace : public Face
type CylindricalFace =
    class
        inherit Face
    end
The CylindricalFace type exposes the following members.
Properties
Name | Description
Axis | Axis of the surface.
Origin | Origin of the surface.
Radius | Radii of the surface.
Top
Methods
Name | Description
Top
Remarks
For details on the parameterization, refer to the documentation for CylindricalSurface.
Example
private void GetCylindricalFaceInfo(Face face)
{
    CylindricalFace cylindricalFace = face as CylindricalFace;
    if (null != cylindricalFace)
    {
       XYZ axis = cylindricalFace.Axis;
       XYZ origin = cylindricalFace.Origin;
       XYZ radius = cylindricalFace.get_Radius(0);
    }
}
Private Sub GetCylindricalFaceInfo(face As Face)
    Dim cylindricalFace As CylindricalFace = TryCast(face, CylindricalFace)
    If cylindricalFace IsNot Nothing Then
        Dim axis As XYZ = cylindricalFace.Axis
        Dim origin As XYZ = cylindricalFace.Origin
        Dim radius As XYZ = cylindricalFace.Radius(0)
    End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB Namespace