Revit 2025 API
GenericZone Properties
The GenericZone type exposes the following members.
Properties
Name | Description
LevelOffset |  The offset distance from this zone to the associated level.
Top
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace