Revit 2025 API
PlanarFace Class
A bounded face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.PlanarFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class PlanarFace : Face
Public Class PlanarFace
	Inherits Face
public ref class PlanarFace : public Face
type PlanarFace =
    class
        inherit Face
    end
The PlanarFace type exposes the following members.
Properties
Name | Description
FaceNormal | Normal of the planar face.
Origin | Origin of the surface.
XVector | The X-vector of the planar face.
YVector | The Y-vector of the planar face.
Top
Methods
Name | Description
Top
Remarks
Planar faces are defined by planes bounded by edge loops. The planes provide natural UV parameterization to the faces. S(u, v) = Origin + u*Vector[0] + v*Vector[1]
Example
private void GetPlanarFaceInfo(Face face)
{
    PlanarFace planarFace = face as PlanarFace;
    if (null != planarFace)
    {
       XYZ origin = planarFace.Origin;
        XYZ normal = planarFace.FaceNormal;
        XYZ vector = planarFace.XVector;
    }
}
Private Sub GetPlanarFaceInfo(face As Face)
   Dim planarFace As PlanarFace = TryCast(face, PlanarFace)
   If planarFace IsNot Nothing Then
      Dim origin As XYZ = planarFace.Origin
      Dim normal As XYZ = planarFace.FaceNormal
      Dim vector As XYZ = planarFace.XVector
   End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB Namespace