Revit 2025 API
Wall Methods
The Wall type exposes the following members.
Methods
Name | Description
AllowWrappingAtLocation |  Allow end wrapping at the location.
CanHaveProfileSketch |  Checks whether this wall has or can have a profile sketch.
Create(Document, IList<Curve>, Boolean) |  Creates a non rectangular profile wall within the project using the default wall type.
Create(Document, Curve, ElementId, Boolean) |  Creates a new rectangular profile wall within the project using the default wall style.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean) |  Creates a non rectangular profile wall within the project using the specified wall type.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean, XYZ) |  Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean) |  Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
CreateProfileSketch |  Creates a new Wall profile Sketch.
DisallowWrappingAtLocation |  Disallow end wrapping at the location.
Flip |  The wall orientation will be flipped.
GetStackedWallMemberIds |  Get the sub walls which belongs to the wall.
GetValidWrappingLocationIndices |  Gets all valid locations for end wrapping.
GetWrappingLocationAsCurveParameter |  Gets the non-normalized (actual) curve parameter of the location.
GetWrappingLocationAsReferences |  Gets an array of references to faces at the location.
IsWallCrossSectionValid |  Checks whether the desired cross section is valid for the current wall.
IsWrappingAtLocationAllowed |  If end wrapping is allowed at the location.
RemoveProfileSketch |  Reverts an edited wall to its original shape.
Top
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace