Revit 2025 API
LayoutRuleMaximumSpacing Class
This class indicate the layout rule of a Beam System is Max-Spacing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleMaximumSpacing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class LayoutRuleMaximumSpacing : LayoutRule
Public Class LayoutRuleMaximumSpacing
	Inherits LayoutRule
public ref class LayoutRuleMaximumSpacing : public LayoutRule
type LayoutRuleMaximumSpacing =
    class
        inherit LayoutRule
    end
The LayoutRuleMaximumSpacing type exposes the following members.
Constructors
Name | Description
LayoutRuleMaximumSpacing | Constructor of LayoutRuleMaximumSpacing.
Top
Properties
Name | Description
Spacing | Get or set the spacing of the beam system.
Top
Methods
Name | Description
Top
Remarks
To use this type of LayoutRule, only the maximum spacing must be set and it must be in (0, 30000).
Example
private bool LayoutRuleMaximumSpacingInformation(BeamSystem beamSystem)
{
    //get the layoutRule of the beamsystem
    Autodesk.Revit.DB.LayoutRule layoutRule = beamSystem.LayoutRule;
    string message = "BeamSystem layout rule : " + layoutRule;
    //create a new instance of the LayoutRuleClearSpacing class
    LayoutRuleMaximumSpacing myLayoutRuleMaximumSpacing =
                        new LayoutRuleMaximumSpacing(10.0);
    //set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleMaximumSpacing;
    LayoutRuleMaximumSpacing maximunSpacing = beamSystem.LayoutRule as LayoutRuleMaximumSpacing;
    if (null == maximunSpacing)
    {
        return false;
    }
    //try to get the property value of the beamsystem LayoutRule
    double spacing = maximunSpacing.Spacing;
    message += "\nNew BeamSystem layout rule: " + maximunSpacing;
    message += "\nNew BeamSystem maximum spacing: " + spacing;
    TaskDialog.Show("Revit",message);
    return true;
}
Private Function LayoutRuleMaximumSpacingInformation(beamSystem As BeamSystem) As Boolean
    'get the layoutRule of the beamsystem
    Dim layoutRule As Autodesk.Revit.DB.LayoutRule = beamSystem.LayoutRule
    Dim message As String = "BeamSystem layout rule : " & layoutRule.ToString()
    'create a new instance of the LayoutRuleClearSpacing class
    Dim myLayoutRuleMaximumSpacing As New LayoutRuleMaximumSpacing(10.0)
    'set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleMaximumSpacing
    Dim maximunSpacing As LayoutRuleMaximumSpacing = TryCast(beamSystem.LayoutRule, LayoutRuleMaximumSpacing)
    If maximunSpacing Is Nothing Then
        Return False
    End If
    'try to get the property value of the beamsystem LayoutRule
    Dim spacing As Double = maximunSpacing.Spacing
    message += vbLf & "New BeamSystem layout rule: " & maximunSpacing.ToString()
    message += vbLf & "New BeamSystem maximum spacing: " & spacing
    TaskDialog.Show("Revit", message)
    Return True
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB Namespace