Revit 2025 API
TemperatureRatingType Class
 Represents temperature rating type definition information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.TemperatureRatingType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class TemperatureRatingType : ElementType
Public Class TemperatureRatingType
	Inherits ElementType
public ref class TemperatureRatingType : public ElementType
type TemperatureRatingType =
    class
        inherit ElementType
    end
The TemperatureRatingType type exposes the following members.
Properties
Name | Description
CorrectionFactors |  Get all correction factors defined in this temperature rating type and its corresponding material type.
InsulationTypes |  Get all insulation types defined in this temperature rating type and its corresponding material type.
IsInUse |  Indicate whether the temperature rating type is in use.
MaterialType |  Get the material type information which this temperature rating type belongs to.
Name |  Get name of temperature rating type.
(Overrides ElementType.Name)
WireSizes |  Get all electrical wire sizes defined in this temperature rating type and its corresponding material type.
Top
Methods
Name | Description
AddCorrectionFactor |  Add a new electrical correction factor type to this temperature rating type. The given temperature value should be quantified in the document's selected unit of electrical temperature.
AddInsulationType |  Add a new kind of insulation type into this temperature rating type.
AddWireSize |  Add a new kind of wire size type into this temperature rating type.
RemoveCorrectionFactor |  Remove an existing correction factor from this temperature rating type in Revit MEP project.
RemoveInsulationType |  Remove an existing insulation type from this temperature rating type.
RemoveWireSize |  Remove an existing wire size type from this temperature rating type.
Top
Remarks
Temperature rating type is defined based on corresponding wire material type. It includes type information such as wire size, insulation type, correction factor, etc. Only the temperature rating types which are retrieved from WireMaterialType can work well, so don't retrieve it from Revit document directly.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace