Revit 2023 API
RoofBase Members
The RoofBase type exposes the following members.
Methods
Name | Description
Properties
Name | Description
EaveCuts
Retrieve or set the EaveCutterType.
FasciaDepth
Retrieve or set the FasciaDepth.
RoofType
Retrieve or set the Type.
SlabShapeEditor
Get the SlabShapeEditor used for slab shape editing.
See Also
RoofBase Class
Autodesk.Revit.DB Namespace