Revit 2023 API
FabricationPartRouteEnd Methods
The FabricationPartRouteEnd type exposes the following members.
Methods
Name | Description
CreateFromCenterline
 Create fabrication routing end from centreline point on straight element.
CreateFromConnector
 Create fabrication routing end from connector end point.
Dispose
See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace