Revit 2023 API
StructuralSettings Members
The StructuralSettings type exposes the following members.
Methods
Name | Description
GetStructuralSettings
 Obtains the StructuralSettings object for the specified project document.
Properties
Name | Description
BoundaryConditionAreaAndLineSymbolSpacing
 Symbol spacing for boundary conditions.
BoundaryConditionFamilySymbolFixed
 The id of the FamilySymbol to represent a fixed boundary condition.
BoundaryConditionFamilySymbolPinned
 The id of the FamilySymbol to represent a pinned boundary condition.
BoundaryConditionFamilySymbolRoller
 The id of the FamilySymbol to represent a roller boundary condition.
BoundaryConditionFamilySymbolUserDefined
 The id of the FamilySymbol to represent a user-defined boundary condition.
BraceAboveSymbol
 The id of the ElementType to represent a brace above a beam in plan view.
BraceBelowSymbol
 The id of the ElementType to represent a brace below a beam in plan view.
BraceParallelLineOffset
 The distance by which brace symbols in plan views will be offset.
KickerBraceSymbol
 The id of the ElementType to represent a kicker brace.
ShowBraceAbove
 Whether to show brace symbols above beams in plan views.
ShowBraceBelow
 Whether to show brace symbols below beams in plan views.
SymbolicCutbackForBeamAndTruss
 Symbolic cutback distance to be applied to all beams and trusses.
SymbolicCutbackForBrace
 Symbolic cutback distance to be applied to all braces.
SymbolicCutbackForColumn
 Symbolic cutback distance to be applied to all columns.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace