Revit 2023 API
LineLoad Methods
The LineLoad type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, XYZ, XYZ, XYZ, XYZ, LineLoadType, SketchPlane)
 Creates a new non-hosted line load within the project using data at point.
GetCurve
 Returns curve that define geometry of the line load.
IsValidHostId
 Indicates if the provided host id can host line loads The document containing both the host and the load The id of the analytical panel that is about to host a line load True if a line load can be placed on the input host id
SetPoints
 Sets start and end point of the line load.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace