Revit 2023 API
DirectShapeType Methods
The DirectShapeType type exposes the following members.
Methods
Name | Description
AddExternallyTaggedGeometry
 Adds the externally tagged geometry object to the DirectShapeType.
AddReferenceCurve(Curve)
 Adds a reference curve to the DirectShapeType.
AddReferenceCurve(Curve, DirectShapeReferenceOptions)
 Adds a reference curve to the DirectShapeType.
AddReferencePlane(Plane)
 Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV)
 Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, DirectShapeReferenceOptions)
 Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV, DirectShapeReferenceOptions)
 Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
AddReferencePoint(XYZ)
 Adds a reference point to the DirectShapeType.
AddReferencePoint(XYZ, DirectShapeReferenceOptions)
 Adds a reference point to the DirectShapeType.
AppendShape(IList<GeometryObject>)
 Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
AppendShape(ShapeBuilder)
 Append shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShapeType. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList<GeometryObject>, DirectShapeTargetViewType)
 Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShapeType. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
AreOptionsValid
 Validates that the given DirectShapeTypeOptions are allowed for this particular DirectShapeType.
CanChangeFamilyName
 Checks whether the DirectShapeType supports a custom family name.
CanCreateParts
 Indicates if it is possible to create parts from this DirectShapeType element.
Create(Document, String, ElementId)
 Creates a DirectShapeType element.
Create(Document, String, ElementId, DirectShapeTypeOptions)
 Creates a DirectShapeType element.
GetExternallyTaggedGeometry
 Gets the externally tagged geometry by its external ID that is stored in this DirectShapeType.
GetOptions
 Gets a copy of the current options for this DirectShapeType.
HasExternalGeometry
 Checks whether the externally tagged geometry is already present in this DirectShapeType.
IsValidReferenceCurve
 Validates that the input curve is suitable for creating a direct shape type reference curve. Bounded and unbounded lines are accepted. Other bounded and unbounded curve types with natural bounds are accepted if they are not closed. Unbounded periodic curves are not allowed.
IsValidReferencePlaneBoundingBoxUV
 Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface. The input BoundingBoxUV must be set and not degenerate.
IsValidShape(IList<GeometryObject>)
 Validates shape to be stored in a DirectShapeType.
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType)
 Validates view-specific shape to be stored in a DirectShapeType. Expects a non-default view type.
RemoveExternallyTaggedGeometry
 Removes the externally tagged geometry object by its external ID from this DirectShapeType.
ResetExternallyTaggedGeometry
 Removes all of the externally tagged geometry in this DirectShapeType.
SetFamilyName
 Sets the family name for the DirectShapeType.
SetOptions
 Sets the options to use for this DirectShapeType.
SetShape(IList<GeometryObject>)
 Builds the type shape from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetShape(ShapeBuilder)
 Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept.
UpdateExternallyTaggedGeometry
 Updates the externally tagged geometry object in the DirectShapeType.
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace