Revit 2023 API
MassZone Properties
The MassZone type exposes the following members.
Properties
Name | Description
ConditionType
 The gbXMLConditionType of the MassZone.
CutByLowerLevel
 Indicates the relationship between the MassZone and its lower level.
CutByUpperLevel
 Indicates the relationship between the MassZone and its upper level.
FloorArea
 The floor area of the MassZone.
IsZoneOccupiable
 A MassZone must have a level as its bottom to be occupiable; If it does not, it is still a MassZone, but it is not occupiable
LowerLevelId
 The bottom level defining the MassZone.
MassEnergyAnalyticalModelId
 The ElementId of the MassEnergyAnalyticalModel that the MassZone is derived from.
MaterialId
 The visualization material for the MassZone. Will be InvalidElementId if material is by category or the material type is by MassZoneMaterialTypeMaterialBySurfaceType.
MaterialType
 Indicates how the material of MassZone faces is determined.
SpaceType
 The gbXMLSpaceType of the MassZone.
SpaceTypeId
 The space type element of the MassZone.
UpperLevelId
 The upper level defining the MassZone.
Volume
 The volume of the MassZone.
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace