Revit 2023 API
StructuralSettings Methods
The StructuralSettings type exposes the following members.
Methods
Name | Description
GetStructuralSettings
 Obtains the StructuralSettings object for the specified project document.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace