Revit 2023 API
GeometryInstance Properties
The GeometryInstance type exposes the following members.
Properties
Name | Description
Symbol |  Obsolete.
The symbol element that this object is referring to.
SymbolGeometry
The geometric representation of the symbol which generates this instance.
Transform
The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance.
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace