Revit 2023 API
MassEnergyAnalyticalModel Members
The MassEnergyAnalyticalModel type exposes the following members.
Methods
Name | Description
GetCoincidentEnergyAnalyticalModelFaceReference
 Returns a Reference to a Face from the same or a different MassEnergyAnalyticalModel that is coincident with the input Face.
GetCoincidentMassZoneFaceReferences
 Returns References to Faces from MassZones coincident with an input Face from a MassEnergyAnalyticalModel.
GetJoinedMassEnergyAnalyticalModelElementIds
 The ElementIds of other MassEnergyAnalyticalModels that are "joined" to this one.
GetMassEnergyAnalyticalModelIdForMassInstance
 Get the ElementId of the MassEnergyAnalyticalModel for a mass instance.
GetMassSurfaceDataIdForReference
 Get the ElementId of the MassSurfaceData corresponding to the Reference.
GetMassZoneIds
 Get the MassZone ElementIds that are created from this MassEnergyAnalyticalModel.
GetReferencesToAllFaces
 Get References to all Faces which are meaningful for the MassEnergyAnalyticalModel. Array of References to Faces of the MassEnergyAnalyticalModel.
GetReferencesToAllShadingFaces
 Get References to all Faces of the MassEnergyAnalyticalModel which are of Mass Shade subcategory.
GetValidSurfaceCategoryIdsForReference
 The Mass surface subcategory ids that are appropriate values for the input Reference.
Properties
Name | Description
MassId
 The ElementId of the mass instance the MassEnergyAnalyticalModel is associated with.
MassZoneCoreOffset
 If this value is greater than 0.0, in the MassEnergyAnalytical model a building "core" geometry will be created for each solid geometry of the mass instance.
See Also
MassEnergyAnalyticalModel Class
Autodesk.Revit.DB.Analysis Namespace