Revit 2023 API
MassEnergyAnalyticalModel Properties
The MassEnergyAnalyticalModel type exposes the following members.
Properties
Name | Description
MassId
 The ElementId of the mass instance the MassEnergyAnalyticalModel is associated with.
MassZoneCoreOffset
 If this value is greater than 0.0, in the MassEnergyAnalytical model a building "core" geometry will be created for each solid geometry of the mass instance.
See Also
MassEnergyAnalyticalModel Class
Autodesk.Revit.DB.Analysis Namespace