Revit 2023 API
MassZone Methods
The MassZone type exposes the following members.
Methods
Name | Description
GetCoincidentReferenceFromAdjacentZone
 This method is used to get a Reference from an adjacent MassZone that is coincident to a Reference of this MassZone.
GetEquivalentReferenceFromMassOrLevel
 Returns a Reference to a face of a MassEnergyAnalyticalModel element or an element Reference to a MassLevelData element. This Reference represents what the MassZone face was "cut from" when making the MassZone for the level.
GetMassDataElementIdForZoneFaceReference
 MassZone faces come from faces of MassEnergyAnalyticalModel, and those faces have MassSurfaceData or MassLevelData elements associated with them.
GetReferencesToEnergyAnalysisFaces
 Used to get References to all the faces of the MassZone that are used for Energy Analysis.
IsEmpty
 Indicates if MassZone has no geometry. Such zones should not be shown to the user.
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace