Revit 2023 API
MassGBXMLExportOptions Members
The MassGBXMLExportOptions type exposes the following members.
Constructors
Name | Description
MassGBXMLExportOptions(IList<ElementId>)
 Constructs a new instance of the options used to export a mass model to gbXML.
MassGBXMLExportOptions(IList<ElementId>, IList<ElementId>)
 Constructs a new instance of the options used to export a mass model to gbXML.
Methods
Name | Description
Dispose
Releases all resources used by the MassGBXMLExportOptions
GetMassIds
 Gets a list of masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
GetMassZoneIds
 Gets a list of mass zones to analyze in the exported gbXML.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
MassGBXMLExportOptions Class
Autodesk.Revit.DB.Analysis Namespace