Revit 2023 API
MassZone Members
The MassZone type exposes the following members.
Methods
Name | Description
GetCoincidentReferenceFromAdjacentZone
 This method is used to get a Reference from an adjacent MassZone that is coincident to a Reference of this MassZone.
GetEquivalentReferenceFromMassOrLevel
 Returns a Reference to a face of a MassEnergyAnalyticalModel element or an element Reference to a MassLevelData element. This Reference represents what the MassZone face was "cut from" when making the MassZone for the level.
GetMassDataElementIdForZoneFaceReference
 MassZone faces come from faces of MassEnergyAnalyticalModel, and those faces have MassSurfaceData or MassLevelData elements associated with them.
GetReferencesToEnergyAnalysisFaces
 Used to get References to all the faces of the MassZone that are used for Energy Analysis.
IsEmpty
 Indicates if MassZone has no geometry. Such zones should not be shown to the user.
Properties
Name | Description
ConditionType
 The gbXMLConditionType of the MassZone.
CutByLowerLevel
 Indicates the relationship between the MassZone and its lower level.
CutByUpperLevel
 Indicates the relationship between the MassZone and its upper level.
FloorArea
 The floor area of the MassZone.
IsZoneOccupiable
 A MassZone must have a level as its bottom to be occupiable; If it does not, it is still a MassZone, but it is not occupiable
LowerLevelId
 The bottom level defining the MassZone.
MassEnergyAnalyticalModelId
 The ElementId of the MassEnergyAnalyticalModel that the MassZone is derived from.
MaterialId
 The visualization material for the MassZone. Will be InvalidElementId if material is by category or the material type is by MassZoneMaterialTypeMaterialBySurfaceType.
MaterialType
 Indicates how the material of MassZone faces is determined.
SpaceType
 The gbXMLSpaceType of the MassZone.
SpaceTypeId
 The space type element of the MassZone.
UpperLevelId
 The upper level defining the MassZone.
Volume
 The volume of the MassZone.
See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace