Revit 2023 API
ATFBaseExportOptions Methods
The ATFBaseExportOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
ATFBaseExportOptions Class
Autodesk.Revit.DB Namespace