Revit 2023 API
EnergyAnalysisOpening Methods
The EnergyAnalysisOpening type exposes the following members.
Methods
Name | Description
GetAnalyticalSurface
 Gets the associative analytical parent surface element.
GetPolyloop
 Gets the planar polygon describing the opening geometry.
GetPolyloops
 Gets the collection of planar polygons describing the opening geometry.
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace