Revit 2023 API
AreaLoad Methods
The AreaLoad type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, XYZ, AreaLoadType)
 Creates a new hosted area load within the project.
Create(Document, IList<CurveLoop>, XYZ, AreaLoadType)
 Creates a new non-hosted area load within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType)
 Creates a new non-hosted area load within the project.
GetLoops
 Returns curve loops that define geometry of the area load.
GetRefPoint
 Returns the physical location of the reference point.
IsValidHostId
 Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical panel that is about to host an area load True if an area load can be placed on the input host id
SetLoops
 Sets curve loops that define geometry of the area load.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace