Revit 2023 API
LoadBase Methods
The LoadBase type exposes the following members.
Methods
Name | Description
IsOrientToPermitted
 Indicates if the provided orientation is permitted for this load.
See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace