Revit 2023 API
PointLoad Members
The PointLoad type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType)
 Creates a new hosted point load within the project.
Create(Document, XYZ, XYZ, XYZ, PointLoadType, SketchPlane)
 Creates a new non-hosted point load within the project using data at point.
IsValidHostId
 Indicates if the provided host id can host point loads The document containing both the host and the load The id of the analytical panel that is about to host a point load True if a point load can be placed on the input host id
Properties
Name | Description
ForceVector
 The force vector applied to the point load, oriented according to OrientTo setting.
MomentVector
 The moment vector applied to the point load, oriented according to OrientTo setting.
Point
 Returns the position of point load, measured in decimal feet.
See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace