Revit 2023 API
Mesh Methods
The Mesh type exposes the following members.
Methods
Name | Description
GetNormal
 Returns a normal unit vector at the given index.
GetNormals
 Returns all normals assigned to the mesh.
See Also
Mesh Class
Autodesk.Revit.DB Namespace