Revit 2023 API
AnalyticalPanel Methods
The AnalyticalPanel type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of an Analytical Panel within the project.
GetAnalyticalOpeningsIds
 Returns the Analytical Openings ids of the Analytical Panel.
See Also
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace