Revit 2023 API
FilledRegionType Methods
The FilledRegionType type exposes the following members.
Methods
Name | Description
IsValidLineWeight
 Indicates whether the given line weight value is valid.
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace