Revit 2023 API
AreaBasedLoadData Methods
The AreaBasedLoadData type exposes the following members.
Methods
Name | Description
AddElectricalLoadArea
 Adds electrical load area into the area based load.
GetElectricalLoadAreas
 Gets electrical load areas which the area based load includes.
RemoveElectricalLoadArea
 Removes electrical load area from the area based load.
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace