Revit 2023 API
AnalyticalToPhysicalAssociationManager Methods
The AnalyticalToPhysicalAssociationManager type exposes the following members.
Methods
Name | Description
AddAssociation
 Adds a new association between an analytical element and a physical element.
GetAnalyticalToPhysicalAssociationManager
 Returns the AnalyticalToPhysicalAssociationManager for this document.
GetAssociatedElementId
 Returns id of the element which is in association with the element with the given ElementId.
HasAssociation
 Verifies if the element has already defined an association.
RemoveAssociation
 This method will remove the association for the element with the given ElementId.
See Also
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace