Revit 2023 API
FilledRegionType Members
The FilledRegionType type exposes the following members.
Methods
Name | Description
IsValidLineWeight
 Indicates whether the given line weight value is valid.
Properties
Name | Description
BackgroundPatternColor
 The background fill pattern color.
BackgroundPatternId
 The background fill pattern Id.
ForegroundPatternColor
 The foreground fill pattern color.
ForegroundPatternId
 The foreground fill pattern Id.
IsMasking
 If true then the FilledRegion will cover the lines and edges of objects behind it. If false then lines and edges will remain visible.
LineWeight
 The line weight of the fill pattern.
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace