Revit 2026 API
FaceToposolid Methods
The FaceToposolid type exposes the following members.
Methods
Name | Description
Create
GetReferencedFaces |  Gets the referenced faces of the face toposolid
SetFaceReferences
UpdateToFace |  Resets the face toposolid to its defining faces.
Top
See Also
Reference
FaceToposolid Class
Autodesk.Revit.DB Namespace