Revit 2026 API
TemperatureRatingTypeSetIterator Class
An iterator to a TemperatureRating type set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public abstract class TemperatureRatingTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class TemperatureRatingTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class TemperatureRatingTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type TemperatureRatingTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The TemperatureRatingTypeSetIterator type exposes the following members.
Constructors
Name | Description
TemperatureRatingTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace