Revit 2026 API
Ceiling Methods
The Ceiling type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
Create(Document, IList<CurveLoop>, ElementId, ElementId, Line, Double)
GetCeilingGridLines |  Get the geometric representation of the ceiling grid, optionally including the ceiling boundary.
Top
See Also
Reference
Ceiling Class
Autodesk.Revit.DB Namespace