Revit 2026 API
InsulationTypeSetIterator Class
An iterator to a insulation type set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public abstract class InsulationTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class InsulationTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class InsulationTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type InsulationTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The InsulationTypeSetIterator type exposes the following members.
Constructors
Name | Description
InsulationTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace