Revit 2026 API
InsulationType Properties
The InsulationType type exposes the following members.
Properties
Name | Description
IsInUse |  Indicate whether the insulation type is in use.
Name |  Get name of Insulation type.
(Overrides ElementType.Name)
Top
See Also
Reference
InsulationType Class
Autodesk.Revit.DB.Electrical Namespace