Revit 2026 API
WireMaterialTypeSetIterator Class
An iterator to a wire material type set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireMaterialTypeSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public abstract class WireMaterialTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class WireMaterialTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class WireMaterialTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type WireMaterialTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The WireMaterialTypeSetIterator type exposes the following members.
Constructors
Name | Description
WireMaterialTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace