Revit 2026 API
AreaReinforcementCurve Class
An object that specifies the type of a floor in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.Structure.AreaReinforcementCurve
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class AreaReinforcementCurve : CurveElement
Public Class AreaReinforcementCurve
	Inherits CurveElement
public ref class AreaReinforcementCurve : public CurveElement
type AreaReinforcementCurve =
    class
        inherit CurveElement
    end
The AreaReinforcementCurve type exposes the following members.
Properties
Name | Description
Curve | Returns the 3D curve forming part of the boundary of an Area Reinforcement element.
Top
Methods
Name | Description
Top
Remarks
The structural layers of the floor can be accessed via this object.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace