Revit 2026 API
ExclusionFilter Class
 A filter used to exclude a set of elements automatically.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ExclusionFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ExclusionFilter : ElementQuickFilter
Public Class ExclusionFilter
	Inherits ElementQuickFilter
public ref class ExclusionFilter : public ElementQuickFilter
type ExclusionFilter =
    class
        inherit ElementQuickFilter
    end
The ExclusionFilter type exposes the following members.
Constructors
Name | Description
ExclusionFilter | Initializes a new instance of the ExclusionFilter class
Top
Properties
Name | Description
Top
Methods
Name | Description
GetIdsToExclude |  Returns the ids to be excluded by this filter.
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace