Revit 2026 API
WallFoundation Class
 An object that represents a wall foundation element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.WallFoundation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class WallFoundation : HostObject
Public Class WallFoundation
	Inherits HostObject
public ref class WallFoundation : public HostObject
type WallFoundation =
    class
        inherit HostObject
    end
The WallFoundation type exposes the following members.
Properties
Name | Description
WallId |  Returns the id of the host wall.
Top
Methods
Name | Description
Create |  Creates a new wall foundation within the project.
Top
See Also
Reference
Autodesk.Revit.DB Namespace