Revit 2026 API
CorrectionFactorSet Class
A set that contains correction factors.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.CorrectionFactorSet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class CorrectionFactorSet : APIObject,
	IEnumerable
Public Class CorrectionFactorSet
	Inherits APIObject
	Implements IEnumerable
public ref class CorrectionFactorSet : public APIObject,
	IEnumerable
type CorrectionFactorSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The CorrectionFactorSet type exposes the following members.
Constructors
Name | Description
CorrectionFactorSet | Initializes a new instance of the CorrectionFactorSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of correction factors that are in the set.
Top
Methods
Name | Description
Clear | Removes every correction factor from the set, rendering it empty.
Contains
Erase
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace