Revit 2026 API
ExternalDataManagerChangedEventArgs Class
 The event arguments used by the ExternalDataManager changed event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.ExternalDataManagerChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ExternalDataManagerChangedEventArgs : RevitAPISingleEventArgs
Public Class ExternalDataManagerChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class ExternalDataManagerChangedEventArgs : public RevitAPISingleEventArgs
type ExternalDataManagerChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The ExternalDataManagerChangedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace