Revit 2026 API
City Class
An object that contains geographical location information for a known city.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.City
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class City : APIObject
Public Class City
	Inherits APIObject
public ref class City : public APIObject
type City =
    class
        inherit APIObject
    end
The City type exposes the following members.
Properties
Name | Description
Latitude | Latitude of the city
Longitude | Longitude of the city
Name | The name of the city
TimeZone | Time-zone in which the city resides
WeatherStation | An identifier for the nearest weather station
Top
Methods
Name | Description
Top
Remarks
This object contains longitude, latitude, time zone information for a city already known by Revit. Currently Revit does not the ability to add cities to the existing list. The list of known cities can be retrieved using the Cities property on the application object.
See Also
Reference
Autodesk.Revit.DB Namespace