Revit 2026 API
RoomFilter Class
 A filter used to match rooms.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Architecture.RoomFilter
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class RoomFilter : ElementSlowFilter
Public Class RoomFilter
	Inherits ElementSlowFilter
public ref class RoomFilter : public ElementSlowFilter
type RoomFilter =
    class
        inherit ElementSlowFilter
    end
The RoomFilter type exposes the following members.
Constructors
Name | Description
RoomFilter |  Constructs a filter which matches only rooms.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace