Revit 2026 API
WireSizeSetIterator Class
An iterator to a wire size set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireSizeSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public abstract class WireSizeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class WireSizeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class WireSizeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type WireSizeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The WireSizeSetIterator type exposes the following members.
Constructors
Name | Description
WireSizeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace