Revit 2026 API
RoomTag Class
Provides access to the room tag in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementTag
 Autodesk.Revit.DB.Architecture.RoomTag
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class RoomTag : SpatialElementTag
Public Class RoomTag
	Inherits SpatialElementTag
public ref class RoomTag : public SpatialElementTag
type RoomTag =
    class
        inherit SpatialElementTag
    end
The RoomTag type exposes the following members.
Properties
Name | Description
IsInRoom | Identifies if the tag is located in a room.
Room | The room that the tag is associated with.
RoomTagType | The tag type.
TaggedLocalRoomId | The ElementId of the tagged room.
TaggedRoomId | The LinkElementId of the tagged room.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace