Revit 2026 API
BoundaryValidation Methods
The BoundaryValidation type exposes the following members.
Methods
Name | Description
Dispose
IsValidBoundaryOnSketchPlane
IsValidBoundaryOnView
IsValidHorizontalBoundary
Top
See Also
Reference
BoundaryValidation Class
Autodesk.Revit.DB Namespace