Revit 2026 API
LogicalAndFilter Class
 A filter that contains a set of filters. The filter passes when all filters in the set pass.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementLogicalFilter
 Autodesk.Revit.DB.LogicalAndFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class LogicalAndFilter : ElementLogicalFilter
Public Class LogicalAndFilter
	Inherits ElementLogicalFilter
public ref class LogicalAndFilter : public ElementLogicalFilter
type LogicalAndFilter =
    class
        inherit ElementLogicalFilter
    end
The LogicalAndFilter type exposes the following members.
Constructors
Name | Description
LogicalAndFilter(IList<ElementFilter>) | Initializes a new instance of the LogicalAndFilter class
LogicalAndFilter(ElementFilter, ElementFilter) |  Constructs a new instance of the logical filter with two input filters.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.
See Also
Reference
Autodesk.Revit.DB Namespace