Revit 2026 API
Grid Class
 Represents a single grid line within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DatumPlane
 Autodesk.Revit.DB.Grid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class Grid : DatumPlane
Public Class Grid
	Inherits DatumPlane
public ref class Grid : public DatumPlane
type Grid =
    class
        inherit DatumPlane
    end
The Grid type exposes the following members.
Properties
Name | Description
Curve | Retrieves an object that represents the geometry of the grid line.
IsCurved |  Identifies if the grid line is curved or straight.
Top
Methods
Name | Description
Create(Document, Arc) |  Creates a new radial grid line.
Create(Document, Line) |  Creates a new grid line.
GetExtents |  Gets the extents of the grid in the model.
SetVerticalExtents |  Adjusts the grid to extend through only the vertical range between bottom and top.
Top
Remarks
 A Grid is a DatumPlane, so it is actually a three dimensional surface. It can be either a plane parallel to the project z-axis, or else a cylinder whose axis is parallel to the project z-xis. [!:Autodesk::Revit::DatumPlane]
See Also
Reference
Autodesk.Revit.DB Namespace