Revit 2026 API
FieldDomainPointsByUV Methods
The FieldDomainPointsByUV type exposes the following members.
Methods
Name | Description
SetGridCoordinates
Top
See Also
Reference
FieldDomainPointsByUV Class
Autodesk.Revit.DB.Analysis Namespace