Revit 2026 API
CircuitNamingScheme Methods
The CircuitNamingScheme type exposes the following members.
Methods
Name | Description
Create
GetCombinedParameters |  Gets the combined parameters.
IsNameUnique |  Validates whether the CircuitNamingScheme name is unique in document.
IsValidCombinedParameters
SetCombinedParameters
Top
See Also
Reference
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace