Revit 2026 API
RebarShapeVertex Methods
The RebarShapeVertex type exposes the following members.
Methods
Name | Description
Dispose
GetConstraints |  Retrieve the list of constraints associated with this vertex.
SetConstraints
Top
See Also
Reference
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace