Revit 2026 API
SplitButton Class
The SplitButton object represents a button with a clickable button appearing above a pulldown.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.PulldownButton
 Autodesk.Revit.UI.SplitButton
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class SplitButton : PulldownButton
Public Class SplitButton
	Inherits PulldownButton
public ref class SplitButton : public PulldownButton
type SplitButton =
    class
        inherit PulldownButton
    end
The SplitButton type exposes the following members.
Properties
Name | Description
CurrentButton | Gets or sets the current PushButton of the SplitButton.
IsSynchronizedWithCurrentItem |  Indicates whether the top PushButton on the SplitButton changes based on the CurrentButton property.
Top
Methods
Name | Description
Top
Remarks
Use of this class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace