Revit 2026 API
HermiteSurface Class
 A Hermite Surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.HermiteSurface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class HermiteSurface : Surface
Public Class HermiteSurface
	Inherits Surface
public ref class HermiteSurface : public Surface
type HermiteSurface =
    class
        inherit Surface
    end
The HermiteSurface type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create(Int32, Int32, IList<XYZ>)
Create(Int32, Int32, IList<XYZ>, Boolean, Boolean)
IsValid |  Checks whether this HermiteSurface object is valid.
Top
See Also
Reference
Autodesk.Revit.DB Namespace