Revit 2026 API
RebarShapeSegment Methods
The RebarShapeSegment type exposes the following members.
Methods
Name | Description
Dispose
GetConstraints |  Retrieve the list of constraints associated with this segment.
SetConstraints
Top
See Also
Reference
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace