Revit 2026 API
Asset Class
 Represents a connected property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetProperties
 Autodesk.Revit.DB.Visual.Asset
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class Asset : AssetProperties
Public Class Asset
	Inherits AssetProperties
public ref class Asset : public AssetProperties
type Asset =
    class
        inherit AssetProperties
    end
The Asset type exposes the following members.
Properties
Name | Description
AssetType |  The type of RenderingAsset
LibraryName |  Library name
Title |  Asset title
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace