Revit 2026 API
LayoutRuleFixedNumber Class
This class indicate the layout rule of a Beam System is Fixed-Number.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleFixedNumber
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class LayoutRuleFixedNumber : LayoutRule
Public Class LayoutRuleFixedNumber
	Inherits LayoutRule
public ref class LayoutRuleFixedNumber : public LayoutRule
type LayoutRuleFixedNumber =
    class
        inherit LayoutRule
    end
The LayoutRuleFixedNumber type exposes the following members.
Constructors
Name | Description
LayoutRuleFixedNumber | Constructor of LayoutRuleFixedNumber.
Top
Properties
Name | Description
NumberOfLines | Get or set the number of the beams in a beam system.
Top
Methods
Name | Description
Top
Remarks
To use this type of LayoutRule, only the number of the beams must be set.
See Also
Reference
Autodesk.Revit.DB Namespace