Revit 2026 API
GroupType Class
 An element representing a group of elements that may be placed many times in a project or family.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.GroupType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class GroupType : ElementType
Public Class GroupType
	Inherits ElementType
public ref class GroupType : public ElementType
type GroupType =
    class
        inherit ElementType
    end
The GroupType type exposes the following members.
Properties
Name | Description
Groups | Retrieve a set of all the groups that have this type.
Top
Methods
Name | Description
GetAvailableAttachedDetailGroupTypeIds |  Returns the attached detail groups available for this element group type.
LoadFrom |  Replaces the group with the contents of the input file.
Top
Remarks
 Grouping elements is useful when you need to create entities that represent repeating layouts or are common to many building projects, such as hotel rooms, apartments, or repeating floors.
See Also
Reference
Autodesk.Revit.DB Namespace