Revit 2026 API
AngularDimension Methods
The AngularDimension type exposes the following members.
Methods
Name | Description
Create
SetAngularRadius |  Set radius of an Angular Dimension arc. The new radius of the arc.
Top
See Also
Reference
AngularDimension Class
Autodesk.Revit.DB Namespace