Revit 2026 API
InsulationTypeSet Properties
The InsulationTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of insulation types that are in the set.
Top
See Also
Reference
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace