Revit 2026 API
FilterCategoryRule Methods
The FilterCategoryRule type exposes the following members.
Methods
Name | Description
AllCategoriesFilterable
GetCategories |  Gets the rule's categories.
SetCategories
Top
See Also
Reference
FilterCategoryRule Class
Autodesk.Revit.DB Namespace