Revit 2026 API
InsulationTypeSetIterator Properties
The InsulationTypeSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
InsulationTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace