Revit 2026 API
TessellatedFace Class
 Defines a planar face bounded by a polyline in 3d space. A face consists of a single connected component and can have holes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TessellatedFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class TessellatedFace : IDisposable
Public Class TessellatedFace
	Implements IDisposable
public ref class TessellatedFace : IDisposable
type TessellatedFace =
    class
        interface IDisposable
    end
The TessellatedFace type exposes the following members.
Constructors
Name | Description
TessellatedFace(IList<XYZ>, ElementId) | Initializes a new instance of the TessellatedFace class
TessellatedFace(IList<IList<XYZ>>, ElementId) | Initializes a new instance of the TessellatedFace class
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaterialId |  Material of the face.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TessellatedFace
GetBoundaryLoops |  Get loops bounding the face.
Top
See Also
Reference
Autodesk.Revit.DB Namespace