Revit 2026 API
WireMaterialTypeSetIterator Properties
The WireMaterialTypeSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
WireMaterialTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace