Revit 2026 API
CorrectionFactorSetIterator Class
An iterator to a correction factor set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public abstract class CorrectionFactorSetIterator : APIObject,
	IEnumerator
Public MustInherit Class CorrectionFactorSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class CorrectionFactorSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type CorrectionFactorSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The CorrectionFactorSetIterator type exposes the following members.
Constructors
Name | Description
CorrectionFactorSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace