Revit 2026 API
PropertyLine Class
Represents kinds of PropertyLines.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.PropertyLine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class PropertyLine : Element
Public Class PropertyLine
	Inherits Element
public ref class PropertyLine : public Element
type PropertyLine =
    class
        inherit Element
    end
The PropertyLine type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace