Revit 2026 API
Profile Class
A geometric profile consisting of a loop of curves.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Profile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class Profile : GeometryObject
Public Class Profile
	Inherits GeometryObject
public ref class Profile : public GeometryObject
type Profile =
    class
        inherit GeometryObject
    end
The Profile type exposes the following members.
Properties
Name | Description
Curves | Retrieve the curves that make up the boundary of the profile.
Filled | Get or set whether the profile is filled.
Transformed | Transforms this profile and returns the result.
Top
Methods
Name | Description
Clone | Returns a copy of this profile.
Top
Remarks
The profile may be filled.
See Also
Reference
Autodesk.Revit.DB Namespace