Revit 2026 API
InstanceBinding Class
The InstanceBinding object is used to signify a binding between a parameter definition and a parameter on each instance of an element, such as a wall.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Binding
 Autodesk.Revit.DB.ElementBinding
 Autodesk.Revit.DB.InstanceBinding
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class InstanceBinding : ElementBinding
Public Class InstanceBinding
	Inherits ElementBinding
public ref class InstanceBinding : public ElementBinding
type InstanceBinding =
    class
        inherit ElementBinding
    end
The InstanceBinding type exposes the following members.
Constructors
Name | Description
InstanceBinding() | Constructs an empty instance binding.
InstanceBinding(CategorySet) | Constructs an instance binding with the set of categories passed.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Once bound the parameter will appear on all instance of the element and changing the parameter on any one single instance will not change the value on any other instance.
See Also
Reference
Autodesk.Revit.DB Namespace