Revit 2026 API
Solid Class
A 3d solid.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Solid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class Solid : GeometryObject
Public Class Solid
	Inherits GeometryObject
public ref class Solid : public GeometryObject
type Solid =
    class
        inherit GeometryObject
    end
The Solid type exposes the following members.
Properties
Name | Description
Edges | The edges that belong to the solid.
Faces | The faces that belong to the solid.
SurfaceArea | Returns the total surface area of this solid.
Volume | Returns the signed volume of this solid.
Top
Methods
Name | Description
ComputeCentroid | Returns the Centroid of this solid.
GetBoundingBox |  Retrieves a box that circumscribes the solid geometry.
IntersectWithCurve |  Calculates and returns the intersection between a curve and this solid.
Top
Remarks
A solid is defined by the faces and edges that form its boundary.
See Also
Reference
Autodesk.Revit.DB Namespace