Revit 2026 API
FamilySymbol Properties
The FamilySymbol type exposes the following members.
Properties
Name | Description
Family |  The Family object to which the symbol belongs.
IsActive |  Identifies whether the symbol is active.
StructuralMaterialType | This property returns the physical material from which the type is made.
Top
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace