Revit 2026 API
FilterCategoryRule Class
 A filter rule that matches elements of a set of categories.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterCategoryRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class FilterCategoryRule : FilterRule
Public Class FilterCategoryRule
	Inherits FilterRule
public ref class FilterCategoryRule : public FilterRule
type FilterCategoryRule =
    class
        inherit FilterRule
    end
The FilterCategoryRule type exposes the following members.
Constructors
Name | Description
FilterCategoryRule | Initializes a new instance of the FilterCategoryRule class
Top
Properties
Name | Description
Top
Methods
Name | Description
AllCategoriesFilterable
GetCategories |  Gets the rule's categories.
SetCategories
Top
See Also
Reference
Autodesk.Revit.DB Namespace