Revit 2026 API
HermiteSpline Methods
The HermiteSpline type exposes the following members.
Methods
Name | Description
Create(IList<XYZ>, Boolean)
Create(IList<XYZ>, Boolean, HermiteSplineTangents)
Top
See Also
Reference
HermiteSpline Class
Autodesk.Revit.DB Namespace