Revit 2026 API
WorksetConfiguration Methods
The WorksetConfiguration type exposes the following members.
Methods
Name | Description
Close
Dispose
Open
Top
See Also
Reference
WorksetConfiguration Class
Autodesk.Revit.DB Namespace