Revit 2026 API
BoundaryValidation Class
 Curve loop validators.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BoundaryValidation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class BoundaryValidation : IDisposable
Public Class BoundaryValidation
	Implements IDisposable
public ref class BoundaryValidation : IDisposable
type BoundaryValidation =
    class
        interface IDisposable
    end
The BoundaryValidation type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BoundaryValidation
IsValidBoundaryOnSketchPlane
IsValidBoundaryOnView
IsValidHorizontalBoundary
Top
See Also
Reference
Autodesk.Revit.DB Namespace