Revit 2026 API
Segment Class
 This element represents a segment of an MEP curve object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Segment
 Autodesk.Revit.DB.Plumbing.PipeSegment
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class Segment : Element
Public Class Segment
	Inherits Element
public ref class Segment : public Element
type Segment =
    class
        inherit Element
    end
The Segment type exposes the following members.
Properties
Name | Description
Description |  The description of the segment.
MaterialId |  The ElementId of the MaterialElem.
Roughness |  The roughness value for given material.
SizeCount |  The number of size objects in the segment.
Top
Methods
Name | Description
AddSize |  Adds a new MEPSize to the segment.
GetSizes |  Gets the defined sizes of the segment.
RemoveSize |  Remove the existing MEPSize with this nominal diameter from the segment.
Top
Remarks
 Currently, only pipe curves can be broken into separate segment elements.
See Also
Reference
Autodesk.Revit.DB Namespace