Revit 2026 API
IndexStreamPoint Methods
The IndexStreamPoint type exposes the following members.
Methods
Name | Description
AddPoint |  Inserts a IndexPoint into the stream and associated buffer.
AddPoints
Top
See Also
Reference
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace