Revit 2026 API
WireSizeSet Properties
The WireSizeSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of wire sizes that are in the set.
Top
See Also
Reference
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace