Revit 2026 API
LinePattern Methods
The LinePattern type exposes the following members.
Methods
Name | Description
Dispose
GetSegments |  Gets the sequence of segments that defines this line pattern.
SetSegments
Top
See Also
Reference
LinePattern Class
Autodesk.Revit.DB Namespace