Revit 2026 API
LinearDimension Methods
The LinearDimension type exposes the following members.
Methods
Name | Description
Create
Top
See Also
Reference
LinearDimension Class
Autodesk.Revit.DB Namespace