Revit 2026 API
ElementMulticategoryFilter Class
 A filter used to find elements whose category matches any of a given set of categories.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementMulticategoryFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ElementMulticategoryFilter : ElementQuickFilter
Public Class ElementMulticategoryFilter
	Inherits ElementQuickFilter
public ref class ElementMulticategoryFilter : public ElementQuickFilter
type ElementMulticategoryFilter =
    class
        inherit ElementQuickFilter
    end
The ElementMulticategoryFilter type exposes the following members.
Constructors
Name | Description
ElementMulticategoryFilter(ICollection<BuiltInCategory>) | Initializes a new instance of the ElementMulticategoryFilter class
ElementMulticategoryFilter(ICollection<ElementId>) | Initializes a new instance of the ElementMulticategoryFilter class
ElementMulticategoryFilter(ICollection<BuiltInCategory>, Boolean) | Initializes a new instance of the ElementMulticategoryFilter class
ElementMulticategoryFilter(ICollection<ElementId>, Boolean) | Initializes a new instance of the ElementMulticategoryFilter class
Top
Properties
Name | Description
Top
Methods
Name | Description
GetCategoryIds |  Gets the category ids assigned to this filter.
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace