Revit 2026 API
BuildingPad Methods
The BuildingPad type exposes the following members.
Methods
Name | Description
Create
GetBoundary |  Gets the boundary of current BuildingPad element.
SetBoundary
Top
See Also
Reference
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace