Revit 2026 API
NavisworksExportOptions Methods
The NavisworksExportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetSelectedElementIds |  Returns the element ids of the elements to export. Empty by default.
SetSelectedElementIds
Top
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace