Revit 2026 API
ElementWorksetFilter Class
 A filter used to match elements which reside in a given workset.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementWorksetFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ElementWorksetFilter : ElementQuickFilter
Public Class ElementWorksetFilter
	Inherits ElementQuickFilter
public ref class ElementWorksetFilter : public ElementQuickFilter
type ElementWorksetFilter =
    class
        inherit ElementQuickFilter
    end
The ElementWorksetFilter type exposes the following members.
Constructors
Name | Description
ElementWorksetFilter(WorksetId) |  Constructs a new instance of a filter to match elements in a given workset.
ElementWorksetFilter(WorksetId, Boolean) |  Constructs a new instance of a filter to match elements in a given workset.
Top
Properties
Name | Description
WorksetId |  The workset id.
Top
Methods
Name | Description
Top
Remarks
 This filter is a quick filter.
See Also
Reference
Autodesk.Revit.DB Namespace