Revit 2026 API
AreaFilter Class
 A filter used to match areas.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.AreaFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class AreaFilter : ElementSlowFilter
Public Class AreaFilter
	Inherits ElementSlowFilter
public ref class AreaFilter : public ElementSlowFilter
type AreaFilter =
    class
        inherit ElementSlowFilter
    end
The AreaFilter type exposes the following members.
Constructors
Name | Description
AreaFilter |  Constructs a filter which matches only areas.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB Namespace