Revit 2026 API
LayoutRuleFixedDistance Class
This class indicate the layout rule of a Beam System is Fixed-Distance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleFixedDistance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class LayoutRuleFixedDistance : LayoutRule
Public Class LayoutRuleFixedDistance
	Inherits LayoutRule
public ref class LayoutRuleFixedDistance : public LayoutRule
type LayoutRuleFixedDistance =
    class
        inherit LayoutRule
    end
The LayoutRuleFixedDistance type exposes the following members.
Constructors
Name | Description
LayoutRuleFixedDistance | Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Top
Properties
Name | Description
JustifyType | Get or set the type of justification.
Spacing | Get or set spacing of the Beam System.
Top
Methods
Name | Description
Top
Remarks
To use this type of LayoutRule, the distance between the beams and the justify-type must be set.
See Also
Reference
Autodesk.Revit.DB Namespace