Revit 2026 API
HermiteSurface Methods
The HermiteSurface type exposes the following members.
Methods
Name | Description
Create(Int32, Int32, IList<XYZ>)
Create(Int32, Int32, IList<XYZ>, Boolean, Boolean)
IsValid |  Checks whether this HermiteSurface object is valid.
Top
See Also
Reference
HermiteSurface Class
Autodesk.Revit.DB Namespace