Revit 2026 API
Workset Class
 Represents a workset in the document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetPreview
 Autodesk.Revit.DB.Workset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class Workset : WorksetPreview
Public Class Workset
	Inherits WorksetPreview
public ref class Workset : public WorksetPreview
type Workset =
    class
        inherit WorksetPreview
    end
The Workset type exposes the following members.
Properties
Name | Description
IsEditable |  Whether the workset is editable.
IsOpen |  Whether the workset is open (rather than closed).
IsVisibleByDefault |  Whether the workset is visible by default.
Kind |  Kind of the workset.
Top
Methods
Name | Description
Create |  Creates a new workset.
Top
Remarks
 Worksets are a way to divide a set of elements in the Revit document into subsets for worksharing. There may be one or many worksets in a document. Each element in the document must belong to one and only one workset.
See Also
Reference
Autodesk.Revit.DB Namespace