Revit 2026 API
CorrectionFactorSet Properties
The CorrectionFactorSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of correction factors that are in the set.
Top
See Also
Reference
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace