Revit 2026 API
DeleteElements Methods
The DeleteElements type exposes the following members.
Methods
Name | Description
Create(Document, ElementId) |  Creates an instance of the DeleteElements resolution.
Create(Document, IList<ElementId>)
Create(Document, ISet<ElementId>)
Top
See Also
Reference
DeleteElements Class
Autodesk.Revit.DB Namespace