Revit 2026 API
ElementLogicalFilter Methods
The ElementLogicalFilter type exposes the following members.
Methods
Name | Description
GetFilters |  Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
SetFilters
Top
See Also
Reference
ElementLogicalFilter Class
Autodesk.Revit.DB Namespace