Revit 2026 API
GroundConductorSizeSetIterator Methods
The GroundConductorSizeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
GroundConductorSizeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace