Revit 2026 API
IndexStreamTriangle Methods
The IndexStreamTriangle type exposes the following members.
Methods
Name | Description
AddTriangle |  Inserts a IndexTriangle into the stream and associated buffer.
AddTriangles
Top
See Also
Reference
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace