Revit 2026 API
ElementDesignOptionFilter Class
 A filter used to find elements contained within a particular design option.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementDesignOptionFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ElementDesignOptionFilter : ElementQuickFilter
Public Class ElementDesignOptionFilter
	Inherits ElementQuickFilter
public ref class ElementDesignOptionFilter : public ElementQuickFilter
type ElementDesignOptionFilter =
    class
        inherit ElementQuickFilter
    end
The ElementDesignOptionFilter type exposes the following members.
Constructors
Name | Description
ElementDesignOptionFilter(ElementId) |  Constructs a new instance of a filter to match elements contained within a particular design option.
ElementDesignOptionFilter(ElementId, Boolean) |  Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option.
Top
Properties
Name | Description
DesignOptionId |  The design option id.
Top
Methods
Name | Description
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace