Revit 2026 API
PushButton Class
The PushButton object represents an button on a RibbonPanel.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.PushButton
 Autodesk.Revit.UI.ToggleButton
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class PushButton : RibbonButton
Public Class PushButton
	Inherits RibbonButton
public ref class PushButton : public RibbonButton
type PushButton =
    class
        inherit RibbonButton
    end
The PushButton type exposes the following members.
Properties
Name | Description
AssemblyName | The assembly path of the button.
AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button.
ClassName | The name of the class containing the implementation for the command.
Top
Methods
Name | Description
Top
Remarks
Use of this class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace