Revit 2026 API
SiteSubRegion Methods
The SiteSubRegion type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>) | Obsolete.
Create(Document, IList<CurveLoop>, ElementId) | Obsolete.
Dispose
GetBoundary |  Gets the boundary of current subregion.
IsValidBoundary
SetBoundary | Obsolete.
Top
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace