Revit 2026 API
MechanicalEquipmentSet Methods
The MechanicalEquipmentSet type exposes the following members.
Methods
Name | Description
Add
AreElementsNotConnectedInSeries
AreValidMembers
Create
GetMembers |  Gets member element ids for the mechanical equipment set.
Remove
Top
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace