Revit 2026 API
TemperatureRatingTypeSetIterator Methods
The TemperatureRatingTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
TemperatureRatingTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace