Revit 2026 API
HermiteFace Class
A cubic hermite spline face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.HermiteFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class HermiteFace : Face
Public Class HermiteFace
	Inherits Face
public ref class HermiteFace : public Face
type HermiteFace =
    class
        inherit Face
    end
The HermiteFace type exposes the following members.
Properties
Name | Description
MixedDerivs | Mixed derivatives of the surface.
Params | Parameters of the surface.
Points | Interpolation points of the surface.
Tangents | Tangents of the surface.
Top
Methods
Name | Description
Top
Remarks
Hermite faces are defined by cubic hermite spline surfaces bounded by edge loops. The surfaces provide natural UV parameterization to the faces.
See Also
Reference
Autodesk.Revit.DB Namespace