Revit 2026 API
CurveElementFilter Class
 A filter used to pass curve elements which are of a specific type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.CurveElementFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class CurveElementFilter : ElementSlowFilter
Public Class CurveElementFilter
	Inherits ElementSlowFilter
public ref class CurveElementFilter : public ElementSlowFilter
type CurveElementFilter =
    class
        inherit ElementSlowFilter
    end
The CurveElementFilter type exposes the following members.
Constructors
Name | Description
CurveElementFilter(CurveElementType) |  Constructs a new instance of a filter to match specific types of curve elements.
CurveElementFilter(CurveElementType, Boolean) |  Constructs a new instance of a filter to match specific types of curve elements, with the option to match all curves which are not of the given curve type.
Top
Properties
Name | Description
CurveElementType |  The curve element type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace