Revit 2026 API
ArcLengthDimension Methods
The ArcLengthDimension type exposes the following members.
Methods
Name | Description
Create
Top
See Also
Reference
ArcLengthDimension Class
Autodesk.Revit.DB Namespace