Revit 2026 API
BoundingBoxUV Class
A two-dimensional rectangle, parallel to the coordinate axes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BoundingBoxUV
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class BoundingBoxUV : IDisposable
Public Class BoundingBoxUV
	Implements IDisposable
public ref class BoundingBoxUV : IDisposable
type BoundingBoxUV =
    class
        interface IDisposable
    end
The BoundingBoxUV type exposes the following members.
Constructors
Name | Description
BoundingBoxUV() | default constructor
BoundingBoxUV(Double, Double, Double, Double) | Creates object with supplied values.
Top
Properties
Name | Description
Bounds | Indexed access for loops. Use 0 for Min and 1 for Max.
IsSet | Indicates whether the BoundingBoxUV is set or not.
Max | Maximum coordinates (upper-right corner of the box).
Min | Minimum coordinates (lower-left corner of the box).
Top
Methods
Name | Description
Dispose | Releases all resources used by the BoundingBoxUV
Top
See Also
Reference
Autodesk.Revit.DB Namespace