Revit 2026 API
ReferencePlane Class
 Represents a reference plane of Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DatumPlane
 Autodesk.Revit.DB.ReferencePlane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ReferencePlane : DatumPlane
Public Class ReferencePlane
	Inherits DatumPlane
public ref class ReferencePlane : public DatumPlane
type ReferencePlane =
    class
        inherit DatumPlane
    end
The ReferencePlane type exposes the following members.
Properties
Name | Description
BubbleEnd |  The bubble end of the reference plane.
Direction |  The direction of the reference plane.
FreeEnd |  The free end of the reference plane.
Name | The name property of the reference plane.
Normal |  The normal vector of the reference plane.
Top
Methods
Name | Description
Flip |  Flips the orientation of the reference plane.
GetPlane |  Returns the geometry plane to which the reference plane is assigned.
GetReference |  Returns the geometry reference of the reference plane.
Top
See Also
Reference
Autodesk.Revit.DB Namespace