Revit 2026 API
FamilyInstanceFilter Class
 A filter used to find elements that are family instances of the given family symbol.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.FamilyInstanceFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class FamilyInstanceFilter : ElementSlowFilter
Public Class FamilyInstanceFilter
	Inherits ElementSlowFilter
public ref class FamilyInstanceFilter : public ElementSlowFilter
type FamilyInstanceFilter =
    class
        inherit ElementSlowFilter
    end
The FamilyInstanceFilter type exposes the following members.
Constructors
Name | Description
FamilyInstanceFilter |  Constructs a new instance of a filter to match family instances of the given family symbol.
Top
Properties
Name | Description
FamilySymbolId |  The family symbol id.
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB Namespace