Revit 2026 API
MassSurfaceData Methods
The MassSurfaceData type exposes the following members.
Methods
Name | Description
GetFaceReferences |  Gets References to the faces that the MassSurfaceData provides properties for.
Top
See Also
Reference
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace