Revit 2026 API
DWFImportOptions Methods
The DWFImportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetSheetViews |  Get sheet views where DWF markups are imported.
SetSheetViews
Top
See Also
Reference
DWFImportOptions Class
Autodesk.Revit.DB Namespace