Revit 2026 API
RevisionsOnSheetUIServiceData Methods
The RevisionsOnSheetUIServiceData type exposes the following members.
Methods
Name | Description
Dispose
GetParentHwnd |  return the parent handle
GetRevitElementIds |  return the list of revit Element Ids
Top
See Also
Reference
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace