Revit 2026 API
SpotDimension Class
 Object representing various types of SpotDimension
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.SpotDimension
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class SpotDimension : Dimension
Public Class SpotDimension
	Inherits Dimension
public ref class SpotDimension : public Dimension
type SpotDimension =
    class
        inherit Dimension
    end
The SpotDimension type exposes the following members.
Properties
Name | Description
LeaderHasShoulder |  True is dimension has leader with shoulder, false otherwise.
LeaderShoulderPosition |  Position of spot dimension's leader shoulder point.
SpotDimensionType |  The dimension style of this dimension.
Top
Methods
Name | Description
CanFlip |  Verifies that the direction of the dimension can be flipped.
Flip |  Flips dimension to the other side of the host.
Top
See Also
Reference
Autodesk.Revit.DB Namespace