Revit 2026 API
TypeBinding Class
TypeBinding objects are used to bind a property to a Revit type, such as a wall type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Binding
 Autodesk.Revit.DB.ElementBinding
 Autodesk.Revit.DB.TypeBinding
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class TypeBinding : ElementBinding
Public Class TypeBinding
	Inherits ElementBinding
public ref class TypeBinding : public ElementBinding
type TypeBinding =
    class
        inherit ElementBinding
    end
The TypeBinding type exposes the following members.
Constructors
Name | Description
TypeBinding() | Constructs an empty type binding.
TypeBinding(CategorySet) | Constructs a type binding with the set of categories passed.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
This differs from Instance bindings in that the property is then shared by all instances that use that type. Changing the parameter for one type affects all other instances that use that type.
See Also
Reference
Autodesk.Revit.DB Namespace