Revit 2026 API
TransactWithCentralOptions Class
 Options to customize Revit behavior when accessing the central model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TransactWithCentralOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class TransactWithCentralOptions : IDisposable
Public Class TransactWithCentralOptions
	Implements IDisposable
public ref class TransactWithCentralOptions : IDisposable
type TransactWithCentralOptions =
    class
        interface IDisposable
    end
The TransactWithCentralOptions type exposes the following members.
Constructors
Name | Description
TransactWithCentralOptions |  Constructs a new TransactWithCentralOptions.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TransactWithCentralOptions
GetLockCallback |  Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
SetLockCallback |  Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
Top
See Also
Reference
Autodesk.Revit.DB Namespace