Revit 2026 API
AXMImportOptions Class
 The import options used to import AXM format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.AXMImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class AXMImportOptions : BaseImportOptions
Public Class AXMImportOptions
	Inherits BaseImportOptions
public ref class AXMImportOptions : public BaseImportOptions
type AXMImportOptions =
    class
        inherit BaseImportOptions
    end
The AXMImportOptions type exposes the following members.
Constructors
Name | Description
AXMImportOptions() |  Constructs a new instance of AXMImportOptions with default values of all properties.
AXMImportOptions(AXMImportOptions) |  Constructs a new instance of AXMImportOptions as a copy of the provided import options.
Top
Properties
Name | Description
ImportLevels |  Indicate if levels are to be imported. False by default.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace