Revit 2026 API
CorrectionFactor Properties
The CorrectionFactor type exposes the following members.
Properties
Name | Description
Factor |  Get factor value of wire correction factor.
Top
See Also
Reference
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace