Revit 2026 API
VectorAtPoint Class
 Stores vectors at one domain point. Each vector corresponds to a "measurement" for which this vector was calculated.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueAtPointBase
 Autodesk.Revit.DB.Analysis.VectorAtPoint
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class VectorAtPoint : ValueAtPointBase
Public Class VectorAtPoint
	Inherits ValueAtPointBase
public ref class VectorAtPoint : public ValueAtPointBase
type VectorAtPoint =
    class
        inherit ValueAtPointBase
    end
The VectorAtPoint type exposes the following members.
Constructors
Name | Description
VectorAtPoint(IList<XYZ>) | Initializes a new instance of the VectorAtPoint class
VectorAtPoint(VectorAtPoint) |  Creates a copy of the given VectorAtPoint instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace