Revit 2024 API
MechanicalSystemType Members
The MechanicalSystemType type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a mechanical system type and adds it to the document.
ValidateRiseDropSymbolType
 Confirms if the parameter is a valid HVAC rise/drop symbol type.
Properties
Name | Description
RiseDropSettings
 indicates the rise/drop symbol given the system type
See Also
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace