Revit 2024 API
TriangulationInterfaceForTriangulatedShellComponent Members
The TriangulationInterfaceForTriangulatedShellComponent type exposes the following members.
Constructors
Name | Description
TriangulationInterfaceForTriangulatedShellComponent
 Constructs an interface object for a TriangulatedShellComponent.
Methods
Name | Description
Properties
Name | Description
See Also
TriangulationInterfaceForTriangulatedShellComponent Class
Autodesk.Revit.DB Namespace