Revit 2024 API
EndTreatmentType Members
The EndTreatmentType type exposes the following members.
Methods
Name | Description
Create(Document)
 Creates a new EndTreatmentType in a document.
Create(Document, String)
 Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter.
CreateDefaultEndTreatmentType
 Creates a new EndTreatmentType object with a default name.
Properties
Name | Description
EndTreatment
 String describing the end treatment
See Also
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace