Revit 2024 API
RevitServerException Members
The RevitServerException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerException Class
Autodesk.Revit.Exceptions Namespace