Revit 2024 API
ReloadLatestOptions Members
The ReloadLatestOptions type exposes the following members.
Constructors
Name | Description
ReloadLatestOptions
 Constructs a new ReloadLatestOptions object.
Methods
Name | Description
Dispose
Releases all resources used by the ReloadLatestOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ReloadLatestOptions Class
Autodesk.Revit.DB Namespace