Revit 2024 API
FilterNumericLess Members
The FilterNumericLess type exposes the following members.
Constructors
Name | Description
FilterNumericLess
 Constructs an instance of FilterNumericLess.
Methods
Name | Description
Properties
Name | Description
See Also
FilterNumericLess Class
Autodesk.Revit.DB Namespace