Revit 2024 API
IntegerParameterValue Properties
The IntegerParameterValue type exposes the following members.
Properties
Name | Description
Value
 The stored value
See Also
IntegerParameterValue Class
Autodesk.Revit.DB Namespace