Revit 2024 API
RuledSurface Members
The RuledSurface type exposes the following members.
Methods
Name | Description
Create(Curve, Curve)
 Creates a Surface object coincident with the ruled surface joining two bounded generating curves.
Create(Curve, XYZ)
 Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point.
GetFirstProfileCurve
 Returns a copy of the first profile curve if it is set.
GetFirstProfilePoint
 If a point was used to define the first profile, returns a copy of that point.
GetSecondProfileCurve
 Returns a copy of the second profile curve if it is set.
GetSecondProfilePoint
 If a point was used to define the second profile, returns a copy of that point.
HasFirstProfilePoint
 Checks if a point was used to define the first profile.
HasSecondProfilePoint
 Checks if a point was used to define the second profile.
Properties
Name | Description
See Also
RuledSurface Class
Autodesk.Revit.DB Namespace