Revit 2024 API
SlabShapeCrease Members
The SlabShapeCrease type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CreaseType
The type of the crease.
Curve
The geometry of the crease.
EndPoints
The vertices of the crease.
See Also
SlabShapeCrease Class
Autodesk.Revit.DB Namespace