Revit 2024 API
PresetInitialColor Members
The PresetInitialColor type exposes the following members.
Constructors
Name | Description
PresetInitialColor(ColorPreset)
 Creates an initial color preset object with the given preset value.
PresetInitialColor(PresetInitialColor)
 Creates a copy of the given preset initial color
Methods
Name | Description
Properties
Name | Description
Preset
 The preset value
See Also
PresetInitialColor Class
Autodesk.Revit.DB.Lighting Namespace