Revit 2024 API
ExternalServiceOptions Methods
The ExternalServiceOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace