Revit 2024 API
RadialArray Methods
The RadialArray type exposes the following members.
Methods
Name | Description
ArrayElementsWithoutAssociation
 Creates a new radial array from a set of elements based on an input rotation axis.
ArrayElementWithoutAssociation
 Creates a new radial array from a single element based on an input rotation axis.
Create(Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember)
 Creates a new radial array element from a single element based on an input rotation axis.
Create(Document, View, ICollection<ElementId>, Int32, Line, Double, ArrayAnchorMember)
 Creates a new radial array element from a set of elements based on an input rotation axis.
GetCopiedMemberIds
Retrieves the copied member Ids of the Array.
 (Overrides BaseArray.GetCopiedMemberIds().)
GetOriginalMemberIds
Retrieves the original member Ids of the Array.
 (Overrides BaseArray.GetOriginalMemberIds().)
IsRotationAngleValid
 This indicates whether the input angle is valid.
IsValidArraySize
 This indicates whether the input count is valid.
See Also
RadialArray Class
Autodesk.Revit.DB Namespace