Revit 2024 API
DimensionSegment Members
The DimensionSegment type exposes the following members.
Methods
Name | Description
IsTextPositionAdjustable
Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
ResetTextPosition
Resets the text position of the segment to the initial position determined by its type and parameters.
Properties
Name | Description
Above
The text shown above the segment's value.
Below
The text shown below the segment's value.
IsLocked
 Indicates if this segment is locked.
LeaderEndPosition
The position of the dimension leader end point.
Origin
 The segment origin.
Prefix
The text shown before the segment's value.
Suffix
The text shown after the segment's value.
TextPosition
The position of the dimension text's drag point.
Value
 The length of the segment.
ValueOverride
The text that replaces the segment's value.
ValueString
 The displayed value shown for the dimension segment.
See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace