Revit 2024 API
ConceptualSurfaceType Members
The ConceptualSurfaceType type exposes the following members.
Methods
Name | Description
GetAllMassSubCategoryIds
 Get all the mass subcategory ids for which there are ConceptualSurfaceType's.
GetByMassSubCategoryId
 Get the ConceptualSurfaceType by its mass subcategory id.
GetConstructionTypeIds
 The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.
Properties
Name | Description
DefaultConstructionTypeId
 The element id of the user specified ConceptualConstructionType to be used by default on creation for mass faces of this mass subcategory.
MassSubCategoryId
 The mass subcategory id of the ConceptualSurfaceType.
See Also
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace