Revit 2024 API
LinkConversionData Members
The LinkConversionData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the LinkConversionData
GetOptions
 Extra information used during the creation of the Revit document.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Path
 The path to the source data used to generate the model.
ServerId
 The service responsible for converting the data into a Revit file.
See Also
LinkConversionData Class
Autodesk.Revit.DB Namespace