Revit 2024 API
ScheduleField Members
The ScheduleField type exposes the following members.
Methods
Name | Description
CanDisplayMinMax
 Indicates if this field can display minimum and maximum values.
CanTotal
 Indicates if totals can be enabled for this field.
CanTotalByAssemblyType
 Indicates if totals by assembly type can be enabled for this field.
CreatesCircularReferences
 Checks whether a field ID would create a circular chain of references when used by the PercentageOf property of this field.
Dispose
Releases all resources used by the ScheduleField
GetCombinedParameters
 Gets this field's combine parameter array if applicable
GetCustomFieldData
 Gets the data associated with this custom field. If this field isn't a CustomField will return null.
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
GetName
 Gets the name of the field.
GetSchedulableField
 Gets a SchedulableField object representing this field.
GetSpecTypeId
 The spec describing values of this field, if applicable.
GetStyle
 Gets the style of this field.
IsValidCombinedParameters
 Checks if data is valid for combined parameters
ResetOverride
 Resets the override of this field.
SetCombinedParameters
 Sets this field's combine parameter array if applicable
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
SetStyle
 Sets the style of this field.
Properties
Name | Description
ColumnHeading
 The column heading text.
Definition
 The ScheduleDefinition that this field belongs to.
DisplayType
 Indicates the chosen display type for the field.
FieldId
 The ID of the field in the containing ScheduleDefinition.
FieldIndex
 The index of the field in the containing ScheduleDefinition.
FieldType
 The type of data displayed by the field.
GridColumnWidth
 The width of the column in the editable grid view, measured in feet.
HasSchedulableField
 Identifies if this ScheduleField object has access to a SchedulableField. Calculated and combined parameter fields will not have the access.
HeadingOrientation
 The orientation of the column heading text.
HorizontalAlignment
 The horizontal alignment of the column's data.
IsCalculatedField
 Indicates if the field is a calculated field (Formula or Percentage).
IsCombinedParameterField
 Indicates if the field is a combined parameter field.
IsHidden
 Indicates if the field is hidden in the schedule.
IsOverridden
 Indicates if the field is overridden or not.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MultipleValuesCustomText
 The custom multiple values text to be used when the schedule field displays multiple element values, used when MultipleValuesDisplayType is set to Custom.
MultipleValuesDisplayType
 Determines the type of multiple value indication to be used when the schedule field displays multiple element values.
MultipleValuesText
 The multiple values text to be used when the schedule field displays multiple element values, as specified by the display type MultipleValuesDisplayType.
ParameterId
 The ID of the parameter displayed by the field.
PercentageBy
 The ID of the grouped schedule field used to calculate percentage totals.
PercentageOf
 The ID of the field to calculate percentages of.
Schedule
 The schedule that this field belongs to.
SheetColumnWidth
 The width of the column on a sheet, measured in feet.
TotalByAssemblyType
 In an assembly schedule view, indicates if totals are calculated for all assembly instances of the same type or only for a single instance.
VerticalAlignment
 The vertical alignment of the column's data.
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace