Revit 2024 API
RebarContainer Members
The RebarContainer type exposes the following members.
Methods
Name | Description
AppendItemFromCurves
 Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
AppendItemFromCurvesAndShape
 Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
AppendItemFromRebar
 Appends an Item to the RebarContainer. Fills its data on base of the Rebar. Will throw exception if given rebar is not shape driven. Will throw exception if given rebar has moved bars in set.
AppendItemFromRebarShape
 Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
CanApplyPresentationMode
 Checks if a presentation mode can be applied for this RebarContainer in the given view.
ClearItems
 Clears all the Items stored in this Rebar Container element.
Contains
 Checks if the RebarContainer has this item as one of its members.
Create
 Creates a new instance of a Rebar Container element within the project.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetHostId
 The element that contains the rebar.
GetItem
 Gets the item stored in the RebarContainer at the associated index.
GetParametersManager
 Returns an object used to manage parameters of the Rebar Container.
GetRebarContainerIterator
 Returns a Rebar Container Iterator that iterates through the Rebar Container Items.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
HasPresentationOverrides
 Identifies if any RebarContainerItem of this RebarContainer has overridden default presentation settings for the given view.
IsItemHidden
 Identifies if a given RebarContainerItem is hidden in this view.
IsUnobscuredInView
 Checks if this rebar container element is shown unobscured in a view.
RemoveItem
 Removes Item from the Rebar Container.
SetHostId
 The element that contains the rebar.
SetItemHiddenStatus
 Sets the RebarContainerItem to be hidden or unhidden in the given view.
SetUnobscuredInView
 Sets this rebar container element to be shown unobscured in a view.
Properties
Name | Description
ItemsCount
 The count of Items in this Rebar Container.
PresentItemsAsSubelements
 Identifies if Items should be presented in schedules and tags as separate subelements.
ScheduleMark
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace