Revit 2024 API
StairsType Members
The StairsType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ConstructionMethod
 The construction method of the stairs.
EndConnectionType
 The join style between a run and landing.
HasMiddleSupports
 True if the stairs type has middle supports, False otherwise.
LandingType
 The type for all landings in the stair element.
LeftLateralOffset
 The offset for the left support from the edge of the run in a horizontal direction.
LeftSideSupportType
 The type of left support used in the stair.
MaxRiserHeight
 The maximum height of each riser on the stair element.
MiddleSupportsNumber
 The number of middle supports used in the stair.
MiddleSupportType
 The type of middle supports used in the stair.
MinRunWidth
 The initial value for the width of a common run.
MinTreadDepth
 The minimum tread width along the center path for all common runs (winder, arc, and straight).
NotchExtension
 The horizontal length of the notch profile.
NotchHorizontalGap
 The width of the horizontal gap in the stairs notch.
NotchThickness
 The vertical length of the notch profile from the top.
NotchVerticalGap
 The width of the vertical gap in the stairs notch.
RightLateralOffset
 The offset for the right support from the edge of the run in a horizontal direction.
RightSideSupportType
 The type of right support used in the stair.
RunType
 The type for all runs in the stair element.
See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace