Revit 2024 API
IFCConnectedWallData Methods
The IFCConnectedWallData type exposes the following members.
Methods
Name | Description
Dispose
See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace