Revit 2024 API
AssemblyDifferenceMemberCount Members
The AssemblyDifferenceMemberCount type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Count1
 Number of members in the first assembly
Count2
 Number of members in the second assembly
See Also
AssemblyDifferenceMemberCount Class
Autodesk.Revit.DB Namespace