Revit 2024 API
TemporaryGraphicsCommandData Methods
The TemporaryGraphicsCommandData type exposes the following members.
Methods
Name | Description
Dispose
See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace