Revit 2024 API
ColorBackgroundSettings Members
The ColorBackgroundSettings type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Color
 The color of the rendering background.
See Also
ColorBackgroundSettings Class
Autodesk.Revit.DB Namespace