Revit 2024 API
PlanCircuit Members
The PlanCircuit type exposes the following members.
Methods
Name | Description
GetPointInside
Returns a point inside the circuit.
Properties
Name | Description
Area
The enclosed area of the circuit.
IsRoomLocated
Reports whether there is a room located in this circuit.
SideNum
The number of sides in the circuit.
See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace