Revit 2024 API
ExportLineweightInfo Methods
The ExportLineweightInfo type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExportLineweightInfo Class
Autodesk.Revit.DB Namespace