Revit 2024 API
ViewSystemsAnalysisReport Members
The ViewSystemsAnalysisReport type exposes the following members.
Methods
Name | Description
CancelSystemsAnalysis
 Cancels the systems analysis based on the report element id.
Create
 Creates a new view for the systems analysis report.
GetLatestSystemsAnalysisReport
 Gets the latest report of systems analysis.
GetReportContent
 Gets the report content in this view.
IsAnalysisCompleted
 Indicates if the background systems analysis has completed or not.
RequestSystemsAnalysis
 Requests a new systems analysis in the background.
Properties
Name | Description
AnalysisDateAndTime
 Identifies the analysis date and time when it was requested.
ReportStyle
 The report style that specifies the display content.
SystemsAnalysisOutputFolder
 The full path of the output folder for systems analysis
SystemsAnalysisWorkflowFile
 The full path name of the original system analysis workflow file.
WeatherFile
 The full path name of the weather file used for the systems analysis.
See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace