Revit 2024 API
FlexDuct Members
The FlexDuct type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>)
 Creates a new flexible duct into the document, using a point array and flexible duct type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>)
 Creates a new flexible duct into the document, using a point array and flexible duct type.
IsFlexDuctTypeId
 Checks if given type is valid flexible duct type.
IsHVACSystemTypeId
 Checks if given type is valid HVAC system type.
Properties
Name | Description
EndTangent
 Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
FlexDuctType
 The flex duct type of this flex duct.
Points
The points of the flex duct.
StartTangent
 Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
See Also
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace