Revit 2024 API
PlanTopology Members
The PlanTopology type exposes the following members.
Methods
Name | Description
GetRoomIds
Retrieves room ElementIds of the PlanTopology in the last phase.
Properties
Name | Description
Circuits
The Circuits of the PlanTopology.
Level
The Level of the PlanTopology.
Phase
The phase of the PlanTopology.
See Also
PlanTopology Class
Autodesk.Revit.DB Namespace