Revit 2024 API
DeleteWorksetSettings Methods
The DeleteWorksetSettings type exposes the following members.
Methods
Name | Description
Dispose
See Also
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace