Revit 2024 API
DoubleArray Members
The DoubleArray type exposes the following members.
Constructors
Name | Description
DoubleArray
Initializes a new instance of the DoubleArray class
Methods
Name | Description
Append
Clear
Removes every double from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a double at a specified index within the array.
Size
Returns the number of doubles that are in the array.
See Also
DoubleArray Class
Autodesk.Revit.DB Namespace