Revit 2024 API
MEPAnalyticalSystem Members
The MEPAnalyticalSystem type exposes the following members.
Methods
Name | Description
Create
 Creates a new analytical system
GetAirSystemData
 Returns the air system data, null if not available.
GetWaterLoopData
 Returns the water loop data, null if not available.
Properties
Name | Description
AnalyticalSystemDomain
 The type of analytical system.
See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace