Revit 2024 API
FilterStringLess Members
The FilterStringLess type exposes the following members.
Constructors
Name | Description
FilterStringLess
 Constructs an instance of FilterStringLess.
Methods
Name | Description
Properties
Name | Description
See Also
FilterStringLess Class
Autodesk.Revit.DB Namespace