Revit 2024 API
ExportFontInfo Members
The ExportFontInfo type exposes the following members.
Constructors
Name | Description
ExportFontInfo()
 Constructs a new default ExportFontInfo.
ExportFontInfo(String)
 Constructs a new ExportFontInfo using the destination font name as input.
ExportFontInfo(ExportFontInfo)
 Constructs a new copy of the input ExportFontInfo object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportFontInfo
Properties
Name | Description
DestinationFontName
 The destination font name (the name of the font in the exported format).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportFontInfo Class
Autodesk.Revit.DB Namespace