Revit 2024 API
PulldownButton Members
The PulldownButton type exposes the following members.
Methods
Name | Description
AddPushButton
Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.
AddSeparator
Adds a separator to the drop-down list.
GetItems
Gets a copy of the collection of buttons assigned to the pulldown button.
Properties
Name | Description
See Also
PulldownButton Class
Autodesk.Revit.UI Namespace