Revit 2024 API
ViewSheetSet Members
The ViewSheetSet type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsAutomatic
 Automatic order or manual order.
Name
The view sheet set name.
 (Overrides Element.Name.)
OrderedViewList
 Ordered views.
SheetOrganizationId
ElementId to the BrowserOrganization for sheets.
ViewOrganizationId
ElementId to the BrowserOrganization for non-sheet views.
Views
The views.
See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace