Revit 2024 API
CurveExtents Members
The CurveExtents type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the CurveExtents
Properties
Name | Description
EndParameter
 The end parameter of the curve extents.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StartParameter
 The start parameter of the curve extents.
See Also
CurveExtents Class
Autodesk.Revit.DB Namespace