Revit 2024 API
FabricSheet Members
The FabricSheet type exposes the following members.
Methods
Name | Description
Create(Document, Element, ElementId)
 Creates a new instance of a single flat Fabric Sheet element within the project.
Create(Document, ElementId, ElementId, CurveLoop)
 Creates a new instance of a single bent Fabric Sheet element within the project.
GetBendProfile
 Returns the profile (not including generated fillets) that defines the shape of the Fabric Sheet bending.
GetBendProfileWithFillets
 Returns the profile with generated fillets that defines the shape of the Fabric Sheet bending.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetSegmentParameterIdsAndLengths
 Returns the array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.).
GetSheetLocation
 Gets the position and the orientation of the Fabric Sheet instance.
GetWireCenterlines()
 Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
GetWireCenterlines(WireDistributionDirection)
 Gets a list of curves representing the wires centerlines of the Fabric Sheet.
IsCoverOffsetValid
 Identifies if the specified value is valid for use as a cover offset.
IsSingleFabricSheetWithinHost
 Identifies if the specified single Fabric Sheet position is within the host.
IsUnobscuredInView
 Checks if this fabric sheet is shown unobscured in a view.
IsValidHost(Element)
 Checks whether an element is a valid host for fabric sheet.
IsValidHost(Document, ElementId)
 Checks whether an element is a valid host for fabric sheet.
PlaceInHost
 Inserts the single Fabric Sheet instance into the host element.
SetBendProfile
 Sets new profile that defines the shape of the Fabric Sheet bending.
SetSegmentLength
 Sets the value of the bent fabric sheet segment(like A, B, C, D etc.)
SetUnobscuredInView
 Sets this fabric sheet to be shown unobscured in a view.
Properties
Name | Description
BendFinalLoopOrientationVector
 Direction of local Fabric Sheet Y axis in bending polyline LCS.
BentFabricBendDirection
 Specifies which wire direction of the fabric sheet is bent.
BentFabricLongitudinalCutLength
 Specifies the cut length of the fabric sheet perpendicular to the bend edge.
BentFabricStraightWiresLocation
 Specifies the location of straight bars with respect to bent bars in the fabric sheet.
CoverOffset
 The additional cover offset of the Fabric Sheet.
CutOverallLength
 The sheet length after cutting has taken place.
CutOverallWidth
 The sheet length after cutting has taken place.
CutSheetMass
 The sheet mass after cutting has taken place.
FabricAreaOwnerId
 The Fabric Area Id.
FabricHostReference
 Controls if Single Fabric Sheet should be cut by the Host Cover
FabricLocation
 The Fabric Sheet location in the host.
FabricNumber
 Specifies the numerical parameter assigned to the fabric sheet and any sheet of the same type, dimension, material, shape, and partition.
HostId
 The structure element that contains the Fabric Sheet.
IsBent
 The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet.
SketchId
 The id of the Sketch element for this element.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace