Revit 2024 API
BeforeExecutedEventArgs Members
The BeforeExecutedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
UsingCommandData
 Indicates whether or not the Revit journal will include custom data populated by the application associated with this command.
See Also
BeforeExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace