Revit 2024 API
FailureMessage Members
The FailureMessage type exposes the following members.
Constructors
Name | Description
FailureMessage
 Creates a new FailureMessage related to a given FailureDefinition.
Methods
Name | Description
AddResolution
 Adds a resolution for the failure.
Dispose
Releases all resources used by the FailureMessage
GetAdditionalElements
 Retrieves list of the additional reference elements for the failure.
GetDefaultResolutionCaption
 Retrieves the caption of the default resolution of the failure.
GetDescriptionText
 Retrieves the description text of the failure.
GetFailingElements
 Retrieves list of the elements that have caused the failure.
GetFailureDefinitionId
 Retrieves the id of the failure definition for the failure.
GetSeverity
 Retrieves the severity of the failure.
HasResolutionOfType
 Checks if failure has a resolution of a given type.
HasResolutions
 Checks if the failure has any resolutions.
SetAdditionalElement
 Sets the additional reference element for the failure.
SetAdditionalElements
 Sets the additional reference elements for the failure.
SetFailingElement
 Sets the element that has caused the failure.
SetFailingElements
 Sets elements that have caused the failure.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FailureMessage Class
Autodesk.Revit.DB Namespace