Revit 2024 API
ElementStructuralTypeFilter Members
The ElementStructuralTypeFilter type exposes the following members.
Constructors
Name | Description
ElementStructuralTypeFilter(StructuralType)
 Constructs a new instance of a filter to match elements by structural type.
ElementStructuralTypeFilter(StructuralType, Boolean)
 Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type.
Methods
Name | Description
Properties
Name | Description
StructuralType
 The structural type.
See Also
ElementStructuralTypeFilter Class
Autodesk.Revit.DB Namespace