Revit 2024 API
LogicalOrFilter Members
The LogicalOrFilter type exposes the following members.
Constructors
Name | Description
LogicalOrFilter(IList<ElementFilter>)
 Constructs a new instance of the logical filter with any number of input filters.
LogicalOrFilter(ElementFilter, ElementFilter)
 Constructs a new instance of the logical filter with two input filters.
Methods
Name | Description
Properties
Name | Description
See Also
LogicalOrFilter Class
Autodesk.Revit.DB Namespace