Revit 2024 API
SATExportOptions Members
The SATExportOptions type exposes the following members.
Constructors
Name | Description
SATExportOptions()
 Constructs a new instance of SATImportOptions with default values of all properties.
SATExportOptions(SATExportOptions)
 Constructs a new instance of SATImportOptions as a copy of the export options.
Methods
Name | Description
Dispose
Releases all resources used by the SATExportOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SATExportOptions Class
Autodesk.Revit.DB Namespace