Revit 2024 API
AreaLoad Members
The AreaLoad type exposes the following members.
Methods
Name | Description
AreCurveLoopsValid
 Checks if curve loops are valid for creating an area load.
Create(Document, ElementId, XYZ, AreaLoadType)
 Creates a new hosted area load within the project.
Create(Document, ElementId, IList<CurveLoop>, XYZ, AreaLoadType)
 Creates a new custom area load within the project.
Create(Document, ElementId, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType)
 Creates a new custom area load within the project.
GetLoops
 Returns curve loops that define geometry of the area load.
GetRefPoint
 Returns the physical location of the reference point.
IsCurveLoopsInsideHostBoundaries
 Checks if contour loops is inside host boundaries.
IsValidHostId
 Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical element that is about to host an area load True if an area load can be placed on the input host id
SetLoops
 Sets curve loops that define geometry of the area load.
Properties
Name | Description
Area
 Returns area of the area load.
ForceVector1
 The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting.
ForceVector2
 The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting.
ForceVector3
 The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
IsProjected
 Indicates if the load is projected.
NumRefPoints
 Returns the total number of reference points for the area load.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace