Revit 2024 API
ValueAtPointBase Members
The ValueAtPointBase type exposes the following members.
Methods
Name | Description
ClearAllFlags
 Sets flags for all measurements to ValueAtPointFlags::None.
ClearFlagsAt
 Sets flags for the given measurement to ValueAtPointFlags::None.
Dispose
Releases all resources used by the ValueAtPointBase
GetFlags
 Returns flags for the given measurement.
SetFlags(IList<Int32>)
 Independently sets the flags associated to all measurements.
SetFlags(Int32)
 Sets the flags associated to all measurements to the same value.
SetFlags(Int32, Int32)
 Sets the flags associated to a given measurement.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ValueAtPointBase Class
Autodesk.Revit.DB Namespace