Revit 2024 API
AreaTagFilter Members
The AreaTagFilter type exposes the following members.
Constructors
Name | Description
AreaTagFilter
 Constructs a filter which matches only areas.
Methods
Name | Description
Properties
Name | Description
See Also
AreaTagFilter Class
Autodesk.Revit.DB Namespace