Revit 2024 API
DockableFrameVisibilityChangedEventArgs Members
The DockableFrameVisibilityChangedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DockableFrameShown
 True if the pane is being shown, false if it is being hidden.
PaneId
 The identifier for dockable pane.
See Also
DockableFrameVisibilityChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace