Revit 2024 API
FaceSilhouetteNode Members
The FaceSilhouetteNode type exposes the following members.
Methods
Name | Description
GetFace
 Returns the Face object corresponding to the node.
Properties
Name | Description
See Also
FaceSilhouetteNode Class
Autodesk.Revit.DB Namespace