Revit 2024 API
TransientElementCreationException Members
The TransientElementCreationException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
TransientElementCreationException Class
Autodesk.Revit.Exceptions Namespace