Revit 2024 API
FamilyInstanceFilter Members
The FamilyInstanceFilter type exposes the following members.
Constructors
Name | Description
FamilyInstanceFilter
 Constructs a new instance of a filter to match family instances of the given family symbol.
Methods
Name | Description
Properties
Name | Description
FamilySymbolId
 The family symbol id.
See Also
FamilyInstanceFilter Class
Autodesk.Revit.DB Namespace