Revit 2024 API
DefinitionBindingMapIterator Members
The DefinitionBindingMapIterator type exposes the following members.
Constructors
Name | Description
DefinitionBindingMapIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the map.
Properties
Name | Description
Current
Retrieves the binding that is the current focus of the iterator.
Key
Retrieves the definition that is the current focus of the iterator.
See Also
DefinitionBindingMapIterator Class
Autodesk.Revit.DB Namespace