Revit 2024 API
Document.NewFamilyInstance Method
Inserts a new instance of a family into the document.
Overload List
Name | Description
NewFamilyInstance(Curve, FamilySymbol, Level, StructuralType)
Inserts a new instance of a family into the document, using a curve, type/symbol and reference level.
NewFamilyInstance(XYZ, FamilySymbol, Element, Level, StructuralType)
Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a base level.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace