Revit 2024 API
RebarHandlesData Members
The RebarHandlesData type exposes the following members.
Methods
Name | Description
AddCustomHandle
 Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.
Dispose
Releases all resources used by the RebarHandlesData
GetCustomHandles
 Gets the handle definitions for the rebar that were added.
GetEndHandle
 Gets the end handle tag.
GetStartHandle
 Gets the start handle tag.
SetEndHandle
 Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully.
SetStartHandle
 Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace