Revit 2024 API
RepeaterBounds Members
The RepeaterBounds type exposes the following members.
Methods
Name | Description
AdjustForCyclicalBounds
 Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
AreCoordinatesInBounds
 Determines whether given coordinates are within the bounds.
Dispose
Releases all resources used by the RepeaterBounds
GetLowerBound
 Returns the smallest index of the array in the given dimension.
GetUpperBound
 Returns the highest index of the array in the given dimension.
IsCyclical
 True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension.
Properties
Name | Description
DimensionCount
 The number of dimensions of the bounds (0, 1 or 2 for zero, one or two dimensional arrays.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RepeaterBounds Class
Autodesk.Revit.DB Namespace