Revit 2024 API
ViewSection Members
The ViewSection type exposes the following members.
Methods
Name | Description
CreateCallout
 Creates a new callout view.
CreateDetail
 Returns a new detail ViewSection.
CreateReferenceCallout
 Creates a new reference callout.
CreateReferenceSection
 Creates a new reference section.
CreateSection
 Returns a new section ViewSection.
IsParentViewValidForCallout
 This validator checks that the parent view is appropriate for callout views.
IsSplitSection
 Sections can be split (jog) so that they cut at >1 plane.
IsViewFamilyTypeValidForCallout
 This validator checks that the ViewFamilyType is appropriate for callout views in the input parent view.
Properties
Name | Description
See Also
ViewSection Class
Autodesk.Revit.DB Namespace