Revit 2024 API
ProjectBrowserOptions Members
The ProjectBrowserOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ProjectBrowserOptions
GetProjectBrowserOptions
 Returns the current Revit instance's ProjectBrowserOptions.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowViewPlacementOnSheetStatusIcons
 Show the icons indicating view placement on sheet status.
See Also
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace