Revit 2024 API
CableTraySettings Members
The CableTraySettings type exposes the following members.
Methods
Name | Description
GetCableTraySettings
 Gets the cable tray settings of the project.
Properties
Name | Description
ConnectorSeparator
 The cable tray connector separator string.
FittingAnnotationSize
 The value of fitting annotation size.
RiseDropAnnotationSize
 The rise drop annotation size.
SizeSeparator
 The cable tray size separator string.
SizeSuffix
 The cable tray size suffix string.
UseAnnotationScaleForSingleLineFittings
 Indicates whether use annotation scale for single line fittings or not.
See Also
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace