Revit 2024 API
ExecutedEventArgs Members
The ExecutedEventArgs type exposes the following members.
Methods
Name | Description
GetJournalData
 Gets the journal data associated to this command (on journal playback).
SetJournalData
 Sets the journal data associated to this command (on journal playback).
Properties
Name | Description
See Also
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace