Revit 2024 API
Macro Members
The Macro type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the Macro
Execute
 Executes the macro.
Properties
Name | Description
Description
 The macro description.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroModule
 The Macro module.
Name
 The macro name.
See Also
Macro Class
Autodesk.Revit.DB.Macros Namespace