Revit 2024 API
ExternalResourceBrowserData Members
The ExternalResourceBrowserData type exposes the following members.
Constructors
Name | Description
ExternalResourceBrowserData
 Constructs a new ExternalResourceBrowserData using the given document(optional), server id, folder path and match options.
Methods
Name | Description
AddResource(String)
 Adds an external resource to the folder path by supplying the resource name.
AddResource(String, IDictionary<String, String>)
 Adds an external resource to the folder path by supplying the resource name and reference information.
AddResource(String, String)
 Adds an external resource to the folder path by supplying the resource name and version.
AddResource(String, String, IDictionary<String, String>)
 Adds an external resource to the folder path by supplying the resource name, version and reference information.
AddSubFolder(String)
 Adds a subfolder to the folder path with the given name.
AddSubFolder(String, String)
 Adds a subfolder to the folder path with the given name and icon type.
CallingDocumentHasModelPath
 Indicates whether the document requesting the external resource browser data has a defined ModelPath.
Dispose
Releases all resources used by the ExternalResourceBrowserData
GetCallingDocumentModelPath
 Returns a copy of the ModelPath of the document that is requesting the external resource browser data.
GetMatchOptions
 Gets the match options used to filter external resources.
GetResources
 Gets the external resources under the folder path of the browser data.
GetSubFoldersData
 Gets the subfolders data under the folder path of the browser data.
IsValidFolderName
 Checks whether the folder name is valid.
IsValidResourceName
 Checks whether the resource name is valid.
Properties
Name | Description
FolderPath
 The current folder path to which the new resources and subfolder belong.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ServerId
 The Id of IExternalResourceServer which handles the external resource load.
See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace