Revit 2024 API
RoofBase Members
The RoofBase type exposes the following members.
Methods
Name | Description
GetSlabShapeEditor
 Gets a SlabShapeEditor that can used to add or modify points of this RoofBase.
Properties
Name | Description
EaveCuts
Retrieve or set the EaveCutterType.
FasciaDepth
Retrieve or set the FasciaDepth.
RoofType
Retrieve or set the Type.
SlabShapeEditor |  Obsolete.
Get the SlabShapeEditor used for slab shape editing.
See Also
RoofBase Class
Autodesk.Revit.DB Namespace