Revit 2024 API
ImageExportOptions Members
The ImageExportOptions type exposes the following members.
Constructors
Name | Description
ImageExportOptions
 Constructs a new instance of the options class used to produce images.
Methods
Name | Description
Dispose
Releases all resources used by the ImageExportOptions
GetFileName
 Gets the file name that will be produced when exporting a view to an image.
GetViewsAndSheets
 Gets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.
IsValidFileName
 Verify if File name is valid
IsValidForSaveToProjectAsImage
 Verify if ImageExportOptions object is valid for calling saveToProjectAsImage
SetViewsAndSheets
 Sets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.
Properties
Name | Description
ExportRange
 The export range defining which view(s) will be exported.
FilePath
 The file name and path for the exported file.
FitDirection
 The fit direction. Used only if ZoomType is FitToPage.
HLRandWFViewsFileType
 File type for exported HLR and wireframe views.
ImageResolution
 The image resolution in dots per inch.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PixelSize
 The pixel size of an image in one direction. Used only if ZoomType is FitToPage.
ShadowViewsFileType
 The file type for exported shadow views.
ShouldCreateWebSite
 Whether or not to create a web site with a page for each export. Used only when ExportRange is SetOfViews.
ViewName
 The name of the view to be created.
Zoom
 The value for Zoom (as a percentage). Used only when ZoomType is Zoom.
ZoomType
 The zoom type, which defines how the image size is determined.
See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace