Revit 2024 API
ReloadSwapOutInfo Members
The ReloadSwapOutInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ReloadSwapOutInfo
Properties
Name | Description
CurrentVersion
 New version.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Part
 The ElementId of part being swapped.
PreviousVersion
 Previous version.
WasSwapped
 Whether the swap out was successful.
See Also
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace