Revit 2024 API
ViewSet Members
The ViewSet type exposes the following members.
Constructors
Name | Description
ViewSet
Initializes a new instance of the ViewSet class
Methods
Name | Description
Clear
Removes every view from the set, rendering it empty.
Contains
Tests for the existence of a view within the set.
Erase
Removes a specified view from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified view into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of views that are in the set.
See Also
ViewSet Class
Autodesk.Revit.DB Namespace