Revit 2024 API
FamilyContextException Members
The FamilyContextException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
FamilyContextException Class
Autodesk.Revit.Exceptions Namespace