Revit 2024 API
AssetPropertyString Members
The AssetPropertyString type exposes the following members.
Methods
Name | Description
IsValidValue
 Checks that the value is a valid value for this property.
Properties
Name | Description
Value
 value of the property
See Also
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace