Revit 2024 API
ExportPDFSettings Members
The ExportPDFSettings type exposes the following members.
Methods
Name | Description
Create
 Returns an new created ExportPDFSettings element in the document with specified settings.
FindByName
 Returns settings element by name.
GetActivePredefinedSettings
 Gets the active settings element in the document.
GetOptions
 Gets a copy of options from settings for exporting. Modification on this options would not change the element.
IsValidName
 Returns result that the proposed name is valid and not exist in the specified document.
ListNames
 Returns all the names of the settings instances in the document.
SetOptions
 Sets options for exporting.
Properties
Name | Description
See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace