Revit 2024 API
GenericImportOptions Members
The GenericImportOptions type exposes the following members.
Methods
Name | Description
Properties
Name | Description
RefPoint
Reference point (in Revit) to which the image is going to be inserted.
See Also
GenericImportOptions Class
Autodesk.Revit.DB Namespace