Revit 2024 API
CurveArray Members
The CurveArray type exposes the following members.
Constructors
Name | Description
CurveArray
Initializes a new instance of the CurveArray class
Methods
Name | Description
Append
Add the curve to the end of the array.
Clear
Removes every curve from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified curve into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a curve at a specified index within the array.
Size
Returns the number of curves that are in the array.
See Also
CurveArray Class
Autodesk.Revit.DB Namespace