Revit 2024 API
EdgeEndPoint.Equals Method
Overload List
Name | Description
Equals(EdgeEndPoint)
 Determines whether this EdgeEndPoint is equal to another.
See Also
EdgeEndPoint Class
EdgeEndPoint Members
Autodesk.Revit.DB Namespace