Revit 2024 API
ConduitSettings Members
The ConduitSettings type exposes the following members.
Methods
Name | Description
GetConduitSettings
 Gets the conduit settings of the project.
Properties
Name | Description
ConnectorSeparator
 The conduit connector separator string.
FittingAnnotationSize
 The value of fitting annotation size.
RiseDropAnnotationSize
 The rise drop annotation size.
SizePrefix
 The conduit size prefix string.
SizeSuffix
 The conduit size suffix string.
UseAnnotationScaleForSingleLineFittings
 Indicates whether use annotation scale for single line fittings or not.
See Also
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace