Revit 2024 API
ButtonData Members
The ButtonData type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Image
The image of the button.
LargeImage
The large image of the button.
Text
The user-visible text of the button.
See Also
ButtonData Class
Autodesk.Revit.UI Namespace