Revit 2024 API
SharedParameterApplicableRule Members
The SharedParameterApplicableRule type exposes the following members.
Constructors
Name | Description
SharedParameterApplicableRule
 Constructs an instance of SharedParameterApplicableRule.
Methods
Name | Description
Properties
Name | Description
ParameterName
 The name of the parameter that an element must support to pass this rule.
See Also
SharedParameterApplicableRule Class
Autodesk.Revit.DB Namespace