Revit 2024 API
PointOnFace Members
The PointOnFace type exposes the following members.
Methods
Name | Description
GetFaceReference
Get a copy of the face reference.
SetFaceReference
Change the face reference.
Properties
Name | Description
UV
The location of the point in the surface's coordinate system.
See Also
PointOnFace Class
Autodesk.Revit.DB Namespace