Revit 2024 API
PhotometricWebLightDistribution Members
The PhotometricWebLightDistribution type exposes the following members.
Constructors
Name | Description
PhotometricWebLightDistribution(PhotometricWebLightDistribution)
 Creates a copy of the given photometric web light distribution
PhotometricWebLightDistribution(String, Double)
 Creates a photometric web light distribution object with the given filename and tilt.
Methods
Name | Description
Properties
Name | Description
PhotometricWebFile
 The filename of an IES photometric web file.
TiltAngle
 The tilt angle.
See Also
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace