Revit 2024 API
DocumentEntryPoint Methods
The DocumentEntryPoint type exposes the following members.
Methods
Name | Description
FinishInitializationEO
 For Revit Macros internal use only.
Initialize
 For Revit Macros internal use only.
OnShutdownEO
 For Revit Macros internal use only.
See Also
DocumentEntryPoint Class
Autodesk.Revit.UI.Macros Namespace