Revit 2024 API
HermiteSplineTangents Members
The HermiteSplineTangents type exposes the following members.
Constructors
Name | Description
HermiteSplineTangents
 Constructs a new default instance of the class, with tangent vectors uninitialized.
Methods
Name | Description
Dispose
Releases all resources used by the HermiteSplineTangents
Properties
Name | Description
EndTangent
 The tangent vector at the end of the curve.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StartTangent
 The tangent vector at the start of the curve.
See Also
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace