Revit 2024 API
IntegerRange Members
The IntegerRange type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IntegerRange
Properties
Name | Description
High
 The upper limit of the range
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Low
 The lower limit of the range
See Also
IntegerRange Class
Autodesk.Revit.DB Namespace