Revit 2024 API
AssetSetIterator Methods
The AssetSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Reset
See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace