Revit 2024 API
WorksharingTooltipInfo Members
The WorksharingTooltipInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the WorksharingTooltipInfo
GetRequesters
 The ordered list of unique user names of users who have outstanding editing requests for the specified element.
Properties
Name | Description
Creator
 The user name of the user who created the element.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LastChangedBy
 The user name of the most recent user who saved a user change of this element to the central model.
Owner
 The current owner of the element or empty string if no one owns the element.
See Also
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace