Revit 2024 API
MEPBuildingConstruction Members
The MEPBuildingConstruction type exposes the following members.
Methods
Name | Description
GetBuildingConstruction
Gets the current Building Construction from the project information.
GetBuildingConstructionOverride
Gets the Building Construction override for a ConstructionType.
GetConstructions
Gets all the Building Constructions corresponding to the specific Construction type.
SetBuildingConstruction
Sets the Building Construction of the Project Information.
SetBuildingConstructionOverride
Sets the Building Construction override for a ConstructionType.
Properties
Name | Description
See Also
MEPBuildingConstruction Class
Autodesk.Revit.DB.Mechanical Namespace