Revit 2024 API
LinkNode Members
The LinkNode type exposes the following members.
Methods
Name | Description
GetDocument
 Returns the document associated with the link.
Properties
Name | Description
SymbolId
 Identifies the Id of the symbol associated with the node.
See Also
LinkNode Class
Autodesk.Revit.DB Namespace