Revit 2024 API
FilterRule Members
The FilterRule type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FilterRule
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
GetRuleParameter
 Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FilterRule Class
Autodesk.Revit.DB Namespace