Revit 2024 API
ViewNode Members
The ViewNode type exposes the following members.
Methods
Name | Description
GetCameraInfo
 Information about the observation point (the camera) of the view.
Properties
Name | Description
LevelOfDetail
 The level of detail the view is going to be rendered at.
ViewId
 The Id of the view element.
See Also
ViewNode Class
Autodesk.Revit.DB Namespace