Revit 2024 API
WireframeBuilder Members
The WireframeBuilder type exposes the following members.
Constructors
Name | Description
WireframeBuilder
 Default constructor.
Methods
Name | Description
AddCurve
 Add a curve to the shape representation stored in this WireframeBuilder.
AddPoint
 Add a point to the shape representation stored in this WireframeBuilder.
Reset
 Clears the accumulated geometry.
ValidateCurve
 Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input. This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve().
ValidatePoint
 Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input.
Properties
Name | Description
See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace