Revit 2024 API
ElevationMarker Members
The ElevationMarker type exposes the following members.
Methods
Name | Description
CreateElevation
 Creates a new elevation ViewSection on the ElevationMarker at the desired index.
CreateElevationMarker
 Creates a new ElevationMarker.
CreateReferenceElevation
 Creates a reference elevation on the ElevationMarker at the desired index.
CreateReferenceElevationMarker
 Creates a new ElevationMarker.
GetViewId
 Returns the ViewSection id for the index of the ElevationMarker.
HasElevations
 Returns true if the ElevationMarker has at least one elevation view, false otherwise.
IsAvailableIndex
 Returns true if a new elevation ViewSection can be placed at %index%, returns false otherwise.
Properties
Name | Description
CurrentViewCount
 The current number of views hosted by this ElevationMarker.
IsReference
 Indicates if this is a reference ElevationMarker. Only reference elevations can be hosted by reference ElevationMarkers.
MaximumViewCount
 The maximum number of views that can be hosted by this ElevationMarker.
See Also
ElevationMarker Class
Autodesk.Revit.DB Namespace