Revit 2024 API
Conduit Members
The Conduit type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of conduit.
IsValidConduitType
 Identifies if a conduit type is valid.
Properties
Name | Description
See Also
Conduit Class
Autodesk.Revit.DB.Electrical Namespace