Revit 2024 API
RevolvedFace Members
The RevolvedFace type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Axis
Axis of the surface.
Curve
Profile curve of the surface.
Origin
Origin of the surface.
Radius
Radius of the surface.
See Also
RevolvedFace Class
Autodesk.Revit.DB Namespace