Revit 2024 API
FilePath Members
The FilePath type exposes the following members.
Constructors
Name | Description
FilePath
 Constructs a FilePath
Methods
Name | Description
Properties
Name | Description
See Also
FilePath Class
Autodesk.Revit.DB Namespace