Revit 2024 API
ViewExportedEventArgs Members
The ViewExportedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ViewId
 Identifies the view that was exported.
See Also
ViewExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace