Revit 2024 API
LinePattern Members
The LinePattern type exposes the following members.
Constructors
Name | Description
LinePattern()
 Creates a simple line pattern.
LinePattern(String)
 Creates a line pattern with given name.
Methods
Name | Description
Dispose
Releases all resources used by the LinePattern
GetSegments
 Gets the sequence of segments that defines this line pattern.
SetSegments
 Sets the sequence of segments that defines this line pattern.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 Line pattern name.
See Also
LinePattern Class
Autodesk.Revit.DB Namespace