Revit 2024 API
ParameterValuePresenceRule Members
The ParameterValuePresenceRule type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Parameter
 The parameter which will be evaluated to pass this rule.
See Also
ParameterValuePresenceRule Class
Autodesk.Revit.DB Namespace