Revit 2024 API
WireMaterialType Members
The WireMaterialType type exposes the following members.
Methods
Name | Description
AddGroundConductorSize
 Add new electrical ground conductor size type into this material type.
AddTemperatureRatingType
 Add a new temperature rating type into material type.
RemoveGroundConductorSize
 Remove an existing ground conductor size from this material type.
RemoveTemperatureRatingType
 Remove an existing temperature rating type from this material type.
Properties
Name | Description
GroundConductorSizes
 Get all ground conductor size types defined in this wire material type.
IsInUse
 Indicate whether the wire material type is in use.
Name
 Get name of wire material type.
 (Overrides ElementType.Name.)
TemperatureRatings
 Get all temperature rating type definitions defined in this wire material type.
See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace