Revit 2024 API
ToposolidType Members
The ToposolidType type exposes the following members.
Methods
Name | Description
GetContourSetting
 Get the contour setting object from the current toposolid type.
Properties
Name | Description
See Also
ToposolidType Class
Autodesk.Revit.DB Namespace