Revit 2024 API
FilterStringEquals Members
The FilterStringEquals type exposes the following members.
Constructors
Name | Description
FilterStringEquals
 Constructs an instance of FilterStringEquals.
Methods
Name | Description
Properties
Name | Description
See Also
FilterStringEquals Class
Autodesk.Revit.DB Namespace