Revit 2024 API
RevisionCloud Members
The RevisionCloud type exposes the following members.
Methods
Name | Description
Create
 Creates a new RevisionCloud in the model.
GetSheetIds
 Returns the ids of the ViewSheets where this RevisionCloud may appear and contribute to the sheet's revision schedule.
GetSketchCurves
 Returns copies of the Curves that form this RevisionCloud.
IsRevisionIssued
 Indicates whether the Revision associated with this RevisionCloud has been issued.
Properties
Name | Description
RevisionId
 The Revision associated with this RevisionCloud.
See Also
RevisionCloud Class
Autodesk.Revit.DB Namespace