Revit 2024 API
DefinitionFile Members
The DefinitionFile type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Filename
This property returns the physical filename of the shared parameters file on disk.
Groups
Return a map of shared parameter definition groups contained within the file.
See Also
DefinitionFile Class
Autodesk.Revit.DB Namespace