Revit 2024 API
RebarBendingDetailType Members
The RebarBendingDetailType type exposes the following members.
Methods
Name | Description
Create
 Creates a new RebarBendingDetailType object.
Properties
Name | Description
AngularDimensionsDisplayOption
 Identifies the angular dimensions display options.
AngularDimensionsEnabled
 Identifies if any angular dimensions will be shown or not.
AngularDimensionsForHooksEnabled
 Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
AngularDimensionsMeasurementOptions
 Identifies the measurement option for angular dimensions.
AngularDimensionsOffset
 Identifies the offset of the angular dimensions.
AngularDimensionTextPosition
 Identifies the text position with respect to dimension line.
AngularDimensionTypeId
 Identifies the Id of the angular dimension type which is used to show dimensions.
BendDiameterDimensionsEnabled
 Identifies if any radial or diameter dimensions will be shown or not.
BendDiameterDimensionsForHooksEnabled
 Identifies if radial or diameter dimensions will be shown for hook fillets. This property has a meaning only if BendDiameterDimensionsEnabled is set to true.
BendDiameterDimensionsForSegmentsEnabled
 Identifies if radial or diameter dimensions will be shown for the bends between segments. Radial or diameter dimesions for arc segments will be shown by default. This property has a menaning only if BendDiameterDimensionsEnabled is set to true.
BendDiameterDimensionType
 Identifies what type of bend diameter dimensions will be shown (radial or diameter).
DetailLevel
 Identifies the level of detail in which the Bending Detail will be represented.
DiameterDimensionTypeId
 Identifies the Id of the diameter dimension type which is used to show dimensions.
MultipleValuesIndicatorOption
 Identifies the option of how multiple values will be represented.
OrthogonalAndOverallDimesionsEnabled
 Identifies if orthogonal and overall dimensions are displayed.
RadialDimensionTypeId
 Identifies the Id of the radial dimension type which is used to show dimensions.
RepresentaionOf3DShapes
 Identifies how the Bending Detail will represent the 3D shapes.
SegmentLengthDimensionsEnabled
 Identifies if any segment length dimensions will be shown or not.
SegmentLengthDimensionsForHooksEnabled
 Identifies if segment length dimensions for hooks will be shown or not. If this property is true, the SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.
SegmentLengthDimensionsOffset
 Identifies the offset of the segment length dimensions.
SegmentLengthDimensionTextPosition
 Identifies the text position with respect to dimension line.
SegmentLengthDimensionTypeId
 Identifies the Id of the linear dimension type which is used to show segments length.
SegmentLengthsDisplayOption
 Identifies if the segment lengths are represented using dimensions or just as text.
SegmentLengthsForArcsDisplayOption
 Identifies if the arc segment lengths are represented using dimensions or just as text. Only RebarShapes whose definition is RebarShapeDefinitionByArc are considered that have arc segments.
SegmentsRepresentation
 Identifies how the bending detail will represent the segments of the bar.
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace