Revit 2024 API
FabricationPartType Members
The FabricationPartType type exposes the following members.
Methods
Name | Description
Create
 Creates a fabrication part type element based on a specific fabrication servic button and condition.
Lookup
 Looks up an existing fabrication part type based on a specfic fabrication service button and condition.
Properties
Name | Description
See Also
FabricationPartType Class
Autodesk.Revit.DB Namespace