Revit 2024 API
EdgeArrayArrayIterator Members
The EdgeArrayArrayIterator type exposes the following members.
Constructors
Name | Description
EdgeArrayArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
EdgeArrayArrayIterator Class
Autodesk.Revit.DB Namespace