Revit 2024 API
FaceSplitter Members
The FaceSplitter type exposes the following members.
Methods
Name | Description
GetBoundaries
 Gets the boundaries.
Properties
Name | Description
SplitElementId
 The id of the element whose face is split by this element.
See Also
FaceSplitter Class
Autodesk.Revit.DB Namespace