Revit 2024 API
ExternalDataInstanceRemovedFromDocumentEventArgs Members
The ExternalDataInstanceRemovedFromDocumentEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
TypeId
 The type id of the external data instance id that has been removed from Revit document.
See Also
ExternalDataInstanceRemovedFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace