Revit 2024 API
FabricationItemFolder Members
The FabricationItemFolder type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationItemFolder
GetItemFiles
 Gets the item files in this item folder.
GetSubFolders
 Gets the item folder's sub folders.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The item folder's name.
See Also
FabricationItemFolder Class
Autodesk.Revit.DB Namespace