Revit 2024 API
BoundingBoxUV Members
The BoundingBoxUV type exposes the following members.
Constructors
Name | Description
BoundingBoxUV()
default constructor
BoundingBoxUV(Double, Double, Double, Double)
Creates object with supplied values.
Methods
Name | Description
Dispose
Releases all resources used by the BoundingBoxUV
Properties
Name | Description
Bounds
Indexed access for loops. Use 0 for Min and 1 for Max.
IsSet
Indicates whether the BoundingBoxUV is set or not.
Max
Maximum coordinates (upper-right corner of the box).
Min
Minimum coordinates (lower-left corner of the box).
See Also
BoundingBoxUV Class
Autodesk.Revit.DB Namespace