Revit 2024 API
EnergyAnalysisConstruction.GetMaterialIds Method
Overload List
Name | Description
GetMaterialIds()
 Returns a list of ids of the associated materials to analytical construction.
See Also
EnergyAnalysisConstruction Class
EnergyAnalysisConstruction Members
Autodesk.Revit.DB.Analysis Namespace