Revit 2024 API
DocumentReloadedLatestEventArgs Members
The DocumentReloadedLatestEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Location
 Full path of the central model which is to be operated.
See Also
DocumentReloadedLatestEventArgs Class
Autodesk.Revit.DB.Events Namespace