Revit 2024 API
OperationCanceledException Members
The OperationCanceledException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
OperationCanceledException Class
Autodesk.Revit.Exceptions Namespace