Revit 2024 API
FilterOperatorAndTextString Members
The FilterOperatorAndTextString type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FilterOperatorAndTextString
Properties
Name | Description
FilterOperatorStr
 A text string denoting the filter operator.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OperatorType
 The filter operator.
See Also
FilterOperatorAndTextString Class
Autodesk.Revit.DB Namespace