Revit 2024 API
Truss Members
The Truss type exposes the following members.
Methods
Name | Description
AttachChord
Attach a truss's specific chord to a specified element, the element should be a roof or floor.
Create
 Creates a new Truss.
DetachChord
Detach a truss's specific chord from the element to which it is attached.
DropTruss
Drop truss Family, it will disassociate all members from the truss and delete the truss.
GetTrussMemberInfo
Query if a given element is a member of a truss, its lock status and its usage, etc.
RemoveProfile
Remove the profile of a truss.
SetProfile
Add or modify the profile of a truss.
TogglePinMember
Pin/Unpin a truss member.
Properties
Name | Description
Curves
Get all the truss curves.
Members
Get all the members of truss.
TrussType
Retrieve/set an object that represents the type of the truss.
See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace