Revit 2024 API
ViewDisplaySketchyLines Methods
The ViewDisplaySketchyLines type exposes the following members.
Methods
Name | Description
Dispose
See Also
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace