Revit 2024 API
LogicalAndFilter Members
The LogicalAndFilter type exposes the following members.
Constructors
Name | Description
LogicalAndFilter(IList<ElementFilter>)
 Constructs a new instance of the logical filter with any number of input filters.
LogicalAndFilter(ElementFilter, ElementFilter)
 Constructs a new instance of the logical filter with two input filters.
Methods
Name | Description
Properties
Name | Description
See Also
LogicalAndFilter Class
Autodesk.Revit.DB Namespace