Revit 2024 API
StructuralSectionGeneralS Members
The StructuralSectionGeneralS type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralS
 Creates a new instance of Round Bar shape.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionGeneralS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace