Revit 2024 API
CentralFileCommunicationException Members
The CentralFileCommunicationException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
CentralFileCommunicationException Class
Autodesk.Revit.Exceptions Namespace