Revit 2024 API
RebarShapeConstraint180DegreeDefaultBend Members
The RebarShapeConstraint180DegreeDefaultBend type exposes the following members.
Constructors
Name | Description
RebarShapeConstraint180DegreeDefaultBend
 Create a 180-degree bend constraint.
Methods
Name | Description
Properties
Name | Description
See Also
RebarShapeConstraint180DegreeDefaultBend Class
Autodesk.Revit.DB.Structure Namespace