Revit 2024 API
MEPConnectorInfo Members
The MEPConnectorInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the MEPConnectorInfo
Properties
Name | Description
IsPrimary
 True if this is the primary connector.
IsSecondary
 True if this is the secondary connector.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LinkedConnector
 The linked connector or null if there is no linked connector
See Also
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace