Revit 2024 API
AnalyticalElement Properties
The AnalyticalElement type exposes the following members.
Properties
Name | Description
AnalyzeAs
 This represents the Analyze As parameter assigned to Analytical Element.
MaterialId
 Defines the Material Id for the Analytical Element.
StructuralRole
 The enum value depicting structural role asigned to the Analytical Element.
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace