Revit 2024 API
ComponentRepeaterSlot Members
The ComponentRepeaterSlot type exposes the following members.
Methods
Name | Description
IsTypeValidForSlot
 Determines whether instance of given family type can be used in the component repeater slot.
MakeDefault
 Populates the slot with an instance of the default family type of the component repeater.
MakeEmpty
 Makes the slot empty by removing the instance currently held by the slot.
Properties
Name | Description
FamilyType
 The id of the family type of the component in the slot, or invalid id if the slot is empty.
IsDefault
 A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.
IsEmpty
 A flag indicating whether the slot is currently empty.
See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace