Revit 2024 API
StructuralSectionRound Members
The StructuralSectionRound type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CentroidHorizontal
 Distance from centroid to the left extremites along horizontal axis.
CentroidVertical
 Distance from centroid to the upper extremites along vertical axis.
Diameter
 Pipe Diameter.
NameKey
 Name Key
See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace