Revit 2024 API
RebarShapeConstraint Members
The RebarShapeConstraint type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarShapeConstraint
GetParamId
 Return the Id of the parameter associated with this constraint.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace