Revit 2024 API
CableTraySizes Members
The CableTraySizes type exposes the following members.
Methods
Name | Description
AddSize
 Inserts a new MEPSize into the cable tray sizes. For cable tray, the nominal diameter of MEPSize is used .
ClearAll
 Removes all MEPSizes in the cable tray sizes.
Contains
 Checks whether a cable tray size with the nominal diameter exists.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetCableTraySizes
 Gets the cable tray sizes of the project.
GetCableTraySizesIterator
 Returns a CableTraySizeIterator to the MEP cable tray sizes.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetSizeCount
 Gets the size count of the cable tray size table.
RemoveSize
 Erases the existing MEPSize. For cable tray, the nominal diameter is used in MEPSize.
Properties
Name | Description
See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace