Revit 2024 API
ExportLineweightKey Members
The ExportLineweightKey type exposes the following members.
Constructors
Name | Description
ExportLineweightKey()
 Constructs a new default ExportLineweightKey.
ExportLineweightKey(Int32)
 Constructs a new default ExportLineweightKey using the original line weight as input.
ExportLineweightKey(ExportLineweightKey)
 Constructs a new copy of the input ExportLineweightKey object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportLineweightKey
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginalLineweight
 The original line weight.
See Also
ExportLineweightKey Class
Autodesk.Revit.DB Namespace