Revit 2024 API
HorizontalCurveEndpoint Members
The HorizontalCurveEndpoint type exposes the following members.
Methods
Name | Description
Properties
Name | Description
NextCurveType
 The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type.
PreviousCurveType
 The HorizontalCurveType of the curve which connects the endpoint to the previous displayed curve. If this endpoint's Station equals DisplayedStartStation, returns Unknown curve type.
Station
 The endpoint's station value.
See Also
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace