Revit 2024 API
DirectoryNotFoundException Members
The DirectoryNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides IOException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
DirectoryNotFoundException Class
Autodesk.Revit.Exceptions Namespace