Revit 2024 API
DataConversionMonitorScope Members
The DataConversionMonitorScope type exposes the following members.
Constructors
Name | Description
DataConversionMonitorScope
 The only constructor. Expects a valid pointer to IDataConversionMonitor.
Methods
Name | Description
Dispose
Releases all resources used by the DataConversionMonitorScope
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace