Revit 2024 API
TemperatureRatingTypeSet Members
The TemperatureRatingTypeSet type exposes the following members.
Constructors
Name | Description
TemperatureRatingTypeSet
Initializes a new instance of the TemperatureRatingTypeSet class
Methods
Name | Description
Clear
Removes every TemperatureRating type from the set, rendering it empty.
Contains
Tests for the existence of a TemperatureRating type within the set.
Erase
Removes a specified TemperatureRating type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified TemperatureRating type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of TemperatureRating types that are in the set.
See Also
TemperatureRatingTypeSet Class
Autodesk.Revit.DB.Electrical Namespace