Revit 2024 API
DocumentSavedAsEventArgs Members
The DocumentSavedAsEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsSavingAsCentralFile
 Indicates whether the document is to be saved as central file.
OriginalPath
 Original path of the document.
See Also
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace