Revit 2024 API
CopyPasteOptions Members
The CopyPasteOptions type exposes the following members.
Constructors
Name | Description
CopyPasteOptions
 Creates a new instance of a CopyPasteOptions object.
Methods
Name | Description
Dispose
Releases all resources used by the CopyPasteOptions
GetDuplicateTypeNamesHandler
 Returns current duplicate type names handler or null if none is set.
SetDuplicateTypeNamesHandler
 Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
CopyPasteOptions Class
Autodesk.Revit.DB Namespace