Revit 2024 API
StructuralAsset Members
The StructuralAsset type exposes the following members.
Constructors
Name | Description
StructuralAsset
 Constructs an instance of StructuralAsset.
Methods
Name | Description
Copy
 Produces a copy of the asset.
Dispose
Releases all resources used by the StructuralAsset
Equals(StructuralAsset)
 Determines whether this structural asset is equal to another.
SetPoissonRatio
 Sets the Poisson ratio of the asset.
SetShearModulus
 Sets the shear modulus of the asset.
SetThermalExpansionCoefficient
 Sets the thermal expansion coefficient of the asset.
SetYoungModulus
 Sets the Young's modulus of the asset.
Properties
Name | Description
Behavior
 Flag indicating whether elements of this material behave isotropically or orthotropically.
ConcreteBendingReinforcement
 The bending reinforcement of the asset.
ConcreteCompression
 The compression strength of concrete-based assets.
ConcreteShearReinforcement
 The shear reinforcement of the asset.
ConcreteShearStrengthReduction
 The shear strength reduction of the asset.
Density
 The density of the asset.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Lightweight
 Flag indicating whether the asset describes a material that is light-weight or not.
MetalReductionFactor
 The reduction factor of the asset.
MetalResistanceCalculationStrength
 The resistance calculation strength of the asset.
MetalThermallyTreated
 Flag indicating whether the asset describes a material that is thermally treated or not.
MinimumTensileStrength
 The minimum tensile strength of the asset.
MinimumYieldStress
 The minimum yield stress of the asset.
Name
 The name of the structural asset.
PoissonRatio
 The Poisson ratio of the asset.
ShearModulus
 The shear modulus of the asset.
StructuralAssetClass
 The type of material that this structural asset describes (e.g. wood, concrete, metal.)
SubClass
 The sub-class of the asset.
ThermalExpansionCoefficient
 The thermal expansion coefficient of the asset.
WoodBendingStrength
 The bending strength of the asset.
WoodGrade
 The grade of wood used in a wood-based asset.
WoodParallelCompressionStrength
 The parallel compression strength of the asset.
WoodParallelShearStrength
 The parallel shear strength of the asset.
WoodPerpendicularCompressionStrength
 The perpendicular compression strength of the asset.
WoodPerpendicularShearStrength
 The perpendicular shear strength of the asset.
WoodSpecies
 The species of wood used in a wood-based asset.
YoungModulus
 The Young's modulus of the asset.
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace