Revit 2024 API
Revolution Members
The Revolution type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Axis
Returns the Axis of the Revolution.
EndAngle
The end angle of the revolution relative to the sketch plane.
Sketch
Returns the Sketch of the Revolution.
StartAngle
The start angle of the revolution relative to the sketch plane.
See Also
Revolution Class
Autodesk.Revit.DB Namespace