Revit 2024 API
InitialLuminousIntensity Members
The InitialLuminousIntensity type exposes the following members.
Constructors
Name | Description
InitialLuminousIntensity(Double)
 Creates an initial luminous intensity object with the given document and luminosity values.
InitialLuminousIntensity(InitialLuminousIntensity)
 Creates a copy of the given initial luminous intensity object
Methods
Name | Description
Properties
Name | Description
Luminosity
 The luminosity value.
See Also
InitialLuminousIntensity Class
Autodesk.Revit.DB.Lighting Namespace