Revit 2024 API
RevisionNumberingSequence Members
The RevisionNumberingSequence type exposes the following members.
Methods
Name | Description
CreateAlphanumericSequence
 Creates a new alphanumeric revision numbering sequence in the document.
CreateNumericSequence
 Creates a new numeric revision numbering sequence in the document.
GetAllRevisionNumberingSequences
 Gets all of the revision numbering sequences from the document.
GetAlphanumericRevisionSettings
 Returns a copy of the AlphanumericRevisionSettings owned by this revision numbering sequence.
GetNumericRevisionSettings
 Returns a copy of the NumericRevisionSettings owned by this revision numbering sequence.
HasValidAlphanumericRevisionSettings
 Checks whether the revision numbering sequence owns a valid alphanumeric revision settings.
HasValidNumericRevisionSettings
 Checks whether the revision numbering sequence owns a valid numeric revision settings.
HasValidRevisionSettingsForNumberType
 Checks whether the revision numbering sequence owns a valid revision settings for number type.
SetAlphanumericRevisionSettings
 Replaces the current alphanumeric revision numbering settings with the provided settings.
SetNumericRevisionSettings
 Replaces the current numeric revision numbering settings with the provided settings.
Properties
Name | Description
NumberType
 Indicates the revision number type of the revision numbering sequence.
SequenceName
 The name of this revision numbering sequence.
See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace