Revit 2024 API
GeomCombinationSetIterator Members
The GeomCombinationSetIterator type exposes the following members.
Constructors
Name | Description
GeomCombinationSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
GeomCombinationSetIterator Class
Autodesk.Revit.DB Namespace