Revit 2024 API
MeshTriangle Members
The MeshTriangle type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Index
The index of the vertex in the Vertices array of the mesh, for indexed access.
Vertex
A vertex of the triangle.
See Also
MeshTriangle Class
Autodesk.Revit.DB Namespace