Revit 2024 API
HostObjectSubcomponentInfo Members
The HostObjectSubcomponentInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the HostObjectSubcomponentInfo
GetCurveLoop
 Gets the CurveLoop representing the base profile curve loop of the roof or floor slab
GetPlane
 Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.
Properties
Name | Description
AreaOfCurveLoop
 The area of the CurveLoop of the roof or floor slab.
Depth
 The depth of the roof or floor slab.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LoopFace
 The face of the loops of the roof or floor slab.
See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace