Revit 2024 API
WallSweep Members
The WallSweep type exposes the following members.
Methods
Name | Description
Create
 Creates a new wall sweep or reveal.
GetHostIds
 Gets a list of all host walls on which the sweep resides.
GetWallSweepInfo
 Gets the information of the wall sweep or reveal.
WallAllowsWallSweep
 Validates that the wall is of a type that may be a host for a wall sweep or reveal.
Properties
Name | Description
See Also
WallSweep Class
Autodesk.Revit.DB Namespace