Revit 2024 API
FabricArea Members
The FabricArea type exposes the following members.
Methods
Name | Description
CopyCurveLoopsInSketch
 Creates copies of the CurveLoops in the FabricArea sketch.
Create(Document, Element, XYZ, ElementId, ElementId)
 Creates a FabricArea based on a host boundary.
Create(Document, Element, IList<CurveLoop>, XYZ, XYZ, ElementId, ElementId)
 Creates a FabricArea from an array of curves.
GetBoundaryCurveIds
 Retrieves the identifiers of the set of curves forming the boundary of the Fabric Area.
GetFabricSheetElementIds
 Retrieves the identifiers of all the FabricSheet Elements in the FabricArea.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetTotalSheetMass
 Calculates the total sheet mass: Volume of Wire * Unit Weight.
GetValidViewsForTags
 Gets ids of the views where tags and symbols can be placed for the FabricArea and/or FabricSheets
IsCoverOffsetValid
 Identifies if the specified value is valid for use as a cover offset.
IsValidMajorLapSplice
 Identifies if the specified value is valid for use as a major lap splice.
IsValidMinorLapSplice
 Identifies if the specified value is valid for use as a minor lap splice.
RemoveFabricReinforcementSystem
 Deletes the specified FabricArea, and converts its FabricSheet elements to equivalent Single Fabric Sheet elements.
Properties
Name | Description
CoverOffset
 The additional cover offset of the fabric distribution.
Direction
 The Major Direction of the Fabric Area.
DirectionOrigin
 The Origin Point of the Major Direction of the Fabric Area.
FabricAreaType
 The type of the Fabric Area.
FabricLocation
 The Fabric location in the host.
FabricSheetTypeId
 The id of the Fabric Sheet Type for this element.
HostId
 The id of the Host element for the fabric area.
LapSplicePosition
 The fabric lap splice position in the fabric distribution.
MajorLapSpliceLength
 The fabric lap splice length in the fabric distribution in the major direction.
MajorSheetAlignment
 The fabric sheet alignment in the fabric distribution in the major direction.
MinorLapSpliceLength
 The fabric lap splice length in the fabric distribution in the minor direction.
MinorSheetAlignment
 The fabric sheet alignment in the fabric distribution in the minor direction.
SketchId
 The id of the Sketch element for this element.
TagViewId
 The element of the view in which to tag new members of this element.
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace