Revit 2024 API
GroundConductorSizeSet Members
The GroundConductorSizeSet type exposes the following members.
Constructors
Name | Description
GroundConductorSizeSet
Initializes a new instance of the GroundConductorSizeSet class
Methods
Name | Description
Clear
Removes every GroundConductorSize from the set, rendering it empty.
Contains
Tests for the existence of a GroundConductorSize within the set.
Erase
Removes a specified GroundConductorSize from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified GroundConductorSize into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of GroundConductorSizes that are in the set.
See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace