Revit 2024 API
RoutingCriterionBase Members
The RoutingCriterionBase type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RoutingCriterionBase
IsEqual
 Verify if two criteria are the same.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace