Revit 2024 API
Room Members
The Room type exposes the following members.
Methods
Name | Description
IsPointInRoom
Determines if a point lies within the volume of the room.
Unplace
 Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.
Properties
Name | Description
BaseOffset
Get or Set the Base Offset of the Room.
ClosedShell
Return the closedShell of the Room.
LimitOffset
Get or Set the Limit Offset of the Room.
UnboundedHeight
Get the Unbounded Height of the Room.
UpperLimit
Get or Set the Upper Limit of the Room.
Volume
Get the Volume of the Room.
See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace