Revit 2024 API
AreaFilter Members
The AreaFilter type exposes the following members.
Constructors
Name | Description
AreaFilter
 Constructs a filter which matches only areas.
Methods
Name | Description
Properties
Name | Description
See Also
AreaFilter Class
Autodesk.Revit.DB Namespace