Revit 2024 API
PathReinforcementType Members
The PathReinforcementType type exposes the following members.
Methods
Name | Description
CreateDefaultPathReinforcementType
 Creates a new PathReinforcementType object with a default name.
Properties
Name | Description
See Also
PathReinforcementType Class
Autodesk.Revit.DB.Structure Namespace