Revit 2024 API
LinePatternSegment Members
The LinePatternSegment type exposes the following members.
Constructors
Name | Description
LinePatternSegment()
 Creates a line pattern segment.
LinePatternSegment(LinePatternSegmentType, Double)
 Creates a line pattern segment with given type and length.
Methods
Name | Description
Dispose
Releases all resources used by the LinePatternSegment
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Length
 Gets and sets the length of the segment.
Type
 Gets and sets the type of the segment.
See Also
LinePatternSegment Class
Autodesk.Revit.DB Namespace