Revit 2024 API
AssemblyDifferenceNamingCategory Members
The AssemblyDifferenceNamingCategory type exposes the following members.
Methods
Name | Description
Properties
Name | Description
NamingCategoryId1
 Naming category id of the first assembly
NamingCategoryId2
 Naming category id of the second assembly
See Also
AssemblyDifferenceNamingCategory Class
Autodesk.Revit.DB Namespace