Revit 2024 API
ScheduleFieldId Members
The ScheduleFieldId type exposes the following members.
Constructors
Name | Description
ScheduleFieldId
Initializes a new instance of the ScheduleFieldId class
Methods
Name | Description
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets the integer value of the id as hash code
 (Overrides Object.GetHashCode().)
ToString
 Gets a String representation of the integer value of the id.
 (Overrides Object.ToString().)
Operators
Name | Description
Equality
Determines whether two ScheduleFieldIds are the same.
Inequality
Determines whether two ScheduleFieldId are different.
Properties
Name | Description
IntegerValue
 Provides the value of the ScheduleFieldId as an integer.
InvalidScheduleFieldId
 Get the invalid ScheduleFieldId whose IntegerValue is -1.
See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace