Revit 2024 API
IFCOpeningData Members
The IFCOpeningData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCOpeningData
GetExtrusionData
 Gets extrusion data.
GetOpeningSolids
 Gets opening solids.
Properties
Name | Description
IsRecess
 Trus if it is a recess, false if it is an opening.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OpeningElementId
 The opening element id.
See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace