Revit 2024 API
Instance Members
The Instance type exposes the following members.
Methods
Name | Description
GetTotalTransform
 Gets the total transform, which includes the true north transform for instances like import instances.
GetTransform
 Gets the transform of the instance.
Properties
Name | Description
See Also
Instance Class
Autodesk.Revit.DB Namespace