Revit 2024 API
AnalyticalPowerSourceData Members
The AnalyticalPowerSourceData type exposes the following members.
Methods
Name | Description
Properties
Name | Description
TotalConnectedCurrent
 The total connected current of the analytical power source.
Voltage
 The voltage value of the analytical power source.
See Also
AnalyticalPowerSourceData Class
Autodesk.Revit.DB.Electrical Namespace