Revit 2024 API
TriangleInShellComponent Members
The TriangleInShellComponent type exposes the following members.
Constructors
Name | Description
TriangleInShellComponent
 Creates a copy of the given TriangleInShellComponent
Methods
Name | Description
Dispose
Releases all resources used by the TriangleInShellComponent
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
VertexIndex0
 Index of the triangle's first vertex in the TriangulatedShellComponent's array of vertices.
VertexIndex1
 Index of the triangle's second vertex in the TriangulatedShellComponent's array of vertices.
VertexIndex2
 Index of the triangle's third vertex in the TriangulatedShellComponent's array of vertices.
See Also
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace