Revit 2024 API
IIFCEntityTreeUIServer Members
The IIFCEntityTreeUIServer type exposes the following members.
Methods
Name | Description
ShowDialog
 Shows dialog on managing IFCEntityTreeUI.
See Also
IIFCEntityTreeUIServer Interface
Autodesk.Revit.UI Namespace