Revit 2024 API
ViewActivatedEventArgs Members
The ViewActivatedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CurrentActiveView
 The view that has just become active.
PreviousActiveView
 The previously active view.
See Also
ViewActivatedEventArgs Class
Autodesk.Revit.UI.Events Namespace