Revit 2024 API
PointOnPlane Members
The PointOnPlane type exposes the following members.
Methods
Name | Description
GetPlaneReference
The geometric plane reference.
IsValidPlaneReference
Check whether a geometry reference corresponds to a referenceable plane.
NewPointOnPlane
Construct a PointOnPlane given a reference and a location in space.
SetPlaneReference
Change the geometric plane reference.
Properties
Name | Description
Offset
Signed offset from the plane.
Position
The coordinates of the point (or its projection) on the plane.
XVec
The X-coordinate vector of the point, in the plane's coordinate system.
See Also
PointOnPlane Class
Autodesk.Revit.DB Namespace