Revit 2024 API
MaterialNode Members
The MaterialNode type exposes the following members.
Methods
Name | Description
GetAppearance
 Appearance properties associated with the material.
GetAppearanceOverride
 Returns appearance properties that override the preset appearance of the material.
Properties
Name | Description
Color
 The color the material is being rendered at
Glossiness
 The level of glossiness of the material
HasOverriddenAppearance
 Identifies if the default rendering appearance the material has is being overridden.
MaterialId
 The Id of the element assocated with this material in the model.
Smoothness
 The level of smoothness of the material.
ThumbnailFile
 The path if a file that contains a thumbnail image of the material.
Transparency
 The value of transparency the material is being rendered with
See Also
MaterialNode Class
Autodesk.Revit.DB Namespace