Revit 2024 API
ConnectionInputPoint Methods
The ConnectionInputPoint type exposes the following members.
Methods
Name | Description
Dispose
See Also
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace