Revit 2024 API
ComboBoxCurrentChangedEventArgs Members
The ComboBoxCurrentChangedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
NewValue
The current item for the ComboBox after the change.
OldValue
The current item for the ComboBox before the change.
See Also
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace