Revit 2024 API
ExportLayerTable Members
The ExportLayerTable type exposes the following members.
Constructors
Name | Description
ExportLayerTable
 Constructs a new ExportLayerTable with default values.
Methods
Name | Description
Add
 Inserts a (key,info) pair into Export layer table.
Clear
 Removes all contents stored in the table.
ContainsKey
 Checks whether a layer key exists in the table.
Dispose
Releases all resources used by the ExportLayerTable
GetAvaliableLayerModifierTypes
 Gets all the avaliable layer modifier types for the layer key.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetExportLayerInfo
 Gets a copy of the layer info associated to the input pattern key.
GetKeys
 Gets all the keys stored in the map.
GetLayerTableIterator
Returns a LayerTableIterator that iterates through the collection.
GetValues
 Returns all the values stored in the map.
Remove
 Removes the pair (key, info) by pattern key.
Properties
Name | Description
Count
 Count of the items contained in the collection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Item
 A copy of the ExportLayerInfo item that corresponds to the layer's ExportLayerKey.
See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace