Revit 2024 API
WorksharingDisplayGraphicSettings Methods
The WorksharingDisplayGraphicSettings type exposes the following members.
Methods
Name | Description
Dispose
See Also
WorksharingDisplayGraphicSettings Class
Autodesk.Revit.DB Namespace