Revit 2024 API
StructuralSectionUserDefined Members
The StructuralSectionUserDefined type exposes the following members.
Constructors
Name | Description
StructuralSectionUserDefined
 Creates a new instance of Structural Section User Defined shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionUserDefined Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace