Revit 2024 API
VertexPositionNormal Members
The VertexPositionNormal type exposes the following members.
Constructors
Name | Description
VertexPositionNormal
 Constructs the vertex from a point and a normal vector.
Methods
Name | Description
GetSizeInFloats
 Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Properties
Name | Description
Normal
 The vertex's normal vector.
Position
 The vertex's position.
See Also
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace