Revit 2024 API
TransactionAttribute Properties
The TransactionAttribute type exposes the following members.
Properties
Name | Description
Mode
Transaction mode.
See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace