Revit 2024 API
HostObjAttributes Members
The HostObjAttributes type exposes the following members.
Methods
Name | Description
GetCompoundStructure
Returns an object that represents the compound structure of the element.
SetCompoundStructure
Sets the compound structure of the element.
Properties
Name | Description
See Also
HostObjAttributes Class
Autodesk.Revit.DB Namespace