Revit 2024 API
FilterStringBeginsWith Members
The FilterStringBeginsWith type exposes the following members.
Constructors
Name | Description
FilterStringBeginsWith
 Constructs an instance of FilterStringBeginsWith.
Methods
Name | Description
Properties
Name | Description
See Also
FilterStringBeginsWith Class
Autodesk.Revit.DB Namespace