Revit 2024 API
CorrectionFactor Members
The CorrectionFactor type exposes the following members.
Methods
Name | Description
GetTemperature
 Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature.
Properties
Name | Description
Factor
 Get factor value of wire correction factor.
See Also
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace