Revit 2024 API
Arc Members
The Arc type exposes the following members.
Methods
Name | Description
Create(XYZ, XYZ, XYZ)
 Creates a new geometric arc object based on three points.
Create(Plane, Double, Double, Double)
 Creates a new geometric arc object based on plane, radius, and angles.
Create(XYZ, Double, Double, Double, XYZ, XYZ)
 Creates a new geometric arc object based on center, radius, unit vectors, and angles.
Properties
Name | Description
Center
Returns the center of the arc.
Normal
Returns the normal to the plane in which the arc is defined.
Radius
Returns the radius of the arc.
XDirection
Returns the X direction.
YDirection
Returns the Y direction.
See Also
Arc Class
Autodesk.Revit.DB Namespace