Revit 2024 API
OrdinateDimensionSetting Methods
The OrdinateDimensionSetting type exposes the following members.
Methods
Name | Description
Dispose
See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace