Revit 2024 API
AnalyticalToPhysicalAssociationManager Members
The AnalyticalToPhysicalAssociationManager type exposes the following members.
Methods
Name | Description
AddAssociation(ElementId, ElementId)
 Adds a new association between an analytical element and a physical element.
AddAssociation(ISet<ElementId>, ISet<ElementId>)
 Adds a new association between a group of analytical elements and a group of physical elements.
GetAnalyticalToPhysicalAssociationManager
 Returns the AnalyticalToPhysicalAssociationManager for this document.
GetAssociatedElementId
 Returns id of the element which is in association with the element with the given ElementId.
GetAssociatedElementIds
 Returns ids of the elements which are in association with the element with the given ElementId.
HasAssociation
 Verifies if the element has already defined an association.
IsAnalyticalElement
 Returns true if the element is an analytical element.
IsPhysicalElement
 Returns true if the element is a physical element.
RemoveAssociation
 This method will remove the association for the element with the given ElementId.
Properties
Name | Description
EnableAssistedAssociation
 Indicates if associations between Analytical and Physical Elements should be created automatically.
See Also
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace