Revit 2024 API
TextEditorOptions Members
The TextEditorOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TextEditorOptions
GetTextEditorOptions
 Returns the current Revit instance's TextEditorOptions.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowBorder
 Show the border box around the text during editing.
ShowOpaqueBackground
 Show opaque background behind the text during editing.
See Also
TextEditorOptions Class
Autodesk.Revit.UI Namespace