Revit 2024 API
IFCAnyHandle Members
The IFCAnyHandle type exposes the following members.
Methods
Name | Description
CreateAggregateAttribute
 Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef
Delete
 Deletes the handle.
Dispose
Releases all resources used by the IFCAnyHandle
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetAttribute
 Gets the attribute by name.
GetHashCode
 Gets the integer value of the id as hash code
 (Overrides Object.GetHashCode().)
IsSubTypeOf
 Determines whether the instance is an instance of the specified instance type or a subtype of this instance type.
IsTypeOf
 Determines whether the instance is an instance of exactly the specified instance type.
SetAttribute(String, IFCAnyHandle)
 Sets the attribute value.
SetAttribute(String, IFCData)
 Sets the attribute value.
SetAttribute(String, Boolean)
 Sets the attribute value.
SetAttribute(String, IList<IFCAnyHandle>)
SetAttribute(String, IList<Boolean>)
SetAttribute(String, IList<Double>)
SetAttribute(String, IList<Int32>)
SetAttribute(String, IList<String>)
SetAttribute(String, ISet<IFCAnyHandle>)
SetAttribute(String, ISet<Boolean>)
SetAttribute(String, ISet<Double>)
SetAttribute(String, ISet<Int32>)
SetAttribute(String, ISet<String>)
SetAttribute(String, Double)
 Sets the attribute value.
SetAttribute(String, Int32)
 Sets the attribute value.
SetAttribute(String, String)
 Sets the attribute value.
UnsetAttribute
 Unsets the attribute value.
Operators
Name | Description
Equality
Determines whether two IFCAnyHandles are the same.
Inequality
Determines whether two IFCAnyHandles are different.
Properties
Name | Description
HasValue
 Identifies if the handle is empty or contains a value.
Id
 The integer identifier for the handle.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StepId
 The step id of the handle. Valid only for import.
TypeName
 The name of the type of the handle.
See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace