Revit 2024 API
FilterStringEndsWith Members
The FilterStringEndsWith type exposes the following members.
Constructors
Name | Description
FilterStringEndsWith
 Constructs an instance of FilterStringEndsWith.
Methods
Name | Description
Properties
Name | Description
See Also
FilterStringEndsWith Class
Autodesk.Revit.DB Namespace