Revit 2024 API
UIMacroManager Methods
The UIMacroManager type exposes the following members.
Methods
Name | Description
AddModule
 Adds a MacroModule to the application or document.
Dispose
EditMacro
 Edits the macro in sharp develop.
EditModule
 Edits the macro in sharp develop.
GetMacroManager(UIApplication)
 Gets the UI Macro manager from the UI application.
GetMacroManager(UIDocument)
 Gets the UI Macro manager from the UI document.
GetUIDocumentMacroSecurityOptions
 Gets the UI document macro security options.
RemoveModule
 Removes a MacroModule from the application or document.
SetUIDocumentMacroSecurityOptions
 Sets the UI document macro security options.
StepInto
 Step into the macro in sharp develop.
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace