Revit 2024 API
IFCFamilyInstanceExtrusionExportResults Members
The IFCFamilyInstanceExtrusionExportResults type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCFamilyInstanceExtrusionExportResults
GetCutPairOpenings
 Gets the set of "openings" determined from the analysis of the instance geometry.
GetExtrusionHandle
 Gets the extruded solid handle generated for the family instance.
Properties
Name | Description
ExtraOffset
 The extra offset determined from the geometry of the family instance.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 The best material id determined for the family instance.
See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace