Revit 2024 API
DefaultOpenFromCloudCallback Members
The DefaultOpenFromCloudCallback type exposes the following members.
Constructors
Name | Description
DefaultOpenFromCloudCallback
 Create a default open callback. Open latest by default for all scenarios.
Methods
Name | Description
Dispose
Releases all resources used by the DefaultOpenFromCloudCallback
OnOpenConflict
 A method called when the conflict is happen during the model opening.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace