Revit 2024 API
DocumentSynchronizingWithCentralEventArgs Members
The DocumentSynchronizingWithCentralEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Comments
 User's comments for synchronization.
Location
 Full path of the central model which is to be synchronized.
Options
 User's options associated with the synchronization operation.
See Also
DocumentSynchronizingWithCentralEventArgs Class
Autodesk.Revit.DB.Events Namespace