Revit 2024 API
StairsPathType Members
The StairsPathType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ArrowheadTypeId
 The arrow head type of the stairs path.
DistanceToCutMark
 The distance from the stairs path arrow to cut mark.
DrawForEachRun
 True if stairs paths should be drawn for each run, false if it should be drawn for the whole stairs.
EndAtRiser
 Represents whether the stairs path ends at the riser.
FullStepArrow
 True if the arrow fills the full step width, false if it fills by the specified arrow size.
LineShapeAtCorner
 The line shape of stairs path at the corner.
ShowArrowheadToCutMark
 True if the stairs path arrowhead should be shown to the cutmark, false if the arrow head is not shown.
StairsPathDirection
 The style of the stairs path.
StartExtension
 The start extension length of the stairs path.
StartFromRiser
 True if the stairs path starts from the riser, false if it starts from the tread.
StartSymbolTypeId
 The start symbol type of stairs path.
See Also
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace