Revit 2024 API
Group Members
The Group type exposes the following members.
Methods
Name | Description
GetAvailableAttachedDetailGroupTypeIds
 Returns the attached detail groups available for this group type.
GetMemberIds
Retrieves all the member ElementIds of the group.
GetShownAttachedDetailGroupTypeIds
 Returns the attached detail groups which have displayed instances for this group type in the input view.
HideAllAttachedDetailGroups
 Hides all the available attached detail groups for this element group type that are compatible with the input view type.
HideAttachedDetailGroups
 Hides the element group's attached detail groups of the input group type that are compatible with the input view.
IsCompatibleAttachedDetailGroupType
 Checks if the orientation of the input attached detail group matches the input view's orientation.
ShowAllAttachedDetailGroups
 Shows all the available attached detail groups for this element group type that are compatible with the input view type.
ShowAttachedDetailGroups
 Shows the element group's attached detail groups of the input group type that are compatible with the input view.
UngroupMembers
Ungroups the group.
Properties
Name | Description
AttachedParentId
 Indicates the Id of the parent group this group is attached to.
GroupType
Get or set the type of the group.
IsAttached
 Indicates wether or not this group is attached to a parent group.
Location
This property is used to find the physical location of a group within project.
 (Overrides Element.Location.)
See Also
Group Class
Autodesk.Revit.DB Namespace