Revit 2024 API
StructuralSectionZProfileWithLips Members
The StructuralSectionZProfileWithLips type exposes the following members.
Constructors
Name | Description
StructuralSectionZProfileWithLips
 Creates a new instance of Structural Section Z Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionZProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace