Revit 2024 API
InvalidPathArgumentException Members
The InvalidPathArgumentException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
InvalidPathArgumentException Class
Autodesk.Revit.Exceptions Namespace