Revit 2024 API
ReleaseConditions Methods
The ReleaseConditions type exposes the following members.
Methods
Name | Description
Dispose
See Also
ReleaseConditions Class
Autodesk.Revit.DB.Structure Namespace