Revit 2024 API
Ellipse Members
The Ellipse type exposes the following members.
Methods
Name | Description
CreateCurve
 Creates a new geometric ellipse or elliptical arc object.
Properties
Name | Description
Center
Returns the center of the ellipse.
Normal
Returns the normal to the plane in which the ellipse is defined.
RadiusX
Returns the X vector radius of the ellipse.
RadiusY
Returns the Y vector radius of the ellipse.
XDirection
The X direction.
YDirection
The Y direction.
See Also
Ellipse Class
Autodesk.Revit.DB Namespace