Revit 2024 API
InitialIntensity Members
The InitialIntensity type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the InitialIntensity derived object.
Dispose
Releases all resources used by the InitialIntensity
Properties
Name | Description
InitialIntensityValue
 The calculated initial intensity value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
InitialIntensity Class
Autodesk.Revit.DB.Lighting Namespace