Revit 2024 API
LineLoad Members
The LineLoad type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, ElementId, Curve, XYZ, XYZ, LineLoadType)
 Creates a new custom line load within the project.
Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
GetCurve
 Returns curve that define geometry of the line load.
IsCurveInsideHostBoundaries
 Indicates if the curve is inside panel's boundaries or on panel's edges or if the curve is on the member's curve.
IsValidHostId
 Indicates if the provided host id can host line loads The document containing both the host and the load The id of the analytical element that is about to host a line load True if a line load can be placed on the input host id
SetCurve
 Sets the curve for the line load.
SetPoints
 Sets start and end point of the line load.
Properties
Name | Description
EndPoint
 Returns the three dimensional location of the end point for the line load.
ForceVector1
 The force vector applied to the start point of the line load, oriented according to OrientTo setting.
ForceVector2
 The force vector applied to the end point of the line load, oriented according to OrientTo setting.
IsProjected
 Indicates if the load is projected.
IsUniform
 Indicates if the load is uniform.
MomentVector1
 The moment vector applied to the start point of the line load, oriented according to OrientTo setting.
MomentVector2
 The moment vector applied to the end point of the line load, oriented according to OrientTo setting.
StartPoint
 Returns the three dimensional location of the start point for the line load.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace