Revit 2024 API
LoadComponent Members
The LoadComponent type exposes the following members.
Constructors
Name | Description
LoadComponent
 Constructs a new instance of a LoadComponent. The load case or combination id. The load case or combination factor.
Methods
Name | Description
Dispose
Releases all resources used by the LoadComponent
Properties
Name | Description
Factor
 Load component factor.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LoadCaseOrCombinationId
 Load case or combination id.
See Also
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace