Revit 2024 API
FluidTemperatureSetIterator Members
The FluidTemperatureSetIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FluidTemperatureSetIterator
GetCurrent
 Returns the current FluidTemperature.
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the iterator to the next item.
Reset
 Resets the iterator to the initial state.
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace