Revit 2024 API
ElementSet Members
The ElementSet type exposes the following members.
Constructors
Name | Description
ElementSet
Initializes a new instance of the ElementSet class
Methods
Name | Description
Clear
Removes every item element the set, rendering it empty.
Contains
Tests for the existence of an element within the set.
Erase
Removes a specified element from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified element into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of elements that are in the set.
See Also
ElementSet Class
Autodesk.Revit.DB Namespace