Revit 2024 API
AccessDeniedException Members
The AccessDeniedException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
AccessDeniedException Class
Autodesk.Revit.Exceptions Namespace