Revit 2024 API
DeleteElements Members
The DeleteElements type exposes the following members.
Methods
Name | Description
Create(Document, ElementId)
 Creates an instance of the DeleteElements resolution.
Create(Document, IList<ElementId>)
 Creates an instance of the DeleteElements resolution.
Create(Document, ISet<ElementId>)
 Creates an instance of the DeleteElements resolution.
Properties
Name | Description
See Also
DeleteElements Class
Autodesk.Revit.DB Namespace