Revit 2024 API
SpatialElementGeometryCalculator Members
The SpatialElementGeometryCalculator type exposes the following members.
Constructors
Name | Description
SpatialElementGeometryCalculator(Document)
 Constructs a new calculator with default options for the geometry of spatial elements.
SpatialElementGeometryCalculator(Document, SpatialElementBoundaryOptions)
 Constructs a new calculator for the geometry of spatial elements.
Methods
Name | Description
CalculateSpatialElementGeometry
 Compute the spatial element geometry and returns the boundary face information.
CanCalculateGeometry
 This indicates whether the input spatial element is a valid one.
Dispose
Releases all resources used by the SpatialElementGeometryCalculator
GetOptions
 The options that control the calculation.
IsRoomOrSpace
 This indicates whether the input spatial element is a room or a space.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace