Revit 2024 API
IFCFileReadOptions Methods
The IFCFileReadOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace