Revit 2024 API
StructuralSectionStructuralTees Members
The StructuralSectionStructuralTees type exposes the following members.
Constructors
Name | Description
StructuralSectionStructuralTees
 Creates a new instance of Structural Section Tees shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing in the flange, in. (mm)
BoltSpacingWeb
 Standard bolt spacing in the web, in. (mm)
See Also
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace