Revit 2024 API
GraphicsStyle Members
The GraphicsStyle type exposes the following members.
Methods
Name | Description
Properties
Name | Description
GraphicsStyleCategory
The graphics style category.
GraphicsStyleType
The graphics style type.
See Also
GraphicsStyle Class
Autodesk.Revit.DB Namespace