Revit 2024 API
StructuralSectionGeneralW Members
The StructuralSectionGeneralW type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralW
 Creates a new instance of Angle shape.
Methods
Name | Description
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
TopWebFillet
 Top Web Fillet - fillet radius at the top of web.
See Also
StructuralSectionGeneralW Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace