Revit 2024 API
StructuralSectionGeneralI Members
The StructuralSectionGeneralI type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralI
 Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
GetFlangeThicknessInFlangeCenter
 Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInQuarterWidth
 Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm.
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet
 Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle
 Sloped flange angle. (rad)
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
See Also
StructuralSectionGeneralI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace