Revit 2024 API
FabricAreaType Members
The FabricAreaType type exposes the following members.
Methods
Name | Description
CreateDefaultFabricAreaType
 Creates a new FabricAreaType object with a default name.
Properties
Name | Description
See Also
FabricAreaType Class
Autodesk.Revit.DB.Structure Namespace