Revit 2024 API
FabricSheetType Members
The FabricSheetType type exposes the following members.
Methods
Name | Description
CreateDefaultFabricSheetType
 Creates a new FabricSheetType object with a default name.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetWireItem
 Gets the Wire stored in the FabricSheetType at the associated index.
IsCustom
 Verifies if the type is Custom Fabric Sheet
IsValidMajorLapSplice
 Identifies if the input value is valid to be applied as the major lap splice value for this FabricSheetType.
IsValidMinorLapSplice
 Identifies if the input value is valid to be applied as the minor lap splice value for this FabricSheetType.
SetLayoutAsCustomPattern
 Sets the minor and major layout patterns as Custom, while specifying the needed parameters for this pattern.
SetMajorLayoutAsActualSpacing
 Sets the major layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.
SetMajorLayoutAsFixedNumber
 Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern.
SetMajorLayoutAsMaximumSpacing
 Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern.
SetMajorLayoutAsNumberWithSpacing
 Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern.
SetMinorLayoutAsActualSpacing
 Sets the minor layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.
SetMinorLayoutAsFixedNumber
 Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern.
SetMinorLayoutAsMaximumSpacing
 Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern.
SetMinorLayoutAsNumberWithSpacing
 Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern.
Properties
Name | Description
MajorDirectionWireType
 The id of the FabricWireType to be used in the major direction.
MajorEndOverhang
 The distance from the edge of the sheet to the last wire (measured in the major direction).
MajorLapSpliceLength
 The lap splice length in the major direction.
MajorLayoutPattern
 The layout pattern in the major direction.
MajorNumberOfWires
 The number of wires used in the major direction (includes the first and last wires).
MajorReinforcementArea
 The area of fabric divided by the spacing of the wire in the major direction. This method does not apply to custom fabric sheet
MajorSpacing
 The spacing between the wires in the major direction (not including the overhangs).
MajorStartOverhang
 The distance from the edge of the sheet to the first wire (measured in the major direction).
Material
 The id of the material assigned to wires.
MinorDirectionWireType
 The id of the FabricWireType to be used in the minor direction.
MinorEndOverhang
 The distance from the edge of the sheet to the last wire (measured in the minor direction).
MinorLapSpliceLength
 The lap splice length in the minor direction.
MinorLayoutPattern
 The layout pattern in the minor direction.
MinorNumberOfWires
 The number of wires used in the minor direction (includes the 1st and last wires).
MinorReinforcementArea
 The area of fabric divided by the spacing of the wire in the minor direction. This method does not apply to custom fabric sheet
MinorSpacing
 The spacing between the wires in the minor direction (not including the overhangs).
MinorStartOverhang
 The distance from the edge of the sheet to the first wire (measured in the minor direction).
OverallLength
 The length of the wire sheet (including overhangs) in the major direction.
OverallWidth
 The length of the wire sheet (including overhangs) in the minor direction.
SheetMass
 The sheet mass.
SheetMassUnit
 The sheet mass per area unit.
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace