Revit 2024 API
AXMImportOptions Members
The AXMImportOptions type exposes the following members.
Constructors
Name | Description
AXMImportOptions()
 Constructs a new instance of AXMImportOptions with default values of all properties.
AXMImportOptions(AXMImportOptions)
 Constructs a new instance of AXMImportOptions as a copy of the provided import options.
Methods
Name | Description
Properties
Name | Description
ImportLevels
 Indicate if levels are to be imported. False by default.
See Also
AXMImportOptions Class
Autodesk.Revit.DB Namespace