Revit 2024 API
TextRange Members
The TextRange type exposes the following members.
Constructors
Name | Description
TextRange()
 Constructs a TextRange with default values for start and length.
TextRange(TextRange)
 Constructs a copy of the input TextRange object.
TextRange(Int32, Int32)
 Constructs a TextRange with input start and length.
Methods
Name | Description
Dispose
Releases all resources used by the TextRange
Properties
Name | Description
End
 The index of the first character after the end of the range
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Length
 The length of the range.
Start
 The start index of a range within the FormattedText.
See Also
TextRange Class
Autodesk.Revit.DB Namespace