Revit 2024 API
Frame Members
The Frame type exposes the following members.
Constructors
Name | Description
Frame()
 Default constructor. Uses global origin and standard basis vectors.
Frame(XYZ, XYZ, XYZ, XYZ)
 Constructor that takes the frame's base point and three basis vectors.
Methods
Name | Description
CanDefineRevitGeometry
 Tests whether the supplied Frame object may be used to define a Revit curve or surface. In order to satisfy the requirements the Frame must be orthonormal and its origin is expected to lie within the Revit design limits IsWithinLengthLimits(XYZ).
Dispose
Releases all resources used by the Frame
IsOrthogonal
 Determines if this frame's basis vectors are orthogonal.
IsOrthonormal
 Determines if this frame's basis vectors are orthonormal.
IsRightHanded
 Determine if this frame's basis is right-handed.
Transform
 Applies the input transform to this frame.
Properties
Name | Description
BasisX
 The first basis vector of the frame.
BasisY
 The second basis vector of the frame.
BasisZ
 The third basis vector of the frame.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Origin
 The frame's base point.
See Also
Frame Class
Autodesk.Revit.DB Namespace