Revit 2024 API
RebarShapeVertex Members
The RebarShapeVertex type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarShapeVertex
GetConstraints
 Retrieve the list of constraints associated with this vertex.
SetConstraints
 Assign a new list of constraints to this vertex.
Properties
Name | Description
BendAngle
 The range of permissible angles at this bend.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Turn
 The sense of the turn. The Turn property must be set to Left or Right on each internal vertex before the RebarShapeDefinitionBySegments is used. Default is permissible for the first and last vertex, since they do not correspond to bends.
See Also
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace