Revit 2024 API
VertexPositionColored Members
The VertexPositionColored type exposes the following members.
Constructors
Name | Description
VertexPositionColored
 Constructs the vertex from a point and a color.
Methods
Name | Description
GetColor
 Gets the vertex's color.
GetSizeInFloats
 Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
SetColor
 Sets the vertex's color.
Properties
Name | Description
Position
 The vertex's position.
See Also
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace