Revit 2024 API
SpaceSetIterator Members
The SpaceSetIterator type exposes the following members.
Constructors
Name | Description
SpaceSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
SpaceSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace