Revit 2024 API
IndexStreamTriangle Members
The IndexStreamTriangle type exposes the following members.
Methods
Name | Description
AddTriangle
 Inserts a IndexTriangle into the stream and associated buffer.
AddTriangles
 Inserts multiple IndexTriangle instances into the stream and associated buffer.
Properties
Name | Description
See Also
IndexStreamTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace