Revit 2024 API
TransmissionData Members
The TransmissionData type exposes the following members.
Constructors
Name | Description
TransmissionData
 Constructs a TransmissionData from another TransmissionData
Methods
Name | Description
Dispose
Releases all resources used by the TransmissionData
DocumentIsNotTransmitted
 Determines whether the document at a given file location is not transmitted.
GetAllExternalFileReferenceIds
 Gets the ids of all ExternalFileReferences.
GetDesiredReferenceData
 Gets the ExternalFileReference representing path and load status information to be used the next time this TransmissionData's document is loaded.
GetLastSavedReferenceData
 Gets the ExternalFileReference representing path and load status information concerning the most recent time this TransmissionData's document was opened.
IsDocumentTransmitted
 Determines whether the document at a given file location is transmitted.
ReadTransmissionData
 Reads the TransmissionData associated with the file at the given location.
SetDesiredReferenceData
 Sets the ExternalFileReference information which Revit should use the next time it opens the document which this TransmissionData belongs to.
WriteTransmissionData
 Writes the given TransmissionData into the Revit file at the given location.
Properties
Name | Description
IsTransmitted
 Determines whether this file has been transmitted or not.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
UserData
 A string which users can store notes in.
Version
 The format version for TransmissionData
See Also
TransmissionData Class
Autodesk.Revit.DB Namespace