Revit 2024 API
OBJImportOptions Members
The OBJImportOptions type exposes the following members.
Constructors
Name | Description
OBJImportOptions()
 Constructs a new instance of OBJImportOptions with default values of all properties.
OBJImportOptions(OBJImportOptions)
 Constructs a new instance of OBJImportOptions as a copy of the import options.
Methods
Name | Description
Properties
Name | Description
See Also
OBJImportOptions Class
Autodesk.Revit.DB Namespace