Revit 2024 API
DocumentPrintingEventArgs Members
The DocumentPrintingEventArgs type exposes the following members.
Methods
Name | Description
GetSettings
 Gets the print settings of the active printing session.
GetViewElementIds
 Returns ElementIds of the views to be printed.
Properties
Name | Description
See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace