Revit 2024 API
Ceiling Members
The Ceiling type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
 Creates a new instance of ceiling within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Line, Double)
 Creates a new instance of ceiling within the project.
Properties
Name | Description
SketchId
 Returns id of the sketch.
See Also
Ceiling Class
Autodesk.Revit.DB Namespace