Revit 2024 API
FamilySymbol Members
The FamilySymbol type exposes the following members.
Methods
Name | Description
Activate
 Activates the symbol to ensure that its geometry is accessible.
CanHaveStructuralSection
 Identifies if this FamilySymbol can have a structural section.
GetFamilyPointLocations
Returns the Point Locations for the Family Symbol.
GetStructuralSection
 Gets the structural section from element.
GetThermalProperties
 Gets the thermal properties for the given FamilySymbol.
HasThermalProperties
 Identifies if this FamilySymbol can include thermal properties.
SetStructuralSection
 Sets the structural section in element.
SetThermalProperties
 Sets the thermal properties for the given FamilySymbol.
Properties
Name | Description
Family
 The Family object to which the symbol belongs.
IsActive
 Identifies whether the symbol is active.
StructuralMaterialType
This property returns the physical material from which the type is made.
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace