Revit 2024 API
HemisphericalLightDistribution Members
The HemisphericalLightDistribution type exposes the following members.
Constructors
Name | Description
HemisphericalLightDistribution()
 Creates a hemispherical light distribution object.
HemisphericalLightDistribution(HemisphericalLightDistribution)
 Creates a copy of the given hemispherical light distribution
Methods
Name | Description
Properties
Name | Description
See Also
HemisphericalLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace