Revit 2024 API
ProjectPosition Members
The ProjectPosition type exposes the following members.
Constructors
Name | Description
ProjectPosition(ProjectPosition)
 Creates a copy of the ProjectPosition.
ProjectPosition(Double, Double, Double, Double)
 Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation.
Methods
Name | Description
Dispose
Releases all resources used by the ProjectPosition
Properties
Name | Description
Angle
 Angle from True North.
EastWest
 East/West offset.
Elevation
 Elevation above ground level.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NorthSouth
 North/South offset
See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace