Revit 2024 API
StructuralSectionGeneralCEx Members
The StructuralSectionGeneralCEx type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralCEx
 Creates a new instance of general Channel Cold Formed shape.
Methods
Name | Description
Properties
Name | Description
FoldLength
 Fold segment length.
LipLength
 Lip segment length.
See Also
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace