Revit 2024 API
FillPattern Members
The FillPattern type exposes the following members.
Constructors
Name | Description
FillPattern()
 Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION_TO_VIEW and FillPatternTarget::FPTARGET_NONE.
FillPattern(FillPattern)
 Constructs a new copy of the input FillPattern object.
FillPattern(String, FillPatternTarget, FillPatternHostOrientation)
 Creates a fill pattern based on the given name, FillPatternTarget and FillPatternHostOrientation.
FillPattern(String, FillPatternTarget, FillPatternHostOrientation, Double, Double)
 Creates a simple hatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation.
FillPattern(String, FillPatternTarget, FillPatternHostOrientation, Double, Double, Double)
 Creates a simple crosshatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation.
Methods
Name | Description
Dispose
Releases all resources used by the FillPattern
ExpandDots
 Corrects pattern dots to make them be drawn properly for Revit.
GetFillGrid
 Gets the specified fill grid.
GetFillGrids
 Gets all fill grids in this fill pattern
IsEqual
 Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.
SetFillGrid
 Sets the fill grid.
SetFillGrids
 Set the fill grids in this fill pattern.
Properties
Name | Description
GridCount
 Gets the count of the fill grids in this fill pattern.
HostOrientation
 Orientation to host layer.
IsSolidFill
 Check if the fill pattern is a solid fill pattern.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LengthPerArea
 Gets length of all lines that placed on unit area.
LinesPerLength
 Gets the number of solid lines that placed in unit length.
Name
 The name of the fill pattern.
StrokesPerArea
 Gets the number of strokes that placed on unit area.
Target
 Target of this fill pattern applied to.
See Also
FillPattern Class
Autodesk.Revit.DB Namespace