Revit 2024 API
CableTrayType Members
The CableTrayType type exposes the following members.
Methods
Name | Description
IsValidBendMultiplier
 Identifies if the input bend multiplier is valid.
Properties
Name | Description
BendMultiplier
 Bend multiplier.
IsWithFitting
 Whether this cable tray type is with fitting
ShapeType
 Shape of this cable tray type.
See Also
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace