Revit 2024 API
CategoryNameMap Members
The CategoryNameMap type exposes the following members.
Constructors
Name | Description
CategoryNameMap
Initializes a new instance of the CategoryNameMap class
Methods
Name | Description
Clear
Removes every category from the map, rendering it empty.
Contains
Tests for the existence of a category with that name within the map.
Erase
Removes a category with the specified name from the map.
ForwardIterator
Retrieve a forward moving iterator to the map.
GetEnumerator
Retrieve a forward moving iterator to the map.
Insert
Insert the specified category with the specified name into the map.
ReverseIterator
Retrieve a backward moving iterator to the map.
Properties
Name | Description
IsEmpty
Test to see if the map is empty.
Item
Gets or sets a category at a specified name within the map.
Size
Returns the number of categories that are in the map.
See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace