Revit 2024 API
DoubleParameterValue Properties
The DoubleParameterValue type exposes the following members.
Properties
Name | Description
Value
 The stored value
See Also
DoubleParameterValue Class
Autodesk.Revit.DB Namespace