Revit 2024 API
CentralModelVersionArchivedException Members
The CentralModelVersionArchivedException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
CentralModelVersionArchivedException Class
Autodesk.Revit.Exceptions Namespace