Revit 2024 API
GeomCombination Members
The GeomCombination type exposes the following members.
Methods
Name | Description
Properties
Name | Description
AllMembers
All elements that are joined in this geometry combination.
See Also
GeomCombination Class
Autodesk.Revit.DB Namespace