Revit 2024 API
ViewPrintingEventArgs Members
The ViewPrintingEventArgs type exposes the following members.
Methods
Name | Description
GetSettings
 Get the print settings of the active printing session.
Properties
Name | Description
Index
 The index of the view being printed out of the set of all views being printed.
TotalViews
 The number of all views being printed.
View
 The view to be printed.
See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace