Revit 2024 API
TilePattern Members
The TilePattern type exposes the following members.
Methods
Name | Description
Properties
Name | Description
TilePatternType
The built-in system tile pattern specified by this object.
TilesPerSeedNode
Get the number of tiles located at each seed node.
See Also
TilePattern Class
Autodesk.Revit.DB Namespace