Revit 2024 API
PipeFittingAndAccessoryData Members
The PipeFittingAndAccessoryData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PipeFittingAndAccessoryData
GetAllConnectorData
 Gets the connector data of the pipe fitting or pipe accessory.
GetEntity
 Returns an Entity of the Schema of the serverGUID.
GetFamilyInstanceId
 Gets the Id of the fiting or accessory instance
Properties
Name | Description
BehaviorType
 The behavior type of the pipe fitting or pipe accessory.
FluidDensity
 The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³).
FluidViscosity
 The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Origin
 The origin position of the pipe fitting or pipe accessory.
PartType
 The part type of the pipe fitting or pipe accessory.
ServerGUID
 The GUID of the pipe fitting or pipe accessory.
SystemClassification
 The system classification of the pipe fitting or pipe accessory.
See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace