Revit 2024 API
PostDocEventArgs Members
The PostDocEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Document
 The document associated with the event.
See Also
PostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace