Revit 2024 API
EnergyAnalysisSurface Members
The EnergyAnalysisSurface type exposes the following members.
Methods
Name | Description
GetAdjacentAnalyticalSpace
 Gets the secondary adjacent analytical space this surface is associated with.
GetAnalyticalOpenings
 Returns the analytical openings of the analytical surface.
GetAnalyticalSpace
 Gets the primary analytical space this surface is associated with.
GetConstruction
 Gets the analytic construction this surface is associated with.
GetPolyloop
 Gets the planar polygon describing the surface geometry.
GetPolyloops
 Gets the collection of planar polygons describing the surface geometry.
Properties
Name | Description
Azimuth
 The azimuth angle for this surface.
CADLinkUniqueId
 The unique id of the originating CAD object's link (linked document) associated with this surface.
CADObjectUniqueId
 The unique id of the originating CAD object (model element) associated with this surface.
Corner
 The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Height
 The height of the analytical rectangular geometry.
Normal
 The outward normal for this surface.
OriginatingElementDescription
 The description for the originating Revit element.
OriginatingElementId
 The element id for the originating Revit element.
OriginatingElementName
 The name for the originating Revit element.
SurfaceId
 The unique identifier for the surface.
SurfaceName
 The unique name identifier for this surface.
SurfaceType
 The analytical surface type.
Tilt
 The tilt angle for this surface.
Type
 The gbXML surface type attribute.
Width
 The width of the analytical rectangular geometry.
See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace