Revit 2024 API
PolylineNode Members
The PolylineNode type exposes the following members.
Methods
Name | Description
GetPolyline
 Returns the polyline object corresponding to the node.
Properties
Name | Description
See Also
PolylineNode Class
Autodesk.Revit.DB Namespace