Revit 2024 API
BoundarySegment Members
The BoundarySegment type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BoundarySegment
GetCurve
 Get a copy of the curve that is formed along this boundary.
Properties
Name | Description
ElementId
 Retrieve the id of the element that produces this boundary segment. If the segment is created from an element in a link, this is the id of the RevitLinkInstance.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LinkElementId
 Retrieve the element id of the element in a link instance that forms this boundary.
See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace