Revit 2024 API
CorrectionFactorSetIterator Members
The CorrectionFactorSetIterator type exposes the following members.
Constructors
Name | Description
CorrectionFactorSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
CorrectionFactorSetIterator Class
Autodesk.Revit.DB.Electrical Namespace