Revit 2024 API
AssetPropertyDouble Members
The AssetPropertyDouble type exposes the following members.
Methods
Name | Description
IsValidValue
 Checks that the value is a valid value for this property.
Properties
Name | Description
Value
 The value of the property.
See Also
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace