Revit 2024 API
GeomCombinationSet Members
The GeomCombinationSet type exposes the following members.
Constructors
Name | Description
GeomCombinationSet
Initializes a new instance of the GeomCombinationSet class
Methods
Name | Description
Clear
Removes every item GeomCombination the set, rendering it empty.
Contains
Tests for the existence of an GeomCombination within the set.
Erase
Removes a specified GeomCombination from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified element into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of GeomCombinations that are in the set.
See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace