Revit 2024 API
Sketch Members
The Sketch type exposes the following members.
Methods
Name | Description
GetAllElements
 Returns all elements which belong to the sketch.
Properties
Name | Description
OwnerId
 Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry.
Profile
Returns the Profile of the Sketch.
SketchPlane
 Returns the Sketch Plane of the Sketch.
See Also
Sketch Class
Autodesk.Revit.DB Namespace