Revit 2024 API
CodeCheckingParameterServiceData Members
The CodeCheckingParameterServiceData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the CodeCheckingParameterServiceData
GetCurrentElements
 Returns the list of Ids of the current elements.
Properties
Name | Description
Document
 The current document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
CodeCheckingParameterServiceData Class
Autodesk.Revit.DB.Structure Namespace