Revit 2024 API
CitySetIterator Members
The CitySetIterator type exposes the following members.
Constructors
Name | Description
CitySetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
CitySetIterator Class
Autodesk.Revit.DB Namespace