Revit 2024 API
CentralModelAccessDeniedException Members
The CentralModelAccessDeniedException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
CentralModelAccessDeniedException Class
Autodesk.Revit.Exceptions Namespace