Revit 2024 API
FieldDomainPointsByXYZ Members
The FieldDomainPointsByXYZ type exposes the following members.
Constructors
Name | Description
FieldDomainPointsByXYZ
 Creates object from an array of three-dimensional point coordinates
Methods
Name | Description
Properties
Name | Description
See Also
FieldDomainPointsByXYZ Class
Autodesk.Revit.DB.Analysis Namespace