Revit 2024 API
ModelCurve Members
The ModelCurve type exposes the following members.
Methods
Name | Description
ChangeToReferenceLine
Changes this curve to a reference curve.
GetVisibility
Gets the visibility for the model curve in a family document.
SetVisibility
Sets the visibility for the model curve in a family document.
Properties
Name | Description
IsReferenceLine
Indicates if this curve is a reference curve.
Subcategory
The subcategory.
TrussCurveType
The truss curve type of this model curve.
See Also
ModelCurve Class
Autodesk.Revit.DB Namespace