Revit 2024 API
ExportLayerInfo Members
The ExportLayerInfo type exposes the following members.
Constructors
Name | Description
ExportLayerInfo
 Constructs a new ExportLayerInfo with default values.
Methods
Name | Description
AddCutLayerModifier
 Adds a cut layer modifier to the layer info.
AddLayerModifier
 Adds a project layer modifier to the layer info.
ClearCutLayerModifiers
 Clears all the cut layer modifiers stored in the layer info.
ClearLayerModifiers
 Clears all the project layer modifiers stored in the layer info.
Dispose
Releases all resources used by the ExportLayerInfo
GetCutLayerModifiers
 Gets all the cut layer modifiers from the layer info.
GetLayerModifiers
 Gets all the project layer modifiers from the layer info.
RemoveCutLayerModifier
 Removes a cut layer modifier from the layer info.
RemoveLayerModifier
 Removes a project layer modifier from the layer info.
SetCutLayerModifiers
 Sets a cut layer modifier array to the layer info.
SetLayerModifiers
 Sets a project layer modifier array to the layer info.
Properties
Name | Description
CategoryType
 The category type which this layer belongs to.
ColorName
 The color name stored in value. For IFC export, the naming is to match the "colornumber" setting -- really, this stores a string that generates the colorNumber (for formats that don't use the color but need a second entry.)
ColorNumber
 The color number stored in value.
CutColorNumber
 The cut color number stored in value.
CutLayerName
 The cut layer name stored in value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LayerName
 The layer name stored in value.
See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace