Revit 2024 API
AnalysisDisplayColoredSurfaceSettings Members
The AnalysisDisplayColoredSurfaceSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayColoredSurfaceSettings()
 Constructs a default instance of colored surface settings.
AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings)
 Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisDisplayColoredSurfaceSettings
IsEqual
 Compares two colored surface settings objects.
Properties
Name | Description
GridColor
 Color of grid lines.
GridLineWeight
 Line weight of grid lines.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowContourLines
 If true, show contour lines in the analysis display.
ShowGridLines
 If true, show grid lines in the analysis display.
Transparency
 Transparency percentage of colored surface
See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace