Revit 2024 API
AreaReinforcementCurve Members
The AreaReinforcementCurve type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Curve
Returns the 3D curve forming part of the boundary of an Area Reinforcement element.
See Also
AreaReinforcementCurve Class
Autodesk.Revit.DB.Structure Namespace