Revit 2024 API
AutoJoinFailedException Members
The AutoJoinFailedException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
AutoJoinFailedException Class
Autodesk.Revit.Exceptions Namespace