Revit 2024 API
SlabShapeEditor Members
The SlabShapeEditor type exposes the following members.
Methods
Name | Description
CreateCreasesFromFoldingLines
 Convert selected folding lines to split lines
Dispose
Releases all resources used by the SlabShapeEditor
DrawPoint
Adds a point to the corresponding slab, roof or floor.
DrawSplitLine
Draws a split line on the corresponding slab, roof or floor.
Enable
Enables the slab shape editing functionality.
ModifySubElement(SlabShapeCrease, Double)
Manipulates the crease on the corresponding slab, roof or floor.
ModifySubElement(SlabShapeVertex, Double)
Manipulates the vertex on the corresponding slab, roof or floor.
PickSupport
Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.
ResetSlabShape
Removes the modifications made during editing and resets the element geometry back to the unmodified state.
Properties
Name | Description
IsEnabled
Identifies if the slab shape editing functionality is enabled.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SlabShapeCreases
All of the creases that can be edited.
SlabShapeVertices
All of the vertices that can be edited.
See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace