Revit 2024 API
PushButtonData Members
The PushButtonData type exposes the following members.
Constructors
Name | Description
PushButtonData
Constructs a new instance of PushButtonData.
Methods
Name | Description
Properties
Name | Description
AssemblyName
The assembly path of the button.
AvailabilityClassName
The full class name for the class providing the entry point to decide availability of this push button.
ClassName
The name of the class containing the implementation for the command.
See Also
PushButtonData Class
Autodesk.Revit.UI Namespace