Revit 2024 API
CurveNode Members
The CurveNode type exposes the following members.
Methods
Name | Description
GetCurve
 Returns the geometric curve object corresponding to the node.
Properties
Name | Description
See Also
CurveNode Class
Autodesk.Revit.DB Namespace