Revit 2024 API
FamilySizeTableColumn Members
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FamilySizeTableColumn
GetSpecTypeId
 Gets the identifier of the spec describing values in the column.
GetUnitTypeId
 Gets the identifier of the unit quantifying values in the column.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The column name.
See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace