Revit 2024 API
MacroModule Members
The MacroModule type exposes the following members.
Methods
Name | Description
AddMacro
 Adds a macro to the module.
Dispose
Releases all resources used by the MacroModule
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetMacro
 Gets the macro with the give name.
GetMacroModuleIterator
 Returns a Macro module iterator that iterates through the collection.
RemoveMacro
 Removes a macro from the module.
Properties
Name | Description
Description
 The module description.
Environment
 The Macro environment.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroLanguageType
 The Macro language type.
MacroLevel
 The Macro level.
MacroManager
 The Macro manager.
ModuleStatus
 The module status.
Name
 The name of the module.
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace