Revit 2024 API
FilterStringRuleEvaluator Members
The FilterStringRuleEvaluator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FilterStringRuleEvaluator
Evaluate
 Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FilterStringRuleEvaluator Class
Autodesk.Revit.DB Namespace