Revit 2024 API
ExportLineweightKey Methods
The ExportLineweightKey type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExportLineweightKey Class
Autodesk.Revit.DB Namespace