Revit 2024 API
FabricationPart Members
The FabricationPart type exposes the following members.
Methods
Name | Description
AddPartCustomData
 Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.
AdjustEndLength
 Adjusts the length for the specified connector.
AlignPartByConnector
 Align the part by its connector to a point and rotation in free space.
AlignPartByConnectors
 Moves fabrication part by one of its connectors and aligns it to another connector.
AlignPartByConnectorToConnector
 Align a part by its connector to another connector. This will replace the FabricationPart::AlignPartByConnectors method.
AlignPartByInsertionPoint
 Align the part by its insertion point to a point and rotation in free space.
AlignPartByInsertionPointAndCutInToStraight
 Align the part by its insertion point to a point and rotation on a straight. This will automatically size and connect the part being cut into, if possible.
CanAdjustEndLength
 Checks if the end of fabrication part can be adjusted.
CanASlopeBeApplied
 This will test if a slope can be applied to the part and maintain connections with any connected parts.
CanFlipPart
 Validates if the fabrication part is one of the supported fabrication part types that can be flipped.
CanSplitStraight
 Validates if the straight can be split into two at the passed in point.
ConnectAndCouple
 Makes a connection between the specified connectors and adds coupling if necessary.
Create(Document, FabricationItemFile, ElementId)
 Creates a fabrication part element from a fabrication item file.
Create(Document, FabricationServiceButton, Int32, ElementId)
 Creates a fabrication part element based on button.
Create(Document, FabricationServiceButton, Double, Double, ElementId)
 Creates a fabrication part element based on button and size.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId)
 Creates a free placed hanger.
CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
Flip
 Flips the fabrication part that is directionally oriented (tees, crosses, valves, dampers, etc.) to the opposite direction.
GetCalculatedDimensionValue
 Gets the calculated dimension value.
GetDimensionCalculatedOptions
 Gets the calculated options of the fabrication dimension.
GetDimensions
 Gets all fabrication dimensions.
GetDimensionValue
 Gets the value of the fabrication dimension, returns value in Revit internal units.
GetHostedInfo
 Gets the fabrication hosted element information.
GetInsulationLiningGeometry
 Gets insulation and lining geometry for this fabrication part.
GetPartAncillaryUsage
 Gets a list of all ancillary usage information for the part.
GetPartCustomDataInteger
 Get custom data integer value for the specified custom data.
GetPartCustomDataReal
 Get custom data real value for the specified custom data.
GetPartCustomDataText
 Get custom data text for the specified custom data.
GetProductListEntryCount
 Gets the number of product entries for this part.
GetProductListEntryName
 Gets the specified product list entry name.
GetRodInfo
 Gets the fabrication rod information.
GetTransform
 Gets the transformation matrix of the fabrication part element.
GetVersionHistory
 Gets a history of version change information about the current part.
HasCustomData
 Check if fabrication part contains custom data already.
HasNoConnections
 Checks to see if all the fabrication part's connectors are open.
IsAHanger
 Checks whether it is a hanger.
IsAStraight
 Checks whether it is a straight part.
IsATap
 Checks if it is any sort of tap.
IsDimensionCalculated
 Checks if the fabrication dimension is calculated.
IsProductList
 Gets whether or not the fabrication part is a product list.
IsProductListEntryCompatibleSize
 Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
IsSameAs
 Compare this fabrication part with the part passed and checks the pattern dimensions and options. A list of fields that can be ignored in the comparison check can be specified.
OptimizeLengths
 Optimizes the length fabrication straight parts.
PlaceAsTap
 Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
PlaceFittingAsCutIn
 Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
RemovePartCustomData
 Remove custom data from the fabrication part.
Reposition
 Repositions the fabrication straight part to another end of the run.
RotateConnectedPartByConnector
 Rotates a connected fabrication part around the axis of the specified connector.
RotateConnectedTap
 Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
SaveAsFabricationJob
 Save fabrication parts to an MEP job that can be opened in the fabrication software.
SetCalculatedDimensionValue
 Sets the calculated dimension value.
SetDimensionValue
 Sets the fabrication dimension value. The value is in Revit internal units.
SetPartCustomDataInteger
 Set the custom data integer value for the specified custom data.
SetPartCustomDataReal
 Set the custom data real value for the specified custom data.
SetPartCustomDataText
 Set the custom data real value for the specified custom data.
SetPositionByEnd
 Positions the connector of the fabrication part element by the passed point.
SplitStraight(XYZ)
 Splits the straight into two at the passed in point.
SplitStraight(Document, ElementId, XYZ)
 Splits the straight into two at the passed in point.
StretchAndFit
 Stretch the fabrication part from the specified connector and fit to the target routing end.
Properties
Name | Description
Alias
 The alias of the fabrication part.
BottomOfPartElevation
 The associated elevation to the bottom of fabrication part off of the current level.
CenterlineLength
 The centerline length of the fabrication part.
ConnectorManager
 The connector manager of the fabrication part.
CutType
 The cut type of the fabrication part.
DomainType
 The domain type for the fabrication part.
DoubleWallMaterial
 The double wall material identifier of the fabrication part.
DoubleWallMaterialArea
 The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero.
DoubleWallMaterialThickness
 The double wall material thickness of the fabrication part. If the fabrication part is not double walled, returns zero.
FreeSize
 The inner size of the fabrication part.
GeometryChecksum
 Gets the geometry checksum of the fabrication part symbol, and it does nothing with the fabrication part instance position.
HangerRodKit
 Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used.
HasDoubleWall
 True if the fabrication part is double walled.
HasInsulation
 True if the fabrication part is insulated.
HasLining
 True if the fabrication part is lined.
InsulationArea
 The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero.
InsulationSpecification
 The fabrication part insulation specification identifier.
InsulationThickness
 The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.
InsulationType
 The insulation type of the fabrication part.
IsBoughtOut
 True if the fabrication part is bought out.
ItemCustomId
 The item custom identifier for the fabrication part.
ItemNumber
 The item number that is used for identification, re-ordering from shop.
LevelOffset
 The associated level offset that indicates the distance from the center of the fabrication part to the current level.
LiningArea
 The lining area of the fabrication part. If the fabrication part is not lined, returns zero.
LiningThickness
 The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero.
LiningType
 The lining type of the fabrication part.
Material
 The fabrication material identifier.
MaterialGauge
 The fabrication material gauge identifier.
MaterialThickness
 The material thickness of the fabrication part.
Notes
 The notes of the fabrication part.
Origin
 The origin of the fabrication part element.
OverallSize
 The overall size of the fabrication part.
PartGuid
 The fabrication part's globally unique identifier.
PartStatus
 The status identifier for the fabrication part.
ProductCode
 The current database id of the part within the fabrication database.
ProductDataRange
 The product data range of the fabrication part.
ProductFinishDescription
 The product finish description of the fabrication part.
ProductInstallType
 The product install type of the fabrication part.
ProductListEntry
 The product entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list.
ProductLongDescription
 The product long description of the fabrication part.
ProductMaterialDescription
 The product material description of the fabrication part.
ProductName
 The product name of the fabrication part.
ProductOriginalEquipmentManufacture
 The product original equipment manufacture (OEM) of the fabrication part.
ProductShortDescription
 The product short description of the fabrication part.
ProductSizeDescription
 The product size description of the fabrication part.
ProductSpecificationDescription
 The product specification description of the fabrication part.
ServiceAbbreviation
 The associated service abbreviation for the fabrication service.
ServiceId
 The fabrication part service identifier. The service can only be changed to compatible services.
ServiceName
 The name of the service associated with the fabrication part.
ServiceType
 The service type identifier of the fabrication part.
SheetMetalArea
 The sheet metal area of the fabrication part.
Size
 The size of the fabrication part.
Slope
 The slope for the straight fabrication part.
Specification
 The fabrication part specification identifier.
SpoolName
 The spool name of the fabrication part.
TopOfPartElevation
 The associated elevation to the top of fabrication part off of the current level.
ValidationStatus
 The validation status of the fabrication part.
Vendor
 The vendor of the fabrication part.
VendorCode
 The vendor code of the fabrication part.
Weight
 The weight of the fabrication part.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace