Revit 2024 API
ReferencePlane Members
The ReferencePlane type exposes the following members.
Methods
Name | Description
Flip
 Flips the orientation of the reference plane.
GetPlane
 Returns the geometry plane to which the reference plane is assigned.
GetReference
 Returns the geometry reference of the reference plane.
Properties
Name | Description
BubbleEnd
 The bubble end of the reference plane.
Direction
 The direction of the reference plane.
FreeEnd
 The free end of the reference plane.
Name
The name property of the reference plane.
Normal
 The normal vector of the reference plane.
See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace