Revit 2024 API
IFCExtrusionData Members
The IFCExtrusionData type exposes the following members.
Constructors
Name | Description
IFCExtrusionData
 Constructs a new empty extrusion data object.
Methods
Name | Description
AddLoop
 Adds a curve loop to the extrusion data.
ClearLoops
 Clears the curve loops stored in the extrusion data.
Dispose
Releases all resources used by the IFCExtrusionData
GetLoops
 Gets the curve loops that form the base shape of the extrusion.
IsValid
 Determines if the extrusion data represents a valid extrusion.
RemoveLoopAt
 Removes the loop at the specified index.
Properties
Name | Description
ExtrusionBasis
 The basis used for the extrusion.
ExtrusionDirection
 The direction used for the extrusion.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ScaledExtrusionLength
 The length of the extrusion, scaled in the units of the export.
See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace