Revit 2024 API
PaperSizeSetIterator Members
The PaperSizeSetIterator type exposes the following members.
Constructors
Name | Description
PaperSizeSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
PaperSizeSetIterator Class
Autodesk.Revit.DB Namespace