Revit 2024 API
BRepBuilderSurfaceGeometry Members
The BRepBuilderSurfaceGeometry type exposes the following members.
Methods
Name | Description
Create
 Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface, including Plane and CylSurf.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, Boolean, BoundingBoxUV)
 Construct a BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are not supplied. In this case, the NURBS surface will be a piecewise polynomial surface.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, IList<Double>, Boolean, BoundingBoxUV)
 Construct BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are supplied. In this case, the NURBS surface will be a piecewise rational polynomial surface.
Dispose
Releases all resources used by the BRepBuilderSurfaceGeometry
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BRepBuilderSurfaceGeometry Class
Autodesk.Revit.DB Namespace