Revit 2024 API
RebarShapeSegment Members
The RebarShapeSegment type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarShapeSegment
GetConstraints
 Retrieve the list of constraints associated with this segment.
SetConstraints
 Assign a new list of constraints to this segment.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace