Revit 2024 API
BRepBuilderGeometryId Members
The BRepBuilderGeometryId type exposes the following members.
Constructors
Name | Description
BRepBuilderGeometryId
 Copy constructor
Methods
Name | Description
Dispose
Releases all resources used by the BRepBuilderGeometryId
InvalidGeometryId
 Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace