Revit 2024 API
StructuralSectionGeneralH Members
The StructuralSectionGeneralH type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralH
 Creates a new instance of Rectangular Pipe shape.
Methods
Name | Description
Properties
Name | Description
InnerFillet
 Inner Fillet - Corner fillet inner radius.
OuterFillet
 Outer Fillet - Corner fillet outer radius.
WallDesignThickness
 Represents wall design thickness of rectangle.
WallNominalThickness
 Represents wall nominal thickness of rectangle.
See Also
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace