Revit 2024 API
VendorIdAttribute Members
The VendorIdAttribute type exposes the following members.
Constructors
Name | Description
VendorIdAttribute
Constructs a new VendorIdAttribute.
Methods
Name | Description
Properties
Name | Description
Value
AddInId VendorId value.
See Also
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace