Revit 2024 API
MacroModule Methods
The MacroModule type exposes the following members.
Methods
Name | Description
AddMacro
 Adds a macro to the module.
Dispose
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetMacro
 Gets the macro with the give name.
GetMacroModuleIterator
 Returns a Macro module iterator that iterates through the collection.
RemoveMacro
 Removes a macro from the module.
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace