Revit 2024 API
ColorWithTransparency Members
The ColorWithTransparency type exposes the following members.
Constructors
Name | Description
ColorWithTransparency()
 color
ColorWithTransparency(UInt32, UInt32, UInt32, UInt32)
 color
Methods
Name | Description
Dispose
Releases all resources used by the ColorWithTransparency
GetBlue
 get blue
GetColor
 get color
GetGreen
 get green
GetRed
 get red
GetTransparency
 get transparency
SetBlue
 set blue
SetColor
 set color
SetGreen
 set green
SetRed
 set red
SetTransparency
 set transparency
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace