Revit 2024 API
CircleLightShape Members
The CircleLightShape type exposes the following members.
Constructors
Name | Description
CircleLightShape()
 Creates a circle light shape object with 2.0' emit diameter.
CircleLightShape(Double)
 Creates a circle light shape object with the given emit diameter.
CircleLightShape(CircleLightShape)
 Creates a copy of the given circle light shape
Methods
Name | Description
Properties
Name | Description
EmitDiameter
 The emit diameter.
See Also
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace