Revit 2024 API
Duct Members
The Duct type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector)
 Creates a new duct that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ)
 Creates a new duct that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ)
 Creates a new duct from two points.
CreatePlaceholder
 Creates a new placeholder duct.
IsDuctTypeId
 Checks if given type is valid duct type.
IsHvacSystemTypeId
 Checks if given type is valid HVAC system type.
SetSystemType
 Updates the associated system type for the duct.
Properties
Name | Description
DuctType
 The duct type of this duct.
IsPlaceholder
 Identifies if the duct is a placeholder or not.
See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace