Revit 2024 API
FaceSecondDerivatives Methods
The FaceSecondDerivatives type exposes the following members.
Methods
Name | Description
Dispose
See Also
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace