Revit 2024 API
IndexStream Members
The IndexStream type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IndexStream
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IndexStream Class
Autodesk.Revit.DB.DirectContext3D Namespace