Revit 2024 API
PulldownButtonData Members
The PulldownButtonData type exposes the following members.
Constructors
Name | Description
PulldownButtonData
Constructs a new instance of PulldownButtonData.
Methods
Name | Description
Properties
Name | Description
See Also
PulldownButtonData Class
Autodesk.Revit.UI Namespace