Revit 2024 API
SpaceSet Members
The SpaceSet type exposes the following members.
Constructors
Name | Description
SpaceSet
Initializes a new instance of the SpaceSet class
Methods
Name | Description
Clear
Removes every item from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of objects that are in the set.
See Also
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace