Revit 2024 API
VertexPosition Members
The VertexPosition type exposes the following members.
Constructors
Name | Description
VertexPosition
 Constructs the vertex from a point.
Methods
Name | Description
GetSizeInFloats
 Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Properties
Name | Description
Position
 The vertex's position.
See Also
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace