Revit 2024 API
VertexStreamPositionColored Members
The VertexStreamPositionColored type exposes the following members.
Methods
Name | Description
AddVertex
 Inserts a VertexStreamPositionColored into the stream and associated buffer.
AddVertices
 Inserts multiple VertexStreamPositionColored instances into the stream and associated buffer.
Properties
Name | Description
See Also
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace