Revit 2024 API
ConfigurationReloadInfo Members
The ConfigurationReloadInfo type exposes the following members.
Constructors
Name | Description
ConfigurationReloadInfo
 Constructor.
Methods
Name | Description
Dispose
Releases all resources used by the ConfigurationReloadInfo
GetConnectivityValidation
 Returns information about the post-reload connectivity validation.
GetCustomDataChangedElements
 Gets a list of ElementIds of fabrication parts that had custom data updated during the reload.
GetOutOfDatePartStatus
 Access reload information for out of date part.
Properties
Name | Description
Disconnects
 The number of disconnections caused by the reload.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OutOfDatePartCount
 The number of fabrication part instances that had newer versions and were out of date.
ProfileNotAvailable
 The current profile is not available in the disk configuration.
See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace