Revit 2024 API
EdgeEndPoint Members
The EdgeEndPoint type exposes the following members.
Constructors
Name | Description
EdgeEndPoint
 Constructs an instance of EdgeEndPoint.
Methods
Name | Description
Dispose
Releases all resources used by the EdgeEndPoint
Equals(EdgeEndPoint)
 Determines whether this EdgeEndPoint is equal to another.
Evaluate
 Evaluate the end point of the edge in 3d coordinates.
Properties
Name | Description
Edge
 The Edge.
Index
 The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace