Revit 2024 API
PointOnEdge Members
The PointOnEdge type exposes the following members.
Methods
Name | Description
GetEdgeReference
Get a copy of the edge or curve reference.
SetEdgeReference
Change the edge or curve reference.
Properties
Name | Description
LocationOnCurve
The point location on curve.
See Also
PointOnEdge Class
Autodesk.Revit.DB Namespace