Revit 2024 API
DimensionType Members
The DimensionType type exposes the following members.
Methods
Name | Description
CanHaveEqualityFormula
 Checks whether this DimensionType can have an equality formula.
CanHaveOrdinateDimensionSetting
 Checks whether this DimensionType can have an ordinate dimension settings.
GetAlternateUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
GetEqualityFormula
 Gets an ordered list of the entries in the equality formula definition.
GetOrdinateDimensionSetting
 Gets the ordinate dimension settings for this DimensionType.
GetSpecTypeId
 Gets the spec of this dimension style.
GetUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the units value.
SetAlternateUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
SetEqualityFormula
 Sets an ordered list of the entries to use in the equality formula definition.
SetOrdinateDimensionSetting
 Sets the ordinate dimension settings for this DimensionType.
SetUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the units value.
Properties
Name | Description
AlternateUnits
 The alternate units display mode for this DimensionType.
AlternateUnitsPrefix
 The prefix text for the alternate units value.
AlternateUnitsSuffix
 The suffix text for the alternate units value.
Prefix
 The prefix text for the dimension value.
StyleType
 The dimension style type of this DimensionType.
Suffix
 The suffix text for the dimension value.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace