Revit 2024 API
DirectoryNotEmptyException Members
The DirectoryNotEmptyException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
DirectoryNotEmptyException Class
Autodesk.Revit.Exceptions Namespace