Revit 2024 API
DataConversionMonitorScope Methods
The DataConversionMonitorScope type exposes the following members.
Methods
Name | Description
Dispose
See Also
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace