Revit 2024 API
CurveElement Members
The CurveElement type exposes the following members.
Methods
Name | Description
CreateAreaBasedLoadBoundaryLine
 Creates an area based load boundary line.
CreateAreaBasedLoadBoundaryLines
 Creates area based load boundary lines.
GetAdjoinedCurveElements
 Returns elements that are joining with this curve element at the given end point.
GetAreaBasedLoadBoundaryLineData
 Gets the area based load boundary line data from this curve, if applicable.
GetLineStyleIds
 Ids of all line style Elements that are applicable to this curve element.
GetTangentLock
 Returns the state of a tangent join between this and another curve element at the given end-point.
HasTangentJoin
 Tests whether this curve element and the input curve element have common tangent join at the given end-point.
HasTangentLocks
 Tests whether this curve element has any locked tangent joins at the given end-point.
IsAdjoinedCurveElement
 This method tests whether this and the given curve elements are joined at the given end.
SetGeometryCurve
 Sets the geometry of the curve element. After the curve geometry is set, other nearby curves may join to the new curve geometry.
SetSketchPlaneAndCurve
Sets the sketch plane and the curve for this CurveElement.
SetTangentLock
 Sets a new status for an existing tangent join with another curve element at the given end-point.
Properties
Name | Description
CenterPointReference
Centerpoint reference of curve element. Curves such as circles, arcs, ellipses, and partial ellipses support this property.
CurveElementType
 Type of the curve element.
GeometryCurve
Geometry curve of the curve element.
LineStyle
The line style of this curve element.
SketchPlane
The sketch plane the curve element lies in.
SupportsTangentLocks
 Indicates whether or not this curve element can have a locked tangent join at either of its end-points shared with another curve element.
See Also
CurveElement Class
Autodesk.Revit.DB Namespace