Revit 2024 API
IStructuralSectionsServer Members
The IStructuralSectionsServer type exposes the following members.
Methods
Name | Description
StructuralSectionsUpdate
 The server's method that will be called when Revit User clicks the Section Type parameter's button in the family dialog.
See Also
IStructuralSectionsServer Interface
Autodesk.Revit.DB.Structure Namespace