Revit 2024 API
Panel Members
The Panel type exposes the following members.
Methods
Name | Description
FindHostPanel
 Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel.
GetRefGridLines
 This method is used to get the reference gridlines.
Properties
Name | Description
Lockable
This property is used to know whether a panel can be locked.
PanelType
 The Panel style of this Panel.
Transform
This property is used to find the transform of a curtain panel within project.
See Also
Panel Class
Autodesk.Revit.DB Namespace