Revit 2024 API
TextBoxData Members
The TextBoxData type exposes the following members.
Constructors
Name | Description
TextBoxData
Constructs a new instance of TextBoxData.
Methods
Name | Description
Properties
Name | Description
Image
The image of the TextBox.
See Also
TextBoxData Class
Autodesk.Revit.UI Namespace