Revit 2024 API
FileNotFoundException Members
The FileNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides IOException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
FileNotFoundException Class
Autodesk.Revit.Exceptions Namespace