Revit 2024 API
DWGExportOptions Members
The DWGExportOptions type exposes the following members.
Constructors
Name | Description
DWGExportOptions()
 Constructs a new instance of DWGExportOptions with default values of all properties.
DWGExportOptions(DWGExportOptions)
 Constructs a new instance of DWGExportOptions as a copy of the export options.
Methods
Name | Description
GetPredefinedOptions
 Returns an instance DWGExportOptions containing settings from a predefined export setup.
Properties
Name | Description
MergedViews
 Whether to merge all views in one file (via XRefs). Default value is false for mergedViews.
See Also
DWGExportOptions Class
Autodesk.Revit.DB Namespace