Revit 2024 API
IFCFileModelOptions Methods
The IFCFileModelOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace