Revit 2024 API
ViewExportingEventArgs Members
The ViewExportingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ViewId
 Identifies the view about to be exported.
See Also
ViewExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace