Revit 2024 API
Workset Members
The Workset type exposes the following members.
Methods
Name | Description
Create
 Creates a new workset.
Properties
Name | Description
IsEditable
 Whether the workset is editable.
IsOpen
 Whether the workset is open (rather than closed).
IsVisibleByDefault
 Whether the workset is visible by default.
Kind
 Kind of the workset.
See Also
Workset Class
Autodesk.Revit.DB Namespace