Revit 2024 API
RevitLinkOperations Members
The RevitLinkOperations type exposes the following members.
Methods
Name | Description
SetGetLocalPathForOpenCallback
 Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
Properties
Name | Description
See Also
RevitLinkOperations Class
Autodesk.Revit.DB Namespace