Revit 2024 API
ColorFillSchemeEntry Members
The ColorFillSchemeEntry type exposes the following members.
Constructors
Name | Description
ColorFillSchemeEntry
 Creates new ColorFillSchemeEntry.
Methods
Name | Description
CanSetValue(Double)
 Checks whether StorageType of entry is Double and the value is no less than 0.0.
CanSetValue(Int32)
 Checks whether StorageType of entry is Integer.
CanSetValue(ElementId)
 Checks whether StorageType of entry is ElementId.
Dispose
Releases all resources used by the ColorFillSchemeEntry
GetDoubleValue
 Gets the Double value stored within the entry.
GetElementIdValue
 Gets the ElementId value stored within the entry.
GetIntegerValue
 Gets the Integer value stored within the entry.
GetStringValue
 Gets the String value stored within the entry.
SetDoubleValue
 Sets new Double value of entry.
SetElementIdValue
 Sets new ElementId value of entry.
SetIntegerValue
 Sets new Integer value of entry.
SetStringValue
 Sets new String value of entry.
Properties
Name | Description
Caption
 The text displayed in [!:Autodesk::Revit::DB::ColorFillLegend] for this entry.
Color
 The filling color of this entry.
FillPatternId
 The id of fill pattern element of this entry.
IsInUse
 Represents if there exists at least one element colored based on this entry in the document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsVisible
 Represents if the element colored based on this entry is visible in views.
StorageType
 The storage type of the value stored in this entry.
See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace