Revit 2024 API
InsulationTypeSet Members
The InsulationTypeSet type exposes the following members.
Constructors
Name | Description
InsulationTypeSet
Initializes a new instance of the InsulationTypeSet class
Methods
Name | Description
Clear
Removes every insulation type from the set, rendering it empty.
Contains
Tests for the existence of a insulation type within the set.
Erase
Removes a specified insulation type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified insulation type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of insulation types that are in the set.
See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace