Revit 2024 API
KeyBasedTreeEntriesLoadContent Members
The KeyBasedTreeEntriesLoadContent type exposes the following members.
Methods
Name | Description
AddEntry
 Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.
BuildEntries
 Builds a KeyBasedTreeEntries object.
CanAddEntry
 Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent.
GetEntries
 Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
GetLoadResults
 Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
IsEntriesBuilt
 Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built.
Reset
 Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.
Properties
Name | Description
See Also
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace