Revit 2024 API
StairsPath Members
The StairsPath type exposes the following members.
Methods
Name | Description
CanCreateOnMultistoryStairs
 Checks if more stairs paths can be added on the plan views of a multistory stairs.
Create
 Creates a new stairs path for the specified stairs with the specified stairs path type only in the plan view.
CreateOnMultistoryStairs
 Creates a new stairs path for the stairs in a multistory stairs with the specified stairs path type only in the plan view.
Properties
Name | Description
DownText
 The stairs down text.
DownTextOffset
 The offset of stairs down text.
ShowDownText
 Represents whether show stairs down text or not.
ShowUpText
 Represents whether show stairs up text or not.
StairsId
 The host stairs element id.
StairsPathOffset
 The offset of stairs path to center line of stairs.
TextOrientation
 The orientation of stair up and down text.
UpText
 The stairs up text.
UpTextOffset
 The offset of stairs up text.
See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace