Revit 2024 API
LayoutRuleClearSpacing Members
The LayoutRuleClearSpacing type exposes the following members.
Constructors
Name | Description
LayoutRuleClearSpacing
Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Methods
Name | Description
Properties
Name | Description
JustifyType
Get or set the type of justification.
Spacing
Get or set the spacing of the beam system.
See Also
LayoutRuleClearSpacing Class
Autodesk.Revit.DB Namespace