Revit 2024 API
DuctLiningType Members
The DuctLiningType type exposes the following members.
Methods
Name | Description
IsValidRoughness
 Identifies if the input roughness is valid.
Properties
Name | Description
Roughness
 The roughness of Duct Lining.
See Also
DuctLiningType Class
Autodesk.Revit.DB.Mechanical Namespace