Revit 2024 API
INavisworksExporter Members
The INavisworksExporter type exposes the following members.
Methods
Name | Description
Export
 The method that Revit will invoke to perform an export to Navisworks.
ValidateExportOptions
 Determines if the inputs are valid, and returns an error message if not.
See Also
INavisworksExporter Interface
Autodesk.Revit.DB Namespace