Revit 2024 API
DocumentChangedEventArgs Members
The DocumentChangedEventArgs type exposes the following members.
Methods
Name | Description
GetAddedElementIds()
 Returns set of elements newly added to the document.
GetAddedElementIds(ElementFilter)
 Returns set of newly added elements that pass the filter.
GetDeletedElementIds
 Returns set of elements that were deleted from the document.
GetDocument
 Returns document associated with this event
GetModifiedElementIds()
 Returns set of elements that were modified.
GetModifiedElementIds(ElementFilter)
 Returns set of elements that were modified according to the given element filter.
GetTransactionNames
 Returns names of the transactions associated with this event
Properties
Name | Description
Operation
 The operation associated with this event
See Also
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace