Revit 2024 API
RadioButtonGroupData Members
The RadioButtonGroupData type exposes the following members.
Constructors
Name | Description
RadioButtonGroupData
Constructs a new instance of RadioButtonGroupData.
Methods
Name | Description
Properties
Name | Description
See Also
RadioButtonGroupData Class
Autodesk.Revit.UI Namespace