Revit 2024 API
LayoutRuleMaximumSpacing Members
The LayoutRuleMaximumSpacing type exposes the following members.
Constructors
Name | Description
LayoutRuleMaximumSpacing
Constructor of LayoutRuleMaximumSpacing.
Methods
Name | Description
Properties
Name | Description
Spacing
Get or set the spacing of the beam system.
See Also
LayoutRuleMaximumSpacing Class
Autodesk.Revit.DB Namespace