Revit 2024 API
Control Members
The Control type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Origin
 The control origin.
Shape
 The control shape.
View
 The view.
See Also
Control Class
Autodesk.Revit.DB Namespace