Revit 2024 API
LoadNature Members
The LoadNature type exposes the following members.
Methods
Name | Description
Create
 Creates a new LoadNature.
Properties
Name | Description
See Also
LoadNature Class
Autodesk.Revit.DB.Structure Namespace