Revit 2024 API
MEPHiddenLineSettings Members
The MEPHiddenLineSettings type exposes the following members.
Methods
Name | Description
GetMEPHiddenLineSettings
 Gets the MEP hidden line settings in the document.
Properties
Name | Description
DrawHiddenLine
 Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines.
InsideGap
 The gap for the lines that appear within a crossing segment.
LineStyle
 The line style that determines how the lines of a hidden segment display at the point where the segments cross.
OutsideGap
 The gap for the lines that appear external to the crossing segments.
SingleLineGap
 The gap for the single hidden lines where segments cross.
See Also
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace