Revit 2024 API
ViewActivatingEventArgs Members
The ViewActivatingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CurrentActiveView
 The view that is currently active.
NewActiveView
 The view that is going to become active.
See Also
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace