Revit 2024 API
LoadCombination Members
The LoadCombination type exposes the following members.
Methods
Name | Description
Create(Document, String)
 Creates a new default LoadCombination.
Create(Document, String, LoadCombinationType, LoadCombinationState)
 Creates a new LoadCombination.
GetCaseAndCombinationIds
 Returns collection of the load combination case and combination IDs.
GetComponents
 Returns collection of the load combination components.
GetUsageIds
 Returns collection of the load combination usage IDs.
SetComponents
 Sets a collection of the load combination components.
SetUsageIds
 Sets a collection of the load combination usage IDs.
Properties
Name | Description
IsThirdPartyGenerated
 Indicates if the load combination was created by API.
State
 The state of the load combination.
Type
 The type of the load combination.
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace