Revit 2024 API
Extrusion Members
The Extrusion type exposes the following members.
Methods
Name | Description
Properties
Name | Description
EndOffset
The offset of the end of the extrusion relative to the sketch plane.
Sketch
Returns the Sketch of the Extrusion.
StartOffset
The offset of the start of the extrusion relative to the sketch plane.
See Also
Extrusion Class
Autodesk.Revit.DB Namespace