Revit 2024 API
ValueParsingOptions Members
The ValueParsingOptions type exposes the following members.
Constructors
Name | Description
ValueParsingOptions
 Creates a new ValueParsingOptions object with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the ValueParsingOptions
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
Properties
Name | Description
AllowedValues
 The allowable range of values to be parsed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace