Revit 2024 API
SpotLightDistribution Members
The SpotLightDistribution type exposes the following members.
Constructors
Name | Description
SpotLightDistribution()
 Creates a spot light distribution object with the following values;
PI/6 radians spot beam angle
PI/2 radians spot field angle
PI/6 radians tilt angle
SpotLightDistribution(SpotLightDistribution)
 Creates a copy of the given spotlight distribution
SpotLightDistribution(Double, Double, Double)
 Creates a spot light distribution object with the given values.
Methods
Name | Description
Properties
Name | Description
SpotBeamAngle
 The spot beam angle.
SpotFieldAngle
 The spot field angle.
TiltAngle
 The tilt angle.
See Also
SpotLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace