Revit 2024 API
RevitAPIPostDocEventArgs Members
The RevitAPIPostDocEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Document
 The document associated with the event.
See Also
RevitAPIPostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace