Revit 2024 API
FabricationPartRouteEnd Members
The FabricationPartRouteEnd type exposes the following members.
Methods
Name | Description
CreateFromCenterline
 Create fabrication routing end from centerline point on straight element.
CreateFromConnector
 Create fabrication routing end from connector end point.
Dispose
Releases all resources used by the FabricationPartRouteEnd
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace