Revit 2024 API
AssemblyMemberDifference Methods
The AssemblyMemberDifference type exposes the following members.
Methods
Name | Description
Dispose
See Also
AssemblyMemberDifference Class
Autodesk.Revit.DB Namespace