Revit 2024 API
SolidCurveIntersection Members
The SolidCurveIntersection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the SolidCurveIntersection
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetCurveSegment
 Gets the curve segment generated by intersection.
GetCurveSegmentExtents
 Gets the extents for the given curve segment generated by intersection.
GetEnumerator
Returns an enumerator that iterates through a collection.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ResultType
 The result type used to calculate the intersections.
SegmentCount
 The number of segments in the results.
See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace