Revit 2024 API
HostedSweep Members
The HostedSweep type exposes the following members.
Methods
Name | Description
AddSegment
Add segments to the hosted sweep object.
GetEndPointParameter
Retrieve segment's start point or end point parameter.
HorizontalFlip
Flip the hosted sweep object along horizontal line.
RemoveSegment
Remove segments from the hosted sweep object.
SetEndPointParameter
Set segment's start point or end point parameter.
VerticalFlip
Flip the hosted sweep object along vertical line.
Properties
Name | Description
Angle
Retrieve/set the angle of the hosted sweep object relative its references (Unit : Radian).
HorizontalFlipped
Retrieve the horizontal flip status of the hosted sweep object.
HorizontalOffset
Retrieve/set the horizontal offset of the hosted sweep object.
Length
Retrieve the length of the hosted sweep object.
ReferenceCurve
The curve on which the hosted sweep segment is created.
VerticalFlipped
Retrieve the vertical flip status of the hosted sweep object.
VerticalOffset
Retrieve/set the vertical offset of the hosted sweep object.
See Also
HostedSweep Class
Autodesk.Revit.DB Namespace