Revit 2024 API
SATImportOptions Members
The SATImportOptions type exposes the following members.
Constructors
Name | Description
SATImportOptions()
 Constructs a new instance of SATImportOptions with default values of all properties.
SATImportOptions(SATImportOptions)
 Constructs a new instance of SATImportOptions as a copy of the import options.
Methods
Name | Description
Properties
Name | Description
See Also
SATImportOptions Class
Autodesk.Revit.DB Namespace