Revit 2024 API
InstanceNode Members
The InstanceNode type exposes the following members.
Methods
Name | Description
GetSymbolGeometryId
 Gets the SymbolGeometryId associated with the node.
Properties
Name | Description
See Also
InstanceNode Class
Autodesk.Revit.DB Namespace