Revit 2024 API
MemberForces Members
The MemberForces type exposes the following members.
Constructors
Name | Description
MemberForces
 Creates a new instance of MemberForces.
Methods
Name | Description
Dispose
Releases all resources used by the MemberForces
Properties
Name | Description
Force
 The translational forces at relative point position of the element.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Moment
 The rotational forces at relative point position of the element.
Start
 Member Forces position on analytical element. True for start, false for end.
See Also
MemberForces Class
Autodesk.Revit.DB.Structure Namespace