Revit 2024 API
TableMergedCell Members
The TableMergedCell type exposes the following members.
Constructors
Name | Description
TableMergedCell()
 Default constructor.
TableMergedCell(Int32, Int32, Int32, Int32)
 Constructor.
Methods
Name | Description
Dispose
Releases all resources used by the TableMergedCell
Properties
Name | Description
Bottom
 Specifies the row index of the bottom-right corner of a table grid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Left
 Specifies the column index of the top-left corner of a table grid.
Right
 Specifies the column index of the bottom-right corner of a table grid.
Top
 Specifies the row index of the top-left corner of a table grid.
See Also
TableMergedCell Class
Autodesk.Revit.DB Namespace