Revit 2024 API
StructuralSectionSigmaProfile Members
The StructuralSectionSigmaProfile type exposes the following members.
Constructors
Name | Description
StructuralSectionSigmaProfile
 Creates a new instance of Structural Section Sigma Profile shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BendWidth
 Bend segment width.
MiddleBendLength
 Middle Bend segment length.
TopBendLength
 Top Bend segment length.
See Also
StructuralSectionSigmaProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace