Revit 2024 API
FormatOptions Members
The FormatOptions type exposes the following members.
Constructors
Name | Description
FormatOptions()
 Creates a new FormatOptions object that represents default formatting.
FormatOptions(ForgeTypeId)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(FormatOptions)
 Creates a copy of a FormatOptions object.
FormatOptions(ForgeTypeId, ForgeTypeId)
 Creates a new FormatOptions object that represents custom formatting.
Methods
Name | Description
CanHaveSymbol()
 Checks whether a symbol can be specified to display the unit in this FormatOptions.
CanHaveSymbol(ForgeTypeId)
 Checks whether a symbol can be specified to display a given unit.
CanSuppressLeadingZeros()
 Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressLeadingZeros(ForgeTypeId)
 Checks whether leading zeros can be suppressed for a given unit.
CanSuppressSpaces()
 Checks whether spaces can be suppressed for the display unit in this FormatOptions.
CanSuppressSpaces(ForgeTypeId)
 Checks whether spaces can be suppressed for a given unit.
CanSuppressTrailingZeros()
 Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressTrailingZeros(ForgeTypeId)
 Checks whether trailing zeros can be suppressed for a given unit.
CanUsePlusPrefix()
 Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
CanUsePlusPrefix(ForgeTypeId)
 Checks whether a plus prefix can be displayed for a given unit.
Dispose
Releases all resources used by the FormatOptions
GetSymbolTypeId
 Gets the identifier of the symbol indicating the unit quantifying the value.
GetUnitTypeId
 Gets the identifier of the unit used to quantify values.
GetValidSymbols()
 Gets the identifiers of all valid symbols for the unit in this FormatOptions.
GetValidSymbols(ForgeTypeId)
 Gets the identifiers of all valid symbols for a given unit.
IsValidAccuracy(Double)
 Checks whether an accuracy is valid for the display unit in this FormatOptions.
IsValidAccuracy(ForgeTypeId, Double)
 Checks whether an accuracy is valid for a given unit.
IsValidForSpec
 Checks whether this FormatOptions is valid for a given spec.
IsValidSymbol(ForgeTypeId)
 Checks whether a symbol is valid for the unit in this FormatOptions.
IsValidSymbol(ForgeTypeId, ForgeTypeId)
 Checks whether a symbol is valid for a given unit.
SetSymbolTypeId
 Sets the symbol that should be displayed to indicate the unit quantifying the value.
SetUnitTypeId
 Sets the unit used to quantify values.
Properties
Name | Description
Accuracy
 The accuracy to which values will be rounded.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RoundingMethod
 The method used to round values: round to nearest, round up, or round down.
SuppressLeadingZeros
 Indicates if leading zeros should be suppressed in feet and fractional inches.
SuppressSpaces
 Indicates if spaces around the dash should be suppressed in feet and fractional inches.
SuppressTrailingZeros
 Indicates if trailing zeros after the decimal point should be suppressed.
UseDefault
 Indicates whether default or custom formatting should be used.
UseDigitGrouping
 Indicates if digit grouping symbols should be displayed.
UsePlusPrefix
 Indicates if a plus sign prefix should be displayed for positive and zero values.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace