Revit 2024 API
FlexPipe Members
The FlexPipe type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>)
 Creates a new flexible pipe into the document, using a point array and flex pipe type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>)
 Creates a new flexible pipe into the document, using a point array and flex pipe type.
IsFlexPipeTypeId
 Checks if given type is valid flexible pipe type.
IsPipingSystemTypeId
 Checks if given type is valid piping system type.
Properties
Name | Description
EndTangent
 Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
FlexPipeType
 The flex pipe type of this flex pipe.
FlowState
The flow state of the pipe.
Points
The points of the flex pipe.
StartTangent
 Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
See Also
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace