Revit 2024 API
WorksharedOperationProgressChangedEventArgs Members
The WorksharedOperationProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Location
 Full path of the central model which is to be operated.
Status
 Gets API event status, reflect current operation execution status.
See Also
WorksharedOperationProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace