Revit 2024 API
FabricationSaveJobOptions Members
The FabricationSaveJobOptions type exposes the following members.
Constructors
Name | Description
FabricationSaveJobOptions()
 Default Constructor
FabricationSaveJobOptions(Boolean)
 Constructor
Methods
Name | Description
Dispose
Releases all resources used by the FabricationSaveJobOptions
Properties
Name | Description
AddHolesForTaps
 Set true to have holes for taps on straights added to the created fabrication job.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace