Revit 2024 API
GeometryElement Members
The GeometryElement type exposes the following members.
Methods
Name | Description
GetBoundingBox
Retrieves a box that encloses the geometry element.
GetEnumerator
Returns an enumerator that iterates through the collection.
GetEnumeratorNG
Returns an enumerator that iterates through the collection.
GetTransformed
Returns a transformed copy of the geometry in this element.
Properties
Name | Description
MaterialElement
Element describing the material from which this element is composed.
See Also
GeometryElement Class
Autodesk.Revit.DB Namespace