Revit 2024 API
InitialWattageIntensity Members
The InitialWattageIntensity type exposes the following members.
Constructors
Name | Description
InitialWattageIntensity(InitialWattageIntensity)
 Creates a copy of the given initial wattage intensity object
InitialWattageIntensity(Double, Double)
 Creates an initial wattage intensity object with the given values.
Methods
Name | Description
Properties
Name | Description
Efficacy
 The efficacy value.
Wattage
 The wattage value.
See Also
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace