Revit 2024 API
CommandEventArgs Members
The CommandEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ActiveDocument
 The active document.
CommandId
 The command id.
See Also
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace