Revit 2024 API
DefinitionGroup Members
The DefinitionGroup type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Definitions
The Definitions property returns an object that contains all the shared parameter definitions within the group.
Name
Returns the name of the parameter group.
See Also
DefinitionGroup Class
Autodesk.Revit.DB Namespace