Revit 2024 API
CurveLoopsProfile Members
The CurveLoopsProfile type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Profile
Returns the curve loops of the profile.
See Also
CurveLoopsProfile Class
Autodesk.Revit.DB Namespace