Revit 2024 API
FamilyType Properties
The FamilyType type exposes the following members.
Properties
Name | Description
Name
The name of the family type.
See Also
FamilyType Class
Autodesk.Revit.DB Namespace