Revit 2024 API
IOException Members
The IOException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
IOException Class
Autodesk.Revit.Exceptions Namespace