Revit 2024 API
ZoneElementDomainData Members
The ZoneElementDomainData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ZoneElementDomainData
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ZoneElementDomainData Class
Autodesk.Revit.DB.Mechanical Namespace