Revit 2024 API
Categories Members
The Categories type exposes the following members.
Methods
Name | Description
Contains
Identifies if a category which has the specified name is in the list of top-level categories.
 (Overrides CategoryNameMap.Contains(String).)
ForwardIterator
Retrieves a forward moving iterator to the map.
 (Overrides CategoryNameMap.ForwardIterator().)
GetEnumerator
Retrieves a forward moving iterator to the map.
 (Overrides CategoryNameMap.GetEnumerator().)
Insert
Inserts the specified category with the specified name into the map.
 (Overrides CategoryNameMap.Insert(String, Category).)
NewSubcategory
Add a new subcategory into the Autodesk Revit document.
ReverseIterator
Retrieves a backward moving iterator to the map.
 (Overrides CategoryNameMap.ReverseIterator().)
Properties
Name | Description
IsEmpty
Whether or not the list of top-level categories is empty.
 (Overrides CategoryNameMap.IsEmpty.)
Item[String]
Gets a category which has the specified name from this list of top-level categories.
 (Overrides CategoryNameMap.Item[String].)
Item[BuiltInCategory]
 Retrieves a category object corresponding to a BuiltInCategory id.
Size
The total number of top-level categories in the document.
 (Overrides CategoryNameMap.Size.)
See Also
Categories Class
Autodesk.Revit.DB Namespace