Revit 2024 API
ElementDesignOptionFilter Members
The ElementDesignOptionFilter type exposes the following members.
Constructors
Name | Description
ElementDesignOptionFilter(ElementId)
 Constructs a new instance of a filter to match elements contained within a particular design option.
ElementDesignOptionFilter(ElementId, Boolean)
 Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option.
Methods
Name | Description
Properties
Name | Description
DesignOptionId
 The design option id.
See Also
ElementDesignOptionFilter Class
Autodesk.Revit.DB Namespace