Revit 2024 API
ElementArray Members
The ElementArray type exposes the following members.
Constructors
Name | Description
ElementArray
Initializes a new instance of the ElementArray class
Methods
Name | Description
Append
Add the element to the end of the array.
Clear
Removes every element from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified element into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an element at a specified index within the array.
Size
Returns the number of elements that are in the array.
See Also
ElementArray Class
Autodesk.Revit.DB Namespace