Revit 2024 API
ZoneEquipment Members
The ZoneEquipment type exposes the following members.
Methods
Name | Description
Create
 Creates a new zone equipment
GetAssociatedZoneEquipment(Document, ElementId)
 Gets the associated zone equipment of the specified analytical space.
GetAssociatedZoneEquipment(Document, ISet<ElementId>)
 Gets the associated zone equipment of all specified analytical spaces.
GetZoneEquipmentData
 Gets the zone equipment data.
MoveSpaceToEquipment
 Moves the selected analytical spaces from the identified zone equipment to another target zone equipment.
Properties
Name | Description
See Also
ZoneEquipment Class
Autodesk.Revit.DB.Mechanical Namespace