Revit 2024 API
HermiteSurface Members
The HermiteSurface type exposes the following members.
Methods
Name | Description
Create(Int32, Int32, IList<XYZ>)
 Create a non-periodic Hermite surface using a net of 3D points as input.
Create(Int32, Int32, IList<XYZ>, Boolean, Boolean)
 Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction.
IsValid
 Checks whether this HermiteSurface object is valid.
Properties
Name | Description
See Also
HermiteSurface Class
Autodesk.Revit.DB Namespace