Revit 2024 API
DocumentSaveToCentralProgressChangedEventArgs Members
The DocumentSaveToCentralProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FailureDueToConflicts
 Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.
RetryTimes
 The number of times Revit has tried to Save to Central." Its value is '0' at the first time.
SaveToCentralFinished
 Indicates if current 'save to central' is finished.
See Also
DocumentSaveToCentralProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace