Revit 2024 API
CircuitNamingSchemeSettings Members
The CircuitNamingSchemeSettings type exposes the following members.
Methods
Name | Description
GetCircuitNamingSchemeSettings
 Gets the circuit naming scheme settings of the project.
IsValidCircuitNamingSchemeId
 Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings.
Properties
Name | Description
CircuitNamingSchemeId
 The circuit naming scheme id set in CircuitNamingSchemeSettings.
See Also
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace