Revit 2024 API
AreaScheme Members
The AreaScheme type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsGrossBuildingArea
Indicates if the area scheme is a Gross Building Area scheme.
See Also
AreaScheme Class
Autodesk.Revit.DB Namespace