Revit 2024 API
StructuralSectionHotRolled Members
The StructuralSectionHotRolled type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FlangeThickness
 Flange Thickness.
FlangeThicknessLocation
 Flange Thickness Location.
WebFillet
 Web Fillet - fillet radius between web and flange.
WebThickness
 Web Thickness.
WebThicknessLocation
 Web Thickness Location.
See Also
StructuralSectionHotRolled Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace