Revit 2024 API
FilterDialog Members
The FilterDialog type exposes the following members.
Constructors
Name | Description
FilterDialog(Document, ElementId)
 Constructs a new instance of the FilterDialog class, while setting the id of the FilterElement to be selected when the dialog is shown.
FilterDialog(Document, String)
 Constructs a new instance of the FilterDialog class, while setting the name of the new ParameterFilterElement to be created and selected for editing.
Methods
Name | Description
Dispose
Releases all resources used by the FilterDialog
Show
 Shows the FilterDialog editing dialog to the user.
Properties
Name | Description
FilterToSelect
 The filter element to be selected once Show is invoked.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NewFilterId
 The ElementId of the new filter created. The value is populated after Show method is executed.
NewFilterName
 The name of the new ParameterFilterElement to be created and selected once Show is invoked.
See Also
FilterDialog Class
Autodesk.Revit.UI Namespace