Revit 2024 API
LoadUsage Members
The LoadUsage type exposes the following members.
Methods
Name | Description
Create
 Creates a new LoadUsage.
Properties
Name | Description
See Also
LoadUsage Class
Autodesk.Revit.DB.Structure Namespace