Revit 2024 API
ExternallyTaggedBRep Members
The ExternallyTaggedBRep type exposes the following members.
Methods
Name | Description
GetTaggedGeometry
 Returns the externally tagged geometry object.
Properties
Name | Description
See Also
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace