Revit 2024 API
Revision Members
The Revision type exposes the following members.
Methods
Name | Description
CombineWithNext
 Combines the specified Revision with the next Revision.
CombineWithPrevious
 Combines the specified Revision with the previous Revision.
Create
 Creates a new Revision in the project.
GetAllRevisionIds
 Returns the ids of all Revisions in the project ordered by sequence number.
ReorderRevisionSequence
 Reorders the sequence of Revisions in the project.
Properties
Name | Description
Description
 The description of this Revision.
Issued
 Indicates whether this Revision has been issued.
IssuedBy
 Indicates who has issued or will issue this Revision.
IssuedTo
 Indicates to whom this Revision was or will be issued.
RevisionDate
 The date of this Revision.
RevisionNumber
 The Revision number of this revision.
RevisionNumberingSequenceId
 The id of the revision numbering sequence which controls this revision's numbering.
SequenceNumber
 The Sequence Number of this Revision.
Visibility
 Controls the visibility of revision clouds and revision tags related to this Revision.
See Also
Revision Class
Autodesk.Revit.DB Namespace