Revit 2024 API
DuctInsulation Members
The DuctInsulation type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of duct insulation.
Properties
Name | Description
See Also
DuctInsulation Class
Autodesk.Revit.DB.Mechanical Namespace