Revit 2024 API
PipeSegment Members
The PipeSegment type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a PipeSegment and adds it to the document.
Properties
Name | Description
ScheduleTypeId
 The ElementId of the PipeScheduleType.
See Also
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace