Revit 2024 API
RebarContainerItem Members
The RebarContainerItem type exposes the following members.
Methods
Name | Description
CanApplyPresentationMode
 Checks if a presentation mode can be applied for this rebar in the given view.
CanUseHookType
 Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType
ClearPresentationMode
 Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
ComputeDrivingCurves
 Compute the driving curves.
Dispose
Releases all resources used by the RebarContainerItem
DoesBarExistAtPosition
 Checks whether a bar exists at the specified position.
FindMatchingPredefinedPresentationMode
 Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetBarPositionTransform
 Return a transform representing the relative position of any individual bar in the set.
GetBendData
 Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves(Boolean, Boolean, Boolean)
 A chain of curves representing the centerline of the rebar.
GetCenterlineCurves(Boolean, Boolean, Boolean, MultiplanarOption)
 A chain of curves representing the centerline of the rebar.
GetDistributionPath
 The distribution path of a rebar set.
GetHookOrientation
 Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
GetHookTypeId
 Get the id of the RebarHookType to be applied to the rebar.
GetPresentationMode
 Gets the presentaion mode for this rebar set when displayed in the given view.
HasPresentationOverrides
 Identifies if this rebar set has overridden default presentation settings for the given view.
IsBarHidden
 Identifies if a given bar in this rebar set is hidden in this view.
IsRebarInSection
 Identifies if this rebar set is shown as a cross-section in the given view.
SetBarHiddenStatus
 Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetFromCurves
 Set an instance of a RebarContainerItem element according to the parameters list.
SetFromCurvesAndShape
 Set an instance of a RebarContainerItem element according to the parameters list. The instance will have the default shape parameters from the RebarShape. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true, then both the curves and hooks must match the RebarShape definition. Otherwise, the hooks can be different than the defaults specified in the RebarShape
SetFromRebar
 Set an instance of a RebarContainerItem element according to a Rebar parameters. Will throw exception if given rebar is not shape driven. Will throw exception if given rebar has moved bars in set.
SetFromRebarShape
 Set an instance of a RebarContainerItem element, as an instance of a RebarShape. The instance will have the default shape parameters from the RebarShape, and its location is based on the bounding box of the shape in the shape definition. Hooks are removed from the shape before computing its bounding box. If appropriate hooks can be found in the document, they will be assigned arbitrarily.
SetHookOrientation
 Defines the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
SetHookTypeId
 Set the id of the RebarHookType to be applied to the rebar.
SetLayoutAsFixedNumber
 Sets the Layout Rule property of rebar set to FixedNumber.
SetLayoutAsMaximumSpacing
 Sets the Layout Rule property of rebar set to MaximumSpacing
SetLayoutAsMinimumClearSpacing
 Sets the Layout Rule property of rebar set to MinimumClearSpacing
SetLayoutAsNumberWithSpacing
 Sets the Layout Rule property of rebar set to NumberWithSpacing
SetLayoutAsSingle
 Sets the Layout Rule property of rebar set to Single.
SetPresentationMode
 Sets the presentation mode for this rebar set when displayed in the given view.
Properties
Name | Description
ArrayLength
 Identifies the distribution path length of rebar set.
BarsOnNormalSide
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
BarTypeId
 The identifier of the rebar bar type.
BaseFinishingTurns
 For a spiral, the number of finishing turns at the lower end of the spiral.
Height
 For a spiral, the overall height.
IncludeFirstBar
 Identifies if the first bar in rebar set is shown.
IncludeLastBar
 Identifies if the last bar in rebar set is shown.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ItemIndex
 The index of this item in its associated RebarContainer.
LayoutRule
 Identifies the layout rule of rebar set.
MaxSpacing
 Identifies the maximum spacing between rebar in rebar set.
MultiplanarDepth
 For a multiplanar rebar, the depth of the instance.
Normal
 A unit-length vector normal to the plane of the rebar
NumberOfBarPositions
 The number of potential bars in the set.
Pitch
 For a spiral, the pitch, or vertical distance traveled in one rotation.
Quantity
 Identifies the number of bars in rebar set.
RebarShapeId
 The RebarShape element that defines the shape of the rebar.
TopFinishingTurns
 For a spiral, the number of finishing turns at the upper end of the spiral.
TotalLength
 The length of an individual bar multiplied by Quantity.
Volume
 The volume of an individual bar multiplied by Quantity.
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace