Revit 2024 API
ExternalResourceMatchOptions Members
The ExternalResourceMatchOptions type exposes the following members.
Constructors
Name | Description
ExternalResourceMatchOptions
 Constructs new instance with specified resource type.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalResourceMatchOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ResourceType
 The desired resource type which external resources should match.
See Also
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace