Revit 2024 API
AnalyticalPanel Members
The AnalyticalPanel type exposes the following members.
Methods
Name | Description
Create(Document, CurveLoop)
 Creates a new instance of an Analytical Panel within the project.
Create(Document, Curve, XYZ)
 Creates a new instance of an Analytical Panel within the project.
GetAnalyticalOpeningsIds
 Returns the Analytical Openings ids of the Analytical Panel.
Properties
Name | Description
Thickness
 Panel thickness, in the Revit default units.
See Also
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace