Revit 2024 API
AssetPropertyInteger Members
The AssetPropertyInteger type exposes the following members.
Methods
Name | Description
IsValidValue
 Checks that the value is a valid value for this property.
Properties
Name | Description
Value
 The value of the property.
See Also
AssetPropertyInteger Class
Autodesk.Revit.DB.Visual Namespace