Revit 2024 API
ImportIFCOptions Members
The ImportIFCOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ImportIFCOptions
GetImportIFCOptions
 Returns the current Revit instance's ImportIFCOptions.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LinkProcessor
 Specifies the engine to use while doing a Link IFC operation.
See Also
ImportIFCOptions Class
Autodesk.Revit.DB Namespace