Revit 2024 API
SunAndShadowSettings Members
The SunAndShadowSettings type exposes the following members.
Methods
Name | Description
CalculateTimeZone
 Use Revit's utilities to calculate the time zone for a given longitude and latitude.
FitToModel
 Adjust SunAndShadowSettings to fit around the current model geometry.
GetActiveSunAndShadowSettings
 Returns the current SunAndShadowSettings element assigned to the active view for the supplied document.
GetFrameAltitude
 Identifies the altitude of the sun (angle in radians) for a specific frame.
GetFrameAzimuth
 Identifies the azimuth of the sun (angle in radians) for a specific frame.
GetFrameTime
 Identifies the date and time of the SunAndShadowSettings element for a given frame.
GetMatchingPreset
 Finds the name of the 'per-document' SunAndShadowSettings that matches the properties of this per-view element.
GetSunrise
 Identifies the sunrise time for the SunAndShadowSettings element at its current location and indicated date.
GetSunset
 Identifies the sunset time for the SunAndShadowSettings element at its current location and indicated date.
IsAfterStartDateAndTime
 Checks whether the end date and time is valid.
IsBeforeEndDateAndTime
 Checks whether the start date and time is valid.
IsFrameValid
 Checks whether the frame is valid for the supplied SunAndShadowSettings.
IsGroundPlaneLevelValid
 Checks whether the element represents a valid Ground Plane level.
IsTimeIntervalValid
 Checks whether the time interval is valid for the SunAndShadowType.
Properties
Name | Description
ActiveFrame
 Identifies the active animation frame for a single-day or multi-day study, starting at 1.0 for the first frame and incrementing in intervals of 1.0.
ActiveFrameTime
 Identifies the date and time of the SunAndShadowSettings element for the active frame.
Altitude
 Altitude setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
Azimuth
 Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
EndDateAndTime
 Identifies the end date and time.
GroundPlaneHeight
 Identifies the ground plane height.
GroundPlaneLevelId
 Identifies the element id of the Ground Plane level for the SunAndShadowSettings element.
Latitude
 Identifies the current latitude used by the SunAndShadowSettings element.
Longitude
 Identifies the current longitude used by the SunAndShadowSettings element.
NumberOfFrames
 Identifies the total number of animation frames for a single-day or multi-day study.
ProjectLocationId
 Identifies the ProjectLocation element used by the SunAndShadowSettings element.
ProjectLocationName
 Identifies the name of the project location used by the SunAndShadowSettings element.
RelativeToView
 Identifies whether the SunAndShadowSettings element is relative to the view direction. This is only relevant for lighting mode.
SharesSettings
 Identifies whether settings are shared globally.
StartDateAndTime
 Identifies the start or current date and time.
SunAndShadowType
 Identifies the type of the SunAndShadowSettings element.
SunriseToSunset
 Identifies whether the current single day sun study is set to run from sunrise to sunset.
TimeInterval
 Identifies the time interval between animation frames.
TimeZone
 Identifies the time zone.
UsesDST
 Identifies whether the SunAndShadowSettings element is using daylight savings time.
UsesGroundPlane
 Identifies whether the SunAndShadowSettings element uses a ground plane.
Visible
 Visibility in current view for a per-view SunAndShadowSettings element.
See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace