Revit 2024 API
HermiteSpline Members
The HermiteSpline type exposes the following members.
Methods
Name | Description
Create(IList<XYZ>, Boolean)
 Creates a Hermite spline with default tangency at its endpoints.
Create(IList<XYZ>, Boolean, HermiteSplineTangents)
 Creates a Hermite spline with specified tangency at its endpoints.
Properties
Name | Description
ControlPoints
The control points of the Hermite spline.
IsPeriodic
Returns whether the Hermite spline is periodic or not.
Parameters
Returns the params of the Hermite spline.
Tangents
Returns the tangents of the Hermite spline.
See Also
HermiteSpline Class
Autodesk.Revit.DB Namespace