Revit 2024 API
WireConduitType Members
The WireConduitType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Name
See Also
WireConduitType Class
Autodesk.Revit.DB.Electrical Namespace