Revit 2024 API
ExternalApplicationArrayIterator Members
The ExternalApplicationArrayIterator type exposes the following members.
Constructors
Name | Description
ExternalApplicationArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
ExternalApplicationArrayIterator Class
Autodesk.Revit.UI Namespace