Revit 2024 API
FilterStringRule Members
The FilterStringRule type exposes the following members.
Constructors
Name | Description
FilterStringRule
 Constructs an instance of FilterStringRule.
Methods
Name | Description
GetEvaluator
 Gets the evaluator that implements the test for this rule.
SetEvaluator
 Sets the evaluator that implements the test for this rule.
Properties
Name | Description
RuleString
 The user-supplied string against which strings from a Revit document will be tested.
See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace