Revit 2024 API
IFCAggregateIterator Members
The IFCAggregateIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCAggregateIterator
MoveNext
 Increments the iterator to the next object in the IFCAggregate.
Reset
 Resets the iterator to the beginning of the aggregate.
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace