Revit 2024 API
RectangleLightShape Members
The RectangleLightShape type exposes the following members.
Constructors
Name | Description
RectangleLightShape()
 Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
RectangleLightShape(RectangleLightShape)
 Creates a copy of the given rectangle light shape
RectangleLightShape(Double, Double)
 Creates a rectangle light shape object with the given emit length and width.
Methods
Name | Description
Properties
Name | Description
EmitLength
 The emit length.
EmitWidth
 The emit width.
See Also
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace