Revit 2024 API
ForgeTypeId Members
The ForgeTypeId type exposes the following members.
Constructors
Name | Description
ForgeTypeId()
 Constructs a ForgeTypeId holding an empty schema identifier.
ForgeTypeId(String)
 Constructs a ForgeTypeId holding the given schema identifier.
Methods
Name | Description
Clear
 Sets the typeId to an empty string
Dispose
Releases all resources used by the ForgeTypeId
Empty
 Checks if the typeId is an empty string
Equals
 Determines whether this ForgeTypeId is equal to another.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns the hash code for this ForgeTypeId
 (Overrides Object.GetHashCode().)
NameEquals
 Returns true if the typeid string held by this ForgeTypeId is equal to that held by the given ForgeTypeId, excluding the version number. The version number of a typeid string follows a hyphen character. This function compares the typeid strings up to the first hyphen. This is the default equality comparison method for the ForgeTypeId class, used by the equality operator (==).
StrictlyEquals
 Returns true if the entire typeid string held by this ForgeTypeId is exactly equal to that held by the given ForgeTypeId. For the default equality comparison used by the equality operator (==), see NameEquals(ForgeTypeId).
Operators
Name | Description
Equality
Inequality
LessThan
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TypeId
 The schema identifier.
See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace