Revit 2024 API
ImportOptions3DM Members
The ImportOptions3DM type exposes the following members.
Constructors
Name | Description
ImportOptions3DM()
 Constructs a new instance of ImportOptions3DM with default values of all properties.
ImportOptions3DM(ImportOptions3DM)
 Constructs a new instance of ImportOptions3DM as a copy of the provided import options.
Methods
Name | Description
Properties
Name | Description
See Also
ImportOptions3DM Class
Autodesk.Revit.DB Namespace