Revit 2024 API
Camera Methods
The Camera type exposes the following members.
Methods
Name | Description
Dispose
Transform
 Transforms the camera
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace