Revit 2024 API
StructuralConnectionType Members
The StructuralConnectionType type exposes the following members.
Methods
Name | Description
Create
 Create a new StructuralConnectionType, allowing the specified annotation FamilySymbol to be applied to structural members.
GetAllStructuralConnectionTypeIds
 Collects the ids of all StructuralConnectionTypes in the document.
GetFamilySymbolId
 FamilySymbol of the annotation to use for this connection type.
SetFamilySymbolId
 FamilySymbol of the annotation to use for this connection type.
ValidFamilySymbolId
 Checks whether the family symbol id is allowed for StructuralConnectionTypes with the given value for the applyTo property.
Properties
Name | Description
ApplyTo
 Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns.
See Also
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace