Revit 2024 API
AddInCommandBinding Members
The AddInCommandBinding type exposes the following members.
Methods
Name | Description
Properties
Name | Description
RevitCommandId
The Revit command Id.
Events
Name | Description
BeforeExecuted
Occurs before the command associated with this AddInCommandBinding executes.
CanExecute
Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether the command can be executed on the command target.
Executed
Occurs when the command associated with this AddInCommandBinding executes.
See Also
AddInCommandBinding Class
Autodesk.Revit.UI Namespace