Revit 2024 API
HVACLoadSpaceType Members
The HVACLoadSpaceType type exposes the following members.
Methods
Name | Description
Create
 Creates a space type.
IsNameUnique(String)
 Determines whether a potential space type name is unique.
IsNameUnique(Document, String)
 Determines whether a potential space type name is unique.
Properties
Name | Description
IsPlenum
 True if the space type is plenum.
SpaceTypeName
 The space type name.
See Also
HVACLoadSpaceType Class
Autodesk.Revit.DB.Analysis Namespace