Revit 2024 API
GeometryInstance Members
The GeometryInstance type exposes the following members.
Methods
Name | Description
GetDocument
Gets the document that contains the symbol of this instance.
GetInstanceGeometry()
Computes the geometric representation of the instance.
GetInstanceGeometry(Transform)
Computes a transformation of the geometric representation of the instance.
GetSymbolGeometry()
Computes the geometric representation of the symbol which generates this instance.
GetSymbolGeometry(Transform)
Computes a transformation of the geometric representation of the symbol which generates this instance.
GetSymbolGeometryId
Gets the SymbolGeometryId that contains data about the symbol of this instance.
Properties
Name | Description
SymbolGeometry
The geometric representation of the symbol which generates this instance.
Transform
The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance.
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace