Revit 2024 API
ViewOrientation3D Members
The ViewOrientation3D type exposes the following members.
Constructors
Name | Description
ViewOrientation3D
 Constructs a new ViewOrientation3D using the input eye position, up and forward directions.
Methods
Name | Description
Dispose
Releases all resources used by the ViewOrientation3D
Properties
Name | Description
EyePosition
 The eye position point
ForwardDirection
 The forward direction vector
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
UpDirection
 The up direction vector
See Also
ViewOrientation3D Class
Autodesk.Revit.DB Namespace