Revit 2024 API
RebarConstrainedHandle Members
The RebarConstrainedHandle type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarConstrainedHandle
GetCustomHandleTag
 Returns the tag of the handle. The type of the handle should be 'CustomHandle'.
GetEdgeNumber
 If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle.
GetHandleName
 Gets the name of the handle.
GetHandleType
 Returns the RebarHandleType of a RebarConstrainedHandle.
IsCustomHandle
 Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'.
IsEdgeHandle
 Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.
IsValid
 Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace