Revit 2024 API
ExternalDataInstanceAddingIntoDocumentEventArgs Members
The ExternalDataInstanceAddingIntoDocumentEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
TypeId
 The type id of the newl external data instance that is being added.
See Also
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace