Revit 2024 API
MEPSize Members
The MEPSize type exposes the following members.
Constructors
Name | Description
MEPSize
 Constructs an object that stores the basic size information for MEP duct, pipe, cable tray and conduit.
Methods
Name | Description
Dispose
Releases all resources used by the MEPSize
Properties
Name | Description
InnerDiameter
 Inner diameter
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NominalDiameter
 Nominal diameter
OuterDiameter
 Outer diameter
UsedInSizeLists
 Whether it is used in size lists.
UsedInSizing
 Whether is used in sizing.
See Also
MEPSize Class
Autodesk.Revit.DB Namespace