Revit 2024 API
Pipe Members
The Pipe type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector)
 Creates a new pipe that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ)
 Creates a new pipe that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ)
 Creates a new pipe from two points.
CreatePlaceholder
 Creates a new placeholder pipe.
IsPipeTypeId
 Checks if given type is valid pipe type.
IsPipingConnector
 Checks if the given connector is a valid piping connector.
IsPipingSystemTypeId
 Checks if given type is valid piping system type.
SetSystemType
 Updates the associated system type for the pipe.
Properties
Name | Description
FlowState
The flow state of the pipe.
IsPlaceholder
 Identifies if the pipe is a placeholder or not.
PipeSegment
 The pipe segment that was assigned to this pipe according to the routing preference.
PipeType
 The pipe type of this pipe.
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace