Revit 2024 API
ContinuousRail Members
The ContinuousRail type exposes the following members.
Methods
Name | Description
GetEndExtensionPath
 Retrieves the start extension path.
GetPath
 Retrieves the rail path.
GetStartExtensionPath
 Retrieves the start extension path.
GetSupports
 Returns all the railing supports attached to the rail.
Properties
Name | Description
HostRailingId
 The id of the host Railing that contains this rail.
Length
 The length of the rail.
See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace