Revit 2024 API
ExtElemChangeBeamSectionRegistry Members
The ExtElemChangeBeamSectionRegistry type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExtElemChangeBeamSectionRegistry
RegisterInterface
 Registers a IExtElemChangeBeamSection
Unregister
 Unregisters IExtElemChangeBeamSection.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace