Revit 2024 API
AssetPropertyBoolean Members
The AssetPropertyBoolean type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
 The value of the property.
See Also
AssetPropertyBoolean Class
Autodesk.Revit.DB.Visual Namespace