Revit 2024 API
DuctPressureDropData Members
The DuctPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctPressureDropData
Properties
Name | Description
CategoryId
 The category id of duct curves. It will be OST_DuctCurves, OST_FlexDuctCurves, or OST_PlaceHolderDucts.
Coefficient
 The coefficient of the duct.
Density
 The density of the duct.Units: (kg/ft³).
EquivalentDiameter |  Obsolete.
 The equivalent diameter of the duct. Units: (ft).
Flow
 The flow of the duct. Units: (ft³/s).
Friction
 The friction of the duct. Units: (kg/(ft²·s²)).
Height
 The height of the duct. If the duct is round, it will be equal to the diameter of the duct. Units: (ft).
HydraulicDiameter
 The hydraulic diameter of the duct. Units: (ft).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Length
 The length of the duct. Units: (ft).
Level
 The calculation level of the system.
PressureDrop
 The pressure drop of the duct. Units: (kg/(ft·s²)).
ReynoldsNumber
 The reynolds number of the duct.
Roughness
 The roughness of the duct. Units: (ft).
Shape
 The profile type of the duct.
Velocity
 The velocity of the duct. Units: (ft/s).
VelocityPressure
 The velocity pressure of the duct. Units: (kg/(ft·s²)).
Viscosity
 The viscosity of the duct. Units: (kg/(ft·s)).
WidthOrDiameter
 The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft).
See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace