Revit 2024 API
FileExportedEventArgs Properties
The FileExportedEventArgs type exposes the following members.
Properties
Name | Description
Format
 Identifies the export format, e.g. DWG or image.
Path
 Target path for the exported file (or files).
See Also
FileExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace