Revit 2024 API
DesignToFabricationConverter Members
The DesignToFabricationConverter type exposes the following members.
Constructors
Name | Description
DesignToFabricationConverter
 Creates a new instance of the DesignToFabricationConverter class.
Methods
Name | Description
Convert
 Converts the set of MEP design elements into fabrication parts.
Dispose
Releases all resources used by the DesignToFabricationConverter
GetConvertedFabricationParts
 Gets the set of element identifiers for newly created fabrication parts.
GetConvertedFabricationPartsWithInvalidConnections
 Gets the collection of converted fabrication parts with invalid connections.
GetDesignElementAndFabricationPartsWithDifferentOffsets
 Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets.
GetDesignElementAndFabricationPartsWithOpenConnectors
 Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors.
GetElementsWithOpenConnector
 Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
GetPartialConvertFailureResults
 Gets the partial failure results.
SetMapForFamilySymbolToFabricationPartType
 Set a map for the conversion of in line family symbols to similar fabrication part types.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace