Revit 2024 API
WorksharingSaveAsOptions Members
The WorksharingSaveAsOptions type exposes the following members.
Constructors
Name | Description
WorksharingSaveAsOptions
 Constructs a new WorksharingSaveAsOptions with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the WorksharingSaveAsOptions
Properties
Name | Description
ClearTransmitted
 For a transmitted model opened with DetachAndPreserveWorksets, clear its transmitted flag in the Save/SaveAs operation.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OpenWorksetsDefault
 The default set of user-worksets to open when opening the model in the UI. Default is AskUserToSpecify.
SaveAsCentral
 Whether to save the new model as a central instead of local model. True: save as a central model. Default is false: save as a local model.
See Also
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace