Revit 2024 API
ClassificationEntries Members
The ClassificationEntries type exposes the following members.
Methods
Name | Description
LoadClassificationEntriesFromFile
 Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent.
Properties
Name | Description
See Also
ClassificationEntries Class
Autodesk.Revit.DB Namespace