Revit 2024 API
AnalyticalSurfaceBase Members
The AnalyticalSurfaceBase type exposes the following members.
Methods
Name | Description
GetOuterContour
 Returns the Curve Loop that defines the geometry of the Analytical Surface element.
IsCurveLoopValid
 Checks if curve loop is valid for Analytical Panel.
SetOuterContour
 Sets the Curve Loop that defines the geometry of the Analytical Surface element.
Properties
Name | Description
SketchId
 Sketch associated to this Revit element.
See Also
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace