Revit 2024 API
LinkLoadResult Members
The LinkLoadResult type exposes the following members.
Constructors
Name | Description
LinkLoadResult()
 Constructs a new uninitialized LinkLoadResult object.
LinkLoadResult(LinkLoadResult)
 Constructs a new copy of the input LinkLoadResult object.
Methods
Name | Description
Dispose
Releases all resources used by the LinkLoadResult
GetCentralModelName
 Gets the central model's name. If the link is not workshared, this returns an empty FilePath. If the link is itself a central model, this returns the link's name.
GetExternalResourceReference
 Gets a copy of the ExternalResourceReference corresponding to the link.
GetExternalResourceReferencesFromFailedLoads
 Searches this and all nested LinkLoadResults, and returns a list of ExternalResourceReferences for the links that failed to load.
GetLinkLoadResult
 Searches this LinkLoadResult and all nested LinkLoadResults for the load operation results of a specified ExternalResourceReference.
GetModelName
 Gets the name of the model.
GetNestedLinkLoadResults
 Gets the results for this link's nested links.
GetParentModelName
 Returns the name of the parent of the linked model, or an empty FilePath if the link is a top-level link.
IsCodeSuccess
 Check if load result code signifies success.
Properties
Name | Description
ElementId
 The id of the created or loaded linked model.
IsCircularLink
 True if these results are part of a link cycle.
IsNested
 True if these results represent a nested link; false otherwise.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LoadResult
 Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded for success, or a variety of errors. See LinkLoadResultType for the full list.
See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace