Revit 2024 API
ProjectLocation Members
The ProjectLocation type exposes the following members.
Methods
Name | Description
Create
 Create an instance of ProjectLocation in the document.
Duplicate
 Generate a copy of this project location with the specified name.
GetProjectPosition
 Gets the coordinates of a point in the ProjectLocation's coordinate system.
GetSiteLocation
 Gets the site location to which this project location refers.
IsProjectLocationNameUnique
 Verifies that there is no existing ProjectLocation with the given name belonging to the given SiteLocation.
SetProjectPosition
 Sets the coordinates of a point in the ProjectLocation's coordinate system.
Properties
Name | Description
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace