Revit 2024 API
DialogBoxShowingEventArgs Members
The DialogBoxShowingEventArgs type exposes the following members.
Methods
Name | Description
OverrideResult
 Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Properties
Name | Description
DialogId
 A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace