Revit 2024 API
StructuralSectionLAngle Members
The StructuralSectionLAngle type exposes the following members.
Constructors
Name | Description
StructuralSectionLAngle
 Creates a new instance of Structural Section L Angle shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BoltDiameterLongerFlange
 Maximum bolt hole diameter in the longer flange, in. (mm)
BoltDiameterShorterFlange
 Maximum bolt hole diameter in the shorter flange, in. (mm)
BoltSpacing1LongerFlange
 Standard bolt spacing first row in the longer flange, in. (mm)
BoltSpacing2LongerFlange
 Standard bolt spacing second row in the longer flange, in. (mm)
BoltSpacingShorterFlange
 Standard bolt spacing in the shorter flange, in. (mm)
See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace