Revit 2024 API
CylindricalFace Members
The CylindricalFace type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Axis
Axis of the surface.
Origin
Origin of the surface.
Radius
Radii of the surface.
See Also
CylindricalFace Class
Autodesk.Revit.DB Namespace