Revit 2024 API
ApplicationEntryPoint Members
The ApplicationEntryPoint type exposes the following members.
Constructors
Name | Description
ApplicationEntryPoint
Initializes a new instance of the ApplicationEntryPoint class
Methods
Name | Description
FinishInitializationEO
 For Revit Macros internal use only.
Initialize
 For Revit Macros internal use only.
OnShutdownEO
 For Revit Macros internal use only.
Properties
Name | Description
AddinFolder
 The full path to the Revit Macros module.
Events
Name | Description
See Also
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace