Revit 2024 API
PhaseFilter Members
The PhaseFilter type exposes the following members.
Methods
Name | Description
Create
 Creates a new phase filter with default status presentation.
GetPhaseStatusPresentation
 Gets the phase status presentation.
SetPhaseStatusPresentation
 Sets the phase status presentation.
Properties
Name | Description
IsDefault
 Indicates whether this filter is the default one.
See Also
PhaseFilter Class
Autodesk.Revit.DB Namespace