Revit 2024 API
SteelElementProperties Members
The SteelElementProperties type exposes the following members.
Methods
Name | Description
AddFabricationInformationForRevitElements
 This method adds fabrication information to the given elements.
GetFabricationUniqueID
 This method will return the fabrication id for the given reference.
GetReference
 This method will return the reference for the given fabrication id.
GetSteelElementProperties
 Get SteelElementProperties for the input element if they exist.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
UniqueID
 This method will return the fabrication id. This represents the link between the Revit and the Steel Core element.
See Also
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace