Revit 2024 API
PanelTypeSet Members
The PanelTypeSet type exposes the following members.
Constructors
Name | Description
PanelTypeSet
Initializes a new instance of the PanelTypeSet class
Methods
Name | Description
Clear
Removes every panel type from the set, rendering it empty.
Contains
Tests for the existence of a panel type within the set.
Erase
Removes a specified panel type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified panel type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of panel types that are in the set.
See Also
PanelTypeSet Class
Autodesk.Revit.DB Namespace