Revit 2024 API
MEPModel Members
The MEPModel type exposes the following members.
Methods
Name | Description
GetAssignedElectricalSystems
 Retrieves the electrical systems this electrical panel currently is assigned to.
GetElectricalSystems
 Retrieves the electrical systems that are currently created using this MEPModel.
Properties
Name | Description
ConnectorManager
 Retrieves the Connector Manager from this MEPModel.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace