Revit 2024 API
SystemsAnalysisOptions Methods
The SystemsAnalysisOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace