Revit 2024 API
FilterNumericEquals Members
The FilterNumericEquals type exposes the following members.
Constructors
Name | Description
FilterNumericEquals
 Constructs an instance of FilterNumericEquals.
Methods
Name | Description
Properties
Name | Description
See Also
FilterNumericEquals Class
Autodesk.Revit.DB Namespace