Revit 2024 API
WorksetKindFilter Members
The WorksetKindFilter type exposes the following members.
Constructors
Name | Description
WorksetKindFilter(WorksetKind)
 Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
WorksetKindFilter(WorksetKind, Boolean)
 Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
Methods
Name | Description
Properties
Name | Description
WorksetKind
 The WorksetKind.
See Also
WorksetKindFilter Class
Autodesk.Revit.DB Namespace