Revit 2024 API
StructuralSectionGeneralU Members
The StructuralSectionGeneralU type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralU
 Creates a new instance of general Channel shape.
Methods
Name | Description
GetFlangeThicknessInFlangeCenter
 Returns thickness of flange measured in the 0.5 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInWidthCenter
 Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm.
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet
 Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle
 Sloped flange angle. (rad)
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
See Also
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace