Revit 2024 API
SpotDimension Members
The SpotDimension type exposes the following members.
Methods
Name | Description
CanFlip
 Verifies that the direction of the dimension can be flipped.
Flip
 Flips dimension to the other side of the host.
Properties
Name | Description
LeaderHasShoulder
 True is dimension has leader with shoulder, false otherwise.
LeaderShoulderPosition
 Position of spot dimension's leader shoulder point.
SpotDimensionType
 The dimension style of this dimension.
See Also
SpotDimension Class
Autodesk.Revit.DB Namespace