Revit 2024 API
LightShape Members
The LightShape type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the LightShape derived object.
Dispose
Releases all resources used by the LightShape
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LightShape Class
Autodesk.Revit.DB.Lighting Namespace