Revit 2024 API
SpatialElementGeometryResults Members
The SpatialElementGeometryResults type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the SpatialElementGeometryResults
GetBoundaryFaceInfo
 Query the spatial element boundary face information with the given face.
GetGeometry
 The solid from the spatial element.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace