Revit 2024 API
AssetPropertyTime Members
The AssetPropertyTime type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
Get the value of the property
See Also
AssetPropertyTime Class
Autodesk.Revit.DB.Visual Namespace