Revit 2024 API
FilterElementIdRule Members
The FilterElementIdRule type exposes the following members.
Constructors
Name | Description
FilterElementIdRule
 Constructs an instance of FilterElementIdRule.
Methods
Name | Description
UsesLevelFiltering
 This function checks if a parameter uses level filtering.
Properties
Name | Description
RuleValue
 The user-supplied value against which values from a Revit document will be tested.
See Also
FilterElementIdRule Class
Autodesk.Revit.DB Namespace