Revit 2024 API
PostEventArgs Members
The PostEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Status
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
See Also
PostEventArgs Class
Autodesk.Revit.DB.Events Namespace