Revit 2024 API
ConnectionValidationInfo Members
The ConnectionValidationInfo type exposes the following members.
Constructors
Name | Description
ConnectionValidationInfo
 Constructor.
Methods
Name | Description
Dispose
Releases all resources used by the ConnectionValidationInfo
GetWarning
 Access specific warning number of warnings generated by reload.
IsValidWarningIndex
 Validate warning index.
ManyWarnings
 Returns number of warnings generated by reload.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace