Revit 2024 API
ExportLineweightInfo Members
The ExportLineweightInfo type exposes the following members.
Constructors
Name | Description
ExportLineweightInfo()
 Constructs a new default ExportLineweightInfo.
ExportLineweightInfo(String)
 Constructs a new ExportLineweightInfo using the destination line weight name as input.
ExportLineweightInfo(ExportLineweightInfo)
 Constructs a new copy of the input ExportLineweightInfo object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportLineweightInfo
Properties
Name | Description
DestinationLineweightName
 The destination lineweight name (the name of the line weight in the exported format)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportLineweightInfo Class
Autodesk.Revit.DB Namespace