Revit 2024 API
PolymeshTopology Members
The PolymeshTopology type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PolymeshTopology
GetFacet
 Returns a definition of one facet
GetFacets
 Returns a definitions of all facets of the polymesh
GetNormal
 Returns a normal vector at the given index
GetNormals
 Returns all normals assigned to the polymesh
GetPoint
 Returns one point at the given index.
GetPoints
 Returns all points of the polymesh.
GetUV
 Returns one UV coordinate at the given index.
GetUVs
 Returns all UV coordinates assigned to the polymesh
Properties
Name | Description
DistributionOfNormals
 Indicates the distribution of normal vectors along the tessellated polymesh surface.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberOfFacets
 The number of facet in the polymesh.
NumberOfNormals
 The number of normals associated with the polymesh
NumberOfPoints
 The number of points in the polymesh
NumberOfUVs
 The number of UV coordinates available for the polymesh.
See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace