Revit 2024 API
SketchedStairsCurveData Members
The SketchedStairsCurveData type exposes the following members.
Constructors
Name | Description
SketchedStairsCurveData
 Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.
Methods
Name | Description
Dispose
Releases all resources used by the SketchedStairsCurveData
GetCurve
 Get a copy of the curve that is formed along this boundary.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace