Revit 2024 API
ComboBoxMember Members
The ComboBoxMember type exposes the following members.
Methods
Name | Description
Properties
Name | Description
GroupName
The group to which the ComboBoxMember is assigned.
Image
The image shown on the ComboBoxMember.
See Also
ComboBoxMember Class
Autodesk.Revit.UI Namespace