Revit 2024 API
TransferredProjectStandardsEventArgs Members
The TransferredProjectStandardsEventArgs type exposes the following members.
Methods
Name | Description
GetSelectedExternalItems
 Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog.
Properties
Name | Description
SourceDocument
 Source document.
TargetDocument
 Target document.
See Also
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace