Revit 2024 API
Settings Members
The Settings type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Categories
Retrieves an object that provides access to all the categories contained in the Autodesk Revit application and project.
ElectricalSetting
 Retrieves an object that provides access to all the electrical settings include voltage type, distribution system type, demand factor, wire type in the Autodesk Revit application and project.
TilePatterns
 Retrieves an object that provides access to the TilePattern objects in the document.
See Also
Settings Class
Autodesk.Revit.DB Namespace