Revit 2024 API
StructuralSectionSigmaProfileWithLips Members
The StructuralSectionSigmaProfileWithLips type exposes the following members.
Constructors
Name | Description
StructuralSectionSigmaProfileWithLips
 Creates a new instance of Structural Section Sigma Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BendWidth
 Bend segment width.
LipLength
 Lip segment length.
MiddleBendLength
 Middle Bend segment length.
TopBendLength
 Top Bend segment length.
See Also
StructuralSectionSigmaProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace