Revit 2024 API
BasicLossFactor Members
The BasicLossFactor type exposes the following members.
Constructors
Name | Description
BasicLossFactor()
 Creates a basic loss factor object with no loss.
BasicLossFactor(Double)
 Creates a basic loss factor object with the given value.
BasicLossFactor(BasicLossFactor)
 Creates a copy of the given basic loss factor object
Methods
Name | Description
Properties
Name | Description
LossFactor
 The loss factor.
See Also
BasicLossFactor Class
Autodesk.Revit.DB.Lighting Namespace