Revit 2024 API
StructuralSectionGeneralF Members
The StructuralSectionGeneralF type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralF
 Creates a new instance of Structural Section Flat Bar.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionGeneralF Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace