Revit 2024 API
ReinforcementData Members
The ReinforcementData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ReinforcementData
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ReinforcementData Class
Autodesk.Revit.DB.Structure Namespace