Revit 2024 API
ITemporaryGraphicsHandler Members
The ITemporaryGraphicsHandler type exposes the following members.
Methods
Name | Description
OnClick
 Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager.
See Also
ITemporaryGraphicsHandler Interface
Autodesk.Revit.UI Namespace