Revit 2024 API
StructuralSectionGeneralR Members
The StructuralSectionGeneralR type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralR
 Creates a new instance of Structural Section Pipe.
Methods
Name | Description
Properties
Name | Description
WallDesignThickness
 Represents wall design thickness of rectangle.
WallNominalThickness
 Represents wall nominal thickness of rectangle.
See Also
StructuralSectionGeneralR Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace