Revit 2024 API
MechanicalFitting Members
The MechanicalFitting type exposes the following members.
Methods
Name | Description
Properties
Name | Description
PartType
The part type of the mechanical fitting.
See Also
MechanicalFitting Class
Autodesk.Revit.DB.Mechanical Namespace