Revit 2024 API
KeynoteTable Members
The KeynoteTable type exposes the following members.
Methods
Name | Description
GetKeynoteTable
 Gets the KeynoteTable from a Revit document.
Properties
Name | Description
See Also
KeynoteTable Class
Autodesk.Revit.DB Namespace