Revit 2024 API
RevitServerInternalException Members
The RevitServerInternalException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerInternalException Class
Autodesk.Revit.Exceptions Namespace