Revit 2024 API
AnalyticalNodeData Members
The AnalyticalNodeData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the AnalyticalNodeData
GetAnalyticalNodeData
 Returns AnalyticalNodeData associated with this element, if it exists.
GetConnectionStatus
 Returns the Connection Status for this Analytical Node.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace