Revit 2024 API
AnalysisDisplayLegend Members
The AnalysisDisplayLegend type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Height
 The height, in sheet size, of the legend's rectangle
See Also
AnalysisDisplayLegend Class
Autodesk.Revit.DB.Analysis Namespace