Revit 2024 API
TrussMemberInfo Members
The TrussMemberInfo type exposes the following members.
Constructors
Name | Description
TrussMemberInfo
For Internal Use Only.
Methods
Name | Description
Properties
Name | Description
hostTrussId
The host truss' ElementId of the member.
lockedToTruss
Whether the member is locked to the host truss.
memberTypeKey
Kind of the member in the truss.
See Also
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace