Revit 2024 API
GridNode Members
The GridNode type exposes the following members.
Constructors
Name | Description
GridNode
Initializes a new instance of the GridNode class
Methods
Name | Description
Properties
Name | Description
UIndex
The node's index along the U axis.
VIndex
The node's index along the V axis.
See Also
GridNode Structure
Autodesk.Revit.DB Namespace