Revit 2024 API
DefinitionBindingMap Members
The DefinitionBindingMap type exposes the following members.
Constructors
Name | Description
DefinitionBindingMap
Initializes a new instance of the DefinitionBindingMap class
Methods
Name | Description
Clear
Removes every binding from the map, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the map.
GetEnumerator
Retrieve a forward moving iterator to the map.
Insert
ReverseIterator
Retrieve a backward moving iterator to the map.
Properties
Name | Description
IsEmpty
Test to see if the map is empty.
Item
Size
Returns the number of bindings that are in the map.
See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace