Revit 2024 API
Options Members
The Options type exposes the following members.
Constructors
Name | Description
Options()
Creates a default Options object.
Options(Options)
Copy constructor.
Methods
Name | Description
Properties
Name | Description
ComputeReferences
Determines whether or not references to geometric objects are computed.
DetailLevel
The detail level for the geometry extracted with these options.
IncludeNonVisibleObjects
Whether to extract element geometry objects not set as Visible. The default is false.
View
The view used for geometry extraction.
See Also
Options Class
Autodesk.Revit.DB Namespace