Revit 2024 API
WorksharingUtils Members
The WorksharingUtils type exposes the following members.
Methods
Name | Description
CheckoutElements(Document, ICollection<ElementId>)
 Obtains ownership for the current user of as many specified elements as possible.
CheckoutElements(Document, ISet<ElementId>, TransactWithCentralOptions)
 Obtains ownership for the current user of as many specified elements as possible.
CheckoutWorksets(Document, ICollection<WorksetId>)
 Obtains ownership for the current user of as many specified worksets as possible.
CheckoutWorksets(Document, ISet<WorksetId>, TransactWithCentralOptions)
 Obtains ownership for the current user of as many specified worksets as possible.
CreateNewLocal
 Takes a path to a central model and copies the model into a new local file for the current user.
Dispose
Releases all resources used by the WorksharingUtils
GetCheckoutStatus(Document, ElementId)
 Gets the ownership status of an element.
GetCheckoutStatus(Document, ElementId, String)
 Gets the ownership status and outputs the owner of an element.
GetModelUpdatesStatus
 Gets the status of a single element in the central model.
GetUserWorksetInfo
 Gets information about user worksets in a workshared model file, without fully opening the file.
GetWorksharingTooltipInfo
 Gets worksharing information about an element to display in an in-canvas tooltip.
RelinquishOwnership
 Relinquishes ownership by the current user of as many specified elements and worksets as possible, and grants element ownership requested by other users on a first-come, first-served basis.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
WorksharingUtils Class
Autodesk.Revit.DB Namespace