Revit 2024 API
CorruptModelException Members
The CorruptModelException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
CorruptModelException Class
Autodesk.Revit.Exceptions Namespace