Revit 2024 API
ElectricalEquipment Members
The ElectricalEquipment type exposes the following members.
Methods
Name | Description
GetCircuitNamingSchemeType
 Gets enumerated type of the circuit naming scheme used with Electrical Equipment.
IsValidCircuitNamingSchemeId
 Verifies that the circuit naming scheme id can be used with Electrical Equipment.
IsValidDistributionSystem
 Verifies that the Distribution System can be assigned to the Electrical Equipment.
SetCircuitNamingSchemeType
 Sets the circuit naming scheme for Electrical Equipment.
Properties
Name | Description
CircuitNamingSchemeId
 The CircuitNamingSchemeId used in the Electrical Equipment. The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.
DistributionSystem
 get or set the Distribution System for the Electrical Equipment.
IsSwitchboard
 The electrical equipment is a switchboard or not. This property returns true if the electrical equipment is a switchboard.
MaxNumberOfCircuits
 The maximum number of circuits for switchboard. The quantity of circuits can be assigned to switchboard through breaker.
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace