Revit 2024 API
GenericZoneDomainData Members
The GenericZoneDomainData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the GenericZoneDomainData
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
GenericZoneDomainData Class
Autodesk.Revit.DB.Analysis Namespace