Revit 2024 API
IDuctFittingAndAccessoryPressureDropServer Members
The IDuctFittingAndAccessoryPressureDropServer type exposes the following members.
Methods
Name | Description
Calculate
 Calculate the duct fitting and duct accessory coefficient.
GetDataSchema
 Obtains the schema of the ESEntity.
IsApplicable
 Check if the server is applicable for the duct fitting or duct accessory.
See Also
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace