Revit 2024 API
SpaceFilter Members
The SpaceFilter type exposes the following members.
Constructors
Name | Description
SpaceFilter
 Constructs a filter which matches only spaces.
Methods
Name | Description
Properties
Name | Description
See Also
SpaceFilter Class
Autodesk.Revit.DB.Mechanical Namespace