Revit 2024 API
MEPSection Members
The MEPSection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the MEPSection
GetCoefficient
 Gets the loss coefficient for the specified element id in this section.
GetElementIds
 Gets all element ids that are contained in the section.
GetPressureDrop
 Gets the pressure drop for the specified element id in this section.
GetSegmentLength
 Get the length for the specified segment id in this section.
IsMain
 Check whether the type of fitting in this section is main.
Properties
Name | Description
FixtureUnit
 The fixture unit of the section.
Flow
 The flow of the section.
Friction
 The friction of the section.
FrictionFactor
 The friction factor of the section.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Number
 The Section number.
ReynoldsNumber
 The Reynolds number of the section.
Roughness
 The roughness of the section.
TotalCoefficient
 The loss coefficient of the section.
TotalCurveLength
 The total length of all segments in the section.
TotalPressureLoss
 The total pressure loss of the section.
Velocity
 The velocity of the section.
VelocityPressure
 The velocity pressure of the section.
See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace