Revit 2024 API
CurveElementFilter Members
The CurveElementFilter type exposes the following members.
Constructors
Name | Description
CurveElementFilter(CurveElementType)
 Constructs a new instance of a filter to match specific types of curve elements.
CurveElementFilter(CurveElementType, Boolean)
 Constructs a new instance of a filter to match specific types of curve elements, with the option to match all curves which are not of the given curve type.
Methods
Name | Description
Properties
Name | Description
CurveElementType
 The curve element type.
See Also
CurveElementFilter Class
Autodesk.Revit.DB Namespace