Revit 2024 API
ComponentRepeater Members
The ComponentRepeater type exposes the following members.
Methods
Name | Description
CanElementBeRepeated
 Determines whether an element can be repeated using the RepeatElements method.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
IsTypeValidForRepeater
 Determines whether given family type can be used as the default type for the repeater.
RemoveRepeaters
 Removes component repeaters from the document, but leaves the individual repeated components in their respective locations and hosted on their original hosts.
RepeatElements
 Repeats a set of adaptive component hosted on one or more repeating references.
Properties
Name | Description
DefaultFamilyType
 The default family type for the component repeater.
DimensionCount
 The dimension count of the component repeater.
See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace