Revit 2024 API
RebarShapeConstraintCircumference Members
The RebarShapeConstraintCircumference type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintCircumference
 Create a circumference constraint.
Methods
Name | Description
Properties
Name | Description
ArcReferenceType
 The choice of rule for measuring the diameter.
See Also
RebarShapeConstraintCircumference Class
Autodesk.Revit.DB.Structure Namespace