Revit 2024 API
ParameterElement Members
The ParameterElement type exposes the following members.
Methods
Name | Description
GetDefinition
 Get the definition representing this parameter element.
Properties
Name | Description
See Also
ParameterElement Class
Autodesk.Revit.DB Namespace