Revit 2024 API
InternalOrigin Members
The InternalOrigin type exposes the following members.
Methods
Name | Description
Get
 Gets the internal origin for the document.
Properties
Name | Description
Position
 The position of the InternalOrigin.
SharedPosition
 The position of the InternalOrigin relative to the active ProjectLocation set for the document.
See Also
InternalOrigin Class
Autodesk.Revit.DB Namespace