Revit 2024 API
VertexPosition Properties
The VertexPosition type exposes the following members.
Properties
Name | Description
Position
 The vertex's position.
See Also
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace