Revit 2024 API
VisibleInViewFilter Members
The VisibleInViewFilter type exposes the following members.
Constructors
Name | Description
VisibleInViewFilter(Document, ElementId)
 Constructs a new instance of a VisibleInViewFilter.
VisibleInViewFilter(Document, ElementId, Boolean)
 Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements.
Methods
Name | Description
Properties
Name | Description
See Also
VisibleInViewFilter Class
Autodesk.Revit.DB Namespace