Revit 2024 API
PolymeshFacet Members
The PolymeshFacet type exposes the following members.
Constructors
Name | Description
PolymeshFacet
 Creates a PolymeshFacet with the supplied vertices.
Methods
Name | Description
GetVertices
 Returns the three vertices that define this facet
ToString
 Returns formatted string showing (V1, V2, V3) with values formatted as regular integers
 (Overrides Object.ToString().)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
V1
 The first vertex of the facet
V2
 The second vertex of the facet
V3
 The third vertex of the facet
See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace