Revit 2024 API
FormArray Members
The FormArray type exposes the following members.
Constructors
Name | Description
FormArray
Initializes a new instance of the FormArray class
Methods
Name | Description
Append
Clear
Removes every form from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a form at a specified index within the array.
Size
Returns the number of forms that are in the array.
See Also
FormArray Class
Autodesk.Revit.DB Namespace