Revit 2024 API
NotTransmittedModelException Members
The NotTransmittedModelException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
NotTransmittedModelException Class
Autodesk.Revit.Exceptions Namespace