Revit 2024 API
WireTypeSet Members
The WireTypeSet type exposes the following members.
Constructors
Name | Description
WireTypeSet
Initializes a new instance of the WireTypeSet class
Methods
Name | Description
Clear
Removes every wire type from the set, rendering it empty.
Contains
Tests for the existence of a wire type within the set.
Erase
Removes a specified wire type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified wire type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of wire types that are in the set.
See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace