Revit 2024 API
ElementBinding Members
The ElementBinding type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Categories
Retrieve or set the categories to which a parameter definition will be bound.
See Also
ElementBinding Class
Autodesk.Revit.DB Namespace