Revit 2024 API
PolyLine Members
The PolyLine type exposes the following members.
Methods
Name | Description
Clone
Returns a copy of this polyline.
Create
Creates a polyline with coordinate points provided.
Evaluate
Evaluates a parameter on the polyline.
GetCoordinate
Gets the coordinate point of the specified index.
GetCoordinates
Gets the coordinate points of the polyline.
GetOutline
Gets the outline of the polyline.
GetTransformed
Gets the copy of the polyline which is applied the specified transformation.
Properties
Name | Description
NumberOfCoordinates
Gets the number of the coordinate points.
See Also
PolyLine Class
Autodesk.Revit.DB Namespace