Revit 2024 API
IRevisionsOnSheetUIServer Members
The IRevisionsOnSheetUIServer type exposes the following members.
Methods
Name | Description
ShowDialog
 Shows dialog on managing RevisionsOnSheetUI.
See Also
IRevisionsOnSheetUIServer Interface
Autodesk.Revit.UI Namespace