Revit 2024 API
SiteSubRegion Members
The SiteSubRegion type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>) |  Obsolete.
 Creates a new SiteSubRegion element and adds it to the document.
Create(Document, IList<CurveLoop>, ElementId) |  Obsolete.
 Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
Dispose
Releases all resources used by the SiteSubRegion
GetBoundary
 Gets the boundary of current subregion.
IsValidBoundary
 Identifies whether the given curve loops compose a valid boundary.
SetBoundary |  Obsolete.
 Set the given curve loops as the boundary of an existing SiteSubRegion.
Properties
Name | Description
HostId
 The element id of the topography surface hosting this SiteSubRegion.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TopographySurface
 The TopographySurface element which this SiteSubRegion represents.
See Also
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace