Revit 2024 API
ExternalResourceLoadContent Methods
The ExternalResourceLoadContent type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExternalResourceLoadContent Class
Autodesk.Revit.DB Namespace