Revit 2024 API
FilterIntegerRule Members
The FilterIntegerRule type exposes the following members.
Constructors
Name | Description
FilterIntegerRule
 Constructs an instance of FilterIntegerRule.
Methods
Name | Description
Properties
Name | Description
RuleValue
 The user-supplied value against which values from a Revit document will be tested.
See Also
FilterIntegerRule Class
Autodesk.Revit.DB Namespace