Revit 2024 API
AreaTag Members
The AreaTag type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Area
The area that the tag is associated with.
AreaTagType
The tag type.
See Also
AreaTag Class
Autodesk.Revit.DB Namespace