Revit 2024 API
FilteredElementIterator Members
The FilteredElementIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FilteredElementIterator
GetCurrent
 The current element found by the iterator.
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the iterator to the next element passing the filter.
Reset
 Resets the iterator to the beginning.
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FilteredElementIterator Class
Autodesk.Revit.DB Namespace