Revit 2024 API
SpatialElement Members
The SpatialElement type exposes the following members.
Methods
Name | Description
GetBoundarySegments
Returns the boundary segments.
GetSpatialElementDomainData
 Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data.
Properties
Name | Description
Area
The area.
Level
Gets the level of the room.
Location
The location of the element.
 (Overrides Element.Location.)
Name
A human readable name for the Element.
 (Overrides Element.Name.)
Number
The number.
Perimeter
The perimeter.
SpatialElementType
 The spatial element type.
See Also
SpatialElement Class
Autodesk.Revit.DB Namespace