Revit 2024 API
FunctionId Members
The FunctionId type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
Properties
Name | Description
File
The name of the file including the function throwing an exception.
Function
The name of the function throwing an exception.
Line
The line number of the function throwing an exception.
See Also
FunctionId Class
Autodesk.Revit.Exceptions Namespace