Revit 2024 API
ElementCategoryFilter Members
The ElementCategoryFilter type exposes the following members.
Constructors
Name | Description
ElementCategoryFilter(BuiltInCategory)
 Constructs a new instance of a filter to match elements by category.
ElementCategoryFilter(ElementId)
 Constructs a new instance of a filter to match elements by category.
ElementCategoryFilter(BuiltInCategory, Boolean)
 Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category.
ElementCategoryFilter(ElementId, Boolean)
 Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category.
Methods
Name | Description
Properties
Name | Description
CategoryId
 The category id.
See Also
ElementCategoryFilter Class
Autodesk.Revit.DB Namespace