Revit 2024 API
IFCGuidKey Members
The IFCGuidKey type exposes the following members.
Constructors
Name | Description
IFCGuidKey(String)
 Constructs a new IFCHybridGuid
IFCGuidKey(IFCGuidKey)
 IFCGuidKey can be used in managed code as well as unmanaged.
Methods
Name | Description
Dispose
Releases all resources used by the IFCGuidKey
Equals
 Determines whether this IFCGuidKey is equal to another.
 (Overrides Object.Equals(Object).)
GetHashCode
 Returns the hash code for this IFCGuidKey
 (Overrides Object.GetHashCode().)
Properties
Name | Description
IFCGlobalId
 IFC GlobalId for map.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace