Revit 2024 API
DirectShapeReferenceOptions Members
The DirectShapeReferenceOptions type exposes the following members.
Constructors
Name | Description
DirectShapeReferenceOptions()
 Constructs a new DirectShapeRefOptions instance with default settings.
DirectShapeReferenceOptions(DirectShapeReferenceOptions)
 Constructs a new copy of the input DirectShapeRefOptions object.
Methods
Name | Description
Dispose
Releases all resources used by the DirectShapeReferenceOptions
GetExternalGeometryId
 Retrieves the ExternalGeometryId associated with the reference object.
IsValidExternalGeometryId
 Validates that the input ExternalGeometryId can be assigned to a direct shape reference.
IsValidReferenceName
 Validates that the input name can be assigned to a direct shape reference.
SetExternalGeometryId
 Sets the ExternalGeometryId associated with the reference object. The ID must be non-empty.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters.
See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace