Revit 2024 API
IFCFileWriteOptions Methods
The IFCFileWriteOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace