Revit 2024 API
ViewFamilyType Members
The ViewFamilyType type exposes the following members.
Methods
Name | Description
IsValidDefaultTemplate
 Verifies that the input can be used as a default template for this view type.
Properties
Name | Description
DefaultTemplateId
 The default template id assigned to this view type.
PlanViewDirection
 The PlanViewDirection of this view.
ViewFamily
 The ViewFamily for this view type.
See Also
ViewFamilyType Class
Autodesk.Revit.DB Namespace