Revit 2024 API
CylindricalSurface Members
The CylindricalSurface type exposes the following members.
Methods
Name | Description
Create
 Construct a cylindrical surface defined by a local coordinate system and a radius.
GetFrameOfReference
 Returns frame of reference associated with this CylindricalSurface.
Properties
Name | Description
Axis
 Axis of the cylinder. This is the Z axis of the local coordinate system associated with this cylinder.
Origin
 Center of the circle that defines the base of the cylinder. This is the origin of the local coordinate system associated with this cylinder.
Radius
 Radius of the circle that defines the base of this cylinder.
XDir
 X axis of the local coordinate system associated with this cylinder.
YDir
 Y axis of the local coordinate system associated with this cylinder.
See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace