Revit 2024 API
ElementIsElementTypeFilter Members
The ElementIsElementTypeFilter type exposes the following members.
Constructors
Name | Description
ElementIsElementTypeFilter()
 Constructs a new instance of a filter to match only ElementTypes.
ElementIsElementTypeFilter(Boolean)
 Constructs a new instance of a filter to match only ElementTypes, with the option to match all elements which are not ElementTypes.
Methods
Name | Description
Properties
Name | Description
See Also
ElementIsElementTypeFilter Class
Autodesk.Revit.DB Namespace