Revit 2024 API
ConicalSurface Members
The ConicalSurface type exposes the following members.
Methods
Name | Description
Create
 Creates a conical surface defined by a local reference frame and a half angle.
GetFrameOfReference
 Returns frame of reference associated with this ConicalSurface.
IsValidConeAngle
 Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
Properties
Name | Description
Axis
 Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.
HalfAngle
 Cone angle.
Origin
 Apex of the cone. This is the origin of the local coordinate system associated with this cone.
XDir
 X axis of the local coordinate system associated with this cone.
YDir
 X axis of the local coordinate system associated with this cone.
See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace