Revit 2024 API
GenericForm Members
The GenericForm type exposes the following members.
Methods
Name | Description
GetVisibility
Gets the visibility for the generic form.
SetVisibility
Sets the visibility for the generic form.
Properties
Name | Description
IsSolid
Identifies if the GenericForm is a solid or a void element.
Name
Get and Set the Name property
 (Overrides Element.Name.)
Subcategory
The subcategory.
Visible
The visibility of the GenericForm.
See Also
GenericForm Class
Autodesk.Revit.DB Namespace