Revit 2024 API
InCanvasControlData Methods
The InCanvasControlData type exposes the following members.
Methods
Name | Description
Dispose
See Also
InCanvasControlData Class
Autodesk.Revit.DB Namespace