Revit 2024 API
MessageBoxData Members
The MessageBoxData type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DialogType
 An integer that describes the standard windows type of the dialog box.
Message
 The message that has been displayed in the dialog box.
See Also
MessageBoxData Class
Autodesk.Revit.UI.Events Namespace