Revit 2024 API
ClassificationEntry Members
The ClassificationEntry type exposes the following members.
Constructors
Name | Description
ClassificationEntry
 Constructs a ClassificationEntry object
Methods
Name | Description
HasBadCategoryId
 Checks if the category id is Revit BuiltInCategory id.
HasBadLevel
 Checks if the level is an integer in range between 1 and 5 inclusive.
HasInvalidKey
 Checks if the key matches the level and parent key.
Properties
Name | Description
CategoryId
 The id of the category associated with this entry.
Description
 The description associated with this entry.
Level
 The entry level in the classification table. The expected range is between 1 and 5 inclusive.
See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace