Revit 2024 API
RebarHandleNameData Members
The RebarHandleNameData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarHandleNameData
GetCustomHandleTag
 Gets the handle tag for which we need to specify the name.
SetCustomHandleName
 Sets the name of the handle.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace