Revit 2024 API
WireSizeSet Members
The WireSizeSet type exposes the following members.
Constructors
Name | Description
WireSizeSet
Initializes a new instance of the WireSizeSet class
Methods
Name | Description
Clear
Removes every wire size from the set, rendering it empty.
Contains
Tests for the existence of a wire size within the set.
Erase
Removes a specified wire size from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified wire size into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of wire sizes that are in the set.
See Also
WireSizeSet Class
Autodesk.Revit.DB.Electrical Namespace