Revit 2024 API
RibbonButtonOptions Methods
The RibbonButtonOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace