Revit 2024 API
InCanvasControlData Members
The InCanvasControlData type exposes the following members.
Constructors
Name | Description
InCanvasControlData(String)
 Constructs an InCanvasControlData with specific values assigned.
InCanvasControlData(String, XYZ)
 Constructs an InCanvasControlData with specific values assigned.
Methods
Name | Description
Dispose
Releases all resources used by the InCanvasControlData
Properties
Name | Description
ImagePath
 The path to the image file to be used. This must be an absolute path to a location on disk.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Position
 The position of the in-canvas control in model coordinates.
See Also
InCanvasControlData Class
Autodesk.Revit.DB Namespace