Revit 2024 API
VertexPair Members
The VertexPair type exposes the following members.
Constructors
Name | Description
VertexPair
 Constructs a new VertexPair from a pair of indices in the curve loops.
Methods
Name | Description
Dispose
Releases all resources used by the VertexPair
Properties
Name | Description
First
 Identifies the first index of VertexPair.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Second
 Identifies the second index of VertexPair.
See Also
VertexPair Class
Autodesk.Revit.DB Namespace