Revit 2024 API
CategorySet Members
The CategorySet type exposes the following members.
Constructors
Name | Description
CategorySet
Initializes a new instance of the CategorySet class
Methods
Name | Description
Clear
Removes every item from the set, rendering it empty.
Contains
Tests for the existence of a category within the set.
Erase
Removes a specified category from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified category into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of categories that are in the set.
See Also
CategorySet Class
Autodesk.Revit.DB Namespace