Revit 2024 API
UIControlledApplication Members
The UIControlledApplication type exposes the following members.
Methods
Name | Description
CreateAddInCommandBinding
Creates a new AddInCommandBinding.
CreateRibbonPanel(String)
 Create a new RibbonPanel on the Add-Ins tab.
CreateRibbonPanel(String, String)
 Create a new RibbonPanel on the specified tab.
CreateRibbonPanel(Tab, String)
 Create a new RibbonPanel on the designated standard Revit tab.
CreateRibbonTab
 Creates a new tab on the Revit user interface.
GetDockablePane
Gets a DockablePane object by its ID.
GetRibbonPanels()
 Get all the custom Panels on Add-Ins tab of Revit.
GetRibbonPanels(String)
 Get all the custom Panels on a designated Revit tab.
GetRibbonPanels(Tab)
 Get all the custom Panels on a designated standard Revit tab.
LoadAddIn
Loads add-ins from the given manifest file.
LoadPackageContents
Loads add-ins from the given packageContents.xml file.
RegisterDockablePane
Adds a new dockable pane to the Revit user interface.
RemoveAddInCommandBinding
Removes an AddInCommandBinding.
Properties
Name | Description
ActiveAddInId
 Get current active external application or external command id.
ControlledApplication
Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
IsLateAddinLoading
 Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true.
IsViewerModeActive
 Determines if Revit session is in Viewer mode.
LoadedApplications
 Returns an array of successfully loaded external applications.
MainWindowHandle
Get the handle of the Revit main window.
ProductIsRS
 Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
Events
Name | Description
ApplicationClosing
 Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
DialogBoxShowing
 Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box.
DisplayingOptionsDialog
 Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
DockableFrameFocusChanged
 Subscribe to this event to be notified when a Revit GenericDockableFrame has gained focus or lost focus in the Revit user interface. This event is called only for API-created GenericDockableFrames.
DockableFrameVisibilityChanged
 Subscribe to this event to be notified when a Revit GenericDockableFrame has been shown or hidden in the Revit user interface. This event is called only for API-created GenericDockableFrames.
FabricationPartBrowserChanged
 Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
FormulaEditing
 Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.
Idling
 Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction.
SelectionChanged
 Subscribe to the SelectionChanged event to be notified after the selection was changed.
ThemeChanged
 Subscribe to the ThemeChanged event to be notified after the theme was changed.
TransferredProjectStandards
 Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized.
TransferringProjectStandards
 Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.
ViewActivated
 Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document.
ViewActivating
 Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document.
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace