Revit 2024 API
DirectShapeTypeOptions Members
The DirectShapeTypeOptions type exposes the following members.
Constructors
Name | Description
DirectShapeTypeOptions
 Constructs a new DirectShapeTypeOptions instance with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the DirectShapeTypeOptions
IsEqualTo
 Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same.
IsValid
 Determines whether a DirectShapeTypeOptions is internally consistent (valid).
Properties
Name | Description
AllowDuplicateNames
 Determines whether or not duplicate DirectShapeType names are allowed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace