Revit 2024 API
ModificationForbiddenException Members
The ModificationForbiddenException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ModificationForbiddenException Class
Autodesk.Revit.Exceptions Namespace