Revit 2024 API
VertexIndexPair Members
The VertexIndexPair type exposes the following members.
Constructors
Name | Description
VertexIndexPair
Initializes a new instance of the VertexIndexPair class
Methods
Name | Description
Properties
Name | Description
Bottom
The index of the vertex pair from the bottom profile.
Top
The index of the vertex pair from the top profile.
See Also
VertexIndexPair Class
Autodesk.Revit.DB Namespace