Revit 2024 API
StructuralConnectionApprovalType Members
The StructuralConnectionApprovalType type exposes the following members.
Methods
Name | Description
Create
 Creates a new StructuralConnectionApprovalType.
GetAllStructuralConnectionApprovalTypes
 Collects the ids of all StructuralConnectionApprovalTypes in the document.
IsValidApprovalTypeName
 Verifies if the provided approval name is unique in the document.
Properties
Name | Description
See Also
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace