Revit 2024 API
AnalyticalOpening Members
The AnalyticalOpening type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of an Analytical Opening within the project.
IsCurveLoopValidForAnalyticalOpening
 Checks if curve loop is valid for Analytical Opening.
Properties
Name | Description
PanelId
 ElementId of the AnalyticalPanel parent.
See Also
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace