Revit 2024 API
ConnectionValidationWarning Members
The ConnectionValidationWarning type exposes the following members.
Constructors
Name | Description
ConnectionValidationWarning
 Constructor.
Methods
Name | Description
Dispose
Releases all resources used by the ConnectionValidationWarning
GetParts
 Get ElementIds of affected parts.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Reason
 Enumeration for reason of warning.
Resolution
 Enumeration for resolution that was applied.
See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace