Revit 2024 API
IFCHybridImport Methods
The IFCHybridImport type exposes the following members.
Methods
Name | Description
CreateMap
Dispose
ImportElements
 Imports IFC Elements using non-open-source framework
See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace