Revit 2024 API
BIMExportOptions Members
The BIMExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BIMExportOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ViewId
 The element id of the 3D view to export. InvalidElementId by default.
See Also
BIMExportOptions Class
Autodesk.Revit.DB Namespace