Revit 2024 API
IFCLinkDocumentExportScope Members
The IFCLinkDocumentExportScope type exposes the following members.
Constructors
Name | Description
IFCLinkDocumentExportScope
 Instantiates a default IFCLinkDocumentExportScope object.
Methods
Name | Description
Dispose
Releases all resources used by the IFCLinkDocumentExportScope
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace