Revit 2024 API
CableTrayConduitBase Members
The CableTrayConduitBase type exposes the following members.
Methods
Name | Description
IsValidEndPoints
 Identifies if two end points are valid.
IsValidLevelId
 Identifies if a level id is valid.
IsWithFitting
 Return whether its cable tray/conduit type is with fitting
Properties
Name | Description
RunId
 The id of the run to which this element belongs.
See Also
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace