Revit 2024 API
DWGImportOptions Members
The DWGImportOptions type exposes the following members.
Constructors
Name | Description
DWGImportOptions()
 Constructs a new instance of DWGImportOptions with default values of all properties.
DWGImportOptions(DWGImportOptions)
 Constructs a new instance of DWGImportOptions as a copy of the import options.
Methods
Name | Description
GetLineWeights
 Gets array of line weights.
SetLineWeights
 Set array of line weights.
Properties
Name | Description
See Also
DWGImportOptions Class
Autodesk.Revit.DB Namespace