Revit 2024 API
Mesh Members
The Mesh type exposes the following members.
Methods
Name | Description
ComputeSurfaceArea
 Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh.
GetNormal
 Returns a normal unit vector at the given index.
GetNormals
 Returns all normals assigned to the mesh.
Properties
Name | Description
DistributionOfNormals
 Indicates the distribution of normal vectors along the tessellated mesh surface.
IsClosed
 Indicates whether the mesh is closed.
MaterialElementId
Element ID of the material from which this mesh is composed.
NumberOfNormals
 The number of normals associated with the mesh.
NumTriangles
The number of triangles that the mesh contains.
Transformed
Transforms this mesh and returns the result.
Triangle
Retrieves a specific triangle.
Vertices
Retrieves all vertices used to define this mesh. Intended for indexed access.
See Also
Mesh Class
Autodesk.Revit.DB Namespace