Revit 2024 API
TransactionAttribute Members
The TransactionAttribute type exposes the following members.
Constructors
Name | Description
TransactionAttribute
Constructs a new TransactionAttribute.
Methods
Name | Description
Properties
Name | Description
Mode
Transaction mode.
See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace