Revit 2024 API
IFCFile Members
The IFCFile type exposes the following members.
Methods
Name | Description
Close
 Close the IFC file.
Create
 Creates an IFC file for exporting.
CreateHeaderInstance
 Creates an IFC header instance in the file model.
CreateInstance
 Creates an IFC instance in the file model.
CreateStyle(ExporterIFC, IFCAnyHandle)
 Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
CreateStyle(ExporterIFC, IFCAnyHandle, Color, ElementId)
 Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
Dispose
Releases all resources used by the IFCFile
GetInstanceCount
 Counts IFC instances of one particular type.
GetInstances
 Gets IFC instances of one particular type.
Read(IFCFileReadOptions)
 Reads content from a file of IFC format.
Read(IFCFileReadOptions, Int32, Int32)
 Reads content from a file of IFC format.
Write
 Writes content to a file of IFC format.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCFile Class
Autodesk.Revit.DB.IFC Namespace