Revit 2024 API
BaseArray Members
The BaseArray type exposes the following members.
Methods
Name | Description
GetCopiedMemberIds
Retrieves the copied member Ids of the Array.
GetOriginalMemberIds
Retrieves the original member Ids of the Array.
Properties
Name | Description
Label
The family parameter label of the BaseArray.
Name
Get and Set the Name property
 (Overrides Element.Name.)
NumMembers
Retrieves or changes the number of the arrayed members.
See Also
BaseArray Class
Autodesk.Revit.DB Namespace