Revit 2024 API
Construction Members
The Construction type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Id
Get the id of the Construction.
Name
Get the name of the Construction.
See Also
Construction Class
Autodesk.Revit.DB Namespace