Revit 2024 API
RevitServerModelNameBreaksConventionException Members
The RevitServerModelNameBreaksConventionException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerModelNameBreaksConventionException Class
Autodesk.Revit.Exceptions Namespace