Revit 2024 API
GroupType Members
The GroupType type exposes the following members.
Methods
Name | Description
GetAvailableAttachedDetailGroupTypeIds
 Returns the attached detail groups available for this element group type.
LoadFrom
 Replaces the group with the contents of the input file.
Properties
Name | Description
Groups
Retrieve a set of all the groups that have this type.
See Also
GroupType Class
Autodesk.Revit.DB Namespace