Revit 2024 API
IndexTriangle Members
The IndexTriangle type exposes the following members.
Constructors
Name | Description
IndexTriangle
 Constructs the triangle primitive.
Methods
Name | Description
GetSizeInShortInts
 Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Properties
Name | Description
Index0
 The index of the triangle's first vertex.
Index1
 The index of the triangle's second vertex.
Index2
 The index of the triangle's third vertex.
See Also
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace