Revit 2024 API
InapplicableDataException Members
The InapplicableDataException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
InapplicableDataException Class
Autodesk.Revit.Exceptions Namespace