Revit 2024 API
ElementFilter Members
The ElementFilter type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ElementFilter
PassesFilter(Element)
 Applies the filter to a given element.
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ElementFilter Class
Autodesk.Revit.DB Namespace