Revit 2024 API
Vertex Members
The Vertex type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the Vertex
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Vertex Class
Autodesk.Revit.DB.DirectContext3D Namespace