Revit 2024 API
StructuralSectionCSlopedFlange Members
The StructuralSectionCSlopedFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionCSlopedFlange
 Creates a new instance of Structural Section C Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing, in. (mm)
ClearWebHeight
 Detailing depth between the web toes of the fillets, in.(mm)
See Also
StructuralSectionCSlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace