Revit 2024 API
ColorSelectionDialog Members
The ColorSelectionDialog type exposes the following members.
Constructors
Name | Description
ColorSelectionDialog
 Default constructor.
Methods
Name | Description
Dispose
Releases all resources used by the ColorSelectionDialog
Show
 Shows the Revit Color dialog as a modal dialog.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginalColor
 The original color.
SelectedColor
 The new color selected by the user.
See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace