Revit 2024 API
PointRelativeToPoint Members
The PointRelativeToPoint type exposes the following members.
Methods
Name | Description
GetHostPointReference
Get a copy of the host point reference.
SetHostPointReference
Change the host point reference.
See Also
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace