Revit 2024 API
MacroManager Methods
The MacroManager type exposes the following members.
Methods
Name | Description
AddModule
 Adds a MacroModule to the application or document.
Contains
 Indicates the given module is a member of this collection.
Dispose
GetApplicationMacroSecurityOptions
 Gets the application macro security options.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetDocumentMacroSecurityOptions
 Gets the document macro security options.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetMacroManager(Application)
 Gets the Macro manager from the application.
GetMacroManager(Document)
 Gets the Macro manager from the document.
GetMacroManagerIterator
 Returns a Macro manager iterator that iterates through the collection.
IsDocLvlMacro
 Indicates current Macro is document level
RemoveModule
 Removes a MacroModule from the application or document.
SetApplicationMacroSecurityOptions
 Sets the application macro security options.
SetDocumentMacroSecurityOptions
 Sets the document macro security options.
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace