Revit 2024 API
Profile Members
The Profile type exposes the following members.
Methods
Name | Description
Clone
Returns a copy of this profile.
Properties
Name | Description
Curves
Retrieve the curves that make up the boundary of the profile.
Filled
Get or set whether the profile is filled.
Transformed
Transforms this profile and returns the result.
See Also
Profile Class
Autodesk.Revit.DB Namespace