Revit 2024 API
RebarInSystem Members
The RebarInSystem type exposes the following members.
Methods
Name | Description
CanApplyPresentationMode
 Checks if a presentation mode can be applied for this rebar in the given view.
CanEditIndividualBars
 Checks if individual bars can be moved, excluded or included.
ClearPresentationMode
 Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
DoesBarExistAtPosition
 Checks whether a bar is included at the specified position.
FindMatchingPredefinedPresentationMode
 Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetBarIndexFromReference
 Given a reference that represents a part of a bar, this method will return the bar index.
GetBarPositionTransform
 Return a transform representing the relative position of any individual bar in the set.
GetBendData
 Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves
 A chain of curves representing the centerline of the rebar.
GetDistributionPath
 The distribution path of a rebar set.
GetHookTypeId
 Get the id of the RebarHookType to be applied to the rebar.
GetHostId
 The element that contains the rebar.
GetMovedBarTransform
 Returns a transform representing the movement of the bar relative to its default position along the distribution path.
GetPresentationMode
 Gets the presentaion mode for this rebar set when displayed in the given view.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetTransformedCenterlineCurves
 A chain of curves representing the centerline of the rebar.
HasPresentationOverrides
 Identifies if this RebarInSystem has overridden default presentation settings for the given view.
IsBarHidden
 Identifies if a given bar in this rebar set is hidden in this view.
IsRebarInSection
 Identifies if this RebarInSystem is cut by the view plane of the given view.
IsUnobscuredInView
 Checks if this rebar element is shown unobscured in a view.
MoveBarInSet
 This method applies the transformation matrix to the rebar bar at the desired position in the rebar set. If the bar was already moved, the method will concatenate the transformation matrix with the existing movement.
ResetMovedBarTransform
 Reset the transformation representing the movement of the bar relative to its default position along the distribution path. The moved bar transform will be set to Identity.
SetBarHiddenStatus
 Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetBarIncluded
 Sets if the bar at the desired index is included or not.
SetPresentationMode
 Sets the presentation mode for this rebar set when displayed in the given view.
SetUnobscuredInView
 Sets RebarInSystem element to be shown unobscured in a view.
Properties
Name | Description
ArrayLength
 Identifies the distribution path length of rebar set.
BarsOnNormalSide
 Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal. For the current implementation of RebarInSystem, this property will always return true, but it is included in the RebarInSystem interface for consistency with the Rebar class.
LayoutRule
 Identifies the layout rule of rebar set.
MaxSpacing
 Identifies the maximum spacing between rebar in rebar set.
Normal
 A unit-length vector normal to the plane of the rebar
NumberOfBarPositions
 The number of bar positions available in the rebar.
Quantity
 Identifies the number of bars in rebar set.
RebarShapeId
 The RebarShape element that defines the shape of the rebar.
ScheduleMark
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
SystemId
 The Id of an AreaReinforcement or PathReinforcement element that owns this element.
TotalLength
 The length of an individual bar multiplied by Quantity.
Volume
 The volume of an individual bar multiplied by Quantity.
See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace