Revit 2024 API
PointLocationOnCurve Members
The PointLocationOnCurve type exposes the following members.
Constructors
Name | Description
PointLocationOnCurve
 Constructs a new instance of a class, with given or default values, to place a point on a curve.
Methods
Name | Description
Dispose
Releases all resources used by the PointLocationOnCurve
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MeasureFrom
 The location on the curve from which the measurement is taken.
MeasurementType
 The measurement type.
MeasurementValue
 The measurement value.
See Also
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace