Revit 2024 API
Fascia Members
The Fascia type exposes the following members.
Methods
Name | Description
AddSegment
Add segments to the fascia.
 (Overrides HostedSweep.AddSegment(Reference).)
Properties
Name | Description
FasciaType
Retrieves/set an object that represents the type of the Fascia.
See Also
Fascia Class
Autodesk.Revit.DB.Architecture Namespace