Revit 2024 API
ShapeImporter Members
The ShapeImporter type exposes the following members.
Constructors
Name | Description
ShapeImporter
 Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Methods
Name | Description
Convert
 Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose
Releases all resources used by the ShapeImporter
IsServiceAvailable
 Checks whether the data conversion service is available.
SetDefaultLengthUnit
 Sets the length unit to be used when the input is a unitless SAT file.
Properties
Name | Description
DefaultLengthUnit
 The length unit to be used if not specified when the input is a unitless SAT file.
InputFormat
 The format of the incoming data.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace