Revit 2024 API
TriangulatedSolidOrShell Members
The TriangulatedSolidOrShell type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TriangulatedSolidOrShell
GetShellComponent
 Returns the specified shell component of a solid or shell. Input componentIndex must lie between 0 and ShellComponentCount-1, inclusive. The returned TriangulatedShellComponent should not be modified by the caller.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShellComponentCount
 The number of TriangulatedShellComponents that this TriangulatedSolidOrShell contains.
See Also
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace