Revit 2024 API
SpatialElementDomainData Members
The SpatialElementDomainData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the SpatialElementDomainData
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SpatialElementDomainData Class
Autodesk.Revit.DB Namespace