Revit 2024 API
ReinforcementAbbreviationTag Methods
The ReinforcementAbbreviationTag type exposes the following members.
Methods
Name | Description
Dispose
See Also
ReinforcementAbbreviationTag Class
Autodesk.Revit.DB.Structure Namespace