Revit 2024 API
ElectricalAnalyticalLoadSet Members
The ElectricalAnalyticalLoadSet type exposes the following members.
Methods
Name | Description
Create
 Creates an electrical analytical load set.
GetLoadIds
 Gets Equipment Load ids in the LoadSet.
Properties
Name | Description
QuantityOnStandBy
 The number of Equipment Loads that are not operational at any time.
TotalQuantity
 The total count of the Equipment Loads in the LoadSet.
See Also
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace