Revit 2024 API
StructuralSectionCProfile Members
The StructuralSectionCProfile type exposes the following members.
Constructors
Name | Description
StructuralSectionCProfile
 Creates a new instance of Structural Section C Profile shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionCProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace