Revit 2024 API
ApplicationEntryPoint Members
The ApplicationEntryPoint type exposes the following members.
Constructors
Name | Description
ApplicationEntryPoint
Initializes a new instance of the ApplicationEntryPoint class
Methods
Name | Description
CreateRibbonPanel(String) |  (Overrides UIApplication.CreateRibbonPanel(String).)
CreateRibbonPanel(String, String) |  (Overrides UIApplication.CreateRibbonPanel(String, String).)
CreateRibbonPanel(Tab, String) |  (Overrides UIApplication.CreateRibbonPanel(Tab, String).)
CreateRibbonTab |  (Overrides UIApplication.CreateRibbonTab(String).)
FinishInitializationEO
 For Revit Macros internal use only.
GetRibbonPanels() |  (Overrides UIApplication.GetRibbonPanels().)
GetRibbonPanels(String) |  (Overrides UIApplication.GetRibbonPanels(String).)
GetRibbonPanels(Tab) |  (Overrides UIApplication.GetRibbonPanels(Tab).)
Initialize
 For Revit Macros internal use only.
OnShutdownEO
 For Revit Macros internal use only.
Properties
Name | Description
AddinFolder
 The full path to the Revit Macros module.
Events
Name | Description
See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace