Revit 2024 API
RadioButtonGroup Members
The RadioButtonGroup type exposes the following members.
Methods
Name | Description
AddItem
Adds a new ToggleButton to the RadioButtonGroup.
AddItems
Adds new ToggleButtons to the RadioButtonGroup.
GetItems
Gets the collection of ToggleButtons assigned to the RadioButtonGroup.
Properties
Name | Description
Current
Gets or sets the current checked ToggleButton of the RadioButtonGroup.
See Also
RadioButtonGroup Class
Autodesk.Revit.UI Namespace