Revit 2024 API
PointOnEdgeFaceIntersection Members
The PointOnEdgeFaceIntersection type exposes the following members.
Methods
Name | Description
GetEdgeReference
Get a copy of the edge or curve reference.
GetFaceReference
Get a copy of the face reference.
SetEdgeReference
Change the edge or curve reference.
SetFaceReference
Change the face reference.
Properties
Name | Description
OrientWithEdge
Whether to orient the ReferencePoint to the edge or the face.
See Also
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace