Revit 2024 API
ReinforcementRoundingManager Members
The ReinforcementRoundingManager type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ReinforcementRoundingManager
GetLengthUnitTypeId
 Gets the identifier of the length unit quantifying the reinforcement rounding values.
Properties
Name | Description
Element
 The owner of the reinforcement rounding overrides.
IsActiveOnElement
 Defines whether reinforcement rounding is activated for the particular element.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace