Revit 2024 API
IIFCImporterServer Members
The IIFCImporterServer type exposes the following members.
Methods
Name | Description
ImportIFC
 The method that Revit will invoke to perform an import from IFC.
See Also
IIFCImporterServer Interface
Autodesk.Revit.DB.IFC Namespace