Revit 2024 API
ConicalFace Members
The ConicalFace type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Axis
Axis of the surface.
HalfAngle
Half angle of the surface.
Origin
Origin of the surface.
Radius
Radii of the surface.
See Also
ConicalFace Class
Autodesk.Revit.DB Namespace