Revit 2024 API
AssetPropertyDoubleArray4d Members
The AssetPropertyDoubleArray4d type exposes the following members.
Methods
Name | Description
GetValueAsColor
 Gets the value property as a color.
GetValueAsDoubles
 Gets the value property as doubles.
IsValidValue(IList<Double>)
 Checks that the value is a valid value for this property.
IsValidValue(Color)
 Checks that the value is a valid value for this property.
SetValueAsColor
 Sets the value property as a color.
SetValueAsDoubles
 Sets the value of the property.
Properties
Name | Description
See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace