Revit 2024 API
ServerPath Members
The ServerPath type exposes the following members.
Constructors
Name | Description
ServerPath
 Constructs a ServerPath
Methods
Name | Description
Properties
Name | Description
See Also
ServerPath Class
Autodesk.Revit.DB Namespace