Revit 2024 API
IFCLegacyStairOrRamp Members
The IFCLegacyStairOrRamp type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCLegacyStairOrRamp
GetBoundaryLines
 Gets boundary lines.
GetLandingGeometries
 Gets the geometries of landings.
GetNumberOfRisers
 Gets the number of risers.
GetNumberOfTreads
 Gets the number of treads.
GetRunGeometries
 Gets the geometries of runs.
GetStringerGeometries
 Gets the geometries of stringers.
GetTreadsLength
 Gets the length of treads.
GetWalkLines
 Gets walk lines.
Properties
Name | Description
IsRamp
 True if it is a ramp, false if it is a stair.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RiserHeight
 The height of riser.
See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace