Revit 2024 API
WireType Members
The WireType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Conduit
 The conduit type of the wire type.
Insulation
 The insulation type.
IsInUse
 Indicates whether the wire type is in use.
MaxSize
 The max size of the wire type.
NeutralMultiplier
 The neutral multiplier type of the wire type.
NeutralRequired
 Whether or not the neutral point is required.
NeutralSize
 The maximum neutral size of the wire type.
TemperatureRating
 The temperature rating type of the wire type.
WireMaterial
 The material type of the wire type.
See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace