Revit 2024 API
ViewDrafting Members
The ViewDrafting type exposes the following members.
Methods
Name | Description
Create
 Creates a new ViewDrafting in the model.
Properties
Name | Description
See Also
ViewDrafting Class
Autodesk.Revit.DB Namespace