Revit 2024 API
PreDocEventArgs Members
The PreDocEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Document
 The document associated with the event.
See Also
PreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace