Revit 2024 API
SpatialElementDomainData Methods
The SpatialElementDomainData type exposes the following members.
Methods
Name | Description
Dispose
See Also
SpatialElementDomainData Class
Autodesk.Revit.DB Namespace