Revit 2024 API
TopographySurface Members
The TopographySurface type exposes the following members.
Methods
Name | Description
AddPoints |  Obsolete.
 Adds points to a topography surface.
ArePointsDistinct
 Identify whether the input points are distinct in XY location.
AsSiteSubRegion
 Obtains the subregion object represented by this element.
ChangePointElevation |  Obsolete.
 Changes the elevation value for a point.
ChangePointsElevation |  Obsolete.
 Changes the elevation value for points
ContainsPoint
 Identifies whether the given point exists in the topography surface.
Create(Document, IList<XYZ>) |  Obsolete.
 Creates a new topography surface element and adds it to the document.
Create(Document, IList<XYZ>, IList<PolymeshFacet>) |  Obsolete.
 Creates a new topography surface element from facets and adds it to the document.
DeletePoints |  Obsolete.
 Deletes points from a Topography surface.
FindPoints
 Filters and returns only the points of the topography surface which lie within the input bounding box.
GetBoundaryPoints
 Gets the points which are on the boundary of the topography surface.
GetHostedSubRegionIds
 Gets the ids of all subregion elements hosted on this topography surface.
GetInteriorPoints
 Gets all of the points that are not boundary points for the topography surface.
GetPoints
 Gets the points that define this topography surface.
IsBoundaryPoint
 Identifies whether the given point is an existing boundary point of the current topography surface.
IsValidFaceSet
 Identifies whether the facets can construct a valid topography surface.
IsValidRegion
 Identify whether the points can construct a valid region for a topography surface.
MovePoint |  Obsolete.
 Moves a point in a TopographySurface to a new designated location.
MovePoints |  Obsolete.
 Moves a collection of points in a topography surface by a designated vector.
Properties
Name | Description
ArePointsEditable
 Identifies whether the points of this topography surface can be edited independently. Topography surfaces created from external data will not allow editing of individual points.
AssociatedBuildingPadId
 The element id of the building pad which causes this topography surface to be formed.
IsAssociatedWithBuildingPad
 Identifies if this element represents a topography surface associated with a building pad.
IsSiteSubRegion
 Identifies if this element represents a subregion.
MaterialId
 The id of the material applied to this element.
See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace