Revit 2024 API
SpatialElementCalculationLocation Members
The SpatialElementCalculationLocation type exposes the following members.
Methods
Name | Description
Properties
Name | Description
MarkerPosition
 The position of the spatial element calculation location marker.
See Also
SpatialElementCalculationLocation Class
Autodesk.Revit.DB Namespace