Revit 2024 API
IndexLine Members
The IndexLine type exposes the following members.
Constructors
Name | Description
IndexLine
 Constructs the line segment primitive.
Methods
Name | Description
GetSizeInShortInts
 Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Properties
Name | Description
Index0
 The index of the line segment's first vertex.
Index1
 The index of the line segment's second vertex.
See Also
IndexLine Class
Autodesk.Revit.DB.DirectContext3D Namespace