Revit 2024 API
DefaultValueException Members
The DefaultValueException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
DefaultValueException Class
Autodesk.Revit.Exceptions Namespace