Revit 2024 API
StructuralSectionConcreteRectangleCut Members
The StructuralSectionConcreteRectangleCut type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteRectangleCut
 Creates a new instance of Structural Section Concrete Rectangle Cut shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BottomCutHeight
 Section height left Cut.
BottomCutWidth
 Section width left Cut.
TopCutHeight
 Section height right Cut.
TopCutWidth
 Section width right Cut.
See Also
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace