Revit 2024 API
FilterGlobalParameterAssociationRule Members
The FilterGlobalParameterAssociationRule type exposes the following members.
Constructors
Name | Description
FilterGlobalParameterAssociationRule
 Constructs an instance of FilterGlobalParameterAssociationRule.
Methods
Name | Description
Properties
Name | Description
RuleValue
 The user-supplied global parameter value against which values from a Revit document will be tested.
See Also
FilterGlobalParameterAssociationRule Class
Autodesk.Revit.DB Namespace