Revit 2024 API
ContentNode Members
The ContentNode type exposes the following members.
Methods
Name | Description
GetAsset
 Returns an an instance of an Asset object, which contains definitions of the content node.
GetTransform
 A transformation matrix associated with the node.
Properties
Name | Description
See Also
ContentNode Class
Autodesk.Revit.DB Namespace