Revit 2024 API
PrintSetup Members
The PrintSetup type exposes the following members.
Methods
Name | Description
Delete
Delete the current print setting, and make the In-Session setting as the current one.
Rename
Rename the current print setting with the specified name.
Revert
Revert the current print setting.
Save
Save the changes for the current print setting.
SaveAs
Save the current print setting to another print setting with the specified name.
Properties
Name | Description
CurrentPrintSetting
The current Print Setting of Print Setup.
InSession
The in-session Print Setting of Print Setup.
See Also
PrintSetup Class
Autodesk.Revit.DB Namespace