Revit 2024 API
ExportPatternInfo Members
The ExportPatternInfo type exposes the following members.
Constructors
Name | Description
ExportPatternInfo()
 Constructs a new default ExportPatternInfo.
ExportPatternInfo(String)
 Constructs a new ExportPatternInfo using the destination pattern name as input.
ExportPatternInfo(ExportPatternInfo)
 Constructs a new copy of the input ExportPatternInfo object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportPatternInfo
Properties
Name | Description
DestinationPatternName
 The destination pattern name (the name of the pattern in the exported format).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportPatternInfo Class
Autodesk.Revit.DB Namespace