Revit 2024 API
SpatialElementBoundaryOptions Methods
The SpatialElementBoundaryOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace