Revit 2024 API
DocumentPrintedEventArgs Members
The DocumentPrintedEventArgs type exposes the following members.
Methods
Name | Description
GetFailedViewElementIds
 Returns ElementIds of the views that that failed to print (if any).
GetPrintedViewElementIds
 Returns ElementIds of the views that printed successfully.
Properties
Name | Description
See Also
DocumentPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace