Revit 2024 API
EnergyAnalysisWindowType Members
The EnergyAnalysisWindowType type exposes the following members.
Methods
Name | Description
GetSolarHeatGainCoefficientsForSolarIndicientAngles
 Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type.
Properties
Name | Description
Description
 The description of the window type.
HeatTransferCoefficient
 The heat transfer coefficient value (U-value) of the window type.
SolarHeatGainCoefficient
 The solar heat gain coefficient (SHGC-value) for the window type.
Transmittance
 The visual light transmittance value (VLT-value) for the window type.
WindowTypeName
 The name of the window type.
See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace