Revit 2024 API
IFCLevelInfo Members
The IFCLevelInfo type exposes the following members.
Methods
Name | Description
Create
 Creates an IFCLevelInfo.
Dispose
Releases all resources used by the IFCLevelInfo
GetBuildingStorey
 Gets the IfcBuildingStorey handle.
GetLocalPlacement
 Gets the local placement.
GetRelatedElements
 Gets all building elements on this level.
GetRelatedProducts
 Gets all building products on this level.
Properties
Name | Description
DistanceToNextLevel
 The distance to the next story level.
Elevation
 The elevation of the level.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace