Revit 2024 API
FailureMessageKey Members
The FailureMessageKey type exposes the following members.
Constructors
Name | Description
FailureMessageKey
 Constructs a new FailureMessageKey with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the FailureMessageKey
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets the integer value of the id as hash code
 (Overrides Object.GetHashCode().)
IsEqual
 Checks it this key is equal to the other.
IsValid
 Checks if the failure message key is valid
Operators
Name | Description
Equality
Determines whether two FailureMessageKeys are the same.
Inequality
Determines whether two FailureMessageKeys are different.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FailureMessageKey Class
Autodesk.Revit.DB Namespace