Revit 2024 API
StructuralSectionIWelded Members
The StructuralSectionIWelded type exposes the following members.
Constructors
Name | Description
StructuralSectionIWelded
 Creates a new instance of Structural Section I Welded shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BottomFlangeThickness
 Bottom Flange Thickness.
BottomFlangeWidth
 Bottom Flange Width.
TopFlangeThickness
 Top Flange Thickness.
TopFlangeWidth
 Top Flange Width.
WebHeight
 Web Height.
WebThickness
 Web Thickness.
See Also
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace