Revit 2024 API
IControllableDropHandler Members
The IControllableDropHandler type exposes the following members.
Methods
Name | Description
CanExecute
 Implement this method to inform Revit whether the drop event can be executed onto the given view.
See Also
IControllableDropHandler Interface
Autodesk.Revit.UI Namespace