Revit 2024 API
UpdaterId Members
The UpdaterId type exposes the following members.
Constructors
Name | Description
UpdaterId
 creates an instance of UpdaterId for given AddInId and a given GUID value
Methods
Name | Description
Dispose
Releases all resources used by the UpdaterId
GetAddInId
 AddInId of the UpdaterId
GetGUID
 GUID value of the UpdaterId
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
UpdaterId Class
Autodesk.Revit.DB Namespace