Revit 2024 API
ColorFillScheme Members
The ColorFillScheme type exposes the following members.
Methods
Name | Description
AddEntry
 Adds new entry to the scheme.
AreEntriesConsistentWithScheme
 Checks whether the entries can be set to the scheme or not.
CanDefineByRange
 Checks whether the scheme entries can be explained by range.
CanRemoveEntry
 Checks whether entry can be removed from the scheme.
CanUpdateEntry
 Checks whether entry exists in the scheme and not the same as input one.
Duplicate
 Generates a copy of current scheme.
GetEntries
 Retrieves copies of all entries.
GetFormatOptions
 Returns the FormatOptions of the scheme.
GetSupportedParameterIds
 Retrieves collection of all parameters supported by the scheme.
IsEntryConsistentWithScheme
 Checks whether an entry can be added to the scheme or not.
IsValidParameterDefinitionId
 Checks whether the input parameter id can be applied to the scheme.
IsValidSchemeName
 Checks whether the name is valid for new generated scheme.
RemoveEntry
 Removes an entry whose parameter value is the same as the input from the scheme
SetEntries
 Update scheme entries in batch mode.
SetFormatOptions
 Sets the FormatOptions of the scheme.
SortEntries
 Sorts the scheme entries ascending.
UpdateEntry
 Updates the scheme entry with the same parameter value as the input entry.
Properties
Name | Description
AreaSchemeId
 Represents the id of AreaScheme of area plan views that this scheme could be applied to.
CategoryId
 Represents the element category that can be colored by this scheme.
IsByRange
 Represents if the parameter values in entries are treated as value range or not.
IsLinkedFilesIncluded
 Represent if the scheme includes entries whose parameter values are based on elements from linked files.
ParameterDefinition
 Represents the parameter of the elements that this scheme could be used to color.
StorageType
 Represents the type of parameter values stored in entries.
Title
 Represents the title displayed in ColorFillLegend.
See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace