Revit 2024 API
Sweep Members
The Sweep type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsTrajectorySegmentationEnabled
The trajectory segmentation option for the sweep.
MaxSegmentAngle
The maximum segment angle of the sweep in radians.
Path3d
The selected curves used for the sweep path.
PathSketch
The sketched path for the sweep.
ProfileSketch
The profile sketch of the sweep.
ProfileSymbol
The family symbol profile details for the sweep.
See Also
Sweep Class
Autodesk.Revit.DB Namespace