Revit 2024 API
StructuralSectionConcreteRound Members
The StructuralSectionConcreteRound type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteRound
 Creates a new instance of Structural Section Concrete Round shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionConcreteRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace