Revit 2024 API
FailureDefinitionRegistry Members
The FailureDefinitionRegistry type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FailureDefinitionRegistry
FindFailureDefinition
 Finds a specific FailureDefinition by a given FailureDefinitionId.
ListAllFailureDefinitions
 Retrieves all the registered FailureDefinitions.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace