Revit 2024 API
TemporaryGraphicsCommandData Members
The TemporaryGraphicsCommandData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TemporaryGraphicsCommandData
Properties
Name | Description
Document
 The document.
Index
 The unique index of the temporary graphics object managed by TemporaryGraphicsManager.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace