Revit 2024 API
AssemblyMemberDifferentCategory Members
The AssemblyMemberDifferentCategory type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CategoryId1
 Category id of the first assembly member
CategoryId2
 Category id of the second assembly member
See Also
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace