Revit 2024 API
Transaction Members
The Transaction type exposes the following members.
Constructors
Name | Description
Transaction(Document)
 Instantiates a transaction object.
Transaction(Document, String)
 Instantiates a transaction object
Methods
Name | Description
Commit()
 Commits all changes made to the model during the transaction.
Commit(FailureHandlingOptions)
 Commits all changes made to the model during the transaction.
Dispose
Releases all resources used by the Transaction
GetFailureHandlingOptions
 Returns the current failure handling options.
GetName
 Returns the transaction's name.
GetStatus
 Returns the current status of the transaction.
HasEnded
 Determines whether the transaction has ended already.
HasStarted
 Determines whether the transaction has been started yet.
RollBack()
 Rolls back all changes made to the model during the transaction.
RollBack(FailureHandlingOptions)
 Rolls back all changes made to the model during the transaction.
SetFailureHandlingOptions
 Sets options for handling failures to be used when the transaction is being committed or rolled back.
SetName
 Sets the transaction's name.
Start()
 Starts the transaction.
Start(String)
 Starts the transaction with an assigned name.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Transaction Class
Autodesk.Revit.DB Namespace