Revit 2024 API
StructuralSectionPipeStandard Members
The StructuralSectionPipeStandard type exposes the following members.
Constructors
Name | Description
StructuralSectionPipeStandard
 Creates a new instance of Structural Section Pipe Standard shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionPipeStandard Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace