Revit 2024 API
IFCExternalServiceUIData Members
The IFCExternalServiceUIData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCExternalServiceUIData
GetParentHwnd
 return the parent handle
GetRevitElementIds
 return the list of revit Element Ids
Properties
Name | Description
Document
 return the document
IsReset
 flag to indicate the value has been reset
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ParamId
 the parameter id
SelectedIFCItem
 The selected IFC Item (can be IFC Entity, or PredefinedType)
See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace