Revit 2024 API
MacroManagerIterator Members
The MacroManagerIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the MacroManagerIterator
GetCurrent
 Returns the current Macro module.
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the iterator to the next item.
Reset
 Resets the iterator to the initial state.
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace