Revit 2024 API
PaperSize Members
The PaperSize type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Name
 Retrieve the paper size name of current project.
See Also
PaperSize Class
Autodesk.Revit.DB Namespace