Revit 2024 API
DockableFrameFocusChangedEventArgs Members
The DockableFrameFocusChangedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FocusGained
 True if the pane is being activated, false if it is being inactivated.
PaneId
 The identifier for dockable pane.
See Also
DockableFrameFocusChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace