Revit 2024 API
NumberSystem Members
The NumberSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, LinkElementId, Reference)
 Creates a new instance of a NumberSystem associated to a host element and a view.
Create(Document, ElementId, LinkElementId, StairsNumberSystemReferenceOption, LinkElementId)
 Creates a new instance of a NumberSystem associated to a host element, a view, and a reference level of stairs if in a multistory stairs.
GetReferencePick
 Gets the reference curve.
SetReferencePick
 Sets the reference pick.
Properties
Name | Description
JustifyOffset
 The offset to the justification curve.
JustifyOption
 The number justify option of number system.
NumberDisplayRule
 The display rule of the number system.
NumberedElementId
 The LinkElementId of the numbered host element.
NumberOrientation
 The number orientation of number system.
PlacementLevelId
 The id of the base level of stairs on which the NumberSystem is placed.
ReferenceOffset
 The offset to the reference curve.
See Also
NumberSystem Class
Autodesk.Revit.DB Namespace