Revit 2024 API
ConduitSizes Members
The ConduitSizes type exposes the following members.
Methods
Name | Description
Contains
 Checks whether a conduit size with the nominal diameter exists.
Dispose
Releases all resources used by the ConduitSizes
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetConduitSizesIterator
 Returns a ConduitSizeIterator to the conduit sizes.
GetEnumerator
Returns an enumerator that iterates through a collection.
Properties
Name | Description
Count
 Count of the items contained in the collection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace