Revit 2024 API
FabricationDimensionDefinition Methods
The FabricationDimensionDefinition type exposes the following members.
Methods
Name | Description
Dispose
See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace