Revit 2024 API
ElementTypeDuplicatingEventArgs Members
The ElementTypeDuplicatingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ElementTypeId
 The id of the ElementType to be duplicated.
See Also
ElementTypeDuplicatingEventArgs Class
Autodesk.Revit.DB.Events Namespace