Revit 2024 API
AssetPropertyDistance Members
The AssetPropertyDistance type exposes the following members.
Methods
Name | Description
GetUnitTypeId
 Gets the identifier of the unit quantifying the distance property.
IsValidValue
 Checks that the value is a valid value for this property.
Properties
Name | Description
Value
 Value of the property.
See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace