Revit 2024 API
IntersectionResultArray Members
The IntersectionResultArray type exposes the following members.
Constructors
Name | Description
IntersectionResultArray
Initializes a new instance of the IntersectionResultArray class
Methods
Name | Description
Append
Clear
Removes every item from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an item at a specified index within the array.
Size
Returns the number of objects that are in the array.
See Also
IntersectionResultArray Class
Autodesk.Revit.DB Namespace