Revit 2024 API
AreaCreationData Members
The AreaCreationData type exposes the following members.
Constructors
Name | Description
AreaCreationData(Object)
Initializes a new instance of the AreaCreationData class
AreaCreationData(ViewPlan, UV)
The data needed to create a new area
Methods
Name | Description
Properties
Name | Description
TagPoint
 Specify the location of the area tag.
See Also
AreaCreationData Class
Autodesk.Revit.Creation Namespace