Revit 2024 API
FaceArrayIterator Members
The FaceArrayIterator type exposes the following members.
Constructors
Name | Description
FaceArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
FaceArrayIterator Class
Autodesk.Revit.DB Namespace