Revit 2024 API
StructuralSectionConcreteCross Members
The StructuralSectionConcreteCross type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteCross
 Creates a new instance of Structural Section Concrete Cross shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
CantileverHeight
 Flange cantilever thickness.
CantileverLength
 Flange cantilever length.
See Also
StructuralSectionConcreteCross Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace