Revit 2024 API
TableCellCalculatedValueData Members
The TableCellCalculatedValueData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TableCellCalculatedValueData
GetName
 Gets the name of the calculated value.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TableCellCalculatedValueData Class
Autodesk.Revit.DB Namespace