Revit 2024 API
AssetPropertyDoubleArray2d Members
The AssetPropertyDoubleArray2d type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
Get the value of the property
See Also
AssetPropertyDoubleArray2d Class
Autodesk.Revit.DB.Visual Namespace