Revit 2024 API
ScheduleSortGroupField Methods
The ScheduleSortGroupField type exposes the following members.
Methods
Name | Description
Dispose
See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace