Revit 2024 API
FormulaEditingEventArgs Members
The FormulaEditingEventArgs type exposes the following members.
Methods
Name | Description
Apply
 Applies formula to the parameter
Properties
Name | Description
CurrentDocument
 Returns the current document
Formula
 Returns text of the formula that will be modified
ParameterId
 Returns the Id of the modified parameter
See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace