Revit 2024 API
LinearArray Members
The LinearArray type exposes the following members.
Methods
Name | Description
ArrayElementsWithoutAssociation
 Creates a new linear array from a set of elements.
ArrayElementWithoutAssociation
 Creates a new linear array from a single element.
Create(Document, View, ElementId, Int32, XYZ, ArrayAnchorMember)
 Creates a new linear array element from a single element.
Create(Document, View, ICollection<ElementId>, Int32, XYZ, ArrayAnchorMember)
 Creates a new linear array element from a set of elements.
GetCopiedMemberIds
Retrieves the copied member Ids of the Array.
 (Overrides BaseArray.GetCopiedMemberIds().)
GetOriginalMemberIds
Retrieves the original member Ids of the Array.
 (Overrides BaseArray.GetOriginalMemberIds().)
IsElementArrayable
 Indicates whether the input element is arrayable.
IsValidArraySize
 This indicates whether the input count is valid.
Properties
Name | Description
NumMembers
Retrieves or changes the number of the arrayed members.
 (Overrides BaseArray.NumMembers.)
See Also
LinearArray Class
Autodesk.Revit.DB Namespace