Revit 2024 API
BoundaryConditions Members
The BoundaryConditions type exposes the following members.
Methods
Name | Description
GetBoundaryConditionsType
 Returns the boundary conditions type.
GetCurve
 Returns curve that define geometry of the line boundary conditions.
GetDegreesOfFreedomCoordinateSystem
 Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
GetLoops
 Returns curve loops that define geometry of the area boundary conditions.
GetOrientTo
 Returns the boundary conditions orientation option.
SetOrientTo
 Sets the boundary condition orientation option.
Properties
Name | Description
AssociatedLoadId
 The Id of the internal load element associated with a boundary conditions.
HostElementId
 The host element Id for the boundary conditions.
Point
 Returns the position of point boundary conditions.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace