Revit 2024 API
ObjectAccessException Members
The ObjectAccessException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ObjectAccessException Class
Autodesk.Revit.Exceptions Namespace