Revit 2024 API
MEPNetworkSegmentId Members
The MEPNetworkSegmentId type exposes the following members.
Constructors
Name | Description
MEPNetworkSegmentId()
 Creates a default invalid segment id on the network.
MEPNetworkSegmentId(ElementId, Int32)
 Creates a valid segment id on the network.
Methods
Name | Description
Dispose
Releases all resources used by the MEPNetworkSegmentId
IsValid
 Verifies if this is a valid segment id.
Properties
Name | Description
ElementId
 The element id where this analytical segment belongs.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SegmentId
 The segment identifier.
See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace