Revit 2024 API
LabelUtils Members
The LabelUtils type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the LabelUtils
GetLabelFor(BuiltInCategory)
 Gets the user-visible name for a BuiltInCategory.
GetLabelFor(BuiltInParameter)
 Gets the user-visible name for a BuiltInParameter.
GetLabelFor(BuiltInParameterGroup) |  Obsolete.
 Gets the user-visible name for a BuiltInParameterGroup.
GetLabelFor(BuiltInParameter, LanguageType)
 Gets the user-visible name for a BuiltInParameter in a specific LanguageType.
GetLabelFor(DuctLossMethodType, Document)
 Gets the user-visible name for a DuctLossMethodType.
GetLabelFor(gbXMLBuildingType, Document)
 Gets the user-visible name for a gbXMLBuildingType.
GetLabelFor(PipeFlowState, Document)
 Gets the user-visible name for a PipeFlowState.
GetLabelFor(PipeLossMethodType, Document)
 Gets the user-visible name for a PipeLossMethodType.
GetLabelForBuiltInParameter(ForgeTypeId)
 Gets the user-visible name for a built-in parameter.
GetLabelForBuiltInParameter(ForgeTypeId, LanguageType)
 Gets the user-visible name for a built-in parameter in a specific LanguageType.
GetLabelForDiscipline
 Gets the user-visible name for a discipline.
GetLabelForGroup
 Gets the user-visible name for a built-in parameter group. To get the name of parameter group "Other", pass an empty, default-constructed ForgeTypeId.
GetLabelForSpec
 Gets the user-visible name for a spec.
GetLabelForSymbol
 Gets the user-visible name for a symbol.
GetLabelForUnit
 Gets the user-visible name for a unit.
GetStructuralSectionShapeName
 Gets the user-visible name for a StructuralSectionShape.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LabelUtils Class
Autodesk.Revit.DB Namespace