Revit 2024 API
KeyBasedTreeEntries Members
The KeyBasedTreeEntries type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the KeyBasedTreeEntries
FindEntry
 Finds the KeyBasedTreeEntry associated with the given key value.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetKeyBasedTreeEntriesIterator
 Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace