Revit 2024 API
RebarShapeConstraintSagittaLength Members
The RebarShapeConstraintSagittaLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintSagittaLength
 Create a constraint to drive sagitta length.
Methods
Name | Description
Properties
Name | Description
See Also
RebarShapeConstraintSagittaLength Class
Autodesk.Revit.DB.Structure Namespace