Revit 2024 API
FieldDomainPointsByUV Members
The FieldDomainPointsByUV type exposes the following members.
Constructors
Name | Description
FieldDomainPointsByUV(IList<UV>)
 Creates object from an array of two-dimensional point coordinates
FieldDomainPointsByUV(IList<UV>, ICollection<Double>, ICollection<Double>)
 Creates object from an array of two-dimensional point coordinates
Methods
Name | Description
SetGridCoordinates
 Set u and v coordinates that specify a grid on the surface. The display of the grid is controlled by AnalysisDisplayColoredSurfaceSettings::getShowGridLines(). If AnalysisDisplayColoredSurfaceSettings::getShowGridLines() returns true and both sets are empty then a grid will be displayed using a default spacing; if only one of the sets is non-empty, then only the corresponding set of grid lines will be displayed, i.e. the grid will consist solely of parallel lines at the specified coordinates.
Properties
Name | Description
See Also
FieldDomainPointsByUV Class
Autodesk.Revit.DB.Analysis Namespace