Revit 2024 API
IFCTransaction Members
The IFCTransaction type exposes the following members.
Constructors
Name | Description
IFCTransaction
 Instantiates a transaction object.
Methods
Name | Description
Commit
 Commits all changes made to the IFC file during the transaction.
Dispose
Releases all resources used by the IFCTransaction
RollBack
 Rolls back all changes made to the IFC file during the transaction.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace