Revit 2024 API
SketchEditScope Members
The SketchEditScope type exposes the following members.
Constructors
Name | Description
SketchEditScope
 Instantiates a SketchEditScope object.
Methods
Name | Description
IsElementWithoutSketch
 Validates if an element can have a sketch but currently does not.
IsSketchEditingSupported
 Checks whether sketch can be edited.
IsSketchEditingSupportedForSketchBasedElement
 Checks whether the element supports sketch editing.
Start
 Starts a sketch edit mode.
StartWithNewSketch
 Starts a sketch edit mode for an element which, at this moment, doesn't have a sketch.
Properties
Name | Description
See Also
SketchEditScope Class
Autodesk.Revit.DB Namespace