Revit 2024 API
SpaceTag Members
The SpaceTag type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Space
The space that the tag is associated with.
SpaceTagType
The tag type.
See Also
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace