Revit 2024 API
ConnectorManager Members
The ConnectorManager type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ConnectorManager
Lookup
 Lookup the connector using the unique index value that identify this connector.
Properties
Name | Description
Connectors
Return all the Connectors of the Connector Manager.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Owner
 This property is used to retrieve the owner of the Connector Manager.
UnusedConnectors
Return all the unused Connectors of the Connector Manager.
See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace