Revit 2024 API
ModificationOutsideTransactionException Members
The ModificationOutsideTransactionException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ModificationOutsideTransactionException Class
Autodesk.Revit.Exceptions Namespace