Revit 2024 API
SweptBlend Members
The SweptBlend type exposes the following members.
Methods
Name | Description
GetVertexConnectionMap
Gets the mapping between the vertices in the top and bottom profiles.
SetVertexConnectionMap
Sets the mapping between the vertices in the top and bottom profiles.
Properties
Name | Description
BottomProfile
The curves which make up the bottom profile of the sketch.
BottomProfileSymbol
The bottom family symbol profile of the swept blend.
BottomSketch
The bottom profile sketch of the swept blend.
PathSketch
The sketched path for the swept blend.
SelectedPath
The selected curve used for the swept blend path.
TopProfile
The curves which make up the top profile of the sketch.
TopProfileSymbol
The top family symbol profile of the swept blend.
TopSketch
The top profile sketch of the swept blend.
See Also
SweptBlend Class
Autodesk.Revit.DB Namespace