Revit 2024 API
RevitServerCollaborationNotAvailableException Members
The RevitServerCollaborationNotAvailableException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerCollaborationNotAvailableException Class
Autodesk.Revit.Exceptions Namespace