Revit 2024 API
City Members
The City type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Latitude
Latitude of the city
Longitude
Longitude of the city
Name
The name of the city
TimeZone
Time-zone in which the city resides
WeatherStation
An identifier for the nearest weather station
See Also
City Class
Autodesk.Revit.DB Namespace