Revit 2024 API
FaceSplitter Methods
The FaceSplitter type exposes the following members.
Methods
Name | Description
GetBoundaries
 Gets the boundaries.
See Also
FaceSplitter Class
Autodesk.Revit.DB Namespace