Revit 2024 API
RibbonItemData Members
The RibbonItemData type exposes the following members.
Methods
Name | Description
GetContextualHelp
Gets the contextual help bound with this control.
SetContextualHelp
Sets the contextual help bound with this button data.
Properties
Name | Description
LongDescription
 Long description of the command tooltip
Name
The name of the item.
ToolTip
The description that appears as a ToolTip for the item.
ToolTipImage
The image to show as a part of the button extended tooltip
See Also
RibbonItemData Class
Autodesk.Revit.UI Namespace