Revit 2024 API
StructuralSectionConcreteRectangle Members
The StructuralSectionConcreteRectangle type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteRectangle
 Creates a new instance of Structural Section Concrete Rectangle shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionConcreteRectangle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace