Revit 2024 API
InSessionViewSheetSet Members
The InSessionViewSheetSet type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the InSessionViewSheetSet
Properties
Name | Description
IsAutomatic
 Automatic order or manual order.
OrderedViewList
 Ordered views.
SheetOrganizationId
ElementId to the BrowserOrganization for sheets.
ViewOrganizationId
ElementId to the BrowserOrganization for non-sheet views.
Views
The views.
See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace