Revit 2024 API
WorksharingDisplaySettings Members
The WorksharingDisplaySettings type exposes the following members.
Methods
Name | Description
CanUserHaveOverrides
 Checks whether a single username can have customized graphic overrides.
GetAllUsersWithGraphicOverrides
 Returns all usernames that have graphic overrides. This list consists of all users included in the user table + all users who have explicitly been assigned overrides.
GetGraphicOverrides(String)
 Returns the graphic overrides assigned for elements owned by a particular user.
GetGraphicOverrides(CheckoutStatus)
 Returns the graphic overrides associated with a particular ownership status.
GetGraphicOverrides(ModelUpdatesStatus)
 Returns the graphic overrides assigned to a particular model update status.
GetGraphicOverrides(WorksetId)
 Returns the graphic overrides assigned to elements in a particular workset.
GetOrCreateWorksharingDisplaySettings
 Returns the worksharing display settings for the document, creating new settings for the current user if necessary.
GetRemovedUsers
 Returns the set of users who have been explicitly removed from the settings.
RemoveUsers
 Removes users from the list of displayed users and permanently discards any customization of the graphics. Note that a user cannot be removed if he or she owns any elements.
RestoreUsers
 Adds users back to the list of displayed users and permits customization of the graphics. Any usernames that are not currently removed will be ignored. Returns the number of users who were actually restored.
SetGraphicOverrides(String, WorksharingDisplayGraphicSettings)
 Sets the graphic overrides assigned to elements owned by a particular user. The username cannot be on the list of removed usernames.
SetGraphicOverrides(CheckoutStatus, WorksharingDisplayGraphicSettings)
 Sets the graphic overrides assigned to elements with a particular ownership status.
SetGraphicOverrides(ModelUpdatesStatus, WorksharingDisplayGraphicSettings)
 Sets the graphic overrides assigned to elements with a particular status in the central model.
SetGraphicOverrides(WorksetId, WorksharingDisplayGraphicSettings)
 Sets the graphic overrides assigned to elements in a particular user workset.
UserHasGraphicOverrides
 Checks whether there are graphic overrides that would apply to elements owned by the given user in the "Individual Owners" display mode.
Properties
Name | Description
See Also
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace