Revit 2024 API
PathReinforcement Members
The PathReinforcement type exposes the following members.
Methods
Name | Description
ConvertRebarInSystemToRebars
 Converts all RebarInSystem elements owned by the input PathReinforcement to equivalent Rebar elements.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId)
 Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId, ElementId)
 Creates a new PathReinforcement object from an array of curves and given Rebar Shape id.
GetCurveElementIds
 Retrieves the set of ElementIds of curves forming the boundary of the Path Reinforcement.
GetHostId
 The element that contains the Path Reinforcement.
GetOrCreateDefaultRebarShape
 Creates a new RebarShape object with a default name or returns existing one which fulfills Path Reinforcement bending data requirements.
GetRebarInSystemIds
 Returns the ids of the RebarInSystem elements owned by the PathReinforcement element.
IsAlternatingLayerEnabled
 Checks if alternating bars are present in Path Reinforcement.
IsUnobscuredInView
 Checks if Path Reinforcement is shown unobscured in a view.
IsValidAlternatingBarOrientation
 Checks if orientation for alternating bars is valid.
IsValidPrimaryBarOrientation
 Checks if orientation for primary bars is valid.
IsValidRebarShapeId
 Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement.
RemovePathReinforcementSystem
 Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
SetUnobscuredInView
 Sets Path Reinforcement to be shown unobscured in a view.
Properties
Name | Description
AdditionalOffset
 Additional offset of rebars in the Path Reinforcement.
AlternatingBarOrientation
 Orientation of alternating bars of Path Reinforcement.
AlternatingBarShapeId
 The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement.
PathReinforcementType
 Retrieves the type of the Path Reinforcement.
PrimaryBarOrientation
 Orientation of primary bars of Path Reinforcement.
PrimaryBarShapeId
 The RebarShape element that defines the shape of the primary bars of the Path Reinforcement.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace