Revit 2024 API
ComboBox Members
The ComboBox type exposes the following members.
Methods
Name | Description
AddItem
Adds a new item to the ComboBox.
AddItems
Adds a new items to the ComboBox.
AddSeparator
Adds a separator to the drop-down list.
GetItems
Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox.
Properties
Name | Description
Current
Gets or sets the current checked ComboBox member of the ComboBox.
Image
The image shown on the ComboBox.
Events
Name | Description
CurrentChanged
Subscribe to this event to be notified when the current item of the ComboBox is changed.
DropDownClosed
Subscribe to this event to be notified when the drop-down of the ComboBox is closed.
DropDownOpened
Subscribe to this event to be notified when the drop-down of the ComboBox is opened.
See Also
ComboBox Class
Autodesk.Revit.UI Namespace