Revit 2024 API
EnergyDataSettings Members
The EnergyDataSettings type exposes the following members.
Methods
Name | Description
CheckAnalysisType
 Checks that the analysis type falls within an appropriate range.
CheckBuildingConstructionClass
 Checks that the building construction class falls within an appropriate range.
CheckBuildingEnvelope
 Checks that the building envelope determination method falls within an appropriate range.
CheckBuildingHVACSystem
 Checks that the building HVAC system falls within an appropriate range.
CheckBuildingOperatingSchedule
 Checks that the building operating schedule falls within an appropriate range.
CheckBuildingType
 Checks that the building type falls within an appropriate range.
CheckConstructionSetElement
 Checks that the construction set ElementId is acceptable.
CheckExportCategory
 Checks whether the export category falls within the list:
OST_Rooms
OST_MEPSpaces
CheckExportComplexity
 Checks that the export complexity falls within an appropriate range.
CheckGroundPlane(ElementId)
 The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
CheckGroundPlane(Document, ElementId)
 The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
CheckProjectPhase
 Checks that the input element is a project phase.
CheckProjectReportType
 Checks that the project report type falls within an appropriate range.
CheckRangeOfPercentageGlazing
 Checks that the percentage glazing value is between 0.00 and 0.95.
CheckRangeOfPercentageSkylights
 Checks that the percentage skylights value is between 0.00 and 0.95.
CheckRangeOfShadeDepth
 Checks that the shade depth is greater than or equal to zero.
CheckRangeOfSillHeight
 Checks that the sill height is greater than or equal to zero.
CheckRangeOfSkylightWidth
 Checks that the skylight width is greater than or equal to eight inches.
CheckRangeOfSliverSpaceTolerance
 Checks that the sliver space tolerance is greater than or equal to zero.
CheckServiceType
 Checks that the service type falls within an appropriate range.
GetBuildingConstructionSetElementId
 Id of the building construction set.
GetFromDocument
 Every project document has a EnergyDataSettings element. Family documents do not have EnergyDataSettings elements.
GetReportsFolderParsed
 Gets the absolute reports folder path that is parsed from the original input.
IsDocumentUsingEnergyDataAnalyticalModel
 Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
SetReportsFolder
 Sets the reports folder path.
Properties
Name | Description
AnalysisType
 The type of analysis mode.
AnalyticalGridCellSize
 The cell size for the uniform cubical grid used when computing the building envelope
BuildingConstructionClass
 Used for both the detailed and conceptual energy model Construction class of building as defined by: loose, medium, tight, or none.
BuildingEnvelopeDeterminationMethod
 Indicates if an analysis should be perform to find the model elements that are part of the building envelope
BuildingHVACSystem
 The type of HVAC system used by the building for conceptual model energy calculations.
BuildingOperatingSchedule
 The operating schedule of the building used for conceptual model energy calculations.
BuildingType
 The type of building.
BuildingTypeId
 The building type element.
CoreOffset
 The default offset used to determine the outer perimeter to be divided into zones.
CreateAnalyticalModel
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
DividePerimeter
 If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.
EnergyModel
 if this is on there should be an energy model dependent on the current AnalysisType if it is off the conceptual energy model should be turned off but setting this datum does not do the work, just reflects the state.
ExportCategory
 Value is a category indicating which discipline model will be used for GreenBuildingXML export.
ExportComplexity
 Value determines Export Complexity for GreenBuildingXML detailed model export.
ExportDefaults
 Use for detailed model GreenBuildingXML export. When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML. When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.
GroundPlane
 Id of level which represents ground level.
IncludeThermalProperties
 Indicates if thermal information from model assemblies and components is included in GreenBuildingXML export of the detailed model.
IsExportMullionsEnabled
 Indicates if mullions are included in GreenBuildingXML export of the detailed model.
IsExportShadingSurfacesEnabled
 Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model.
IsExportSimplifiedCurtainSystemsEnabled
 Indicates if curtain system geometry is being simplified for GreenBuildingXML export of the detailed model.
IsGlazingShaded
 If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.
OutsideAirChangesRatePerHour
 The number of times the volume of air interchanges in the room in one hour.
OutsideAirPerArea
 The rate of flow of outside air available per unit area.
OutsideAirPerPerson
 The rate of flow of outside air available per person.
PercentageGlazing
 Used for the conceptual energy model. The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
PercentageSkylights
 Used for the conceptual energy model. The approximate percentage of the building roof surfaces in massing instances for the Conceptual Energy Analytical Model.
ProjectPhase
 The project phase of the EnergyData information.
ProjectReportType
 Report type: None, simple, standard, detailed
ReportsFolder
 The folder path where all systems analysis reports are stored. It may include special label and relative path.
ServiceType
 The type of heating or cooling system.
ShadeDepth
 Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.
SillHeight
 Used for the conceptual energy model. The height from the nearest lower level used for auto-glazing created on walls.
SkylightWidth
 Used for the conceptual energy model. The approximate width used for the skylights in massing instances when the Energy Analytical model is being created.
SliverSpaceTolerance
 Used for Detailed GreenBuildingXML export. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
UseAirChangesPerHour
 True if user is specifying air changes per hour, false otherwise.
UseCurrentViewOnly
 True if only elements visible in the currently active view are used for generation of Energy Model.
UseHeatingCredits
 If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.
UseOutsideAirPerArea
 True is user is specifying outside air per area, false otherwise.
UseOutsideAirPerPerson
 True if user is specifying outside air per person, false otherwise.
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace