Revit 2024 API
MEPAnalyticalSegment Methods
The MEPAnalyticalSegment type exposes the following members.
Methods
Name | Description
Dispose
See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace