Revit 2024 API
BackgroundTaskCancelledException Members
The BackgroundTaskCancelledException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
BackgroundTaskCancelledException Class
Autodesk.Revit.Exceptions Namespace