Revit 2024 API
MEPFamilyConnectorInfo Members
The MEPFamilyConnectorInfo type exposes the following members.
Methods
Name | Description
GetAssociateFamilyParameterId
 Gets the associate family parameter id of the specified connector parameter id.
GetConnectorParameterValue
 Gets the parameter value of the specified connector parameter id.
Properties
Name | Description
See Also
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace