Revit 2024 API
FaceWall Members
The FaceWall type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a wall attached to a non-vertical massing face.
IsValidFaceReferenceForFaceWall
 Identifies if a reference may be used as the parent of a face wall.
IsWallTypeValidForFaceWall
 Identifies if a wall type may be applied to a face wall.
Properties
Name | Description
See Also
FaceWall Class
Autodesk.Revit.DB Namespace