Revit 2024 API
FillPatternElement Members
The FillPatternElement type exposes the following members.
Methods
Name | Description
Create
 Creates a new FillPatternElement.
GetFillPattern
 Gets the FillPattern associated to this element.
GetFillPatternElementByName
 Retrieves the FillPatternElement by its name.
SetFillPattern
 Sets the FillPattern associated to this element.
Properties
Name | Description
See Also
FillPatternElement Class
Autodesk.Revit.DB Namespace