Revit 2024 API
AnalyticalModelSelector Methods
The AnalyticalModelSelector type exposes the following members.
Methods
Name | Description
Dispose
See Also
AnalyticalModelSelector Class
Autodesk.Revit.DB.Structure Namespace