Revit 2024 API
MessageBoxShowingEventArgs Members
The MessageBoxShowingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DialogType
 An integer that describes the standard Windows type of the dialog box.
Message
 The message that has been displayed in the dialog box.
See Also
MessageBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace