Revit 2024 API
RegenerationFailedException Members
The RegenerationFailedException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RegenerationFailedException Class
Autodesk.Revit.Exceptions Namespace