Revit 2024 API
FileImportingEventArgs Members
The FileImportingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Format
 Identifies the import format, e.g. DWG or image.
Path
 Path of the source file which is about to be imported.
See Also
FileImportingEventArgs Class
Autodesk.Revit.DB.Events Namespace