Revit 2024 API
TessellatedBuildIssue Members
The TessellatedBuildIssue type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TessellatedBuildIssue
GetIssueDescription
 Gets a string describing the issue. If the issue does not present a problem, then an empty string is returned.
IsValidIssue
 Reports whether the issue is well-formed, valid and does describe a real problem.
MakesDataUnusable
 Reports whether this issue makes some data unusable ('true') or is only shows that data format conventions were broken, but the data are still usable (false).
ReportIssueToDataSource
 Reports whether this issue should be reported to the company which wrote the software which produced the face set data (true), or to Autodesk (false).
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberEncountered
 How many times this issue was encountered in its face set during the face set processing. This number can be less than the total number of such issues in the face set, as the face set processing could be aborted due to the presence of the issues which could not be handled.
See Also
TessellatedBuildIssue Class
Autodesk.Revit.DB Namespace