Revit 2024 API
SplitButton Members
The SplitButton type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CurrentButton
Gets or sets the current PushButton of the SplitButton.
IsSynchronizedWithCurrentItem
 Indicates whether the top PushButton on the SplitButton changes based on the CurrentButton property.
See Also
SplitButton Class
Autodesk.Revit.UI Namespace