Revit 2024 API
Polyloop Members
The Polyloop type exposes the following members.
Methods
Name | Description
ComputeArea
 Gets the area for this polygon.
Dispose
Releases all resources used by the Polyloop
GetPoints
 Gets the array of points in the polygon.
Properties
Name | Description
Centroid
 The polygon centroid.
Direction
 The direction for the outward normal for this polygon.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace