Revit 2024 API
StructuralSectionIWideFlange Members
The StructuralSectionIWideFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionIWideFlange
 Creates a new instance of Structural Section I Wide Flange shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing, in. (mm)
BoltSpacingBetweenRows
 Standard bolt spacing between rows, in. (mm)
BoltSpacingTwoRows
 Standard bolt spacing for two rows , in. (mm)
ClearWebHeight
 Detailing depth between the web toes of the fillets, in.(mm)
FlangeToeOfFillet
 Detailing distance from center of web to flange toe of fillet, in. (mm)
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
See Also
StructuralSectionIWideFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace