Revit 2024 API
ElementParameterFilter Members
The ElementParameterFilter type exposes the following members.
Constructors
Name | Description
ElementParameterFilter(FilterRule)
 Constructs a new instance of an ElementParameterFilter from a single rule.
ElementParameterFilter(IList<FilterRule>)
 Constructs a new instance of an ElementParameterFilter from a set of rules.
ElementParameterFilter(FilterRule, Boolean)
 Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule.
ElementParameterFilter(IList<FilterRule>, Boolean)
 Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing the given filter rules.
Methods
Name | Description
GetRules
 Returns the set of rules contained in this filter.
Properties
Name | Description
See Also
ElementParameterFilter Class
Autodesk.Revit.DB Namespace