Revit 2024 API
ElementIntersectsSolidFilter Members
The ElementIntersectsSolidFilter type exposes the following members.
Constructors
Name | Description
ElementIntersectsSolidFilter(Solid)
 Constructs a filter to match elements which intersect the given element.
ElementIntersectsSolidFilter(Solid, Boolean)
 Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element.
Methods
Name | Description
GetSolid
 Gets the target solid geometry.
Properties
Name | Description
See Also
ElementIntersectsSolidFilter Class
Autodesk.Revit.DB Namespace