Revit 2024 API
BeamSystem Members
The BeamSystem type exposes the following members.
Methods
Name | Description
BeamBelongsTo
Find out the BeamSystem to which the beam belongs.
Create(Document, IList<Curve>, SketchPlane, Int32)
 Creates a 2D BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, XYZ, Boolean)
 Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, Int32, Boolean)
 Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, SketchPlane, XYZ, Boolean)
 Creates a new BeamSystem with specified profile curves.
DropBeamSystem
Drop beam system, it will disassociate all members from the beam system and delete the beam system.
GetBeamIds
Gets all the beams of the BeamSystem.
Properties
Name | Description
BeamSystemType
Retrieves or changes the type of the BeamSystem.
BeamType
Retrieves or changes the Beam Type of the BeamSystem.
Direction
The Direction of the BeamSystem.
Elevation
Retrieves or changes the Elevation of the BeamSystem.
LayoutRule
Retrieves or changes the LayoutRule of the BeamSystem.
Level
Get or change the level of the BeamSystem. When the level is changed, the elevation is changed to make the the BeamSystem remain the location.
Profile
Retrieve or set the profile of the BeamSystem.
See Also
BeamSystem Class
Autodesk.Revit.DB Namespace