Revit 2024 API
VertexFormat Members
The VertexFormat type exposes the following members.
Constructors
Name | Description
VertexFormat
 Constructs the specification of vertex format from a numerical representation.
Methods
Name | Description
Dispose
Releases all resources used by the VertexFormat
IsValid
 Tests whether the vertex format specification is valid for rendering.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace