Revit 2024 API
PipeFittingAndAccessoryPressureDropUIDataItem Members
The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PipeFittingAndAccessoryPressureDropUIDataItem
GetEntity
 Returns the entity set by UI server. or an invalid entity otherwise.
GetPipeFittingAndAccessoryData
 Gets the fitting data stored in the UI data item.
SetEntity
 Stores the entity in the UI data item.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace