Revit 2024 API
CombinableElementArray Members
The CombinableElementArray type exposes the following members.
Constructors
Name | Description
CombinableElementArray
Initializes a new instance of the CombinableElementArray class
Methods
Name | Description
Append
Add the element to the end of the array.
Clear
Removes every CombinableElement from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified element into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a CombinableElement at a specified index within the array.
Size
Returns the number of CombinableElements that are in the array.
See Also
CombinableElementArray Class
Autodesk.Revit.DB Namespace