Revit 2024 API
LinkOperations Members
The LinkOperations type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the LinkOperations
SetOnLocalLinkSharedCoordinatesSavedCallback
 Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LinkOperations Class
Autodesk.Revit.DB Namespace