Revit 2024 API
MEPNetworkIterator Members
The MEPNetworkIterator type exposes the following members.
Constructors
Name | Description
MEPNetworkIterator(Document, MEPAnalyticalModelData, ConnectorDomainType)
 Creates an iterator by the analytical model data to visit all connected components in the network.
MEPNetworkIterator(Document, MEPAnalyticalNode, MEPAnalyticalSegment)
 Creates an iterator to visit the connected segments on one side of the network.
Methods
Name | Description
Dispose
Releases all resources used by the MEPNetworkIterator
End
 Checks if the network iteration has completed.
GetAnalyticalModelData
 Gets the analytical model data at the current iteration step.
GetAnalyticalNode
 Gets the analytical node at the current iteration step.
GetAnalyticalSegment
 Gets the analytical segment at the current iteration step.
GetOtherAnalyticalNode
 Gets the other analytical node at the current iteration step.
Next
 Moves this iterator to the next step of network iteration.
Start
 Gets the first step of network iteration.
Properties
Name | Description
CurrentElementId
 The element id at the current iteration step.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SystemClassification
 The optional MEP system classification where the iterations are restricted.
SystemId
 The optional MEP system element id where the iterations are restricted.
See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace