Revit 2024 API
FieldDomainPoints Methods
The FieldDomainPoints type exposes the following members.
Methods
Name | Description
Dispose
See Also
FieldDomainPoints Class
Autodesk.Revit.DB.Analysis Namespace