Revit 2024 API
IATFTranslationServer Members
The IATFTranslationServer type exposes the following members.
Methods
Name | Description
Translate
 Translate a model according to translationData settings
See Also
IATFTranslationServer Interface
Autodesk.Revit.DB Namespace