Revit 2024 API
ExternalDataInstanceRemovingFromDocumentEventArgs Members
The ExternalDataInstanceRemovingFromDocumentEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
InstanceId
 The Revit id of the external data instance being removed from Revit document.
TypeId
 The type id of the external data instance id being removed from Revit document.
See Also
ExternalDataInstanceRemovingFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace