Revit 2024 API
FilterNumericLessOrEqual Members
The FilterNumericLessOrEqual type exposes the following members.
Constructors
Name | Description
FilterNumericLessOrEqual
 Constructs an instance of FilterNumericLessOrEqual.
Methods
Name | Description
Properties
Name | Description
See Also
FilterNumericLessOrEqual Class
Autodesk.Revit.DB Namespace