Revit 2024 API
TriangulationInterfaceForTriangulatedSolidOrShell Members
The TriangulationInterfaceForTriangulatedSolidOrShell type exposes the following members.
Constructors
Name | Description
TriangulationInterfaceForTriangulatedSolidOrShell
 Construct an interface object for a TriangulatedSolidOrShell.
Methods
Name | Description
Properties
Name | Description
See Also
TriangulationInterfaceForTriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace