Revit 2024 API
AssemblyDifferenceMemberDifference Members
The AssemblyDifferenceMemberDifference type exposes the following members.
Methods
Name | Description
Properties
Name | Description
MemberDifference
 Difference between the assembly members
MemberId1
 Id of the member in the first assembly
MemberId2
 Id of the member in the second assembly
See Also
AssemblyDifferenceMemberDifference Class
Autodesk.Revit.DB Namespace