Revit 2024 API
Line Members
The Line type exposes the following members.
Methods
Name | Description
CreateBound
 Creates a new instance of a bound linear curve.
CreateUnbound
 Creates a new instance of an unbound linear curve.
Properties
Name | Description
Direction
Returns the direction of the line.
Origin
Returns the origin of the line.
See Also
Line Class
Autodesk.Revit.DB Namespace