Revit 2024 API
FailureHandlingOptions Members
The FailureHandlingOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FailureHandlingOptions
GetClearAfterRollback
 Obtains the flag indicating if all posted failures should be removed silently when transaction is being rolled back.
GetDelayedMiniWarnings
 Obtains the flag indicating if showing of mini-warning dialog should be delayed until the end of next transaction.
GetFailuresPreprocessor
 Gets the callback to be invoked in the beginning of failure processing.
GetForcedModalHandling
 Obtains the flag indicating if the error handling dialog shown at the end of the failing transaction should be modal.
GetTransactionFinalizer
 Gets the callback to be executed after transaction is completed.
SetClearAfterRollback
 Sets a flag indicating that Revit should clear all posted failures silently when the failing transaction is being rolled back intentionally. If not set, the failures may still be displayed to the user during rollback.
SetDelayedMiniWarnings
 Sets a flag indicating if Revit should delay the display of the mini-warning dialog (if one is to be shown as a result of warnings in the current transaction) until the end of the next transaction.
SetFailuresPreprocessor
 Sets the callback to be invoked in the beginning of failure processing.
SetForcedModalHandling
 Sets a flag indicating whether Revit will show a modal (blocking) error dialog if the transaction failed to finish.
SetTransactionFinalizer
 Sets the callback to be executed after the transaction is completed.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace