Revit 2024 API
LoadCase Members
The LoadCase type exposes the following members.
Methods
Name | Description
Create(Document, String, ElementId, ElementId)
 Creates a new LoadCase.
Create(Document, String, ElementId, LoadCaseCategory)
 Creates a new LoadCase.
IsLoadCaseSubcategoryId
 Checks whether provided element ID refer to subcategory of Structural Load Cases (OST_LoadCases) category - one of built-in or user defined.
IsLoadNatureId
 Checks whether provided element ID refer to LoadNature element.
IsNumberUnique
 Checks that a given number is unique among all load cases.
Properties
Name | Description
NatureId
 The nature ID of the load case.
Number
 Returns unique load case number.
SubcategoryId
 Build-in or user defined subcategory of Structural Load Cases (OST_LoadCases) category.
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace