Revit 2024 API
AnalyticalSurfaceBase Methods
The AnalyticalSurfaceBase type exposes the following members.
Methods
Name | Description
GetOuterContour
 Returns the Curve Loop that defines the geometry of the Analytical Surface element.
IsCurveLoopValid
 Checks if curve loop is valid for Analytical Panel.
SetOuterContour
 Sets the Curve Loop that defines the geometry of the Analytical Surface element.
See Also
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace