Revit 2024 API
VertexPositionNormalColored Members
The VertexPositionNormalColored type exposes the following members.
Constructors
Name | Description
VertexPositionNormalColored
 Constructs the vertex from a point, a normal vector, and a color.
Methods
Name | Description
GetColor
 Gets the vertex's color.
GetSizeInFloats
 Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
SetColor
 Sets the vertex's color.
Properties
Name | Description
Normal
 The vertex's normal vector.
Position
 The vertex's position.
See Also
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace