Revit 2024 API
EdgeArrayArray Members
The EdgeArrayArray type exposes the following members.
Constructors
Name | Description
EdgeArrayArray
Initializes a new instance of the EdgeArrayArray class
Methods
Name | Description
Append
Add the edge array to the end of the array.
Clear
Removes every edge array from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified edge array into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an edge array at a specified index within the array.
Size
Returns the number of edge arrays that are in the array.
See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace