Revit 2024 API
FilteredWorksetIdIterator Members
The FilteredWorksetIdIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FilteredWorksetIdIterator
GetCurrent
 The current workset id found by the iterator.
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the iterator to the next workset id passing the filter.
Reset
 Resets the iterator to the beginning.
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace