Revit 2024 API
ViewsExportedByContextEventArgs Members
The ViewsExportedByContextEventArgs type exposes the following members.
Methods
Name | Description
GetViewIds
 Gets the views that were exported by CustomExporter.
Properties
Name | Description
See Also
ViewsExportedByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace