Revit 2024 API
DuctFittingAndAccessoryPressureDropUIData Members
The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctFittingAndAccessoryPressureDropUIData
GetUIDataItems
 Gets all UI data items stored in the UI data.
GetUnits
 Gets units.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace