Revit 2024 API
FluidTemperature Members
The FluidTemperature type exposes the following members.
Constructors
Name | Description
FluidTemperature
 Creates a new fluid temperature with given temperature, dynamic viscosity and density.
Methods
Name | Description
Dispose
Releases all resources used by the FluidTemperature
Properties
Name | Description
Density
 The density value
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Temperature
 The temperature value
Viscosity
 The dynamic viscosity value
See Also
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace