Revit 2024 API
ElementIntersectsElementFilter Members
The ElementIntersectsElementFilter type exposes the following members.
Constructors
Name | Description
ElementIntersectsElementFilter(Element)
 Constructs a filter to match elements which intersect the given element.
ElementIntersectsElementFilter(Element, Boolean)
 Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element.
Methods
Name | Description
GetElement
 Gets the target element.
Properties
Name | Description
See Also
ElementIntersectsElementFilter Class
Autodesk.Revit.DB Namespace