Revit 2024 API
CurveByPoints Members
The CurveByPoints type exposes the following members.
Methods
Name | Description
GetPoints
Get the sequence of points interpolated by this curve.
GetVisibility
Gets the visibility.
SetPoints
Change the sequence of points interpolated by this curve.
SetVisibility
Sets the visibility.
SortPoints
Order a set of ReferencePoints in the same way Revit does when creating a curve from points.
Properties
Name | Description
IsReferenceLine
ReferenceType
Indicates the type of reference.
SketchPlane
Override the SketchPlane property of CurveElement.
 (Overrides CurveElement.SketchPlane.)
Subcategory
The subcategory, or graphics style, of the CurveByPoints.
Visible
Whether the point is visible when the family is loaded into a project.
See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace