Revit 2024 API
ElectricalDemandFactorDefinition Members
The ElectricalDemandFactorDefinition type exposes the following members.
Constructors
Name | Description
ElectricalDemandFactorDefinition
 Constructs a new ElectricalDemandFactorDefinition with default settings.
Methods
Name | Description
AddValue
 Adds a value to the value set for this demand factor definition
ClearValues
 Clears all the values stored for this demand factor definition.
Create
 Creates a new instance of a demand factor definition.
GetApplicableDemandFactor
 This method will return the applicable demand factor for the specified number of devices or load.
GetValues
 Provides access to the value set stored with this demand factor definition
GetValuesCount
 Returns the number of values in the set.
RemoveValue
 Removes a value to the value set for this demand factor definition
SetValues
 Sets the value set to the demand factor definition.
Properties
Name | Description
AdditionalLoad
 Additional load to be included during demand load calculation.
IncludeAdditionalLoad
 Should the additional load (if set) be included in demand load calculations.
RuleType
 The rule type for this demand factor definition.
See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace