Revit 2024 API
CitySet Members
The CitySet type exposes the following members.
Constructors
Name | Description
CitySet
Initializes a new instance of the CitySet class
Methods
Name | Description
Clear
Removes every city from the set, rendering it empty.
Contains
Tests for the existence of a city within the set.
Erase
Removes a specified city from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified city into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of cities that are in the set.
See Also
CitySet Class
Autodesk.Revit.DB Namespace