Revit 2024 API
IndexPrimitive Methods
The IndexPrimitive type exposes the following members.
Methods
Name | Description
Dispose
See Also
IndexPrimitive Class
Autodesk.Revit.DB.DirectContext3D Namespace