Revit 2024 API
CurtainGridLine Members
The CurtainGridLine type exposes the following members.
Methods
Name | Description
AddAllSegments
All the segments on this grid line will be added.
AddMullions
 Add mullions on the specified segments of a grid. If any segment already has a mullion, no change is made to that segment.
AddSegment
Add a segment based on the specified segment curve of the gridline.
RemoveSegment
Remove the segment specified by the input curve.
Properties
Name | Description
AllSegmentCurves
Retrieve the curves of all segments.
ExistingSegmentCurves
Retrieve all the existing segment curves of the grid line.
FullCurve
Retrieve the geometry curve of the curtain grid line.
IsUGridLine
Retrieve the direction of a grid line.If it is true,we say it is a UGridLine,otherwise it is VGridLine
Lock
Retrieves or changes the lock state of the curtain grid line.
SkippedSegmentCurves
Retrieve all the removed segment curves of the grid line.
See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace