Revit 2024 API
ReferenceArrayIterator Members
The ReferenceArrayIterator type exposes the following members.
Constructors
Name | Description
ReferenceArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
ReferenceArrayIterator Class
Autodesk.Revit.DB Namespace