Revit 2024 API
RegenerationAttribute Properties
The RegenerationAttribute type exposes the following members.
Properties
Name | Description
Option
Regeneration option.
See Also
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace