Revit 2024 API
CancellationListener Members
The CancellationListener type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the CancellationListener
IsCancelled
 Returns true if the operation associated with this instance has been cancelled.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
CancellationListener Class
Autodesk.Revit.DB Namespace