Revit 2024 API
LayoutRuleFixedDistance Members
The LayoutRuleFixedDistance type exposes the following members.
Constructors
Name | Description
LayoutRuleFixedDistance
Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Methods
Name | Description
Properties
Name | Description
JustifyType
Get or set the type of justification.
Spacing
Get or set spacing of the Beam System.
See Also
LayoutRuleFixedDistance Class
Autodesk.Revit.DB Namespace