Revit 2024 API
FaceNode Members
The FaceNode type exposes the following members.
Methods
Name | Description
GetFace
 Returns the Face object corresponding to the node.
Properties
Name | Description
See Also
FaceNode Class
Autodesk.Revit.DB Namespace