Revit 2024 API
ArgumentOutOfRangeException Members
The ArgumentOutOfRangeException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ArgumentOutOfRangeException Class
Autodesk.Revit.Exceptions Namespace