Revit 2024 API
GBXMLImportOptions Members
The GBXMLImportOptions type exposes the following members.
Constructors
Name | Description
GBXMLImportOptions
Default constructor. Sets all options to their default values.
Methods
Name | Description
See Also
GBXMLImportOptions Class
Autodesk.Revit.DB Namespace