Revit 2024 API
StructuralSectionLProfileWithLips Members
The StructuralSectionLProfileWithLips type exposes the following members.
Constructors
Name | Description
StructuralSectionLProfileWithLips
 Creates a new instance of Structural Section L Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionLProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace