Revit 2024 API
ArgumentException Members
The ArgumentException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
Message
Gets the error message and the parameter name, or only the error message if no parameter name is set.
 (Overrides Exception.Message.)
ParamName
Gets the name of the parameter that causes this exception.
See Also
ArgumentException Class
Autodesk.Revit.Exceptions Namespace