Revit 2024 API
UnauthenticatedException Members
The UnauthenticatedException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
UnauthenticatedException Class
Autodesk.Revit.Exceptions Namespace