Revit 2024 API
WrongUserException Members
The WrongUserException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
WrongUserException Class
Autodesk.Revit.Exceptions Namespace