Revit 2024 API
DocumentEntryPoint Properties
The DocumentEntryPoint type exposes the following members.
Properties
Name | Description
AddinFolder
 The full path to the Revit Macros module.
See Also
DocumentEntryPoint Class
Autodesk.Revit.UI.Macros Namespace