Revit 2024 API
PointCollection Members
The PointCollection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PointCollection
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetPointBufferPointer
 Returns an unsafe pointer to the buffer in which this collection stores the points.
GetPointIterator
 Creates and returns an iterator for the points contained in this collection.
Properties
Name | Description
Count
 The number of points in this collection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace