Revit 2024 API
SKPImportOptions Members
The SKPImportOptions type exposes the following members.
Constructors
Name | Description
SKPImportOptions()
 Constructs a new instance of SKPImportOptions with default values of all properties.
SKPImportOptions(SKPImportOptions)
 Constructs a new instance of SKPImportOptions as a copy of the import options.
Methods
Name | Description
Properties
Name | Description
See Also
SKPImportOptions Class
Autodesk.Revit.DB Namespace