Revit 2024 API
HVACLoadBuildingType Members
The HVACLoadBuildingType type exposes the following members.
Methods
Name | Description
Create
 Creates a building type element.
IsNameUnique(String)
 Determines whether a potential building type name is unique.
IsNameUnique(Document, String)
 Determines whether a potential building type name is unique.
IsValidTime
 Check if the string can be parsed to a valid time for opening time and closing time. A valid string can be "16:30" or "4:30 PM";
Properties
Name | Description
BuildingTypeName
 The building type name.
ClosingTime
 The closing time of the building type.
OpeningTime
 The opening time of the building type.
UnoccupiedCoolingSetPoint
 The unoccupied cooling set point of the building type with unit kelvin (K).
See Also
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace