Revit 2024 API
RoofType Members
The RoofType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ThermalProperties
 The calculated and settable thermal properties of the RoofType
See Also
RoofType Class
Autodesk.Revit.DB Namespace