Revit 2024 API
PanelScheduleData Members
The PanelScheduleData type exposes the following members.
Methods
Name | Description
AddLoadClassification
 Add a Load Classification Id to the array of Load Classifications.
GetLoadClassifications
 Gets an array of the load classifications associated with this panel schedule
GetNumberOfCircuitRows
 Gets the number of rows in the circuit table
IsSymmetric
 Check if this panel schedule is symmetric
RemoveLoadClassification
 Remove a Load Classification Id from the array of Load Classifications
SetBorderAroundSchedule
 Adds a border around the schedule
SetBorderAroundSections
 Adds a border around the sections
SetLoadClassifications
 Sets the Load Classifications associated with this panel schedule
UpdateCircuitTableForInstance
 Redraw the circuit table for the given panel with the given parameter updates
UpdateCircuitTableForTemplate
 Redraw the circuit table for a template with the given parameter updates
UpdateIsSectionHidden
 Update if this section is hidden or not
UpdateLoadSummary
 Update the load summary section
UpdateVerticalHeadersInSection
 Sets if this header should have vertical text
Properties
Name | Description
BodyShowsVerticalHeaders
 Shows text in the Load Summary section's headers vertically instead of horizontally
BorderAroundSchedule
 Places a border (GraphicStyle element) around the entire schedule, visible only on the instance and sheet
BorderAroundSections
 Places a border (GraphicStyle element) around each section, visible only on the instance and sheet
IsAutoShadingForLoadDisplay
 Display shading of load cells automatically or not.
IsFooterSectionHidden
 True if the user wishes to hide the footer section; setting this value must go through the appropriate update function
IsHeaderSectionHidden
 True if the user wishes to hide the header section; setting this value must go through the appropriate update function
IsPanelSinglePhase
 Identifies if the panel is single phase.
IsSummarySectionHidden
 True if the user wishes to hide the summary section; setting this value must go through the appropriate update function
IsUnusedPhaseHidden
 True if the user wishes to hide the unused phase column of a single phase panel, false otherwise.
NumberOfSlots
 The number of slots in the panel schedule; setting this value must go through the appropriate update function
PanelConfiguration
 The panel configuration of this panel schedule
PhaseLoadType
 This property determines the layout of the phase load columns; setting this value must go through the updateCircuitTable function
PhasesAsCurrents
 If true, the phase columns are currents (A), otherwise they are loads (VA); setting this value must go through the appropriate update function
ScheduleType
 The panel schedule type of this panel schedule
ShowCircuitNumberOnOneRowForMultiphaseCircuits
 Shows the circuit number broken up on each row of the multiphase circuit rows if true, all on the first row otherwise
ShowMultipleRowsForMultiphaseCircuits
 shows extra rows below multiphase circuits to indicate how many slots they take up if true, all on a single row otherwise
ShowSlotFromDeviceInsteadOfTemplate
 When true, the number of rows in an instance will be the number of poles on the associated device, not a set number
SummaryShowsGroups
 Show groups of load classifications in the load summary section
SummaryShowsOnlyConnectedLoads
 Show only the connected load classifications in the summary section
SummaryShowsVerticalHeaders
 Shows text in the Load Summary section's headers vertically instead of horizontally
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace