Revit 2024 API
GroupSet Members
The GroupSet type exposes the following members.
Constructors
Name | Description
GroupSet
Initializes a new instance of the GroupSet class
Methods
Name | Description
Clear
Removes every group from the set, rendering it empty.
Contains
Tests for the existence of a group within the set.
Erase
Removes a specified group from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified group into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of groups that are in the set.
See Also
GroupSet Class
Autodesk.Revit.DB Namespace