Revit 2024 API
ScheduleSheetInstance Members
The ScheduleSheetInstance type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, XYZ)
 Create an instance of a schedule on a sheet.
Create(Document, ElementId, ElementId, XYZ, Int32)
 Creates an instance of a schedule segment on a sheet.
Properties
Name | Description
IsTitleblockRevisionSchedule
 Identifies if this ScheduleSheetInstance is a revision schedule in a titleblock family.
Point
 Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Rotation
 Rotation of the ScheduleInstance.
ScheduleId
 Id of the primary schedule that generates this ScheduleInstance.
SegmentIndex
 The schedule segment index of this ScheduleSheetInstance.
See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace