Revit 2024 API
NurbsSurfaceData Members
The NurbsSurfaceData type exposes the following members.
Constructors
Name | Description
NurbsSurfaceData
 Copy constructor.
Methods
Name | Description
Create
 Construct NurbsSurfaceData based on NURBS surface data, where the weights are supplied. The NURBS surface will be (piecewise) polynomial if all the weights are equal, rational if not. Note: A rational polynomial is a quotient of two polynomials; this includes a polynomial, which can be thought of as a quotient with denominator equal to 1.
Dispose
Releases all resources used by the NurbsSurfaceData
GetControlPoints
 Get the list of control points.
GetKnotsU
 Get the list of knots in the u-direction.
GetKnotsV
 Get the list of knots in the v-direction.
GetWeights
 Get the list of weights.
IsValid
 Check if the object contains a valid NurbsSurfaceData.
Properties
Name | Description
DegreeU
 The degree of the spline in the u-direction.
DegreeV
 The degree of the spline in the v-direction.
IsRational
 Tells if the spline is rational or not. If it is true (rational), then the NURBS is a piecewise rational polynomial function. If it is false (non-rational), then the NURBS is a piecewise polynomial function.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ReverseOrientation
 If true, the surface's orientation is opposite to the canonical parametric orientation, otherwise it is the same. The canonical parametric orientation is a counter-clockwise sense of rotation in the uv-parameter plane. Extrinsically, the oriented normal vector for the canonical parametric orientation points in the direction of the cross product dS/du x dS/dv, which S(u, v) is the parameterized surface.
See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace