Revit 2024 API
MultiSegmentGrid Properties
The MultiSegmentGrid type exposes the following members.
Properties
Name | Description
Text
 name shared by grids in this MultiSegmentGrid
See Also
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace