Revit 2024 API
CheckoutElementsRequestTooLargeException Members
The CheckoutElementsRequestTooLargeException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
CheckoutElementsRequestTooLargeException Class
Autodesk.Revit.Exceptions Namespace