Revit 2024 API
Outline Members
The Outline type exposes the following members.
Constructors
Name | Description
Outline(Outline)
 Constructs a new copy of the input Outline object.
Outline(XYZ, XYZ)
 Constructor that uses a minimum and maximum XYZ point to initialize the outline.
Methods
Name | Description
AddPoint
 Adds a point to the bounding box, expanding it if the point is outside the existing boundary.
Contains
 Determine if this Outline contains the specified point to within a tolerance.
ContainsOtherOutline
 Determine if this Outline contains another Outline to within tolerance.
Dispose
Releases all resources used by the Outline
GetDiagonalLength
 Get the length of outline's diagonal. If called on empty outline, 0. is returned
Intersects
 Determine if this Outline intersects the input Outline to within a specified tolerance.
IsScaleValid
 Checks if given scale is valid. Should be greater than zero.
Scale
 Scales the bounding box by given scale.
Properties
Name | Description
IsEmpty
 Identifies if the outline represents an empty outline.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaximumPoint
 The maximum point of the bounding box.
MinimumPoint
 The minimum point of the bounding box.
See Also
Outline Class
Autodesk.Revit.DB Namespace