Revit 2024 API
CurveByPointsArray Members
The CurveByPointsArray type exposes the following members.
Constructors
Name | Description
CurveByPointsArray
Initializes a new instance of the CurveByPointsArray class
Methods
Name | Description
Append
Clear
Removes every curve from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a curve at a specified index within the array.
Size
Returns the number of curves that are in the array.
See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace