Revit 2024 API
ElementLogicalFilter Members
The ElementLogicalFilter type exposes the following members.
Methods
Name | Description
GetFilters
 Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
SetFilters
 Replaces current filters in the logical filter with any number of input filters.
Properties
Name | Description
See Also
ElementLogicalFilter Class
Autodesk.Revit.DB Namespace