Revit 2024 API
PrimarySizeCriterion Members
The PrimarySizeCriterion type exposes the following members.
Constructors
Name | Description
PrimarySizeCriterion
 Constructs a PrimarySizeCriterion with a minimum and maximum size.
Methods
Name | Description
All
 Creates a criterion with a range of all sizes.
None
 Creates a criterion with a range of no sizes.
Properties
Name | Description
MaximumSize
 The maximum size of this criterion.
MinimumSize
 The minimum size of this criterion.
See Also
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace