Revit 2024 API
MultiServerService Members
The MultiServerService type exposes the following members.
Methods
Name | Description
GetActiveServerIds()
 Returns Ids of the currently active application-level servers registered for the service.
GetActiveServerIds(Document)
 Returns Ids of the servers currently applicable to the given document for the service.
SetActiveServers(IList<Guid>)
 Changes the active servers and/or their order.
SetActiveServers(IList<Guid>, Document)
 Changes the active servers and/or their order for the given document.
SetServerState
 This method will simply switch the active state of a server without affecting in any way the other servers.
Properties
Name | Description
ExecutionPolicy
 Specifies how a multi-server service executes servers during its execution.
See Also
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace