Revit 2024 API
ViewSheetSetting Members
The ViewSheetSetting type exposes the following members.
Methods
Name | Description
Delete
Delete the current view sheet set, and make the In-Session set as the current one.
Rename
Rename the current view sheet set.
Revert
Revert the current view sheet set.
Save
Save the changes for the current view sheet set.
SaveAs
Save the current view sheet set to another view sheet set with the specified name.
Properties
Name | Description
AvailableViews
All views that can be printed.
CurrentViewSheetSet
The current view sheet set of PrintSetup.
InSession
The in-session view sheet set of Print Setup.
See Also
ViewSheetSetting Class
Autodesk.Revit.DB Namespace