Revit 2024 API
DocumentOpeningEventArgs Members
The DocumentOpeningEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DocumentType
 Type of the document, e.g. Project or Template.
PathName
 Path of the document to be opened.
See Also
DocumentOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace