Revit 2024 API
ValidateCurveLoopsOptions Members
The ValidateCurveLoopsOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ValidateCurveLoopsOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ValidateCurveLoopsOptions Class
Autodesk.Revit.DB Namespace