Revit 2024 API
DistributionSysTypeSet Members
The DistributionSysTypeSet type exposes the following members.
Constructors
Name | Description
DistributionSysTypeSet
Initializes a new instance of the DistributionSysTypeSet class
Methods
Name | Description
Clear
Removes every DistributionSys type from the set, rendering it empty.
Contains
Tests for the existence of a DistributionSys type within the set.
Erase
Removes a specified DistributionSys type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified DistributionSys type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of DistributionSys types that are in the set.
See Also
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace