Revit 2024 API
LightDistribution Members
The LightDistribution type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the LightDistribution derived object.
Dispose
Releases all resources used by the LightDistribution
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LightDistribution Class
Autodesk.Revit.DB.Lighting Namespace