Revit 2024 API
AreaBasedLoadBoundaryLineData Members
The AreaBasedLoadBoundaryLineData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the AreaBasedLoadBoundaryLineData
GetLevelIdsInRange
 Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line.
IsElevationWithinRange
 Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line.
IsLevelWithinRange
 Checks whether the given level is between the bottom level and the top level (including the bottom level and the top level) of the area based load boundary line.
Properties
Name | Description
BottomLevelId
 The bottom level id of the area based load boundary line.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TopLevelId
 The top level id of the area based load boundary line.
See Also
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace