Revit 2024 API
InvalidOperationException Members
The InvalidOperationException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
InvalidOperationException Class
Autodesk.Revit.Exceptions Namespace