Revit 2024 API
TessellatedShapeBuilder Members
The TessellatedShapeBuilder type exposes the following members.
Constructors
Name | Description
TessellatedShapeBuilder
 Constructs a new instance of a TessellatedShapeBuilder.
Methods
Name | Description
AddFace
 Adds a face to the currently open connected face set.
AreTargetAndFallbackCompatible
 Checks whether this combination of fallback and target parameters can be used as a valid combination of inputs.
Build
 Builds the designated geometrical objects from the stored face sets. Stores the result in this TessellatedShapeBuilder object.
CancelConnectedFaceSet
 Cancels the current face set - i.e., all data from it will be lost and the builder will have no open connected face set anymore.
Clear
 Erases all face set and clears the logs, if any.
CloseConnectedFaceSet
 Closes the currently open connected face set.
CreateMeshByExtrusion
 Builds a mesh by extruding curve loop(s) along extrusion distance.
DoesFaceHaveEnoughLoopsAndVertices
 Checks whether 'face' has enough loops and vertcies to be valid.
GetBuildResult
 Get the built geometry, build status and other data stored in TessellatedShapeBuilderResult. Clears the stored data.
OpenConnectedFaceSet
 Opens a new connected face set.
Properties
Name | Description
Fallback
 Defines acceptable fallback if the desired type of geometry can't be built.
GraphicsStyleId
 Optional - if set, the built geometry will use that graphics style.
IsFaceSetOpen
 Flag whether the current set of connected faces is open and additional tessellation faces can be added to it.
LogInteger
 Integer value used for logging, if it is performed. Usually the number of the face set(s) in the IFC file, from which they are imported. Any value is acceptable.
LogString
 String used for logging, if any. Usually the name of the file from which face sets were imported.
NumberOfCompletedFaceSets
 Number of completed face sets.
OwnerInfo
 String used for logging, if any. Usually describes the element or object, which either defined or will own the geoemtrical objects to be built.
Target
 Requests the type of geometry to be built.
See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace