Revit 2024 API
ModuleSettings Members
The ModuleSettings type exposes the following members.
Constructors
Name | Description
ModuleSettings
 Constructs a new module settings.
Methods
Name | Description
Dispose
Releases all resources used by the ModuleSettings
Properties
Name | Description
Description
 The module description.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroLanguageType
 The Macro language type.
Name
 The module name.
See Also
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace