Revit 2024 API
TransmittedModelException Members
The TransmittedModelException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
TransmittedModelException Class
Autodesk.Revit.Exceptions Namespace