Revit 2024 API
ExternallyTaggedNonBRep Members
The ExternallyTaggedNonBRep type exposes the following members.
Constructors
Name | Description
ExternallyTaggedNonBRep
 Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject.
Methods
Name | Description
SetUsage
 Controls the usage of this ExternallyTaggedNonBRep.
Properties
Name | Description
See Also
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace