Revit 2024 API
IMultiServerService Members
The IMultiServerService type exposes the following members.
Methods
Name | Description
CanExecute
 Implement this to test whether a particular server should be executed.
See Also
IMultiServerService Interface
Autodesk.Revit.DB.ExternalService Namespace