Revit 2024 API
Asset Members
The Asset type exposes the following members.
Methods
Name | Description
Properties
Name | Description
AssetType
 The type of RenderingAsset
LibraryName
 Library name
Title
 Asset title
See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace