Revit 2024 API
ArgumentsInconsistentException Members
The ArgumentsInconsistentException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ArgumentsInconsistentException Class
Autodesk.Revit.Exceptions Namespace