Revit 2024 API
CADLinkOptions Members
The CADLinkOptions type exposes the following members.
Constructors
Name | Description
CADLinkOptions(CADLinkOptions)
 Constructs a new copy of the input CADLinkOptions object.
CADLinkOptions(Boolean, ElementId)
 Creates a CADLinkOptions object, specifying whether to preserve graphic overrides, and what view to use if the link's view has been deleted.
Methods
Name | Description
Dispose
Releases all resources used by the CADLinkOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PreserveOverrides
 Whether Revit should preserve the link's graphic overrides on reload.
ViewId
 The id of the view to use as the link's reference view, if the reference view has been deleted.
See Also
CADLinkOptions Class
Autodesk.Revit.DB Namespace