Revit 2024 API
SymbolicCurve Members
The SymbolicCurve type exposes the following members.
Methods
Name | Description
GetVisibility
Gets the visibility for the symbolic curve.
SetVisibility
Sets the visibility for the symbolic curve.
Properties
Name | Description
IsDrawnInForeground
Indicates if this curve will be drawn in the foreground of the family instance.
ReferenceType
Indicates the type of reference.
Subcategory
The subcategory.
See Also
SymbolicCurve Class
Autodesk.Revit.DB Namespace