Revit 2024 API
PointCloudInstance Members
The PointCloudInstance type exposes the following members.
Methods
Name | Description
ContainsScan
 Identifies whether the instance contains a scan.
Create
 Creates a new instance of a point cloud based on an input point cloud type and transformation.
GetPoints
 Extracts a collection of points based on a filter.
GetRegions
 Returns array of region names.
GetScanOrigin
 Returns the origin point of a scan in model coordinates.
GetScans
 Returns array of scan names.
GetSelectionFilter
 Returns the currently active selection filter for this point cloud.
HasColor
 Returns true if at least one scan of the element have color, false otherwise.
SetSelectionFilter
 Sets active selection filter by cloning of the one passed to it.
Properties
Name | Description
FilterAction
 The action taken based on the results of the selection filter applied to this point cloud.
SupportsOverrides
 Identifies whether the instance can have graphic overrides.
See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace