Revit 2024 API
PipingSystemType Members
The PipingSystemType type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a piping system type and adds it to the document.
ValidateRiseDropSymbolType
 Confirms if the parameter is a valid piping rise/drop symbol type.
Properties
Name | Description
FlowConversionMethod
 The flow conversion method for the piping system type.
FluidTemperature
 Fluid Temperature, in Kelvin.
FluidType
 Fluid Type
SingleLineBendDropType
 Symbol for a 1 line drop
SingleLineBendRiseType
 Symbol for a 1 line rise
SingleLineJunctionDropType
 Symbol for a 1 line junction drop
SingleLineJunctionRiseType
 Symbol for a 1 line junction rise
TwoLineDropType
 Symbol for a 2 line drop
TwoLineRiseType
 Symbol for a 2 line rise
See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace