Revit 2024 API
SymbolicCurveArray Members
The SymbolicCurveArray type exposes the following members.
Constructors
Name | Description
SymbolicCurveArray
Initializes a new instance of the SymbolicCurveArray class
Methods
Name | Description
Append
Add the model curve to the end of the array.
Clear
Removes every model curve from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified model curve into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a model curve at a specified index within the array.
Size
Returns the number of model curves that are in the array.
See Also
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace