Revit 2024 API
FaceArray Members
The FaceArray type exposes the following members.
Constructors
Name | Description
FaceArray
Initializes a new instance of the FaceArray class
Methods
Name | Description
Append
Add the face to the end of the array.
Clear
Removes every face from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified face into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a face at a specified index within the array.
Size
Returns the number of faces that are in the array.
See Also
FaceArray Class
Autodesk.Revit.DB Namespace