Revit 2024 API
IFCExtrusionCalculatorOptions Methods
The IFCExtrusionCalculatorOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace