Revit 2024 API
IntersectionResultArrayIterator Members
The IntersectionResultArrayIterator type exposes the following members.
Constructors
Name | Description
IntersectionResultArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
IntersectionResultArrayIterator Class
Autodesk.Revit.DB Namespace