Revit 2024 API
InvalidObjectException Members
The InvalidObjectException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
InvalidObjectException Class
Autodesk.Revit.Exceptions Namespace