Revit 2024 API
AssetPropertyFloatArray Members
The AssetPropertyFloatArray type exposes the following members.
Methods
Name | Description
GetValue
Get the value of the property.
Properties
Name | Description
See Also
AssetPropertyFloatArray Class
Autodesk.Revit.DB.Visual Namespace