Revit 2024 API
AnalyticalLink Members
The AnalyticalLink type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a AnalyticalLink element between two Hubs.
IsAutoGenerated
 Specifies whether or not an AnalyticalLink was created by an Analytical Element.
IsValidHub
 Checks whether input hub is valid for an AnalyticalLink.
Properties
Name | Description
End
 The point at the end of the AnalyticalLink.
EndHubId
 Hub ID at end of AnalyticalLink.
OwnerId
 ElementId of Analytical Element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API
Start
 The point at the start of the AnalyticalLink.
StartHubId
 Hub ID at start of AnalyticalLink.
See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace