Revit 2024 API
Face Members
The Face type exposes the following members.
Methods
Name | Description
ComputeDerivatives
Returns the first partial derivatives of the underlying surface at the specified point.
ComputeNormal
Returns the normal vector for the face at the given point.
ComputeSecondDerivatives
Returns the second partial derivatives of the face at the specified point.
Evaluate
Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.
GetBoundingBox
Returns the UV bounding box of the face.
GetEdgesAsCurveLoops
Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
GetRegions
Gets the face regions (created, for example, by the Split Face command) of the face.
GetSurface
Returns a copy of this face's surface.
Intersect(Curve)
Calculates the intersection of the specified curve with this face.
Intersect(Face)
Calculates the intersection of the specified face with this face and returns the intersection results.
Intersect(Curve, IntersectionResultArray)
Calculates the intersection of the specified curve with this face and returns the intersection results.
Intersect(Face, Curve)
Calculates the intersection of the specified face with this face and returns the intersection results.
IsInside(UV)
Indicates whether the specified point is within this face.
IsInside(UV, IntersectionResult)
Indicates whether the specified point is within this face and outputs additional information about the point location.
Project
Projects the specified point on the face.
Triangulate()
Returns a triangular mesh approximation to the face.
Triangulate(Double)
Returns a triangular mesh approximation to the face.
Properties
Name | Description
Area
The area of this face.
EdgeLoops
A collection of edge loops. Each edge loop represents one of the closed boundaries of the face.
HasRegions
Identifies if the face contains regions (which can be created, for example, by the Split Face command).
IsCyclic
Indicates whether the underlying surface is periodic in the specified parametric direction.
IsTwoSided
Determines if a face is two-sided (degenerate).
MaterialElementId
The element ID of the material from which this face is composed.
OrientationMatchesSurfaceOrientation
 Returns true if this face's orientation matches the orientation of the face's surface, false if they have opposite orientations.
Period
The period of the underlying surface in the specified parametric direction.
Reference
Returns a stable reference to the face.
See Also
Face Class
Autodesk.Revit.DB Namespace