Revit 2024 API
SelectionChangedEventArgs Members
The SelectionChangedEventArgs type exposes the following members.
Methods
Name | Description
GetDocument
 Returns the document associated with this event.
GetReferences
 Returns the references that are currently selected.
GetSelectedElements
 Returns ElementIds of selected elements.
Properties
Name | Description
See Also
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace