Revit 2024 API
MEPBuildingConstructionSet Members
The MEPBuildingConstructionSet type exposes the following members.
Constructors
Name | Description
MEPBuildingConstructionSet
Initializes a new instance of the MEPBuildingConstructionSet class
Methods
Name | Description
Clear
Removes every MEPBuildingConstruction from the set, rendering it empty.
Contains
Tests for the existence of a MEPBuildingConstruction within the set.
Erase
Removes a specified MEPBuildingConstruction from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified MEPBuildingConstruction into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of MEPBuildingConstructions that are in the set.
See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace