Revit 2024 API
FailureDefinition Members
The FailureDefinition type exposes the following members.
Methods
Name | Description
AddResolutionType
 Adds a type of possible resolution for the failure.
CreateFailureDefinition
 Creates an instance of a FailureDefinition.
Dispose
Releases all resources used by the FailureDefinition
GetApplicableResolutionTypes
 Retrieves a list of resolution types applicable to the failure.
GetDefaultResolutionType
 Retrieves the default resolution type for the failure.
GetDescriptionText
 Retrieves the description text of the failure.
GetResolutionCaption
 Retrieves the caption for a specific resolution type.
HasResolutions
 Checks if the FailureDefinition has at least one resolution.
IsResolutionApplicable
 Checks if the given resolution type is applicable to the failure.
SetDefaultResolutionType
 Sets the default resolution type for the failure.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Severity
 The severity of the failure.
See Also
FailureDefinition Class
Autodesk.Revit.DB Namespace