Revit 2024 API
TriangulationInterface Methods
The TriangulationInterface type exposes the following members.
Methods
Name | Description
Dispose
See Also
TriangulationInterface Class
Autodesk.Revit.DB Namespace