Revit 2024 API
WallSweepInfo Members
The WallSweepInfo type exposes the following members.
Constructors
Name | Description
WallSweepInfo(Boolean, WallSweepType)
 Constructs a new WallSweepInfo instance.
WallSweepInfo(WallSweepType, Boolean)
 Constructs a new WallSweepInfo instance.
Methods
Name | Description
Dispose
Releases all resources used by the WallSweepInfo
IsEqual
 Determines if the input object is equivalent to this WallSweepInfo.
Properties
Name | Description
CutsWall
 Indicates if you want the sweep to cut geometry out of the host wall.
DefaultSetback
 The sweep setback distance from inserts, such as windows and doors.
Distance
 Represents the distance from either the top or base of the wall for horizontal sweeps, or the parameter along the wall's path curve for vertical ones.
DistanceMeasuredFrom
 Indicates if Distance is measured from the top or bottom of the wall.
Id
 The id of the sweep or reveal.
IsCutByInserts
 Indicates if the sweep is cut by wall inserts.
IsFixed
 Indicates if the described wall sweep is fixed. A sweep is fixed if it is a part of a vertical compound structure.
IsProfileFlipped
 Indicates if the profile is applied upside-down.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsVertical
 Indicates whether the sweep or reveal is swept vertically or horizontally.
MaterialId
 The element id of the material used to create the sweep or reveal.
ProfileId
 The element id of the profile family used to create the sweep or reveal.
WallOffset
 The offset from the sweep or reveal to the wall.
WallSide
 The side of the wall to which the sweep or reveal is attached.
WallSweepOrientation
 Indicates how the profile of a horiztonal sweep is oriented with repect to the wall side face.
WallSweepType
 The type (either a wall sweep or a reveal).
See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace