Revit 2024 API
ExternalResourceServerExtensions Members
The ExternalResourceServerExtensions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalResourceServerExtensions
GetCADLinkOperations
 Gets the specific methods supported by external resource CAD Links.
GetRevitLinkOperations
 Gets the specific methods supported by the external resource of Revit Links.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace