Revit 2024 API
HomeCamera Members
The HomeCamera type exposes the following members.
Constructors
Name | Description
HomeCamera
 Constructs a new copy of the input HomeCamera object.
Methods
Name | Description
Dispose
Releases all resources used by the HomeCamera
Properties
Name | Description
BottomAngleOfFieldOfView
 The bottom angle of the field of view.
Center
 The zoom or orbit center.
EyePosition
 The eye position point.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LeftAngleOfFieldOfView
 The left angle of the field of view.
OrthogonalProjectionHeight
 The height of orthogonal projection view volume.
OrthogonalProjectionWidth
 The width of orthogonal projection view volume.
Pivot
 The pivot point.
RightAngleOfFieldOfView
 The right angle of the field of view.
TopAngleOfFieldOfView
 The top angle of the field of view.
UpDirection
 The up direction vector.
ViewId
 The id of the view which is associated to this document's Home view orientation.
See Also
HomeCamera Class
Autodesk.Revit.DB Namespace