Revit 2024 API
DuctSizes Members
The DuctSizes type exposes the following members.
Methods
Name | Description
Contains
 Checks whether a duct size with the nominal diameter exists.
Dispose
Releases all resources used by the DuctSizes
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetDuctSizeIterator
Returns a DuctSizeIterator that iterates through the collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
Properties
Name | Description
Count
 Count of the items contained in the collection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace