Revit 2024 API
RebarShapeDefinitionByArc Members
The RebarShapeDefinitionByArc type exposes the following members.
Constructors
Name | Description
RebarShapeDefinitionByArc(Document, RebarShapeDefinitionByArcType)
 Create a non-spiral shape definition.
RebarShapeDefinitionByArc(Document, Double, Double, Int32, Int32)
 Create a spiral shape definition.
Methods
Name | Description
AddConstraintArcLength
 Specify a parameter to drive the arc length of the shape.
AddConstraintChordLength
 Specify a parameter to drive the chord length (the straight-line distance between the endpoints of the arc).
AddConstraintCircumference
 Specify a parameter to drive the circumference of the shape.
AddConstraintDiameter
 Specify a parameter to drive the diameter of the shape.
AddConstraintRadius
 Specify a parameter to drive the radius of the shape.
AddConstraintSagittaLength
 Specify a parameter to drive the sagittal length (the height of the circular segment, measured perpendicular to the chord).
GetConstraints
 Retrieve the list of constraints associated with this definition.
SetArcTypeSpiral
 Set the RebarShapeDefinitionByArc.Type property to Spiral.
SetConstraints
 Assign a new list of constraints to this definition.
Properties
Name | Description
Type
 Among those rebar shapes defined by an arc, specify which kind.
See Also
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace