Revit 2024 API
ExternalResourceSubFolder Members
The ExternalResourceSubFolder type exposes the following members.
Constructors
Name | Description
ExternalResourceSubFolder()
 Constructs a new ExternalResourceSubFolder with default values for folder name and icon path.
ExternalResourceSubFolder(String, String)
 Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalResourceSubFolder
Properties
Name | Description
FolderName
 Folder displayed name.
IconPath
 The path of the resource icon.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace