Revit 2024 API
StructuralInstanceUsageFilter Members
The StructuralInstanceUsageFilter type exposes the following members.
Constructors
Name | Description
StructuralInstanceUsageFilter(StructuralInstanceUsage)
 Constructs a new instance of a filter to match structural family instances (typically columns, beams, or braces) of the given structural usage.
StructuralInstanceUsageFilter(StructuralInstanceUsage, Boolean)
 Constructs a new instance of a filter to match family instances by structural usage, with the option to match all family instances which are not of the given structural usage.
Methods
Name | Description
Properties
Name | Description
StructuralUsage
 The family instance structural usage.
See Also
StructuralInstanceUsageFilter Class
Autodesk.Revit.DB.Structure Namespace