Revit 2024 API
DocumentDifference Members
The DocumentDifference type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DocumentDifference
GetCreatedElementIds
 Created element id collection.
GetDeletedElementIds
 Deleted element id collection. For non-worksharing models, this will always be an empty collection.
GetModifiedElementIds
 Modified element id collection.
Properties
Name | Description
AreDeletedElementIdsAvailable
 Whether or the deleted elements were retrieved.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace