Revit 2024 API
ViewScheduleExportOptions Members
The ViewScheduleExportOptions type exposes the following members.
Constructors
Name | Description
ViewScheduleExportOptions()
 Constructs a new instance of the ViewScheduleExportOptions class
ViewScheduleExportOptions(ViewScheduleExportOptions)
 Constructs a new copy of the input ViewScheduleExportOptions object.
Methods
Name | Description
Dispose
Releases all resources used by the ViewScheduleExportOptions
Properties
Name | Description
ColumnHeaders
 How to export column headers. Default is MultipleRows.
FieldDelimiter
 How to delimit fields. Default is Tab.
HeadersFootersBlanks
 Whether to export group headers, footers, and blank lines. Default is true.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TextQualifier
 How to qualify text fields. Default is DoubleQuote.
Title
 Whether or not to export the schedule title. Default is true.
See Also
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace