Revit 2024 API
TabbedDialogExtension Members
The TabbedDialogExtension type exposes the following members.
Constructors
Name | Description
TabbedDialogExtension
Constructs a extension instance with a control and ok action handler.
Methods
Name | Description
GetContextualHelp
Gets the contextual help.
SetContextualHelp
Sets the contextual help.
Properties
Name | Description
Control
The control.
OnCancelAction
The cancel handler.
OnOKAction
The ok handler.
OnRestoreDefaultsAction
The restore defaults handler.
See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace