Revit 2024 API
StructuralSectionSigmaProfileWithFold Members
The StructuralSectionSigmaProfileWithFold type exposes the following members.
Constructors
Name | Description
StructuralSectionSigmaProfileWithFold
 Creates a new instance of Structural Section Sigma Profile With Fold shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
BendWidth
 Bend segment width.
FoldWidth
 Fold segment width.
LipLength
 Lip segment length.
MiddleBendLength
 Middle Bend segment length.
TopBendLength
 Top Bend segment length.
See Also
StructuralSectionSigmaProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace