Revit 2024 API
RegenerationAttribute Members
The RegenerationAttribute type exposes the following members.
Constructors
Name | Description
RegenerationAttribute
Constructs a new RegenerationAttribute.
Methods
Name | Description
Properties
Name | Description
Option
Regeneration option.
See Also
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace