Revit 2024 API
LightFamily Members
The LightFamily type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the LightFamily
GetLightDistributionStyle
 Returns a LightDistributionStyle value for the light distribution
GetLightFamily
 Creates a light family object from the given family document
GetLightShapeStyle
 Returns a LightShapeStyle value for the light shape
GetLightSourceTransform
 Returns a Transform value for the transform of light source.
GetLightType
 Return a LightType object for the light type at the given index
GetLightTypeName
 Return the name for the light type at the given index
GetNumberOfLightTypes
 Return the number of light types contained in this light family
SetLightDistributionStyle
 Set the light distribution style to the given shape distribution
SetLightShapeStyle
 Set the light shape style to the given shape style
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace