Revit 2024 API
InitialIlluminanceIntensity Members
The InitialIlluminanceIntensity type exposes the following members.
Constructors
Name | Description
InitialIlluminanceIntensity(InitialIlluminanceIntensity)
 Creates a copy of the given initial illuminance intensity object
InitialIlluminanceIntensity(Double, Double)
 Creates an initial illuminance intensity object with the given document and illuminance values.
Methods
Name | Description
Properties
Name | Description
Distance
 The illuminance intensity distance value.
Illuminance
 The illuminance intensity value.
See Also
InitialIlluminanceIntensity Class
Autodesk.Revit.DB.Lighting Namespace