Revit 2024 API
ConduitType Members
The ConduitType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsWithFitting
 Whether this conduit type is with fitting
See Also
ConduitType Class
Autodesk.Revit.DB.Electrical Namespace