Revit 2024 API
ElementWorksetFilter Members
The ElementWorksetFilter type exposes the following members.
Constructors
Name | Description
ElementWorksetFilter(WorksetId)
 Constructs a new instance of a filter to match elements in a given workset.
ElementWorksetFilter(WorksetId, Boolean)
 Constructs a new instance of a filter to match elements in a given workset.
Methods
Name | Description
Properties
Name | Description
WorksetId
 The workset id.
See Also
ElementWorksetFilter Class
Autodesk.Revit.DB Namespace