Revit 2024 API
CurtainSystem Members
The CurtainSystem type exposes the following members.
Methods
Name | Description
AddCurtainGrid
Add CurtainGrid on the specified face for the CurtainSystem.
RemoveCurtainGrid
Remove CurtainGrid from the specified face for the CurtainSystem.
Properties
Name | Description
CurtainGrids
Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face.
CurtainSystemType
get or set the type of the CurtainSystem.
See Also
CurtainSystem Class
Autodesk.Revit.DB Namespace