Revit 2024 API
KeyBasedTreeEntriesLoadResults Members
The KeyBasedTreeEntriesLoadResults type exposes the following members.
Constructors
Name | Description
KeyBasedTreeEntriesLoadResults
 Creates an empty KeyBasedTreeEntriesLoadResults.
Methods
Name | Description
Dispose
Releases all resources used by the KeyBasedTreeEntriesLoadResults
GetFailureMessages
 Get all error or warnings created while attempting to load KeyBasedTreeEntries.
GetFileReadErrors
 Gets the names of any files which could not be read due to access errors.
GetFileSyntaxErrors
 Gets all the records in the key-based tree data text file that could not be parsed into KeyBasedTreeEntries.
GetKeyBasedTreeEntryErrors()
 Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors.
GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType)
 Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors of a particular type.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace