Revit 2024 API
PushButton Members
The PushButton type exposes the following members.
Methods
Name | Description
Properties
Name | Description
AssemblyName
The assembly path of the button.
AvailabilityClassName
The full class name for the class providing the entry point to decide availability of this push button.
ClassName
The name of the class containing the implementation for the command.
See Also
PushButton Class
Autodesk.Revit.UI Namespace