Revit 2024 API
ImageTypeOptions Members
The ImageTypeOptions type exposes the following members.
Constructors
Name | Description
ImageTypeOptions(ExternalResourceReference, ImageTypeSource)
 Constructs a new instance of the ImageTypeOptions object.
ImageTypeOptions(String, Boolean, ImageTypeSource)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
This constructor saves an additional setting that indicates whether the imagetype will be a link or an import.
Methods
Name | Description
Dispose
Releases all resources used by the ImageTypeOptions
IsValid
 If true the ImageTypeOptions can be used to create or reload an ImageType.
SetExternalResourceReference
 Update the external resource reference to an image.
SetPath(String)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
SetPath(String, Boolean)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
Additionally, indicate whether the path used by ImageType should be absolute or relative.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PageNumber
 The page in the file to be used for the image
Path
 The path of the file that specifies the image to be used.
Resolution
 The Resolution of the image is expressed in dots-per-inch and hence determines the size of a pixel in the image.
SourceType
 Indicates whether the image type is a link or an import.
See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace