Revit 2024 API
ModelCurveNode Members
The ModelCurveNode type exposes the following members.
Methods
Name | Description
Properties
Name | Description
LineProperties
 Access to the line (pen) properties of the curve being drawn
See Also
ModelCurveNode Class
Autodesk.Revit.DB Namespace