Revit 2024 API
AreaBasedLoadData Properties
The AreaBasedLoadData type exposes the following members.
Properties
Name | Description
ApparentLoad
 The electrical apparent load of the area based load.
ApparentPowerDensity
 The apparent power density of the area based load.
AreaBasedLoadType
 The electrical area based load type of the area based load.
Current
 The current of the area based load .
LoadClassification
 The load classification of the area based load.
LoadDensity
 The load density of the area based load.
LoadType
 The load type of the area based load.
PhasesNumber
 The Phases Number of the area based load.
PowerFactor
 The power factor of the area based load.
TrueLoad
 The electrical true load of the area based load.
Voltage
 The voltage of the area based load.
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace