Revit 2024 API
MassInstanceUtils Members
The MassInstanceUtils type exposes the following members.
Methods
Name | Description
AddMassLevelDataToMassInstance
 Create a MassLevelData (Mass Floor) to associate a Level with a mass instance.
Dispose
Releases all resources used by the MassInstanceUtils
GetGrossFloorArea
 Get the total occupiable floor area represented by a mass instance.
GetGrossSurfaceArea
 Get the total exterior building surface area represented by a mass instance.
GetGrossVolume
 Get the total building volume represented by a mass instance.
GetJoinedElementIds
 Get the ElementIds of Elements that are joined to a mass instance.
GetMassLevelDataIds
 Get the ElementIds of the MassLevelDatas (Mass Floors) associated with a mass instance.
GetMassLevelIds
 Get the ElementIds of the Levels associated with a mass instance.
RemoveMassLevelDataFromMassInstance
 Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
MassInstanceUtils Class
Autodesk.Revit.DB Namespace