Revit 2024 API
LoadNature Methods
The LoadNature type exposes the following members.
Methods
Name | Description
Create
 Creates a new LoadNature.
See Also
LoadNature Class
Autodesk.Revit.DB.Structure Namespace