Revit 2024 API
ComboBoxData Members
The ComboBoxData type exposes the following members.
Constructors
Name | Description
ComboBoxData
Constructs a new instance of ComboBoxData.
Methods
Name | Description
Properties
Name | Description
Image
The image shown on the ComboBox.
See Also
ComboBoxData Class
Autodesk.Revit.UI Namespace