Revit 2024 API
PropertySetElement Members
The PropertySetElement type exposes the following members.
Methods
Name | Description
Create(Document, StructuralAsset)
 Creates a new PropertySetElement to contain the given asset.
Create(Document, ThermalAsset)
 Creates a new PropertySetElement to contain the given asset.
Duplicate
 Creates a duplicate of this PropertySetElement.
GetStructuralAsset
 Gets a copy of the StructuralAsset.
GetThermalAsset
 Gets a copy of the ThermalAsset.
SetStructuralAsset
 Sets a copy of the given StucturalAsset to be used in the PropertySetElement.
SetThermalAsset
 Sets a copy of the given ThermalAsset to be used in the PropertySetElement.
Properties
Name | Description
See Also
PropertySetElement Class
Autodesk.Revit.DB Namespace