Revit 2024 API
ElementIdSetFilter Members
The ElementIdSetFilter type exposes the following members.
Constructors
Name | Description
ElementIdSetFilter
 Constructs a new instance of a filter wrapping a set of elements.
Methods
Name | Description
GetIdsToInclude
 Returns the ids of this filter.
Properties
Name | Description
See Also
ElementIdSetFilter Class
Autodesk.Revit.DB Namespace