Revit 2024 API
ElectricalLoadAreaData Members
The ElectricalLoadAreaData type exposes the following members.
Methods
Name | Description
CreateElectricalLoadAreas
 Creates electrical load areas on all the empty plan circuits of the given level.
GetAreaBasedLoadIds
 Gets the area based load ids of the electrical load area to be included.
HasCircuitsWithoutElectricalLoadAreas
 Checks whether there are any empty plan circuits in which there are no electrical load areas.
Properties
Name | Description
See Also
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace