Revit 2024 API
DXFExportOptions Members
The DXFExportOptions type exposes the following members.
Constructors
Name | Description
DXFExportOptions()
 Constructs a new instance of DXFImportOptions with default values of all properties.
DXFExportOptions(DXFExportOptions)
 Constructs a new instance of DXFImportOptions as a copy of the export options.
Methods
Name | Description
GetPredefinedOptions
 Returns an instance DXFExportOptions containing settings from a predefined export setup.
Properties
Name | Description
See Also
DXFExportOptions Class
Autodesk.Revit.DB Namespace