Revit 2024 API
ThermalAsset.Equals Method
Overload List
Name | Description
Equals(ThermalAsset)
 Determines whether this thermal asset is equal to another.
See Also
ThermalAsset Class
ThermalAsset Members
Autodesk.Revit.DB Namespace