Revit 2024 API
AnalyticalElement Members
The AnalyticalElement type exposes the following members.
Methods
Name | Description
GetCurve
 Returns the curve of the Analytical Element.
GetReference
 Returns a reference to a given curve within the Analytical Element.
GetTransform
 Returns the transform which reflects Analytical Element orientation.
IsSingleCurve
 Indicates if the Analytical Element can be expressed as a single curve.
IsValidAnalyzeAs
 Checks whether the value set for Analyze As is valid for an Analytical Element.
IsValidSelector
 Indicates if the input selector is valid for the Analytical Element.
IsValidStructuralRole
 Checks whether the value set for Analytical Structural Role is valid for an Analytical Element.
Properties
Name | Description
AnalyzeAs
 This represents the Analyze As parameter assigned to Analytical Element.
MaterialId
 Defines the Material Id for the Analytical Element.
StructuralRole
 The enum value depicting structural role asigned to the Analytical Element.
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace