Revit 2024 API
IFCTransformSetter Members
The IFCTransformSetter type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a transform setter.
Dispose
Releases all resources used by the IFCTransformSetter
Initialize
 Initializes the transformation in the transform setter.
InitializeFromBoundingBox
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace