Revit 2024 API
LinkLoadContent Members
The LinkLoadContent type exposes the following members.
Methods
Name | Description
GetLinkDataPath
 Returns the Link data path owned by this LinkLoadContent object.
GetLinkLoadResult
 Retrieves the LinkLoadResult of the attempt to load or reload a Revit link.
SetLinkDataPath
 Sets the Link data path owned by this LinkLoadContent object.
Properties
Name | Description
See Also
LinkLoadContent Class
Autodesk.Revit.DB Namespace