Revit 2024 API
BuildingEnvelopeAnalyzer Members
The BuildingEnvelopeAnalyzer type exposes the following members.
Methods
Name | Description
Create
 Creates a new analyzer.
Dispose
Releases all resources used by the BuildingEnvelopeAnalyzer
GetBoundingElements
 Returns the collection of building elements exposed to the outside forming the building envelope.
GetBoundingElementsForSpaceVolume
 Returns the collection of bounding building elements for an enclosed space volume.
GetCenterPointsForConnectedGridCellsInSpaceVolume
 Returns the collection of connected cells in an enclosed space volume.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace