Revit 2024 API
SymbolGeometryId Members
The SymbolGeometryId type exposes the following members.
Methods
Name | Description
AsUniqueIdentifier
 Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
Dispose
Releases all resources used by the SymbolGeometryId
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SymbolId
 The id of the symbol that is containing the shared geometry.
See Also
SymbolGeometryId Class
Autodesk.Revit.DB Namespace