Revit 2024 API
DisplacementElement Members
The DisplacementElement type exposes the following members.
Methods
Name | Description
CanCategoryBeDisplaced
 Indicates whether elements of the specified category are eligible as displaced elements.
CanElementsBeAddedToDisplacementSet
 Indicates if these elements can be displaced by this DisplacementElement.
CanElementsBeDisplaced(View, ICollection<ElementId>)
 Indicates if elements can be assigned to a new DisplacementElement.
CanElementsBeDisplaced(View, ICollection<ElementId>, ElementId)
 Indicates if elements can be assigned to a new DisplacementElement.
Create
 Creates a new DisplacementElement as a child of the specified parent DisplacementElement.
GetAbsoluteDisplacement
 The absolute displacement applied to the displaced elements.
GetAdditionalElementsToDisplace
 Identify a set of elements that potentially should be displaced along with a given element.
GetChildren
 Returns a set of DisplacementElements which have this DisplacementElement as a parent.
GetDisplacedElementIds()
 The ids of the elements affected by this DisplacementElement.
GetDisplacedElementIds(View)
 Returns the element ids of all displaced elements in the specified view.
GetDisplacedElementIdsFromAllChildren
 The element ids of elements displaced by this DisplacementElement and any DisplacementElement which declare this one as parent.
GetDisplacementElementId
 The element id of the DisplacementElement that includes the specified element.
GetDisplacementElementIds
 The element ids of all DisplacementElements owned by the specified view.
GetRelativeDisplacement
 The relative displacement applied to the displaced elements by this DisplacementElement.
IsAllowedAsDisplacedElement
 Indicates if the specified element is allowed to be displaced.
IsElementDisplacedInView
 Indicates if the specified element displaced in the specified View.
IsNotEmpty
 Validates that the input set of element ids is valid for a DisplacementElement.
IsValidAsParentInView
 Indicates whether the specified DisplacementElement can be used as a parent when creating a DisplacementElement in the specified view.
RemoveDisplacedElement
 Remove a displaced element from this DisplacementElement.
ResetDisplacedElements
 Sets the translation of the DisplacementElement to (0, 0, 0). The DisplacementElement continues to exist, but its elements are displayed in their actual location.
SetDisplacedElementIds
 Sets the ids of the elements affected by this DisplacementElement.
SetRelativeDisplacement
 Sets the relative displacement applied to the displaced elements by this DisplacementElement.
Properties
Name | Description
ParentId
 The element id of the parent DisplacementElement. This DisplacementElement's relative transform will be concatenated with the absolute transform of its parent.
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace