Revit 2024 API
RebarBarType Members
The RebarBarType type exposes the following members.
Methods
Name | Description
Create
 Creates a new RebarBarType object
CreateDefaultRebarBarType
 Creates a new RebarBarType object with a default name.
GetAutoCalcHookLengths
 Identifies if the hook lengths of a hook type are automatically calculated for this bar type
GetHookLength
 Identifies the hook length for a hook type
GetHookOffsetLength
 Identifies the hook offset length for a hook type
GetHookPermission
 Identifies if a hook type is permitted for this bar type
GetHookTangentLength
 Identifies the hook tangent length for a hook type
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
SetAutoCalcHookLengths
 Identifies if the hook lengths of a hook type are automatically calculated for this bar type
SetBarTypeDiameters
 Sets all input diameters from diametersOptions in current RebarBarType.
SetHookLength
 Identifies the hook length for a hook type
SetHookOffsetLength
 Identifies the hook offset length for a hook type
SetHookPermission
 Identifies if a hook type is permitted for this bar type
SetHookTangentLength
 Identifies the hook tangent length for a hook type
Properties
Name | Description
BarModelDiameter
 Defines bar model diameter of rebar
BarNominalDiameter
 Defines bar nominal diameter of rebar
DeformationType
 Defines bar deformation type.
MaximumBendRadius
 Defines maximum bend radius of rebar
StandardBendDiameter
 Defines bar bend diameter for rebar whose style is standard
StandardHookBendDiameter
 Defines hook bend diameter for rebar whose style is standard
StirrupTieBendDiameter
 Defines bar and hook bend diameter for rebar whose style is stirrup/tie
See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace