Revit 2024 API
InternalException Members
The InternalException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
InternalException Class
Autodesk.Revit.Exceptions Namespace