Revit 2024 API
StructuralSectionGeneralLA Members
The StructuralSectionGeneralLA type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralLA
 Creates a new instance of Angle Cold Formed shape.
Methods
Name | Description
Properties
Name | Description
LipLength
 Lip segment length.
See Also
StructuralSectionGeneralLA Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace