Revit 2024 API
LineSegment Members
The LineSegment type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the LineSegment
Properties
Name | Description
EndParameter
 Parameter associated with the end point.
EndPoint
 End point of the line segment.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LineProperties
 Access to the line (pen) properties of the line
StartParameter
 Parameter associated with the start point.
StartPoint
 Start point of the line segment.
See Also
LineSegment Class
Autodesk.Revit.DB Namespace