Revit 2024 API
CategoryNameMapIterator Members
The CategoryNameMapIterator type exposes the following members.
Constructors
Name | Description
CategoryNameMapIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the map.
Properties
Name | Description
Current
Retrieves the category that is the current focus of the iterator.
Key
Retrieves the category name that is the current focus of the iterator.
See Also
CategoryNameMapIterator Class
Autodesk.Revit.DB Namespace