Revit 2024 API
FabricationItemFile Members
The FabricationItemFile type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationItemFile
GetImage
Gets the image for the fabrication item file.
IsLoaded
 Checks to see if the item file has been loaded into the configuration.
IsValid
 Checks to see if the item file is valid.
Properties
Name | Description
Identifier
 The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file.
IsUsed
 Checks to see if the item file is already in use in the project.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace