Revit 2024 API
PointNode Members
The PointNode type exposes the following members.
Methods
Name | Description
GetPoint
 Returns the point object corresponding to the node.
Properties
Name | Description
See Also
PointNode Class
Autodesk.Revit.DB Namespace