Revit 2024 API
ExternalResourceSubFolder Methods
The ExternalResourceSubFolder type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace