Revit 2024 API
AssemblyMemberDifference Members
The AssemblyMemberDifference type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the AssemblyMemberDifference
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AssemblyMemberDifference Class
Autodesk.Revit.DB Namespace