Revit 2024 API
RoofComponents Members
The RoofComponents type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RoofComponents
GetAreasOfCurveLoops
 The areas of CurveLoops of roof slabs.
GetCurveLoops
 The CurveLoops of roof slabs.
GetLoopFaces
 The faces of the loops of roof slabs.
GetPlaneDirections
 The plane directions of roof slabs.
GetPlaneOrigins
 The plane origins of roof slabs.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ScaledDepth
 The depth of the roof slab.
See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace