Revit 2024 API
TopographyLinkType Members
The TopographyLinkType type exposes the following members.
Methods
Name | Description
Reload
 Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Properties
Name | Description
See Also
TopographyLinkType Class
Autodesk.Revit.DB.Architecture Namespace