Revit 2024 API
FamilySizeTableErrorInfo Members
The FamilySizeTableErrorInfo type exposes the following members.
Constructors
Name | Description
FamilySizeTableErrorInfo
 Constructs a new FamilySizeTableErrorInfo with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the FamilySizeTableErrorInfo
Properties
Name | Description
FamilySizeTableErrorType
 The error type.
FilePath
 The path of the imported CSV file.
InvalidColumnIndex
 The index of the invalid column.
InvalidHeaderText
 The invalid header text.
InvalidRowIndex
 The index of the invalid row.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace