Revit 2024 API
GenericZone Members
The GenericZone type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a generic zone and adds it to the document.
GetBoundaries
 Gets the boundaries for the generic zone.
GetDomainData
 Gets the domain data for the generic zone.
Properties
Name | Description
LevelOffset
 The offset distance from this zone to the associated level.
See Also
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace