Revit 2024 API
DuctFittingAndAccessoryPressureDropData Members
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctFittingAndAccessoryPressureDropData
GetDuctFittingAndAccessoryData
 Returns the fitting and accessory information.
GetPresureDropItems
 Returns the pressure drop items.
SetDefaultEntity
 Stores the default entity in the data.
Properties
Name | Description
CalculationType
 The calculation type, a bitmask of FittingAndAccessoryCalculationType.
IsCurrentEntityValid
 True if the current settings stored in the entity is valid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace