Revit 2024 API
StructuralSectionConcreteT Members
The StructuralSectionConcreteT type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteT
 Creates a new instance of Structural Section Concrete T shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
CantileverHeight
 Flange cantilever thickness.
CantileverLength
 Flange cantilever length.
See Also
StructuralSectionConcreteT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace