Revit 2024 API
FabricationServiceButton Members
The FabricationServiceButton type exposes the following members.
Methods
Name | Description
ContainsFabricationPartType
 Checks to see if the fabrication part type exists on one of the button conditions.
Dispose
Releases all resources used by the FabricationServiceButton
GetConditionDescription
 Gets the description for the condition size range.
GetConditionImage
Gets the image for the specified fabrication service button condition.
GetConditionLowerValue
 Gets the condition lower value (valid if greater or equal) for a given condition index.
GetConditionName
 Gets the name of the specified condition on the fabrication service button.
GetConditionUpperValue
 Gets the condition upper value (valid if less) for a given condition index.
GetImage
Gets the image for fabrication service button.
IsExcluded
 Gets if the button's fabrication part content associated with the button is to be excluded from Route and Fill, Design to Fabrication, or Multi-Point Routing commands.
IsUnrestrictedCondition
 Checks if the condition is unrestricted.
IsValid
 Checks if the button contains only valid fittings.
IsValidConditionIndex
 Validates if the given condition index is valid or not.
Properties
Name | Description
ButtonIndex
 The button index for this button.
Code
 The code of the button.
ConditionCount
 The number of conditions.
IsAHanger
 Checks if the fabrication service button is hanger.
IsStraight
 Checks if all of the fabrication service button conditions are straights.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the button.
PaletteIndex
 The palette index for this button.
ServiceId
 The fabrication service identifier for the fabrication service this button belongs to.
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace