Revit 2024 API
RebarContainerType Members
The RebarContainerType type exposes the following members.
Methods
Name | Description
CreateDefaultRebarContainerType
 Creates a new RebarContainerType object with a default name.
GetOrCreateRebarContainerType
 Creates or returns a RebarContainerType object with a given name.
Properties
Name | Description
See Also
RebarContainerType Class
Autodesk.Revit.DB.Structure Namespace