Revit 2024 API
ExternalService Members
The ExternalService type exposes the following members.
Methods
Name | Description
AddServer
 Registers a server with its service.
Dispose
Releases all resources used by the ExternalService
GetDefaultServerId
 Returns the Id of the default server if one was assigned to the service.
GetOptions
 A copy of the options the service was registered with.
GetPublicAccessKey
 Access key to use to execute a service.
GetRegisteredServerIds
 Returns Ids of all servers registered for the service.
GetServer
 Returns the instance that provides implementation for a registered server.
IsRegisteredServerId
 Checks if the Id represents a valid server that has been registered for the service.
RemoveServer
 Removes/unregisters a server from the service.
Properties
Name | Description
Description
 The description for the service
IsSerializable
 Indicates whether executions of the service requires serialization in documents or not.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the service
NumberOfServers
 Indicates the number of servers currently registered with the service.
ServiceId
 The Id of the service
SupportActivation
 Indicates if the service supports activation/deactivation of the servers.
VendorId
 The vendor who provided the service
See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace