Revit 2024 API
AssetPropertyEnum Members
The AssetPropertyEnum type exposes the following members.
Methods
Name | Description
IsValidValue
 Checks that the value is a valid value for this property.
Properties
Name | Description
Value
 The value of the property.
See Also
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace