Revit 2024 API
GroupNode Members
The GroupNode type exposes the following members.
Methods
Name | Description
GetTransform
 A transformation matrix associated with the node.
Properties
Name | Description
See Also
GroupNode Class
Autodesk.Revit.DB Namespace