Revit 2024 API
ReinforcementAbbreviationTag Members
The ReinforcementAbbreviationTag type exposes the following members.
Constructors
Name | Description
ReinforcementAbbreviationTag
 Constructs a new ReinforcementAbbreviationTag.
Methods
Name | Description
Dispose
Releases all resources used by the ReinforcementAbbreviationTag
Properties
Name | Description
AbbreviationTag
 The abbreviation tag value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TypeTag
 The abbreviation tag type.
See Also
ReinforcementAbbreviationTag Class
Autodesk.Revit.DB.Structure Namespace