Revit 2024 API
DirectContext3DHandleSettings Members
The DirectContext3DHandleSettings type exposes the following members.
Constructors
Name | Description
DirectContext3DHandleSettings()
 Constructs an instance of settings with default values.
DirectContext3DHandleSettings(DirectContext3DHandleSettings)
 Constructs a copy of source object.
DirectContext3DHandleSettings(Boolean, Int32)
 Constructs an instance of settings with provided values.
Methods
Name | Description
Assign
 Assigns values of the source settings to this object.
Dispose
Releases all resources used by the DirectContext3DHandleSettings
GetTransparency
 Gets the transparency value of the handle and the associated DirectContext3D graphics.
IsEqual
 Check if the contents of two instances of settings are equal.
SetTransparency
 Sets the transparency value of the handle and the associated DirectContext3D graphics.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Visibility
 Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
See Also
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace