Revit 2024 API
LossFactor Members
The LossFactor type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the LossFactor derived object.
Dispose
Releases all resources used by the LossFactor
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LossFactorValue
 The calculated loss factor value
See Also
LossFactor Class
Autodesk.Revit.DB.Lighting Namespace