Revit 2024 API
EnergyAnalysisConstruction Properties
The EnergyAnalysisConstruction type exposes the following members.
Properties
Name | Description
Absorptance
 The absorptance value of the construction.
ConstructionName
 The name of the construction
Description
 The description of the construction.
HeatTransferCoefficient
 The heat transfer coefficient value (U-value) of the construction.
IsSchematic
 Indicates if this originates from a schematic or analytical construction.
Roughness
 The roughness value of the construction.
ThermalMass
 The thermal mass value (Cth-value) of the construction.
ThermalResistance
 The thermal resistance value (R-value) of the construction.
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace