Revit 2024 API
FilterStringContains Members
The FilterStringContains type exposes the following members.
Constructors
Name | Description
FilterStringContains
 Constructs an instance of FilterStringContains.
Methods
Name | Description
Properties
Name | Description
See Also
FilterStringContains Class
Autodesk.Revit.DB Namespace