Revit 2024 API
TessellatedFace Members
The TessellatedFace type exposes the following members.
Constructors
Name | Description
TessellatedFace(IList<XYZ>, ElementId)
 Constructs a tessellated face without holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible.
TessellatedFace(IList<IList<XYZ>>, ElementId)
 Constructs a tessellated face, which, may be, have holes. Face data is always set, even if the input data are invalid (e.g., describes a wildly non-planar face). A TessellatedShepeBuilder's function is used to check the data and heal them if possible.
Methods
Name | Description
Dispose
Releases all resources used by the TessellatedFace
GetBoundaryLoops
 Get loops bounding the face.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 Material of the face.
See Also
TessellatedFace Class
Autodesk.Revit.DB Namespace