Revit 2024 API
FieldBuilder Members
The FieldBuilder type exposes the following members.
Constructors
Name | Description
FieldBuilder(FieldBuilder)
 Constructs a new copy of the input ESFieldBuilder object.
FieldBuilder(Field, SchemaBuilder)
 Constructs a new FieldBuilder using the field and associated SchemaBuilder object.
Methods
Name | Description
Dispose
Releases all resources used by the FieldBuilder
NeedsSubSchemaGUID
 Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
NeedsUnits
 Checks whether the field type requires explicit unit conversions.
Ready
 Checks whether the builder may be used.
SetDocumentation
 Sets the documentation string for the Field.
SetSpec
 Sets the spec describing the field's values.
SetSubSchemaGUID
 Sets the GUID of the Schema of the Entities that are intended to be stored in this field.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace