Revit 2024 API
Location Members
The Location type exposes the following members.
Methods
Name | Description
Move
Move the element within the project by a specified vector.
Rotate
Rotate the element within the project by a specified angle around a given axis.
Properties
Name | Description
See Also
Location Class
Autodesk.Revit.DB Namespace