Revit 2024 API
ElementOwnerViewFilter Members
The ElementOwnerViewFilter type exposes the following members.
Constructors
Name | Description
ElementOwnerViewFilter(ElementId)
 Constructs a new instance of a filter to match elements which are owned by a particular view.
ElementOwnerViewFilter(ElementId, Boolean)
 Constructs a new instance of a filter to match elements which are owned by a particular view, with the option to invert the filter and find elements not owned by the given view.
Methods
Name | Description
Properties
Name | Description
ViewId
 The view id.
See Also
ElementOwnerViewFilter Class
Autodesk.Revit.DB Namespace