Revit 2024 API
PanelScheduleSheetInstance Members
The PanelScheduleSheetInstance type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of panel schedule on sheet and adds it to the document.
GetSchedule
 Gets the panel schedule view.
SplitSegment
 Split the panel schedule into Thrown if the index is out of bounds.
Properties
Name | Description
Origin
 The sheet instance offset in drawing sheet coordinates.
ScheduleId
 The panel schedule id.
See Also
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace