Revit 2024 API
ColorFillLegend Members
The ColorFillLegend type exposes the following members.
Methods
Name | Description
Create
 Creates new instance of ColorFillLegend.
GetColumnWidths
 Returns array of column widths in the legend.
SetColumnWidths
 Sets array of column widths.
Properties
Name | Description
ColorFillCategoryId
 Returns the id of color fill category that this legend is created for.
Height
 The height of the legend.
Origin
 The top left corner of the color fill legend.
See Also
ColorFillLegend Class
Autodesk.Revit.DB Namespace