Revit 2024 API
InSessionPrintSetting Members
The InSessionPrintSetting type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the InSessionPrintSetting
Properties
Name | Description
PrintParameters
Returns the Parameters of Print Setup.
See Also
InSessionPrintSetting Class
Autodesk.Revit.DB Namespace