Revit 2024 API
Alignment Members
The Alignment type exposes the following members.
Methods
Name | Description
Get(Element)
 Returns an Alignment object given a Revit alignment element.
Get(Document, Guid)
 Returns an Alignment in the document given its GUID.
GetAlignments(Document)
 Returns all alignments in the given document.
GetAlignments(View)
 Returns all alignments visible in the given view.
GetClosestPoint
 Calculates the point on the alignment's geometry which is closest to the given model point.
GetClosestStation
 Calculates the alignment station closest to the given model point.
GetDisplayedHorizontalCurveEndpoints
 Returns the endpoints of the alignment's horizontal curves. Only the points between DisplayedStartStation and DisplayedEndStation are returned.
GetDistance
 Calculates the relative distance along the alignment between two stations based on their alignment distances according to Revit Internal Origin Coordinate Base. The distance may be positive or negative depending on the relative positions of the input stations on the alignment.
GetHCurveNormalAtStation
 Calculate 2d (X and Y components of returned vector) horizontal normal at given station.
GetHCurveTangentAtStation
 Calculate 2d (X and Y components of returned vector) horizontal tangent at given station.
GetPointAtStation
 Calculates the model point for a given alignment station.
GetVCurveNormalAtStation
 Calculate 2d (X and Y components of returned vector) vertical normal at given station.
GetVCurveTangentAtStation
 Calculate 2d (X and Y components of returned vector) vertical tangent at given station.
IsValid()
 Checks if this object is a valid alignment.
IsValid(Element)
 Checks if the element is a valid alignment.
Properties
Name | Description
Description
 The Description of this alignment.
DisplayedEndStation
 Specifies the station at which the alignment's display ends, in Revit internal model units (standard Imperial feet).
DisplayedStartStation
 Specifies the station at which the alignment's display starts, in Revit internal model units (standard Imperial feet).
Element
 The underlying DirectShape element.
EndStation
 Specifies the station at which the alignment's geometric definition ends, in Revit internal model units (standard Imperial feet).
GUID
 The GUID of this alignment.
Name
 The Name of this alignment.
StartStation
 Specifies the station at which the alignment's geometric definition starts, in Revit internal model units (standard Imperial feet).
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace