Revit 2024 API
IFCExportOptions Members
The IFCExportOptions type exposes the following members.
Constructors
Name | Description
IFCExportOptions()
 Default constructor. Initializes FileVersion to Default. WallAndColumnSplitting and ExportBaseQuantities are set to false. FamilyMappingFile is set to empty.
IFCExportOptions(IFCExportOptions)
 Creates a copy of an IFCExportOptions.
Methods
Name | Description
AddOption
 Adds a new named option to the options structure.
Assign
 Assigns the values of the IFCExportOptions to this options object.
Dispose
Releases all resources used by the IFCExportOptions
Properties
Name | Description
ExportBaseQuantities
 Option to export IFC standard quantities currently supported by Revit.
FamilyMappingFile
 Path to a file containing family mapping.
FileVersion
 IFC file version.
FilterViewId
 Id of the view whose visibility settings will govern the contents in the exported IFC file.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SpaceBoundaryLevel
 Level of space boundaries exported in IFC file.
WallAndColumnSplitting
 Option to allow division of multi-level walls and columns by levels.
See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace