Revit 2024 API
EnergyAnalysisMaterial Properties
The EnergyAnalysisMaterial type exposes the following members.
Properties
Name | Description
Density
 The density of the material.
Description
 The description of the material.
MaterialName
 The name of the material.
SpecificHeatCapacity
 The specific heat capacity of the material.
ThermalConductivity
 The thermal conductivity of the material.
ThermalResistance
 The thermal resistance (R-value) of the material.
Thickness
 The thickness of the material.
See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace