Revit 2024 API
IntegerParameterValue Members
The IntegerParameterValue type exposes the following members.
Constructors
Name | Description
IntegerParameterValue()
 Default constructor
IntegerParameterValue(Int32)
 Value constructor
Methods
Name | Description
Properties
Name | Description
Value
 The stored value
See Also
IntegerParameterValue Class
Autodesk.Revit.DB Namespace