Revit 2024 API
SiteLocation Members
The SiteLocation type exposes the following members.
Methods
Name | Description
ConvertFromProjectTime
Converts project time to UTC time.
ConvertToProjectTime
Converts local time or UTC time to project time.
IsCompatibleWith
 Checks whether the geographic coordinate system of this site is compatible with the given site . True if he geographic coordinate system of this site is compatible with the given site, false otherwise.
SetGeoCoordinateSystem
 Set the geographic coordinate system for this site. Similar to acquire coordinate system from a link in the UI.
Properties
Name | Description
Elevation
 The elevation of the site location.
GeoCoordinateSystemDefinition
 The XML string which describes the geographic coordinate system.
GeoCoordinateSystemId
 The geographic coordinate system ID, such as "AMG-50" and "Beijing1954/a.GK3d-40".
Latitude
 The latitude of the site location.
Longitude
 The longitude of the site location.
PlaceName
 The place name of the site.
TimeZone
 The time-zone for the site.
WeatherStationName
 The name of the weather station at the site location.
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace