Revit 2024 API
ElementLevelFilter Members
The ElementLevelFilter type exposes the following members.
Constructors
Name | Description
ElementLevelFilter(ElementId)
 Constructs a new instance of an ElementLevelFilter.
ElementLevelFilter(ElementId, Boolean)
 Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id.
Methods
Name | Description
Properties
Name | Description
LevelId
 The id of the level that will be matched to elements' associated level.
See Also
ElementLevelFilter Class
Autodesk.Revit.DB Namespace