Revit 2024 API
RibbonButtonOptions Members
The RibbonButtonOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RibbonButtonOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace