Revit 2024 API
Subelement Members
The Subelement type exposes the following members.
Methods
Name | Description
CanHaveTypeAssigned
 Identifies if the subelement can have a type assigned.
ChangeTypeId
 Changes the type of the subelement.
Create
 Creates an object representing element or subelement.
Dispose
Releases all resources used by the Subelement
GetAllParameters
 Returns all parameters of this subelement.
GetBoundingBox
 Retrieves a box that circumscribes all geometry of the subelement.
GetGeometryObject
 Retrieve one geometric primitive representing given subelement.
GetParameterValue
 Obtains the current parameter value of this subelement given a parameter id.
GetReference
 Obtains the reference to this subelement.
GetValidTypes
 Obtains a set of types that are valid for this subelement.
HasParameter
 Checks if this subelement have given parameter.
IsParameterModifiable
 Checks if given parameter of this subelement is modifiable.
IsValidSubelementReference
 Checks if given Reference identifies either a valid element or subelement.
IsValidType
 Checks if given type is valid for this subelement.
SetParameterValue
 Sets a new parameter value of this subelement given a parameter id.
Properties
Name | Description
Category
Retrieves a Category object that represents the category or sub category of the subelement.
Document
 The document in which the subelement resides.
Element
 The element in which the subelement resides.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TypeId
 The identifier of this subelement's type.
UniqueId
 A stable unique identifier for this subelement within the document.
See Also
Subelement Class
Autodesk.Revit.DB Namespace