Revit 2024 API
AdvancedLossFactor Members
The AdvancedLossFactor type exposes the following members.
Constructors
Name | Description
AdvancedLossFactor()
 Creates an advanced loss factor object with values set to no loss.
AdvancedLossFactor(AdvancedLossFactor)
 Creates a copy of the given advanced loss factor object
AdvancedLossFactor(Double, Double, Double, Double, Double, Double, Double)
 Creates an advanced loss factor object with the given values.
Methods
Name | Description
Properties
Name | Description
BallastLossFactor
 The ballast loss factor.
LampLumenDepreciation
 The lamp lumen depreciation loss factor.
LampTiltLossFactor
 The lamp tilt loss factor.
LuminaireDirtDepreciation
 The luminaire dirt depreciation loss factor.
SurfaceDepreciationLossFactor
 The surface depreciation loss factor.
TemperatureLossFactor
 The temperature loss factor.
VoltageLossFactor
 The voltage loss factor.
See Also
AdvancedLossFactor Class
Autodesk.Revit.DB.Lighting Namespace