Revit 2024 API
FileArgumentNotFoundException Members
The FileArgumentNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
FileArgumentNotFoundException Class
Autodesk.Revit.Exceptions Namespace