Revit 2024 API
AnalyticalLinkType Members
The AnalyticalLinkType type exposes the following members.
Methods
Name | Description
IsValidAnalyticalFixityState
 Returns whether the input fixity state is valid for Analytical Link Type parameters.
Properties
Name | Description
RotationX
 Fixity of rotation around X.
RotationY
 Fixity of rotation around Y.
RotationZ
 Fixity of rotation around Z.
TranslationX
 Fixity of translation along X.
TranslationY
 Fixity of translation along Y.
TranslationZ
 Fixity of translation along Z.
See Also
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace