Revit 2024 API
TableData Members
The TableData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TableData
GetSectionData(Int32)
 Returns the section data array element at the specified index.
GetSectionData(SectionType)
 Returns the pointer to the section data array element at the specified section type.
IsEqual
 Checks if this element is equal in value to the other element.
IsValidZoomLevel
 Verifies if the value of zoom level is valid.
Properties
Name | Description
FreezeColumnsAndRows
 set to true if the columns and rows should be unmovable by the slider grips
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberOfSections
 Gets the number of items in section data array.
Width
 Gets or sets the table width in feet
WidthInPixels
 Gets the width of the panel schedule in logical pixels
ZoomLevel
 The value of zoom level for corresponding TableView.
See Also
TableData Class
Autodesk.Revit.DB Namespace