Revit 2024 API
WorksetDefaultVisibilitySettings Members
The WorksetDefaultVisibilitySettings type exposes the following members.
Methods
Name | Description
GetWorksetDefaultVisibilitySettings
 Get the WorksetDefaultVisibilitySettings of the document.
IsWorksetVisible
 Indicates whether the workset is visible by default.
SetWorksetVisibility
 Set the default visibility of a workset.
Properties
Name | Description
See Also
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace