Revit 2024 API
Segment Members
The Segment type exposes the following members.
Methods
Name | Description
AddSize
 Adds a new MEPSize to the segment.
GetSizes
 Gets the defined sizes of the segment.
RemoveSize
 Remove the existing MEPSize with this nominal diameter from the segment.
Properties
Name | Description
Description
 The description of the segment.
MaterialId
 The ElementId of the MaterialElem.
Roughness
 The roughness value for given material.
SizeCount
 The number of size objects in the segment.
See Also
Segment Class
Autodesk.Revit.DB Namespace