Revit 2024 API
CylindricalHelix Members
The CylindricalHelix type exposes the following members.
Methods
Name | Description
Create
 Create a cylindrical helix.
Properties
Name | Description
BasePoint
The base point of the axis of the cylindrical helix.
Height
 Height of the cylindrical helix.
IsRightHanded
True if the helix is right handed, false if the helix is left handed.
Pitch
The pitch of the cylindrical helix.
Radius
The radius of the cylindrical helix.
XVector
The X direction vector.
YVector
The Y direction vector.
ZVector
The Z direction vector, which is same as the axis direction vector.
See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace