Revit 2024 API
CreateRelatedFileProgressChangedEventArgs Members
The CreateRelatedFileProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CreatingCloudSharedLocal
 Indicates if it is creating cloud shared local model.
DownloadFinished
 Indicates if all data downloads are finished.
FullDownload
 Indicates if download the full data of the document, which will take longer than subsequent downloads.
See Also
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace