Revit 2024 API
CableTray Members
The CableTray type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of cable tray.
GetShapeType
 Returns the shape type for the cable tray.
IsValidCableTrayType
 Identifies if a cable tray type is valid.
IsValidRungSpace
 Identifies if the input rung space is valid.
Properties
Name | Description
CurveNormal
 The up-direction vector of the cable tray.
RungSpace
 Distance between two rungs for the ladder cable tray.
See Also
CableTray Class
Autodesk.Revit.DB.Electrical Namespace