Revit 2024 API
PointLightShape Members
The PointLightShape type exposes the following members.
Constructors
Name | Description
PointLightShape()
 Creates a point light shape object.
PointLightShape(PointLightShape)
 Creates a copy of the given point light shape
Methods
Name | Description
Properties
Name | Description
See Also
PointLightShape Class
Autodesk.Revit.DB.Lighting Namespace