Revit 2024 API
FaceDetailNode Members
The FaceDetailNode type exposes the following members.
Methods
Name | Description
GetInstanceTransform
 Returns instance transform of the object being drawn.
GetLinkTransform
 Returns link transform of the object being drawn.
Properties
Name | Description
LineProperties
 Access to the line (pen) properties of the curve being drawn.
See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace