Revit 2024 API
ForbiddenForDynamicUpdateException Members
The ForbiddenForDynamicUpdateException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ForbiddenForDynamicUpdateException Class
Autodesk.Revit.Exceptions Namespace