Revit 2024 API
DocumentPreviewSettings Members
The DocumentPreviewSettings type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DocumentPreviewSettings
ForceViewUpdate
 Sets Revit to update the preview view if necessary.
IsViewIdValidForPreview
 Identifies if the view id is valid as a preview view id.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsViewUpdateForced
 Identifies if Revit will update the preview view if necessary.
PreviewViewId
 The view id that will be used to generate the preview.
See Also
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace