Revit 2024 API
FileArgumentAlreadyExistsException Members
The FileArgumentAlreadyExistsException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
FileArgumentAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace