Revit 2024 API
OverrideGraphicSettings Members
The OverrideGraphicSettings type exposes the following members.
Constructors
Name | Description
OverrideGraphicSettings()
 Creates a new instance of an OverrideGraphicSettings object.
OverrideGraphicSettings(OverrideGraphicSettings)
 Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the OverrideGraphicSettings
SetCutBackgroundPatternColor
 Sets the override color of the background pattern of cut faces.
SetCutBackgroundPatternId
 Sets the ElementId of the cut face background pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetCutBackgroundPatternVisible
 Sets the visibility of the cut face background fill pattern.
SetCutForegroundPatternColor
 Sets the override color of the foreground pattern of cut faces.
SetCutForegroundPatternId
 Sets the ElementId of the cut face foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetCutForegroundPatternVisible
 Sets the visibility of the cut face foreground fill pattern.
SetCutLineColor
 Sets the cut surface line color.
SetCutLinePatternId
 Sets the ElementId of the cut surface line pattern.
SetCutLineWeight
 Sets the cut surface line weight.
SetDetailLevel
 Sets the detail level.
SetHalftone
 Sets the halftone value.
SetProjectionLineColor
 Sets the projection surface line color.
SetProjectionLinePatternId
 Sets the ElementId of the projection surface line pattern.
SetProjectionLineWeight
 Sets the projection surface line weight.
SetSurfaceBackgroundPatternColor
 Sets the override color of the surface background pattern.
SetSurfaceBackgroundPatternId
 Sets the ElementId of the surface background pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetSurfaceBackgroundPatternVisible
 Sets the visibility of the surface background fill pattern.
SetSurfaceForegroundPatternColor
 Sets the override color of the surface foreground pattern.
SetSurfaceForegroundPatternId
 Sets the ElementId of the surface foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetSurfaceForegroundPatternVisible
 Sets the visibility of the surface foreground fill pattern.
SetSurfaceTransparency
 Sets the projection surface transparency.
Properties
Name | Description
CutBackgroundPatternColor
 The override color of the background pattern of cut faces.
CutBackgroundPatternId
 The ElementId of the cut face background fill pattern override. A value of InvalidElementId means no override is set.
CutForegroundPatternColor
 The override color of the foreground pattern of cut faces.
CutForegroundPatternId
 The ElementId of the cut face foreground fill pattern override. A value of InvalidElementId means no override is set.
CutLineColor
 Cut surface line color.
CutLinePatternId
 ElementId of the cut surface line pattern.
CutLineWeight
 Cut surface line weight.
DetailLevel
 The detail level.
Halftone
 Value of the halftone override.
InvalidPenNumber
 The invalidPenNumber for clearing line weight overrides.
IsCutBackgroundPatternVisible
 The visibility of the cut face background fill pattern.
IsCutForegroundPatternVisible
 The visibility of the cut face foreground fill pattern.
IsSurfaceBackgroundPatternVisible
 The visibility of the surface background fill pattern.
IsSurfaceForegroundPatternVisible
 The visibility of the surface foreground fill pattern.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ProjectionLineColor
 Projection surface line color.
ProjectionLinePatternId
 Id of the projection surface line pattern.
ProjectionLineWeight
 The projection surface line weight.
SurfaceBackgroundPatternColor
 The override color of the surface background pattern.
SurfaceBackgroundPatternId
 The ElementId of the surface background fill pattern override. A value of InvalidElementId means no override is set.
SurfaceForegroundPatternColor
 The override color of the surface foreground pattern.
SurfaceForegroundPatternId
 The ElementId of the surface foreground fill pattern override. A value of InvalidElementId means no override is set.
Transparency
 Transparency of surfaces.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace