Revit 2024 API
WireMaterialTypeSet Members
The WireMaterialTypeSet type exposes the following members.
Constructors
Name | Description
WireMaterialTypeSet
Initializes a new instance of the WireMaterialTypeSet class
Methods
Name | Description
Clear
Removes every wire material type from the set, rendering it empty.
Contains
Tests for the existence of a wire material type within the set.
Erase
Removes a specified wire material type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified wire material type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of wire material types that are in the set.
See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace