Revit 2024 API
CorrectionFactorSet Members
The CorrectionFactorSet type exposes the following members.
Constructors
Name | Description
CorrectionFactorSet
Initializes a new instance of the CorrectionFactorSet class
Methods
Name | Description
Clear
Removes every correction factor from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of correction factors that are in the set.
See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace