Revit 2024 API
RoutingCondition Members
The RoutingCondition type exposes the following members.
Constructors
Name | Description
RoutingCondition
 Creates a new RoutingCondition.
Methods
Name | Description
Dispose
Releases all resources used by the RoutingCondition
Properties
Name | Description
Diameter
 The diameter of the segment or fitting specified for the routing condition.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RoutingCondition Class
Autodesk.Revit.DB Namespace