Revit 2024 API
BalusterInfo Members
The BalusterInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BalusterInfo
GetReferenceNameForHost
 Gets the name string to be used as a reference to Host in the current language.
GetReferenceNameForTopRail
 Gets the name string to be used as a reference to Top Rail in the current language.
Properties
Name | Description
BalusterFamilyId
 The id of the family used for the baluster or post.
BaseOffset
 The offset from the base reference.
BaseReferenceName
 Represents the name of the reference for the bottom of this baluster or post.
DistanceFromPreviousOrSpace
 The length, in case of balusters, it is a distance from a previous one. For a post, it is a space from the original position of the post.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the baluster.
Offset
 The side offset of the baluster/post from the railing path.
TopOffset
 The offset from the top reference.
TopReferenceName
 Represents the name of the reference for the top of this baluster or post.
See Also
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace