Revit 2024 API
PreviewControl Members
The PreviewControl type exposes the following members.
Constructors
Name | Description
PreviewControl
Constructs a preview control.
Methods
Name | Description
Dispose
 This method is called if the user explicitly disposes of the object (by calling the Dispose method in other managed languages, or the destructor in C++).
Properties
Name | Description
ScrollbarVisibility
 The visibility of the preview view scrollbars.
UIView
The UI view representing the preview view.
ViewId
The view Id.
Events
Name | Description
See Also
PreviewControl Class
Autodesk.Revit.UI Namespace