Revit 2024 API
PipeSettings Members
The PipeSettings type exposes the following members.
Methods
Name | Description
AddPipeSlope
 Add a pipe slope value.
GetFlowConvertionServerInfo
 Get the MEPServerInfo of the current plumbing flow convertion server.
GetPipeSettings
 Get the pipe settings of the project.
GetPipeSlopes
 Get pipe slopes.
GetSpecificFittingAngles
 Gets the list of specific fitting angles.
GetSpecificFittingAngleStatus
 Gets the status of given specific angle.
IsAnalysisForClosedLoopHydronicPipingNetworksEnabled
 Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.
IsValidSpecificFittingAngle
 Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
SetFlowConvertionServerInfo
 Set the MEPServerInfo of the current plumbing flow convertion server.
SetPipeSlopes
 Set pipe slope values.
SetSpecificFittingAngleStatus
 Sets the status of given specific angle.
Properties
Name | Description
AnalysisForClosedLoopHydronicPipingNetworks
 Indicates whether to enable analysis for closed loop hydronic piping networks.
Centerline
 The abbreviation of the Centerline (=) string.
ConnectorSeparator
 The connector separator string.
ConnectorTolerance
 The connector tolerance value.
FittingAngleUsage
 Determine how to use fitting angle during pipe layout or modifying layout.
FittingAnnotationSize
 The value of fitting annotation size.
FlatOnBottom
 The abbreviation of the Flat On Bottom (FOB) string.
FlatOnTop
 The abbreviation of the Flat On Top (FOT) string.
SetDown
 The abbreviation of the Set Down (SD) string.
SetDownFromBottom
 The abbreviation of the Set Down from bottom of fitting (SDB) string.
SetUp
 The abbreviation of the Set Up (SU) string.
SetUpFromBottom
 The abbreviation of the Set Up from bottom of fitting(SUB) string.
SizePrefix
 The size prefix string.
SizeSuffix
 The size suffix string.
UseAnnotationScaleForSingleLineFittings
 Indicates whether use annotation scale for single line fittings or not.
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace