Revit 2024 API
ContinuousRailType Members
The ContinuousRailType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DefaultJoinOption
 The default join option between two rails.
EndOrTopExtensionLength
 The extension length of the rail termination at the end or top.
EndOrTopExtensionStyle
 The extension style of the rail termination at the end or top.
EndOrTopTermination
 The termination of the rail at the end or top.
FilletRadius
 The fillet radius of the rail join.
HandClearance
 The horizontal distance between the inner boundary of the rail and the path.
ProfileId
 The id of the profile of the rail
Projection
 The horizontal distance between the outer boundary of the rail and the path.
StartOrBottomExtensionLength
 The extension length of the rail termination at the beginning or bottom.
StartOrBottomExtensionStyle
 The extension style of the rail termination at the beginning or bottom.
StartOrBottomTermination
 The termination of the rail at the beginning or bottom.
Transition
 The transition option of the rail.
See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace