Revit 2024 API
EnergyAnalysisDetailModel Members
The EnergyAnalysisDetailModel type exposes the following members.
Methods
Name | Description
Create
 Creates a new energy analysis detailed model.
GetAnalyticalOpenings
 The collection of analytical openings.
GetAnalyticalShadingSurfaces
 The collection of analytical shading surfaces.
GetAnalyticalSpaces
 The collection of analytical spaces.
GetAnalyticalSurfaces
 The collection of analytical surfaces.
GetMainEnergyAnalysisDetailModel
 Gets the EnergyAnalysisDetailModel in given document.
TransformModel
 Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north.
Properties
Name | Description
BuildingTypeId
 The building type element.
ExportCategory
 Export elements of this category in energy analysis.
ExportMullions
 Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces
 Indicates if to set and get the setting for if shading surfaces should be included.
SimplifyCurtainSystems
 Indicates if to specify the setting for simplified curtain systems.
Tier
 Level of computation for energy analysis model.
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace