Revit 2024 API
Parameter Members
The Parameter type exposes the following members.
Methods
Name | Description
AsDouble
Provides access to the double precision number within the parameter.
AsElementId
Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.
AsInteger
Provides access to the integer number within the parameter.
AssociateWithGlobalParameter
 Associates this parameter with a global parameter in the same document.
AsString
Provides access to the string contents of the parameter.
AsValueString()
Get the parameter value as a string with units.
AsValueString(FormatOptions)
Get the parameter value as a string with units.
CanBeAssociatedWithGlobalParameter
 Tests whether this parameter can be associated with the given global parameter.
CanBeAssociatedWithGlobalParameters
 Tests whether this parameter can be associated with any global parameter.
ClearValue
Clears the parameter to its initial value.
DissociateFromGlobalParameter
 Dissociates this parameter from a global parameter.
GetAssociatedGlobalParameter
 Returns a global parameter, if any, currently associated with this parameter.
GetTypeId
Gets the identifier of the parameter.
GetUnitTypeId
Gets the identifier of the unit quantifying the parameter value.
Set(Double)
Sets the parameter to a new real number value.
Set(Int32)
Sets the parameter to a new integer value.
Set(String)
Sets the parameter to a new string of text.
Set(ElementId)
Sets the parameter to a new element id.
SetValueString
Set the parameter value according to the input string.
Properties
Name | Description
Definition
Returns the Definition object that describes the data type, name and other details of the parameter.
Element
The element to which this parameter belongs.
GUID
The Guid for a shared parameter.
HasValue
Identifies if the parameter has an assigned value.
Id
The id of the parameter.
IsReadOnly
Get the readonly property of the parameter.
 (Overrides APIObject.IsReadOnly.)
IsShared
Identifies if the parameter is a shared parameter.
StorageType
Describes the type that is used internally within the parameter to store its value.
UserModifiable
 Indicates whether the interactive user can modify the value of this parameter.
See Also
Parameter Class
Autodesk.Revit.DB Namespace