Revit 2024 API
KeyBasedTreeEntryError Members
The KeyBasedTreeEntryError type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the KeyBasedTreeEntryError
GetEntry
 Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.
Properties
Name | Description
ErrorType
 Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace