Revit 2024 API
TessellatedShapeBuilderResult Members
The TessellatedShapeBuilderResult type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TessellatedShapeBuilderResult
GetGeometricalObjects
 When called the first time, returns geometrical objects which were built. Later calls will throw exceptions.
GetIssuesForFaceSet
 Returns the array of issues encountered while processing a face set with index 'setIndex'.
GetNumberOfFaceSets
 Gets number of face sets for which 'this' result was obtained.
Properties
Name | Description
AreObjectsAvailable
 Shows whether 'issues' still contains the original data or whether these data have already been relinquished by 'getGeometricalObjects'. The former is true, the later is false.
HasInvalidData
 Whether there were any inconsistencies in the face sets, stored in the tessellated shape builder while building geometrical objects.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Outcome
 What kinds of geometrical objects were built.
See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace