Revit 2024 API
FilterNumericGreaterOrEqual Members
The FilterNumericGreaterOrEqual type exposes the following members.
Constructors
Name | Description
FilterNumericGreaterOrEqual
 Constructs an instance of FilterNumericGreaterOrEqual.
Methods
Name | Description
Properties
Name | Description
See Also
FilterNumericGreaterOrEqual Class
Autodesk.Revit.DB Namespace