Revit 2024 API
RebarConstraintsManager Methods
The RebarConstraintsManager type exposes the following members.
Methods
Name | Description
AllowConstraintTargets
 Returns true if references are valid targets for handle, false otherwise.
ApplyRebarConstraints
 Returns true if constraints were applied to rebar with success.
ClearHandleConstraintPairHighlighting
 Clears all highlighting in all views.
Dispose
GetAllConstrainedHandles
 Retrieves all handles on the Rebar that are constrained to external references.
GetAllHandles
 Gets all RebarConstrainedHandles of this bar.
GetConstraintCandidatesForHandle(RebarConstrainedHandle)
For shape driven rebar returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.
For free form rebar will return an empty list.
GetConstraintCandidatesForHandle(RebarConstrainedHandle, ElementId)
For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle.
For free form rebar will return an empty list.
GetConstraintCandidatesForHandle(RebarConstrainedHandle, Reference)
For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference.
For free form rebar will return an empty lists.
GetCurrentConstraintOnHandle
 Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
GetPreferredConstraintOnHandle
For ShapeDriven: Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
For FreeForm: Returns the RebarConstraint that acts on the specified RebarConstraintHandle.
HasValidRebar
 Checks whether the Manager's Rebar is still valid.
HighlightHandleConstraintPairInAllViews
 Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.
RemovePreferredConstraintFromHandle
For ShapeDriven: Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.
For FreeForm: Removes the RebarConstraint that is associated to the specified RebarConstrainedHandle.
SetPreferredConstraintForHandle
For ShapeDriven Rebar: Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.
For FreeForm Rebar: Sets the RebarConstraint as the target for the specified RebarConstraintHandle.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace