Revit 2024 API
ApplicationException Members
The ApplicationException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides Exception.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
FunctionId
The information of the function throwing the exception.
See Also
ApplicationException Class
Autodesk.Revit.Exceptions Namespace