Revit 2024 API
FilterCategoryRule Members
The FilterCategoryRule type exposes the following members.
Constructors
Name | Description
FilterCategoryRule
 Constructs a new instance of FilterCategoryRule.
Methods
Name | Description
AllCategoriesFilterable
 Checks that all of the given categories are filterable.
GetCategories
 Gets the rule's categories.
SetCategories
 Sets the rule's categories.
Properties
Name | Description
See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace