Revit 2024 API
SSEPointVisibilitySettings Members
The SSEPointVisibilitySettings type exposes the following members.
Methods
Name | Description
GetVisibility
 Gets the SSE point visibility for the given category.
SetVisibility
 Sets the SSE point visibility for the given category.
Properties
Name | Description
See Also
SSEPointVisibilitySettings Class
Autodesk.Revit.DB Namespace