Revit 2024 API
LinePatternElement Members
The LinePatternElement type exposes the following members.
Methods
Name | Description
Create
 Creates a new LinePatternElement.
GetLinePattern()
 Gets the LinePattern associated to this element.
GetLinePattern(Document, ElementId)
 Gets the LinePattern associated to an element or from a built-in line pattern.
GetLinePatternElementByName
 Retrieves the LinePatternElement by its name.
GetSolidPatternId
 Gets the solid line pattern element id.
SetLinePattern
 Sets the LinePattern associated to this element.
Properties
Name | Description
See Also
LinePatternElement Class
Autodesk.Revit.DB Namespace