Revit 2024 API
MEPAnalyticalNode Members
The MEPAnalyticalNode type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the MEPAnalyticalNode
IsSameNode
 Verify if this node is connected to the other node and thus represents the same analytical node in the network.
Properties
Name | Description
Id
 The identity used in the MEPAnalyticalSegment
IsFlowBlocked
 Is the flow blocked at this analytical node?
IsFocalNode
 Is this node a focal point of multiple branches?
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Location
 The location of this node.
See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace