Revit 2024 API
AnalysisDisplayLegendSettings Members
The AnalysisDisplayLegendSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayLegendSettings()
 Constructs a default instance of legend settings.
AnalysisDisplayLegendSettings(AnalysisDisplayLegendSettings)
 Constructs a new copy of the input AnalysisDisplayLegendSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisDisplayLegendSettings
IsEqual
 Compares two legend settings objects.
Properties
Name | Description
ColorRangeHeight
 Height of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units.
ColorRangeWidth
 Width of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units.
HeadingTextTypeId
 Element id of text associated with legend heading.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberForScale
 A fixed value to display on the legend scale (0 by default; 0 means width of legend scale is calculated dynamically).
NumberOfSteps
 Number of steps (values between minimum and maximum) to be shown in legend.
Rounding
 Rounding increment for numeric values of analysis results.
ScaleHeight
 Height of scale (for Diagram display). Measured in paperspace units.
ShowDataDescription
 If true, data description is shown in the legend.
ShowDataName
 If true, data name is shown in the legend.
ShowLegend
 If true, legend is shown in the view.
ShowUnits
 If true, units are shown in the legend.
TextTypeId
 Element id of text associated with legend body.
See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace