Revit 2024 API
AnalysisDisplayMarkersAndTextSettings Members
The AnalysisDisplayMarkersAndTextSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayMarkersAndTextSettings()
 Constructs a default instance of markers and text settings.
AnalysisDisplayMarkersAndTextSettings(AnalysisDisplayMarkersAndTextSettings)
 Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisDisplayMarkersAndTextSettings
IsEqual
 Compares two colored surface settings objects.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MarkerSize
 Size of marker.
MarkerType
 Type of marker.
Rounding
 Increment to which numeric values of analysis results are rounded in markers.
TextLabelType
 Type of diagram text label visualization.
TextTypeId
 Element id of text associated with the settings.
See Also
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace