Revit 2024 API
AlignmentStationLabel Members
The AlignmentStationLabel type exposes the following members.
Methods
Name | Description
Create
 Creates an AlignmentStationLabel object along with its underlying SpotDimension element. Returns null if element creation fails.
CreateRecommendedTypeForSet
 Creates an element type recommended for alignment label sets and returns its ElementId.
CreateSet
 Creates a collection of AlignmentStationLabel objects along with their underlying SpotDimension elements.
Get
 Returns an AlignmentStationLabel object for the given element.
GetAlignmentStationLabels(Alignment)
 Returns all alignment station labels placed on the given alignment.
GetAlignmentStationLabels(Alignment, ElementId)
 Returns all alignment station labels placed on the given alignment in the given view.
IsRecommendedTypeForSet
 Checks if the element type is recommended for alignment labels in sets.
IsValid()
 Checks if this object is a valid alignment station label.
IsValid(Element)
 Checks if the element is a valid alignment station label.
IsValidType
 Checks if the type is a valid alignment station label type.
Properties
Name | Description
AlignmentId
 The ElementId of the Alignment on which the SpotDimension is placed.
Element
 The underlying SpotDimension element.
Station
 The alignment station at which the SpotDimension is placed.
See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace