Revit 2024 API
RevitServerUnauthorizedException Members
The RevitServerUnauthorizedException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerUnauthorizedException Class
Autodesk.Revit.Exceptions Namespace