Revit 2024 API
ParameterMapIterator Members
The ParameterMapIterator type exposes the following members.
Constructors
Name | Description
ParameterMapIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the map.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
Key
Retrieves the key that is the current focus of the iterator.
See Also
ParameterMapIterator Class
Autodesk.Revit.DB Namespace