Revit 2024 API
WireConduitTypeSet Members
The WireConduitTypeSet type exposes the following members.
Constructors
Name | Description
WireConduitTypeSet
Initializes a new instance of the WireConduitTypeSet class
Methods
Name | Description
Clear
Removes every conduit type from the set, rendering it empty.
Contains
Tests for the existence of a conduit type within the set.
Erase
Removes a specified conduit type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified conduit type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of conduit types that are in the set.
See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace