Revit 2024 API
TemporaryGraphicsManager Members
The TemporaryGraphicsManager type exposes the following members.
Methods
Name | Description
AddControl
 Creates an in-canvas control.
Clear
 Clear all temporary graphics objects managed by this manager.
Dispose
Releases all resources used by the TemporaryGraphicsManager
GetAll
 Returns all temporary graphics object indexes managed by this manager.
GetTemporaryGraphicsManager
 Gets a TemporaryGraphicsManager reference of the document.
RemoveControl
 Deletes the existing control identified by the unique index.
SetVisibility
 Changes the visibility of temporary graphics object.
UpdateControl
 Updates the in-canvas control identified by the unique index.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace