Revit 2024 API
DuctSizeSettings Members
The DuctSizeSettings type exposes the following members.
Methods
Name | Description
AddSize
 Inserts a new MEPSize in to the duct size settings. The duct shape determines the location of the new size in the size table.
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetDuctSizeSettingIterator
Returns a DuctSizeSettingIterator object that iterates through the collection.
GetDuctSizeSettings
 Get the duct size settings of the project.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetSizeCount
 Get the size count of the duct size table. The duct shape determines the location of the size in the size table.
RemoveSize
 Erase the existing MEPSize with this nominal diameter. The duct shape determines the location of the size in the size table.
Properties
Name | Description
Item
 Get the DuctSizes for this DuctShape.
See Also
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace