Revit 2024 API
TableSectionData Members
The TableSectionData type exposes the following members.
Methods
Name | Description
AllowOverrideCellStyle
 Identifies if the style can be overridden in the given cell.
CanInsertColumn
 Verifies if a new column can be inserted at the given index.
CanInsertRow
 Verifies if a new row can be inserted at the given index.
CanRemoveColumn
 Verifies that if the column at the given index can be removed.
CanRemoveRow
 Verifies that if the row at the given index can be removed..
ClearCell
 Deletes text or image, or removes parameter of this cell.
Dispose
Releases all resources used by the TableSectionData
GetCellCalculatedValue(Int32)
 Gets the calculated value for the specified column
GetCellCalculatedValue(Int32, Int32)
 Gets the calculated value for the specified cell
GetCellCategoryId(Int32)
 Returns a column's ParamId Associated with the paramId to find the correct element
GetCellCategoryId(Int32, Int32)
 Returns a cell's CategoryId and if no CategoryId exists for this cell, it would come from the column. Associated with the paramId to find the correct element.
GetCellCombinedParameters(Int32)
 Returns an array of combined parameter data for the specified column
GetCellCombinedParameters(Int32, Int32)
 Returns an array of combined parameter data for the specified cell
GetCellFormatOptions(Int32, Document)
 Returns a column's cell FormatOptions and if no FormatOptions exists for this column, it would come from the section.
GetCellFormatOptions(Int32, Int32, Document)
 Returns a cell's FormatOptions and if no FormatOptions exists for this cell, it would come from the column, or the row, or the section.
GetCellParamId(Int32)
 Returns a column's ParamId
GetCellParamId(Int32, Int32)
 Returns a cell's ParamId and if no ParamId exists for this cell, it would come from the column
GetCellSpec
 Gets the spec describing values of a cell, if applicable.
GetCellText
 Returns the text shown by this cell, if the cell's type is CellType.Text or CellType.ParameterText or CellType.CustomField.
GetCellType(Int32)
 Returns a column's cell type and if no type exists for this column, it would come from the section
GetCellType(Int32, Int32)
 Returns a cell's Type and if no Type exists for this cell, it would come from the column, or the row, or the section
GetColumnWidth
 Returns a column's width in feet
GetColumnWidthInPixels
 This returns a column's width in logical pixels
GetCustomFieldId
 Gets custom field id from the cell.
GetMergedCell
 Gets the whole merged cell that this cell is a part of.
GetRowHeight
 Returns a row's height in feet
GetRowHeightInPixels
 This returns a row's height in logical pixels
GetTableCellStyle
 Returns a cell's style and if no style exists for this cell, it would come from the column, or the section
InsertColumn
 Inserts a new column at the specified index relative to the current set of columns.
InsertImage
 Inserts a image in the given cell.
InsertRow
 Inserts a row data at a specified index.
IsAcceptableParamIdAndCategoryId(ElementId, ElementId)
 Identifies if the given parameter id and category id can be assigned to a cell in this table.
IsAcceptableParamIdAndCategoryId(Int32, ElementId, ElementId)
 Identifies if the given parameter id and category id can be assigned to a cell in the given row in this table.
IsCellFormattable
 Determines whether the cell is formattable or not
IsCellOverridden(Int32)
 Indicates if the column is overridden or not.
IsCellOverridden(Int32, Int32)
 Indicates if the cell is overridden or not.
IsDataOutOfDate
 Indicates whether the data in this section is out of date.
IsValidColumnNumber
 Verifies if the column number is valid.
IsValidImageSymbolId
 Identifies if the element id represents a valid ImageSymbol element.
IsValidRowNumber
 Verifies if the row number is valid.
MergeCells
 Merges cells for the given area.
RefreshData
 Rebuilds the data in this section if it is out of date.
RemoveColumn
 Removes a column data at a specified index.
RemoveRow
 Removes a row data at a specified index.
ResetCellOverride(Int32)
 Resets the override of the column.
ResetCellOverride(Int32, Int32)
 Resets the override of the cell.
SetCellCalculatedValue(Int32, TableCellCalculatedValueData)
 Allows the caller to set the calculated value for a specified column
SetCellCalculatedValue(Int32, Int32, TableCellCalculatedValueData)
 Allows the caller to set the calculated value for a specified cell
SetCellCombinedParameters(Int32, IList<TableCellCombinedParameterData>)
 Allows the caller to set combined parameter for a specified column
SetCellCombinedParameters(Int32, Int32, IList<TableCellCombinedParameterData>)
 Allows the caller to set combined parameter for a specified cell
SetCellFormatOptions
 Sets a cell's FormatOptions.
SetCellParamIdAndCategoryId(Int32, ElementId, ElementId)
 Sets a column's category and parameter Id
SetCellParamIdAndCategoryId(Int32, Int32, ElementId, ElementId)
 Sets a cell's category and parameter Id
SetCellStyle(TableCellStyle)
 Sets a section's style
SetCellStyle(Int32, TableCellStyle)
 Sets a column's style.
SetCellStyle(Int32, Int32, TableCellStyle)
 Sets a cell's style
SetCellText
 Sets a cell's to display the specified text.
SetCellType(Int32, CellType)
 Sets a column's cell type
SetCellType(Int32, Int32, CellType)
 Sets a cell's Type
SetColumnWidth
 Sets a column's width in feet
SetColumnWidthInPixels
 This sets a column's width in logical pixels
SetMergedCell
 Sets the merged cell that this cell is a part of.
SetRowHeight
 Sets a row's height in feet
SetRowHeightInPixels
 This sets a row's height in logical pixels
Properties
Name | Description
FirstColumnNumber
 The first column in this section of the table.
FirstRowNumber
 The first row in this section of the table.
HideSection
 Whether or not the section is hidden.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LastColumnNumber
 The last column in this section of the table.
LastRowNumber
 The last row in this section of the table.
NeedsRefresh
 Indicates if the table data need to refresh.
NumberOfColumns
 Gets or sets the number of items in column data array.
NumberOfRows
 Gets or sets the number of items in row data array.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace