Revit 2024 API
VoltageTypeSet Members
The VoltageTypeSet type exposes the following members.
Constructors
Name | Description
VoltageTypeSet
Initializes a new instance of the VoltageTypeSet class
Methods
Name | Description
Clear
Removes every voltage type from the set, rendering it empty.
Contains
Tests for the existence of a voltage type within the set.
Erase
Removes a specified voltage type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified voltage type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of voltage types that are in the set.
See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace