Revit 2024 API
CompoundStructureLayer Methods
The CompoundStructureLayer type exposes the following members.
Methods
Name | Description
Dispose
See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace