Revit 2024 API
ReferenceIntersector Members
The ReferenceIntersector type exposes the following members.
Constructors
Name | Description
ReferenceIntersector(View3D)
 Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.
ReferenceIntersector(ElementFilter, FindReferenceTarget, View3D)
 Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.
ReferenceIntersector(ElementId, FindReferenceTarget, View3D)
 Constructs a ReferenceIntersector which is set to return intersections from a single target element only.
ReferenceIntersector(ICollection<ElementId>, FindReferenceTarget, View3D)
 Constructs a ReferenceIntersector which is set to return intersections from any of a set of target elements.
Methods
Name | Description
Dispose
Releases all resources used by the ReferenceIntersector
Find
 Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
FindNearest
 Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria.
GetFilter
 Gets the ElementFilter used in intersection testing.
GetTargetElementIds
 Gets the set of ElementIds to test from in intersection testing.
SetFilter
 Sets the ElementFilter used in intersection testing.
SetTargetElementIds
 Sets the set of ElementIds to test from in intersection testing.
Properties
Name | Description
FindReferencesInRevitLinks
 Determines if references inside Revit Links should be found.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TargetType
 The type of reference to find.
ViewId
 The id of the 3D view used for evaluation.
See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace