Revit 2024 API
AreaVolumeSettings Members
The AreaVolumeSettings type exposes the following members.
Methods
Name | Description
GetAreaVolumeSettings
 Get the area and volume settings of the project.
GetSpatialElementBoundaryLocation
 Gets the spatial element boundary location based on spatial element type.
SetSpatialElementBoundaryLocation
 Sets the spatial element boundary location of a spatial element type.
Properties
Name | Description
ComputeVolumes
 True to enable volume computation. False to disable it.
See Also
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace