Revit 2024 API
DoubleParameterValue Members
The DoubleParameterValue type exposes the following members.
Constructors
Name | Description
DoubleParameterValue()
 Default constructor
DoubleParameterValue(Double)
 Value constructor
Methods
Name | Description
Properties
Name | Description
Value
 The stored value
See Also
DoubleParameterValue Class
Autodesk.Revit.DB Namespace