Revit 2024 API
AssetSet Members
The AssetSet type exposes the following members.
Constructors
Name | Description
AssetSet
Initializes a new instance of the AssetSet class
Methods
Name | Description
Clear
Contains
Erase
ForwardIterator
GetEnumerator
Insert
ReverseIterator
Properties
Name | Description
IsEmpty
Size
See Also
AssetSet Class
Autodesk.Revit.DB.Visual Namespace