Revit 2024 API
StairsEditScope Members
The StairsEditScope type exposes the following members.
Constructors
Name | Description
StairsEditScope
 Instantiates a StairsEditScope object.
Methods
Name | Description
Start(ElementId)
 Starts an stairs edit mode for an existing Stairs element
Start(ElementId, ElementId)
 Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs.
Properties
Name | Description
See Also
StairsEditScope Class
Autodesk.Revit.DB Namespace