Revit 2024 API
PartMakerMethodToDivideVolumes Members
The PartMakerMethodToDivideVolumes type exposes the following members.
Methods
Name | Description
AddIntersectingReference
 Adds intersecting reference with an offset.
AreElementsValidIntersectingReferences(ICollection<ElementId>)
 Identifies if provided members are valid.
AreElementsValidIntersectingReferences(Document, ICollection<ElementId>)
 Identifies if provided members are valid.
CanBeDivisionProfile(ElementId)
 Checks whether a family defines a profile which can be used by this method.
CanBeDivisionProfile(ElementId, Document)
 Checks whether a family defines a profile which can be used by this method.
Dispose
Releases all resources used by the PartMakerMethodToDivideVolumes
GetOffsetForIntersectingReference
 Gets offset for the intersecting reference.
GetPlaneOfSketch
 Gets the plane of the sketch.
GetSketchCurves
 Populates the array with copies of curves in the sketch.
GetSplitRefsOffsets
 Returns offsets for plane-defining splitters.
IsElementValidIntersectingReference(ElementId)
 Identifies if the provided member is valid.
IsElementValidIntersectingReference(Document, ElementId)
 Identifies if the provided member is valid.
IsValidSketchPlane
 Identifies if provided sketch plane is valid.
RemoveIntersectingReference
 Removed intersecting reference.
SetOffsetForIntersectingReference
 Sets offset for the intersecting reference.
UsesReference
 Identifies if the PartMaker uses the intersecting reference.
Properties
Name | Description
DivisionGap
 The gap which is created between matching profiles of parts.
DivisionPatternMirror
 Whether pattern defined by the division rule should be mirrored before application Mirroring is similar to changing indices of u-const gridlines.
DivisionRotationAngle
 Angle by which both u- and v- gridlines of the division are rotated with respect to the natural u/v-const directions of the sketch plane.
DivisionRuleId
 Id of the 'DivisionRule' which is used to augment the cutting sketch.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ProfileFlipAcross
 True if the corresponding left/upper parts profile are mirrored with respect to the division line. False if the profile of left/upper parts are defined directly by the profile family.
ProfileFlipAlong
 True if the corresponding left/upper parts profile are mirrored with respect to the center line of the hosts to be divided. False if the profile of left/upper parts are defined directly by the profile family.
ProfileMatch
 Determines how two profiles match.
ProfileOffset
 The offset which is applied to a family-defined profile in the direction away from the division line and toward left/upper part to obtain its profile.
ProfileType
 The id of the profile family applied to boundaries between parts.
UConstDivisionIndent
 Indentation for the application of division rule's pattern across u-const gridlines (i.e., similar to changing indices of u-const gridlines).
VConstDivisionIndent
 Indentation for the application of division rule's pattern across v-const gridlines (i.e., similar to changing indices of v-const gridlines).
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace