Revit 2024 API
DocumentSaveToLocalProgressChangedEventArgs Members
The DocumentSaveToLocalProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
BeforeSaveToCentral
 True if the "save to local" operation is occurring before "save to central"; false if after.
FinishedStreams
 The number of streams finished since the last time this event was raised.
SaveToLocalFinished
 Indicates if the current "save to local" operation has finished.
TotalStreams
 The total expected number of streams to save to local.
See Also
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace