Revit 2024 API
ChangeType Members
The ChangeType type exposes the following members.
Methods
Name | Description
ConcatenateChangeTypes
 Creates a ChangeType that is a union of the two input ChangeTypes
Contains
 Checks whether this ChangeType contains the input ChangeType
Dispose
Releases all resources used by the ChangeType
IsIdentical
 Compares if two ChangeTypes are identical
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ChangeType Class
Autodesk.Revit.DB Namespace