Revit 2024 API
FabricationRodInfo Members
The FabricationRodInfo type exposes the following members.
Methods
Name | Description
AttachToHanger
 Attaches the hanger rod to another bearer hanger.
AttachToStructure
 Attaches to the nearest structural element.
Dispose
Releases all resources used by the FabricationRodInfo
GetBearerExtension
 Gets the bearer extension. The method is applicable only for bearer hanger.
GetRodAttachedElementId
 Gets the identifier of the attached component for the specified rod.
GetRodEndPosition
 Gets the position of the rod end.
GetRodLength
 Get the current rod length. If the rod is the length will include structural extension.
GetRodStructureExtension
 Gets the length of the rod's top extension into structure.
IsRodLockedWithHost
 Checks if the rod is locked with the host. The method is applicable only for bearer hanger.
SetBearerExtension
 Sets the bearer extension. The method is applicable only for bearer hanger.
SetRodEndPosition
 Sets the position of the rod end. The method is applicable only for bearer hanger.
SetRodLength
 Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted.
SetRodLockedWithHost
 Locks the rod with the host. The method is applicable only for bearer hanger.
SetRodStructureExtension
 Set the length of the rod's top extension into structure. The rod must be attached to structure.
Properties
Name | Description
CanRodsBeHosted
 Controls whether the hanger's rod's will be automatically hosted by other elements.
IsAttachedToStructure
 Checks if the hanger is attached to structure.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RodCount
 Gets the number of rods.
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace