Revit 2024 API
RoomFilter Members
The RoomFilter type exposes the following members.
Constructors
Name | Description
RoomFilter
 Constructs a filter which matches only rooms.
Methods
Name | Description
Properties
Name | Description
See Also
RoomFilter Class
Autodesk.Revit.DB.Architecture Namespace