Revit 2024 API
Toposolid Members
The Toposolid type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
 Creates a new instance of toposolid within the project.
Create(Document, IList<XYZ>, ElementId, ElementId)
 Creates a new instance of toposolid within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, ElementId, ElementId)
 Creates a new instance of toposolid within the project.
CreateFromTopographySurface
 Creates a toposolid element from a host TopographySurface, and toposolid sub-divisions from its subregions.
CreateSubDivision
 Create a toposolid subdivision element with the current toposolid as its host.
GetSlabShapeEditor
 Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid.
GetSubDivisionIds
 Get all element ids of toposolid subdivisions with the current toposolid as its host.
Simplify
 Simplifies the toposolid by reducing the number of inner vertices to the given percentage.
Split
 Split the toposolid by the given curve loops.
Properties
Name | Description
HostTopoId
 The host toposolid id of the current toposolid subdivision. If the object is not a toposolid subdivision, hostTopoId will be InvalidElementId.
SketchId
 Returns id of the sketch.
See Also
Toposolid Class
Autodesk.Revit.DB Namespace