Revit 2024 API
SolidCurveIntersectionOptions Methods
The SolidCurveIntersectionOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace