Revit 2024 API
FormatValueOptions Members
The FormatValueOptions type exposes the following members.
Constructors
Name | Description
FormatValueOptions
 Creates a new FormatValueOptions object with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the FormatValueOptions
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
Properties
Name | Description
AppendUnitSymbol
 Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FormatValueOptions Class
Autodesk.Revit.DB Namespace