Revit 2024 API
FailureResolution Members
The FailureResolution type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FailureResolution
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FailureResolution Class
Autodesk.Revit.DB Namespace