Revit 2024 API
GeometryObject Members
The GeometryObject type exposes the following members.
Methods
Name | Description
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Overrides Object.GetHashCode().)
Operators
Name | Description
Equality
Determines whether two GeometryObjects are the same.
Inequality
Determines whether two GeometryObjects are different.
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
Id
A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
Visibility
The visibility.
See Also
GeometryObject Class
Autodesk.Revit.DB Namespace