Revit 2024 API
FaceEdgeNode Members
The FaceEdgeNode type exposes the following members.
Methods
Name | Description
GetFaceEdge
 Returns the Face edge object corresponding to the node.
Properties
Name | Description
See Also
FaceEdgeNode Class
Autodesk.Revit.DB Namespace