Revit 2024 API
RadialArray Properties
The RadialArray type exposes the following members.
Properties
Name | Description
NumMembers
Retrieves or changes the number of the arrayed members.
 (Overrides BaseArray.NumMembers.)
See Also
RadialArray Class
Autodesk.Revit.DB Namespace