Revit 2024 API
PointCloudOverrideSettings Members
The PointCloudOverrideSettings type exposes the following members.
Constructors
Name | Description
PointCloudOverrideSettings()
 Constructs a settings object with default values.
PointCloudOverrideSettings(PointCloudOverrideSettings)
 Constructs a copy of source object.
Methods
Name | Description
Assign
 Assigns values of the source settings to this object.
Dispose
Releases all resources used by the PointCloudOverrideSettings
GetModeOverride
 Lookup color settings for the given color mode.
IsEqual
 Checks if the contents of two settings are equal.
SetModeOverride
 Sets color settings for the given color mode.
Properties
Name | Description
ColorMode
 The current color mode for the PointCloudInstance element or its scan.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Visible
 Visibility flag for point cloud scans.
See Also
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace