Revit 2024 API
DocumentWorksharingEnabledEventArgs Members
The DocumentWorksharingEnabledEventArgs type exposes the following members.
Methods
Name | Description
GetDocument
 Returns document associated with this event
Properties
Name | Description
See Also
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace