Revit 2024 API
RoomTagFilter Members
The RoomTagFilter type exposes the following members.
Constructors
Name | Description
RoomTagFilter
 Constructs a filter which matches only rooms.
Methods
Name | Description
Properties
Name | Description
See Also
RoomTagFilter Class
Autodesk.Revit.DB.Architecture Namespace