Revit 2024 API
KeyBasedTreeEntry Members
The KeyBasedTreeEntry type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the KeyBasedTreeEntry
GetChildrenKeys
 Gets a collection containing the keys of all children entry objects from this entry.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Key
 The key of this entry.
ParentKey
 The parent key of this entry.
See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace