Revit 2024 API
RoomTag Members
The RoomTag type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsInRoom
Identifies if the tag is located in a room.
Room
The room that the tag is associated with.
RoomTagType
The tag type.
TaggedLocalRoomId
The ElementId of the tagged room.
TaggedRoomId
The LinkElementId of the tagged room.
See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace