Revit 2024 API
DuctLining Members
The DuctLining type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of duct lining.
Properties
Name | Description
See Also
DuctLining Class
Autodesk.Revit.DB.Mechanical Namespace