Revit 2024 API
JournalingAttribute Members
The JournalingAttribute type exposes the following members.
Constructors
Name | Description
JournalingAttribute
Constructs a new JournalingAttribute.
Methods
Name | Description
Properties
Name | Description
Mode
Journaling mode.
See Also
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace