Revit 2024 API
SystemZoneData Members
The SystemZoneData type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a system-zone data domain class.
Properties
Name | Description
ZoneEquipmentId
 The id of the zone equipment related to the zone.
See Also
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace