Revit 2024 API
RebarHookType Members
The RebarHookType type exposes the following members.
Methods
Name | Description
Create
 Creates a new RebarHookType in a document.
CreateDefaultRebarHookType
 Creates a new RebarHookType object with a default name.
GetDefaultHookExtension
 Computes the default hook length, which is equal to barDiameter * multiplier.
GetHookExtensionLength
 Computes the hook extension length based on current hook length
IsOffsetLengthRequired
 Check whether hook offset length is required. remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful. returns: True if hook offset length is required, otherwise false.
Properties
Name | Description
HookAngle
 The hook angle, measured in radians. Must be greater than 0 and no more than pi.
StraightLineMultiplier
 Multiplier of bar diameter. Used to compute a default hook length. The default hook length can be overridden by the RebarBarType class.
Style
 The hook may only be applied to shapes of the specified style.
See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace