Revit 2024 API
RevitServerCommunicationException Members
The RevitServerCommunicationException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerCommunicationException Class
Autodesk.Revit.Exceptions Namespace