Revit 2024 API
IFCExtrusionCalculatorOptions Members
The IFCExtrusionCalculatorOptions type exposes the following members.
Constructors
Name | Description
IFCExtrusionCalculatorOptions
 Constructs a new instance of a class used to calculate extrusions from Revit geometry.
Methods
Name | Description
Dispose
Releases all resources used by the IFCExtrusionCalculatorOptions
Properties
Name | Description
CustomAxis
 The custom axis to try (if extrusionAxes includes an option for a custom direction).
ExtrusionAxes
 The extrusion axes to try when doing the calculation.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Scale
 The scaling factor for length measurements from the default Revit units to the export units.
See Also
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace