Revit 2024 API
Part Members
The Part type exposes the following members.
Methods
Name | Description
CanOffsetFace
 Checks if it is possible to offset the given face.
GetFaceOffset
 Get face offset of the given part face.
GetSourceElementIds
 Gets a collection of elements from which this Part is created by the PartMaker. May return more than one source only if there is merge involved somewhere in the history of this Part.
GetSourceElementOriginalCategoryIds
 Gets the category ids of the source elements which were used to form this part.
ResetFaceOffset
 Resets the offset applied to the given part face.
ResetPartShape
 Resets all face offsets applied to part faces.
SetFaceOffset
 Offsets the given part face in the direction that points out of the solid shape with the specified amount. Negative value will offset the face into the solid shape.
Properties
Name | Description
Excluded
 True if the part is excluded, false otherwise
OriginalCategoryId
 The category Id of the original element corresponding to this Part.
PartMaker
 The PartMaker that created this Part.
See Also
Part Class
Autodesk.Revit.DB Namespace