Revit 2024 API
TransferringProjectStandardsEventArgs Members
The TransferringProjectStandardsEventArgs type exposes the following members.
Methods
Name | Description
GetExternalItems
 Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
SetExternalItems
 Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
Properties
Name | Description
SourceDocument
 Source document.
TargetDocument
 Target document.
See Also
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace