Revit 2024 API
RebarShapeConstraintDiameter Members
The RebarShapeConstraintDiameter type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintDiameter
 Create a diameter constraint.
Methods
Name | Description
Properties
Name | Description
ArcReferenceType
 The choice of rule for measuring the diameter.
See Also
RebarShapeConstraintDiameter Class
Autodesk.Revit.DB.Structure Namespace