Revit 2024 API
SolidGeometryOptions Methods
The SolidGeometryOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace