Revit 2024 API
FamilySizeTable Members
The FamilySizeTable type exposes the following members.
Methods
Name | Description
AsValueString
 Gets the table cell value as a string.
Dispose
Releases all resources used by the FamilySizeTable
GetColumnHeader
 Gets a column of the table at at given index.
IsValidColumnIndex
 Checks if the column index is valid.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberOfColumns
 Number of columns in the table.
NumberOfRows
 Number of rows in the table.
See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace