Revit 2024 API
VoltageType Members
The VoltageType type exposes the following members.
Methods
Name | Description
SetVoltageValue
 Assign new values to modify voltage type, all of the unit are volt.
Properties
Name | Description
ActualValue
 Get actual voltage value of this voltage definition, the unit is volt.
IsInUse
 Indicates whether this voltage type is in service now, such as by other distribution system.
MaxValue
 Get upper boundary of voltage value of this voltage definition, the unit is volt.
MinValue
 Get lower boundary of voltage value of this voltage definition, the unit is volt.
See Also
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace