Revit 2024 API
DocumentEntryPoint Members
The DocumentEntryPoint type exposes the following members.
Constructors
Name | Description
DocumentEntryPoint
Initializes a new instance of the DocumentEntryPoint class
Methods
Name | Description
FinishInitializationEO
 For Revit Macros internal use only.
Initialize
 For Revit Macros internal use only.
OnShutdownEO
 For Revit Macros internal use only.
Properties
Name | Description
AddinFolder
 The full path to the Revit Macros module.
Events
Name | Description
See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace