Revit 2024 API
VertexStreamPositionNormal Members
The VertexStreamPositionNormal type exposes the following members.
Methods
Name | Description
AddVertex
 Inserts a VertexStreamPositionNormal into the stream and associated buffer.
AddVertices
 Inserts multiple VertexStreamPositionNormal instances into the stream and associated buffer.
Properties
Name | Description
See Also
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace