Revit 2024 API
RevitServerModelAlreadyExistsException Members
The RevitServerModelAlreadyExistsException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerModelAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace