Revit 2024 API
FieldDomainPointsByParameter Members
The FieldDomainPointsByParameter type exposes the following members.
Constructors
Name | Description
FieldDomainPointsByParameter
 Creates object from an array of one-dimensional point coordinates
Methods
Name | Description
Properties
Name | Description
See Also
FieldDomainPointsByParameter Class
Autodesk.Revit.DB.Analysis Namespace