Revit 2024 API
InsulationType Members
The InsulationType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsInUse
 Indicate whether the insulation type is in use.
Name
 Get name of Insulation type.
 (Overrides ElementType.Name.)
See Also
InsulationType Class
Autodesk.Revit.DB.Electrical Namespace