Revit 2024 API
CentralModelContentionException Members
The CentralModelContentionException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
CurrentUser
Retrieves current user name.
See Also
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace