Revit 2024 API
MechanicalEquipmentSetType Members
The MechanicalEquipmentSetType type exposes the following members.
Methods
Name | Description
Create
 Creates a new type of a mechanical equipment set and adds it to the document.
Properties
Name | Description
See Also
MechanicalEquipmentSetType Class
Autodesk.Revit.DB.Mechanical Namespace