Revit 2024 API
SolidCurveIntersectionOptions Members
The SolidCurveIntersectionOptions type exposes the following members.
Constructors
Name | Description
SolidCurveIntersectionOptions
 Constructs a new SolidCurveIntersectionMode with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the SolidCurveIntersectionOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ResultType
 The type of results expected by the calculation. The default is CurveSegmentsInside.
See Also
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace