Revit 2024 API
FileDialog Members
The FileDialog type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FileDialog
GetSelectedModelPath
 Returns the selected file path chosen by the user.
IsValidFilterString
 Determines if the input string is acceptable as input for a FileDialog filter string.
Show
 Shows the dialog using the stored settings.
Properties
Name | Description
DefaultFilterEntry
 The default entry (from the filter) to be selected in the dialog.
Filter
 The filter string representing a collection of extensions allowed by the dialog.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Title
 The title to show on the dialog.
See Also
FileDialog Class
Autodesk.Revit.UI Namespace