Revit 2024 API
Entity Members
The Entity type exposes the following members.
Constructors
Name | Description
Entity()
 The default-constructed Entity is invalid.
Entity(Guid)
 Creates a new Entity corresponding to the Schema of the specified GUID.
Entity(Entity)
 Constructs a new copy of the input ESEntity object.
Entity(Schema)
 Creates a new Entity corresponding to the Schema.
Methods
Name | Description
Clear(String)
 Resets the field to its default value.
Clear(Field)
 Resets the field to its default value.
Dispose
Releases all resources used by the Entity
Get<FieldType>(String)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field)
 Retrieves the value of the field in the entity.
Get<FieldType>(String, ForgeTypeId)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field, ForgeTypeId)
 Retrieves the value of the field in the entity.
IsValid
 Checks whether this Entity has a live Schema corresponding to it.
ReadAccessGranted
 Checks whether this Entity may be retrieved by the current add-in.
RecognizedField
 Checks whether a Field belongs to the same Schema as this Entity.
Set<FieldType>(String, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, ForgeTypeId)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, ForgeTypeId)
 Stores the value of the field in the entity.
WriteAccessGranted
 Checks whether this Entity may be stored by the current add-in.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Schema
 The Schema describing this Entity.
SchemaGUID
 The GUID of the Schema describing this Entity.
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace