Revit 2024 API
InitialColor Members
The InitialColor type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the InitialColor derived object.
Dispose
Releases all resources used by the InitialColor
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TemperatureValue
 The light color temperature value in Kelvins.
See Also
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace