Revit 2024 API
ContextualHelp Members
The ContextualHelp type exposes the following members.
Constructors
Name | Description
ContextualHelp
Constructs a contextual help object.
Methods
Name | Description
Launch
Launches and displays the help topic specified by the contents of this ContextualHelp object.
Properties
Name | Description
HelpPath
The context id, help URL, or help file path.
HelpTopicUrl
The help topic URL.
HelpType
The contextual help type.
See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace