Revit 2024 API
IndexStreamLine Members
The IndexStreamLine type exposes the following members.
Methods
Name | Description
AddLine
 Inserts a IndexLine segment into the stream and associated buffer.
AddLines
 Inserts multiple IndexLine segments into the stream and associated buffer.
Properties
Name | Description
See Also
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace