Revit 2024 API
SchemaException Members
The SchemaException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
SchemaException Class
Autodesk.Revit.Exceptions Namespace