Revit 2024 API
RebarShapeConstraintProjectedSegmentLength Members
The RebarShapeConstraintProjectedSegmentLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintProjectedSegmentLength
 Constructs a new instance of a RebarConstraintProjectEdgedLength object using a shape parameter, direction, and reference types.
Methods
Name | Description
GetSegmentEndReferenceType
 Choice of two possibilities for the start and end references of the length constraint.
Properties
Name | Description
Direction
 A vector specifying the direction of the constraint. The direction is fixed, and the shape is always constructed so that the segment direction has a positive dot product with this vector.
TripleProductSign
 Sign of the z-coordinate of the cross product of the Direction property with the segment vector. TripleProductSign is 1 if the segment direction is to be on the left of the constraint direction, or -1 if the segment direction is to be on the right.
See Also
RebarShapeConstraintProjectedSegmentLength Class
Autodesk.Revit.DB.Structure Namespace