Revit 2024 API
ParameterSetIterator Members
The ParameterSetIterator type exposes the following members.
Constructors
Name | Description
ParameterSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
ParameterSetIterator Class
Autodesk.Revit.DB Namespace