Revit 2024 API
ResourceNotFoundException Members
The ResourceNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ResourceNotFoundException Class
Autodesk.Revit.Exceptions Namespace