Revit 2024 API
SlabEdge Members
The SlabEdge type exposes the following members.
Methods
Name | Description
AddSegment
Add segments to the slab edge.
 (Overrides HostedSweep.AddSegment(Reference).)
Properties
Name | Description
SlabEdgeType
Retrieves/set an object that represents the type of the SlabEdge.
See Also
SlabEdge Class
Autodesk.Revit.DB Namespace