Revit 2024 API
AssetPropertyDoubleMatrix44 Members
The AssetPropertyDoubleMatrix44 type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
Get the value of the property
See Also
AssetPropertyDoubleMatrix44 Class
Autodesk.Revit.DB.Visual Namespace