Revit 2024 API
ArgumentNullException Members
The ArgumentNullException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ArgumentNullException Class
Autodesk.Revit.Exceptions Namespace