Revit 2024 API
TransactionGroup Members
The TransactionGroup type exposes the following members.
Constructors
Name | Description
TransactionGroup(Document)
 Constructs a transaction group object.
TransactionGroup(Document, String)
 It constructs a transaction group object
Methods
Name | Description
Assimilate
 Assimilates all inner transactions by merging them into a single undo item.
Commit
 Commits the transaction group.
Dispose
Releases all resources used by the TransactionGroup
GetName
 Returns the transaction group's name. It could be an empty string.
GetStatus
 Gets the current status of the transaction group.
HasEnded
 Determines whether the transaction group has ended already.
HasStarted
 Determines whether the transaction has been started yet.
RollBack
 Rolls back the transaction group, which effectively undoes all transactions committed inside the group.
SetName
 Sets the transaction group's name.
Start()
 Starts the transaction group
Start(String)
 Starts the transaction group with an assigned name.
Properties
Name | Description
IsFailureHandlingForcedModal
 Forces all transactions finished inside this group to use modal failure handling regardless of what failure handling options are set for those transactions.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace