Revit 2024 API
RebarSystemSpanSymbol Members
The RebarSystemSpanSymbol type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of RebarSystemSpanSymbol in the project.
Properties
Name | Description
See Also
RebarSystemSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace