Revit 2024 API
BoundingBoxIsInsideFilter Members
The BoundingBoxIsInsideFilter type exposes the following members.
Constructors
Name | Description
BoundingBoxIsInsideFilter(Outline)
 Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline.
BoundingBoxIsInsideFilter(Outline, Boolean)
 Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline.
BoundingBoxIsInsideFilter(Outline, Double)
 Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline.
BoundingBoxIsInsideFilter(Outline, Double, Boolean)
 Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline.
Methods
Name | Description
GetBoundingBox
 Gets the outline being used for this filter.
Properties
Name | Description
Tolerance
 Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
See Also
BoundingBoxIsInsideFilter Class
Autodesk.Revit.DB Namespace