Revit 2024 API
SpatialElementBoundaryOptions Members
The SpatialElementBoundaryOptions type exposes the following members.
Constructors
Name | Description
SpatialElementBoundaryOptions
 Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).
Methods
Name | Description
Dispose
Releases all resources used by the SpatialElementBoundaryOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SpatialElementBoundaryLocation
 The boundary of spatial element for geometry calculation.
StoreFreeBoundaryFaces
 Indicates whether to include the free boundary faces in the result.
See Also
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace