Revit 2024 API
DocumentClosingEventArgs Members
The DocumentClosingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DocumentId
 Id of the document that is about to be closed.
See Also
DocumentClosingEventArgs Class
Autodesk.Revit.DB.Events Namespace