Revit 2024 API
BackgroundSettings Members
The BackgroundSettings type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BackgroundSettings
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BackgroundSettings Class
Autodesk.Revit.DB Namespace