Revit 2024 API
StartingViewSettings Members
The StartingViewSettings type exposes the following members.
Methods
Name | Description
GetStartingViewSettings
 Returns the starting view settings for the specified document.
IsAcceptableStartingView
 Checks whether the given Id is an acceptable starting view. InvalidElementId corresponds to "Last Viewed" and is therefore also acceptable.
Properties
Name | Description
ViewId
 Indicates the specific view that will be opened when the model is loaded. InvalidElementId indicates that no view has been specified. In that case, Revit will open the last views that were open at the time the file was saved.
See Also
StartingViewSettings Class
Autodesk.Revit.DB Namespace