Revit 2024 API
RouteAnalysisSettings Members
The RouteAnalysisSettings type exposes the following members.
Methods
Name | Description
GetExcludedCategoryIds
 Returns ElementIds for Category elements which are excluded (not taken into account) by route calculation. These categories are always excluded, regardless of the EnableIgnoredCategoryIds value. If an excluded category has sub-categories, then the sub-categories will be excluded as well.
GetIgnoredCategoryIds
 Returns ElementIds for Category elements which are ignored (not taken into account) route calculation. To enable ignoring of these categories, EnableIgnoredCategoryIds must be set to true. If an ignored category has sub-categories, then the sub-categories will be ignored as well.
GetRouteAnalysisSettings
 Returns the RouteAnalysisSettings element for a given document.
IsLargeGeometryAllowed
 Returns if large geometry is allowed for path of travel creation or not.
SetIgnoredCategoryIds
 Sets the ElementIds for Category elements which are ignored by route calculation.
Properties
Name | Description
AnalysisZoneBottomOffset
 The bottom plane offset, in ft, of the zone used in route calculation. Default value is 8".
AnalysisZoneTopOffset
 The top plane offset, in ft, for the zone used in route calculation. Default value is 6'8".
EnableIgnoredCategoryIds
When this setting is true, elements with category ids returned by GetIgnoredCategoryIds will be ignored in route calculation. default is true as all elements with the Door Category Id are ignored by default.
IgnoreImports
 If true, import instances are ignored by route calculation. For imports to be ignored, also EnableIgnoredCategoryIds must be set to true.
MinimumLength
 The constant storing minimum allowed length of path of travel
See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace