Revit 2024 API
InsufficientResourcesException Members
The InsufficientResourcesException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
InsufficientResourcesException Class
Autodesk.Revit.Exceptions Namespace