Revit 2024 API
WorksetConfiguration Members
The WorksetConfiguration type exposes the following members.
Constructors
Name | Description
WorksetConfiguration()
 Constructs a new workset configuration with an initial setting to open all user-created worksets.
WorksetConfiguration(WorksetConfiguration)
 Constructs a new copy of the input WorksetConfiguration object.
WorksetConfiguration(WorksetConfigurationOption)
 Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets.
Methods
Name | Description
Close
 Sets a group of user-created worksets to close.
Dispose
Releases all resources used by the WorksetConfiguration
Open
 Sets a group of user-created worksets to open.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
WorksetConfiguration Class
Autodesk.Revit.DB Namespace