Revit 2024 API
RebarShapeParameters Members
The RebarShapeParameters type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarShapeParameters
GetAllRebarShapeParameters
 List all shape parameters used by all the existing RebarShapes in the specified document.
GetElementIdForExternalDefinition
 Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, return InvalidElementId.
GetExternalDefinitionForElementId
 Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document.
GetOrCreateElementIdForExternalDefinition
 Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, add the parameter to the document and generate a new ElementId.
IsValidExternalDefinition
 Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace