Revit 2024 API
AssetProperties Members
The AssetProperties type exposes the following members.
Methods
Name | Description
FindByName
 Gets the property with the given name.
Get
 Gets the property at the given index.
IsValidIndex
 Returns true if the provided index is valid.
Properties
Name | Description
Item
Size
 The number of the AssetProperty(s) in the object.
See Also
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace