Revit 2024 API
DocumentClosedEventArgs Members
The DocumentClosedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DocumentId
 Id of the document that has just been closed.
See Also
DocumentClosedEventArgs Class
Autodesk.Revit.DB.Events Namespace