Revit 2024 API
SubTransaction Members
The SubTransaction type exposes the following members.
Constructors
Name | Description
SubTransaction
 Instantiates a sub-transaction object
Methods
Name | Description
Commit
 Commits all changes made to the model made during the sub-transaction.
Dispose
Releases all resources used by the SubTransaction
GetStatus
 Returns the current status of the sub-transaction.
HasEnded
 Determines whether the sub-transaction has ended already.
HasStarted
 Determines whether the sub-transaction has been started yet.
RollBack
 Discards all changes made to the model during the sub-transaction.
Start
 Starts the sub-transaction.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SubTransaction Class
Autodesk.Revit.DB Namespace