Revit 2024 API
DuplicateTypeNamesHandlerArgs Members
The DuplicateTypeNamesHandlerArgs type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuplicateTypeNamesHandlerArgs
GetTypeIds
 Returns ids of the types with duplicate names.
Properties
Name | Description
Document
 The document that contains the types with duplicate names.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace