Revit 2024 API
StairsComponentConnection Methods
The StairsComponentConnection type exposes the following members.
Methods
Name | Description
Dispose
See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace