Revit 2024 API
MEPSpaceConstruction Members
The MEPSpaceConstruction type exposes the following members.
Methods
Name | Description
DeleteConstruction
Remove an existing construction from Space constructions.
DuplicateConstruction
Create a new construction for Space constructions.
NewConstruction
Create a new construction for Space constructions.
Properties
Name | Description
CurrentConstruction
Get all the Building Constructions according to the specific Construction type.
SpaceConstructions
Return all the Space constructions of current space.
See Also
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace