Revit 2024 API
RelinquishedItems Members
The RelinquishedItems type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RelinquishedItems
GetRelinquishedElements
 The elements that were relinquished by the current user.
GetRelinquishedWorksets
 The elements that were relinquished by the current user.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RelinquishedItems Class
Autodesk.Revit.DB Namespace