Revit 2024 API
HostObject Members
The HostObject type exposes the following members.
Methods
Name | Description
FindInserts
 Gets the ids of the instances inserted into this host object.
Properties
Name | Description
See Also
HostObject Class
Autodesk.Revit.DB Namespace