Revit 2024 API
ExternalServiceOptions Members
The ExternalServiceOptions type exposes the following members.
Constructors
Name | Description
ExternalServiceOptions
 Constructs a new ExternalServiceOptions with default settings.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalServiceOptions
Properties
Name | Description
IsPublic
 This property denotes a service as either public or private.
IsRecordable
 Indicates whether executions of the service is recorded in documents or not.
IsSelfsynchronizing
 Indicates whether the service's record of used services (in a particular document) can independently wary between local clients and the corresponding central model. It is then up to the service's owner to assure proper local-central synchronization.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SupportActivation
 Indicates if the service supports activation/deactivation of the servers.
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace