Revit 2024 API
ElementNode Members
The ElementNode type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Document
 Gets the document associated with the element.
ElementId
 The Id of the element.
LinkInstanceId
 The Id of the link instance for the element.
See Also
ElementNode Class
Autodesk.Revit.DB Namespace