Revit 2024 API
BarTypeDiameterOptions Methods
The BarTypeDiameterOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace