Revit 2024 API
Edge Properties
The Edge type exposes the following members.
Properties
Name | Description
ApproximateLength
Returns the approximate length of the edge.
Reference
Returns a stable reference to the edge.
See Also
Edge Class
Autodesk.Revit.DB Namespace