Revit 2024 API
BoundingBoxXYZ Members
The BoundingBoxXYZ type exposes the following members.
Constructors
Name | Description
BoundingBoxXYZ
Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100).
Methods
Name | Description
Properties
Name | Description
BoundEnabled
Indexed access for loops.
Bounds
Indexed access for loops. Use 0 for Min and 1 for Max.
Enabled
Defines whether the entire bounding box is enabled.
IsSet
Indicates whether the bounding box is set.
Max
Maximum coordinates (upper-right-front corner of the box).
MaxEnabled
Defines whether the maximum bound is active for given dimension.
Min
Minimum coordinates (lower-left-rear corner of the box).
MinEnabled
Defines whether the minimum bound is active for given dimension.
Transform
The transform from the coordinate space of the box to the model coordinate space.
See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace