Revit 2024 API
ViewCropRegionShapeManager Members
The ViewCropRegionShapeManager type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ViewCropRegionShapeManager
GetAnnotationCropShape
 Gets the annotation crop box assigned to the view.
GetCropShape
 Gets the crop boundaries that are curently active.
GetSplitRegionMaximum
 Returns the proportional location of the maximum boundary of the specified split crop region.
GetSplitRegionMinimum
 Returns the proportional location of the minimum boundary of the specified split crop region.
GetSplitRegionOffset
 Returns the offset for the specified split crop region.
IsCropRegionShapeValid
 Verifies that boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
RemoveCropRegionShape
 Removes any non-rectangular boundary of the view's crop.
RemoveSplit
 Removes any split applied to the view's crop.
RemoveSplitRegion
 Removes one region in split crop.
SetCropShape
 Sets the boundary of the view's crop to the specified shape.
SplitRegionHorizontally
 Splits horizontally one region in split crop.
SplitRegionVertically
 Splits vertically one region in split crop.
Properties
Name | Description
BottomAnnotationCropOffset
 The offset from the bottom of the view crop that determines the location of the annotation crop bottom boundary.
CanBeSplit
 Verifies that the crop of the associated view is permitted to have multiple regions.
CanHaveAnnotationCrop
 Verifies that the view is allowed to have an annotation crop.
CanHaveShape
 Verifies that the crop of the associated view is permitted to have a non-rectangular shape.
IsSplitHorizontally
 Whether or not the view's crop is split (and the split is horizontal).
IsSplitVertically
 Whether or not the view's crop is split (and the split is vertical).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LeftAnnotationCropOffset
 The offset from the left of the view crop that determines the location of the annotation crop left boundary.
NumberOfSplitRegions
 The number of split crop regions (1 if the crop is not currently split).
RightAnnotationCropOffset
 The offset from the right of the view crop that determines the location of the annotation crop right boundary.
ShapeSet
 Whether or not the view crop has a non-rectangular shape set.
Split
 Whether or not the view crop is split.
TopAnnotationCropOffset
 The offset from the top of the view crop that determines the location of the annotation crop top boundary.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace