Revit 2024 API
EditScope Members
The EditScope type exposes the following members.
Methods
Name | Description
Cancel
 Cancels the edit scope.
Commit
 Finishes the edit scope.
Dispose
Releases all resources used by the EditScope
Properties
Name | Description
IsActive
 Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
IsPermitted
 Tells if the edit scope is permitted to start.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
EditScope Class
Autodesk.Revit.DB Namespace