Revit 2024 API
CutMarkType Members
The CutMarkType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
CutLineAngle
 The rotation angle of the cut mark.
CutLineDistance
 The distance between 2 cut lines.
CutLineExtension
 The extension distance to the boundary.
CutLineType
 The cut line type of the cut mark.
CutMarkSymbol
 The symbol type of the cut mark.
CutMarkSymbolSize
 The size of the cut mark symbol.
See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace