Revit 2024 API
InsulationLiningBase Members
The InsulationLiningBase type exposes the following members.
Methods
Name | Description
GetInsulationIds
 Returns the ids of the insulation elements associated to a given element.
GetLiningIds
 Returns the ids of the lining elements associated to a given element.
IsValidThickness
 Identifies if the given thickness value is valid for assignment to insulation or lining elements.
Properties
Name | Description
HostElementId
 The id of the host element for the insulation or lining element.
Thickness
 Thickness of the insulation or lining element.
See Also
InsulationLiningBase Class
Autodesk.Revit.DB Namespace