Revit 2024 API
WallFoundation Members
The WallFoundation type exposes the following members.
Methods
Name | Description
Create
 Creates a new wall foundation within the project.
Properties
Name | Description
WallId
 Returns the id of the host wall.
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace