Revit 2024 API
FileExportingEventArgs Members
The FileExportingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Format
 Identifies the export format, e.g. DWG or image.
Path
 The target path for the export.
See Also
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace