Revit 2024 API
DeleteWorksetSettings Members
The DeleteWorksetSettings type exposes the following members.
Constructors
Name | Description
DeleteWorksetSettings()
 Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.
DeleteWorksetSettings(DeleteWorksetOption, WorksetId)
 Constructs a DeleteWorksetSettings object.
Methods
Name | Description
Dispose
Releases all resources used by the DeleteWorksetSettings
Properties
Name | Description
DeleteWorksetOption
 The current delete workset option.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
WorksetId
 The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset.
See Also
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace