Revit 2024 API
SpacingRule Members
The SpacingRule type exposes the following members.
Methods
Name | Description
SetLayoutFixedDistance
Set the Layout property to FixedDistance.
SetLayoutFixedNumber
Set the Layout property to FixedNumber.
SetLayoutMaximumSpacing
Set the Layout property to MaximumSpacing.
SetLayoutMinimumSpacing
Set the Layout property to MinimumSpacing.
SetLayoutNone
Set the Layout property to None.
Properties
Name | Description
BeltMeasurement
 On a curved surface, BeltMeasurement specifies where the grid's distances are measured.
Distance
The exact distance between layout lines.
GridlinesRotation
An additional rotation to be applied to this set of grid lines.
HasBeltMeasurement
 True if the gridlines are not parallel due to surface curvature, and the BeltMeasurement property therefore applies.
Justification
The justification of the lines within the region.
Layout
A choice of several gridline layout rules.
Number
The exact number of lines in the region.
Offset
An additional offset applied to the first gridline.
See Also
SpacingRule Class
Autodesk.Revit.DB Namespace