Revit 2024 API
PipeFittingAndAccessoryPressureDropUIData Members
The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PipeFittingAndAccessoryPressureDropUIData
GetUIDataItems
 Gets all UI data items stored in the UI data.
GetUnits
 Gets units.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace