Revit 2024 API
RebarHandlePositionData Members
The RebarHandlePositionData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RebarHandlePositionData
GetBarGeometry
 Returns the geometry for a bar at the specified index currently in the Rebar.
GetDistributionPath
 Gets the distribution path currently stored in the rebar.
GetNumberOfBars
 Gets the number of bars currently in the rebar.
SetPosition
 Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace