Revit 2024 API
AnnotationSymbol Members
The AnnotationSymbol type exposes the following members.
Methods
Name | Description
addLeader
add a leader to this annotation symbol.
duplicate
Duplicate this annotation symbol.
GetLeaders
 Returns a collection of leaders currently attached to the annotation.
removeLeader
remove a leader of this annotation symbol.
Properties
Name | Description
AnnotationSymbolType
 The AnnotationSymbol style of this AnnotationSymbol.
See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace