Revit 2024 API
FilterNumericValueRule Members
The FilterNumericValueRule type exposes the following members.
Methods
Name | Description
GetEvaluator
 Gets the evaluator that implements the test for this rule.
SetEvaluator
 Sets the evaluator that implements the test for this rule.
Properties
Name | Description
See Also
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace