Revit 2024 API
StructuralSectionRectangleHSS Members
The StructuralSectionRectangleHSS type exposes the following members.
Constructors
Name | Description
StructuralSectionRectangleHSS
 Creates a new instance of Structural Section Rectangle HSS shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionRectangleHSS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace