Revit 2024 API
LightGroupManager Members
The LightGroupManager type exposes the following members.
Methods
Name | Description
CreateGroup
 Create a new LightGroup object with the given name
DeleteGroup
 Remove the given LightGroup object from the set of LightGroup objects
Dispose
Releases all resources used by the LightGroupManager
GetGroups
 Get the set of contained LightGroup objects The set of LightGroup objects
GetLightDimmer
 Gets the dimmer value for the given light for rendering the given view
GetLightGroupManager
 Creates a light group manager object from the given document
IsLightGroupOn
 Returns true if the given light group is on
IsLightOn
 Returns true if the given light is on for rendering the given view
SetLightDimmer
 Sets the dimmer value for the given light for rendering the given view
SetLightGroupOn
 Turns the given light group on or off for rendering the given view depending on the bool argument
SetLightOn
 Turns the given light on or off for rendering the given view depending on the bool argument
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace