Revit 2024 API
TableView Members
The TableView type exposes the following members.
Methods
Name | Description
GetAvailableParameterCategories
 Get all available parameter categories.
GetAvailableParameters
 Gets a list of valid parameters for the specified category that can be used in the table view.
GetCalculatedValueName
 Gets the calculated value name for a cell from the template view.
GetCalculatedValueText
 Gets the calculated value text for a cell from the instance view.
GetCellText
 Gets the cell's text based on its type
IsValidSectionType
 Identifies if the section type is valid for this view.
Properties
Name | Description
MaximumColumnWidth
 Gets the maximum column width
MaximumGridWidth
 Gets the allowed maximum grid width
MaximumRowHeight
 Gets the maximum row height
MinimumColumnWidth
 Gets the minimum column width
MinimumRowHeight
 Gets the minimum row height
TargetId
 the element id of the element that is being viewed
See Also
TableView Class
Autodesk.Revit.DB Namespace