Revit 2024 API
LinkElementId Members
The LinkElementId type exposes the following members.
Constructors
Name | Description
LinkElementId(ElementId)
 Creates a new LinkElementId representing an element in the host document.
LinkElementId(ElementId, ElementId)
 Creates a new LinkElementId representing an element in a linked document.
Methods
Name | Description
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
Operators
Name | Description
Equality
Determines whether these two LinkElementIds are the same.
Inequality
Determines whether these two LinkElementIds are different.
Properties
Name | Description
HostElementId
 The id of the element in the host, or invalidElementId if there is a link.
LinkedElementId
 The id of the element in the link, or invalidElementId if no link.
LinkInstanceId
 The id of the link, or invalidElementId if no link.
See Also
LinkElementId Class
Autodesk.Revit.DB Namespace