Revit 2024 API
ImageType Members
The ImageType type exposes the following members.
Methods
Name | Description
CanReload
 Check whether the ImageType can be reloaded from file.
Create
 Creates a new ImageType element and loads the image into it.
GetImage
Get the bitmap image stored in the image symbol.
Reload
 Reloads the ImageType from the file found at the location specified by the Path property, using the same PageNumber and resolution.
ReloadFrom
 Reloads the image in the ImageType from a new image file, and for a new PageNumber.
Unload
 Unload the linked image.
Properties
Name | Description
ExternalResourceType
 The type of external resources that represents images.
Height
 The vertical size of the image
HeightInPixels
 Number of pixels in the vertical direction of the image
PageNumber
 The number of the page in a multi-page file, that was used to create the image in the ImageType.
Path
 The path to the file from which the ImageType was loaded.
PathType
 The path type that was used to refer to the file from which the ImageType was loaded.
Resolution
 The size of the pixels in the image, expressed in dots-per-inch (dpi)
Source
 The source of the image in the ImageType.
Status
 The status of the image
Width
 The horizontal size of the image
WidthInPixels
 Number of pixels in the horizontal direction of the image
See Also
ImageType Class
Autodesk.Revit.DB Namespace