Revit 2024 API
ExportLinetypeTableIterator Members
The ExportLinetypeTableIterator type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExportLinetypeTableIterator
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the iterator to the next item.
Reset
 Resets the iterator to the initial state.
Properties
Name | Description
Current
Gets the item at the current position of the iterator.
CurrentObject
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportLinetypeTableIterator Class
Autodesk.Revit.DB Namespace