Revit 2024 API
InvalidDataStreamException Members
The InvalidDataStreamException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides IOException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
InvalidDataStreamException Class
Autodesk.Revit.Exceptions Namespace