Revit 2024 API
MechanicalEquipmentSet Members
The MechanicalEquipmentSet type exposes the following members.
Methods
Name | Description
Add
 Adds member element ids to the mechanical equipment set.
AreElementsNotConnectedInSeries
 Checks if the elements are not serially connected.
AreValidMembers
 Checks if these are valid members for mechanical equipment set.
Create
 Creates a new instance of a mechanical equipment set and adds it to the document.
GetMembers
 Gets member element ids for the mechanical equipment set.
Remove
 Removes member element ids from the mechanical equipment set.
Properties
Name | Description
Classification
 The classification for the mechanical equipment set.
OnDuty
 The number of pieces of mechanical equipment operating in parallel at any given time.
OnStandby
 The number of pieces of mechanical equipment that are not operational at any given time.
See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace