Revit 2024 API
ExternalApplicationException Members
The ExternalApplicationException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ExternalApplicationException Class
Autodesk.Revit.Exceptions Namespace