Revit 2024 API
TaskDialogShowingEventArgs Members
The TaskDialogShowingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Message
 The message that has been displayed in the dialog box.
See Also
TaskDialogShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace