Revit 2024 API
IDuctFittingAndAccessoryPressureDropUIServer Members
The IDuctFittingAndAccessoryPressureDropUIServer type exposes the following members.
Methods
Name | Description
GetDBServerId
 Returns the Id of the corresponding DB server for which this server provides an optional UI.
ShowSettings
 Shows the settings UI.
See Also
IDuctFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Mechanical Namespace