Revit 2024 API
PrintSetting Members
The PrintSetting type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Name
Returns the Name of Print Setup.
 (Overrides Element.Name.)
PrintParameters
Returns the Parameters of Print Setup.
See Also
PrintSetting Class
Autodesk.Revit.DB Namespace