Revit 2024 API
GroupLoadOptions Members
The GroupLoadOptions type exposes the following members.
Constructors
Name | Description
GroupLoadOptions
 Creates a new instance of a GroupLoadOptions object.
Methods
Name | Description
Dispose
Releases all resources used by the GroupLoadOptions
GetDuplicateTypeNamesHandler
 Returns current duplicate type names handler or null if none is set.
SetDuplicateTypeNamesHandler
 Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
Properties
Name | Description
IncludeAttachedDetails
 True if attached detail groups should be included, false otherwise. The default value is true.
IncludeGrids
 True if grids should be brought in from the input file, false otherwise. The default value is false.
IncludeLevels
 True if levels should be brought in from the input file, false otherwise. The default value is false.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ReplaceDuplicatedGroups
 If there are groups with the same names in source and destination documents set this property to true to replace existing groups, otherwise the operation will be canceled. The default value is false.
See Also
GroupLoadOptions Class
Autodesk.Revit.DB Namespace