Revit 2024 API
OptionalFunctionalityNotAvailableException Members
The OptionalFunctionalityNotAvailableException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
OptionalFunctionalityNotAvailableException Class
Autodesk.Revit.Exceptions Namespace