Revit 2024 API
LayoutRuleFixedNumber Members
The LayoutRuleFixedNumber type exposes the following members.
Constructors
Name | Description
LayoutRuleFixedNumber
Constructor of LayoutRuleFixedNumber.
Methods
Name | Description
Properties
Name | Description
NumberOfLines
Get or set the number of the beams in a beam system.
See Also
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace