Revit 2024 API
StructuralWallUsageFilter Members
The StructuralWallUsageFilter type exposes the following members.
Constructors
Name | Description
StructuralWallUsageFilter(StructuralWallUsage)
 Constructs a new instance of a filter to match walls that have the given structural wall usage.
StructuralWallUsageFilter(StructuralWallUsage, Boolean)
 Constructs a new instance of a filter to match walls that have the given structural wall usage, with the option to match all walls which are not of the given structural wall usage.
Methods
Name | Description
Properties
Name | Description
StructuralWallUsage
 The wall structural usage.
See Also
StructuralWallUsageFilter Class
Autodesk.Revit.DB.Structure Namespace