Revit 2024 API
Units Members
The Units type exposes the following members.
Constructors
Name | Description
Units
 Creates a new Units object with default settings for Metric or Imperial units.
Methods
Name | Description
Dispose
Releases all resources used by the Units
GetFormatOptions
 Gets the default FormatOptions for a spec.
GetModifiableSpecs
 Gets all specs for which the default FormatOptions can be modified.
IsModifiableSpec
 Checks whether the default FormatOptions can be modified for a given spec.
SetFormatOptions
 Sets the default FormatOptions for a spec.
Properties
Name | Description
DecimalSymbol
 The symbol used to separate the integer and fractional parts of a number.
DigitGroupingAmount
 The number of digits in each group when numbers are formatted with digit grouping.
DigitGroupingSymbol
 The symbol used to separate groups of digits when numbers are formatted with digit grouping.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Units Class
Autodesk.Revit.DB Namespace