Revit 2024 API
BrowserOrganization Members
The BrowserOrganization type exposes the following members.
Methods
Name | Description
AreFiltersSatisfied
 Determines if the given element satisfies the filters defined by the browser organization.
GetCurrentBrowserOrganizationForSchedules
 Gets the BrowserOrganization that applies to the Schedules section of the project browser.
GetCurrentBrowserOrganizationForSheets
 Gets the BrowserOrganization that applies to the Sheets section of the project browser.
GetCurrentBrowserOrganizationForViews
 Gets the BrowserOrganization that applies to the Views section of the project browser.
GetFolderItems
 Returns a collection of leaf FolderItemInfo objects each containing the given element Id.
Properties
Name | Description
SortingOrder
 The sorting order if sorting of items is applicable in the browser.
SortingParameterId
 The Id of the parameter used to determine the sorting order of items in the browser.
Type
 Get BrowserOrganizationType.
See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace