Revit 2024 API
ExportLinetypeTable Members
The ExportLinetypeTable type exposes the following members.
Constructors
Name | Description
ExportLinetypeTable
 Constructs a new ExportLinetypeTable with default values.
Methods
Name | Description
Add
 Inserts a (key, info) pair into Export line type table.
Clear
 Removes all contents stored in Export line type table.
ContainsKey
 Checks whether a pattern key exists in the table.
Dispose
Releases all resources used by the ExportLinetypeTable
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetExportLinetypeInfo
 Gets a copy of the ExportLinetypeInfo corresponding to the given ExportLinetypeKey.
GetKeys
 Gets all the keys stored in the map.
GetLinetypeTableIterator
Returns a ExportLinetypeTableIterator that iterates through the collection.
GetValues
 Returns all the values stored in the map.
Remove
 Removes the pair (key, info) corresponding to the given ExportLinetypeKey.
Properties
Name | Description
Count
 Count of the items contained in the collection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Item
 A copy of the ExportLinetypeInfo for the linetype's ExportLinetypeKey.
See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace