Revit 2024 API
RevitLinkGraphicsSettings Methods
The RevitLinkGraphicsSettings type exposes the following members.
Methods
Name | Description
Dispose
See Also
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace