Revit 2024 API
DWFImportOptions Members
The DWFImportOptions type exposes the following members.
Constructors
Name | Description
DWFImportOptions(DWFImportOptions)
 Constructs a new instance of DWFImportOptions as a copy of the import options.
DWFImportOptions(IList<ElementId>)
 Constructs a new instance of DWFImportOptions with an array of imported sheet views.
Methods
Name | Description
Dispose
Releases all resources used by the DWFImportOptions
GetSheetViews
 Get sheet views where DWF markups are imported.
SetSheetViews
 Set sheet views where DWF markups are imported.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DWFImportOptions Class
Autodesk.Revit.DB Namespace