Revit 2024 API
PhaseArray Members
The PhaseArray type exposes the following members.
Constructors
Name | Description
PhaseArray
Initializes a new instance of the PhaseArray class
Methods
Name | Description
Append
Add the phase to the end of the array.
Clear
Removes every phase from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified phase into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a phase at a specified index within the array.
Size
Returns the number of phases that are in the array.
See Also
PhaseArray Class
Autodesk.Revit.DB Namespace