Revit 2024 API
StructuralSectionGeneralT Members
The StructuralSectionGeneralT type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralT
 Creates a new instance of Tees shape.
Methods
Name | Description
GetFlangeThicknessInFlangeCenter
 Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInQuarterWidth
 Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm.
GetWebThicknessInHeightCenter
 Returns thickness of web measured in the 0.5 * height,
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet
 Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle
 Sloped flange angle. (rad)
SlopedWebAngle
 Sloped web angle. (rad)
TopWebFillet
 Top Web Fillet - fillet radius at the top of web.
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
See Also
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace