Revit 2024 API
LocationPoint Members
The LocationPoint type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Point
The physical location of the element.
Rotation
The angle of rotation around the insertion point, in radians.
See Also
LocationPoint Class
Autodesk.Revit.DB Namespace