Revit 2024 API
ElementClassFilter Members
The ElementClassFilter type exposes the following members.
Constructors
Name | Description
ElementClassFilter(Type)
 Constructs a new instance of a filter to match elements by class.
ElementClassFilter(Type, Boolean)
 Constructs a new instance of a filter to match elements by class, with the option to match all elements which are not of the given class.
Methods
Name | Description
GetElementClass
 The class for the filter.
Properties
Name | Description
See Also
ElementClassFilter Class
Autodesk.Revit.DB Namespace