Revit 2024 API
AppearanceAssetElement Members
The AppearanceAssetElement type exposes the following members.
Methods
Name | Description
Create
 Creates a new AppearanceAssetElement from an existing rendering asset.
Duplicate
 Duplicates the appearance asset element.
GetAppearanceAssetElementByName
 Gets an AppearanceAssetElement by name.
GetRenderingAsset
 Gets the rendering asset for the appearance asset element.
SetRenderingAsset
 Sets the rendering asset for the appearance asset element.
Properties
Name | Description
See Also
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace