Revit 2024 API
RebarReinforcementData Members
The RebarReinforcementData type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of RebarReinforcementData, or null if the operation fails.
Properties
Name | Description
End
 The end of the rebar. The end should be 0 or 1.
RebarId
 The id of the Rebar
See Also
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace