Revit 2024 API
RevitServerUnauthenticatedUserException Members
The RevitServerUnauthenticatedUserException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
RevitServerUnauthenticatedUserException Class
Autodesk.Revit.Exceptions Namespace