Revit 2024 API
ElementMulticlassFilter Members
The ElementMulticlassFilter type exposes the following members.
Constructors
Name | Description
ElementMulticlassFilter(IList<Type>)
 Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes.
ElementMulticlassFilter(IList<Type>, Boolean)
 Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes, with an option to instead match elements whose Element subclass does not match the list of input classes.
Methods
Name | Description
Properties
Name | Description
See Also
ElementMulticlassFilter Class
Autodesk.Revit.DB Namespace