Revit 2024 API
IFCRange Members
The IFCRange type exposes the following members.
Constructors
Name | Description
IFCRange()
 Instantiates a default IFCRange object.
IFCRange(IFCRange)
 Instantiates an IFCRange object by copy.
IFCRange(Double, Double)
 Instantiates an IFCRange object.
Methods
Name | Description
Dispose
Releases all resources used by the IFCRange
Properties
Name | Description
End
 The ending value of the range.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Start
 The starting value of the range.
See Also
IFCRange Class
Autodesk.Revit.DB.IFC Namespace