Revit 2024 API
BarTypeDiameterOptions Members
The BarTypeDiameterOptions type exposes the following members.
Constructors
Name | Description
BarTypeDiameterOptions()
 Constructs a new BarTypeDiameterOptions with default settings.
BarTypeDiameterOptions(RebarBarType)
 Constructs a new BarTypeDiameterOptions copying the diameter information from the bar type.
Methods
Name | Description
Dispose
Releases all resources used by the BarTypeDiameterOptions
Properties
Name | Description
BarModelDiameter
 Represents the bar model diameter of the RebarBarType.
BarNominalDiameter
 Represents the bar nominal diameter of the RebarBarType.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StandardBendDiameter
 Represents the standard bar bend diameter of the RebarBarType.
StandardHookBendDiameter
 Represents the standard hook bend diameter of the RebarBarType.
StirrupTieBendDiameter
 Represents the stirrup/tie bar and hook bend diameter of the RebarBarType.
See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace