Revit 2024 API
FileAccessException Members
The FileAccessException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides IOException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
FileAccessException Class
Autodesk.Revit.Exceptions Namespace