Revit 2024 API
UISaveAsOptions Members
The UISaveAsOptions type exposes the following members.
Constructors
Name | Description
UISaveAsOptions
 Default constructor.
Methods
Name | Description
Dispose
Releases all resources used by the UISaveAsOptions
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowOverwriteWarning
 Identifies if UI should show an overwrite warning dialog.
See Also
UISaveAsOptions Class
Autodesk.Revit.UI Namespace