Revit 2024 API
ParameterSet Members
The ParameterSet type exposes the following members.
Constructors
Name | Description
ParameterSet
Initializes a new instance of the ParameterSet class
Methods
Name | Description
Clear
Removes every parameter from the set, rendering it empty.
Contains
Tests for the existence of a parameter within the set.
Erase
Removes a specified parameter from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified parameter into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of parameters that are in the set.
See Also
ParameterSet Class
Autodesk.Revit.DB Namespace