Revit 2024 API
FileImportedEventArgs Members
The FileImportedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Format
 Identifies the import format, e.g. DWG or image.
ImportedInstanceId
 The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance.
Path
 Path of the source file that was imported.
See Also
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace