Revit 2024 API
SelectionFilterElement Members
The SelectionFilterElement type exposes the following members.
Methods
Name | Description
AddSet
 Adds a set of ElementIds to the filter's set.
AddSingle
 Adds a single ElementId to the filter's set.
Clear
 Removes all ElementIds from the filter.
Contains
 Returns true if the given ElementId is a member of this filter's set.
Create
 Creates a new SelectionFilterElement in the given document.
GetElementIds
 Returns the set of ElementIds contained by this filter.
IsEmpty
 Determines whether this filter's set is empty or not.
RemoveSet
 Removes a set of ElementIds from the filter's set.
RemoveSingle
 Removes a single ElementId from the filter's set.
SetElementIds
 Replaces the set of ElementIds contained by this filter.
Properties
Name | Description
See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace