Revit 2024 API
ReferencePointArray Members
The ReferencePointArray type exposes the following members.
Constructors
Name | Description
ReferencePointArray
Initializes a new instance of the ReferencePointArray class
Methods
Name | Description
Append
Clear
Removes every reference from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a reference at a specified index within the array.
Size
Returns the number of references that are in the array.
See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace