Revit 2024 API
FailureDefinitionAccessor Members
The FailureDefinitionAccessor type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FailureDefinitionAccessor
GetApplicableResolutionTypes
 Retrieves a list of resolution types applicable to the failure.
GetDefaultResolutionType
 Retrieves the default resolution type for the failure.
GetDescriptionText
 Retrieves the description text of the failure.
GetId
 Retrieves the unique identifier of the FailureDefinition.
GetResolutionCaption
 Retrieves the caption for a specific resolution type.
GetSeverity
 Retrieves severity of the failure.
HasResolutions
 Checks if the FailureDefinition has at least one resolution.
IsResolutionApplicable
 Checks if the given resolution type is applicable to the failure.
SetDefaultResolutionType
 Sets the default resolution type for the failure.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace