Revit 2024 API
LevelAssociationData Members
The LevelAssociationData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the LevelAssociationData
GetAssociatedLevel
 Returns the Associated Level id.
GetLevelAssociationData
 Returns LevelAssociationData associated with this element, if it exists.
GetLevelOffset
 Returns the offset from the Associated Level.
SetAssociatedLevel
 Sets the Associated Level.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace