Revit 2024 API
FamilyType Members
The FamilyType type exposes the following members.
Methods
Name | Description
AsDouble
Provides access to the double precision number of the given family parameter.
AsElementId
Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter.
AsInteger
Provides access to the integer number of the given family parameter.
AsString
Provides access to the string contents of the given family parameter.
AsValueString
Provides access to value as a string with unit in the given family parameter.
HasValue
Indicates if this family parameter has an assigned value or not.
Properties
Name | Description
Name
The name of the family type.
See Also
FamilyType Class
Autodesk.Revit.DB Namespace