Revit 2024 API
FaceSecondDerivatives Members
The FaceSecondDerivatives type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FaceSecondDerivatives
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MixedDerivative
 The mixed derivative.
UUDerivative
 The second derivative with respect to U.
VVDerivative
 The second derivative with respect to V.
See Also
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace