Revit 2024 API
FamilyPointPlacementReference Members
The FamilyPointPlacementReference type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Location
 The location of the point.
Name
 The name of the corresponding reference point in the Family document.
PointReference
 The reference on which the point depends on.
See Also
FamilyPointPlacementReference Class
Autodesk.Revit.DB Namespace