Revit 2024 API
LoadUsage Methods
The LoadUsage type exposes the following members.
Methods
Name | Description
Create
 Creates a new LoadUsage.
See Also
LoadUsage Class
Autodesk.Revit.DB.Structure Namespace