Revit 2024 API
RevitAPIEventArgs Members
The RevitAPIEventArgs type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RevitAPIEventArgs
IsCancelled
 Indicates whether the event is being cancelled.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace