Revit 2024 API
ExportPatternKey Members
The ExportPatternKey type exposes the following members.
Constructors
Name | Description
ExportPatternKey()
 Constructs a new default ExportPatternKey.
ExportPatternKey(ExportPatternKey)
 Constructs a new copy of the input ExportPatternKey object.
ExportPatternKey(FillPatternTarget, String)
 Constructs a new ExportPatternKey using the original fill pattern type and name as input.
Methods
Name | Description
Dispose
Releases all resources used by the ExportPatternKey
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginalFillPatternName
 The original FillPattern name.
OriginalFillPatternType
 The original FillPattern type.
See Also
ExportPatternKey Class
Autodesk.Revit.DB Namespace