Revit 2024 API
MullionTypeSet Members
The MullionTypeSet type exposes the following members.
Constructors
Name | Description
MullionTypeSet
Initializes a new instance of the MullionTypeSet class
Methods
Name | Description
Clear
Removes every mullion type from the set, rendering it empty.
Contains
Tests for the existence of a mullion type within the set.
Erase
Removes a specified mullion type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified mullion type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of mullion types that are in the set.
See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace