Revit 2024 API
FormattedText Members
The FormattedText type exposes the following members.
Constructors
Name | Description
FormattedText()
 Creates a new default FormattedText object, which contains only a carriage return character and has no formatting.
FormattedText(String)
 Creates a new FormattedText object with unformatted text.
Methods
Name | Description
AsTextRange
 Returns a TextRange object that represents the entire text.
Dispose
Releases all resources used by the FormattedText
Find
 Returns a text range identifying the first occurrence of the given string within the text, starting from a given index.
GetAllCapsStatus()
 Returns whether All, None or a Mixed of characters in the entire text are in all caps.
GetAllCapsStatus(TextRange)
 Returns whether All, None or a Mixed set of characters in a given text range are in all caps.
GetBoldStatus()
 Returns whether All, None or a Mixed of characters in the entire text are bold.
GetBoldStatus(TextRange)
 Returns whether All, None or a Mixed set of characters in a given text range are bold.
GetIndentLevel
 Returns the indent level of the paragraphs in the text range.
GetItalicStatus()
 Returns whether All, None or a Mixed of characters in the entire text are italic.
GetItalicStatus(TextRange)
 Returns whether All, None or a Mixed set of characters in a given text range are italic.
GetListStartNumber
 Returns the list start number of the paragraphs in a given text range.
GetListType
 Returns the ListType of a paragraph.
GetMaximumIndentLevel
 Returns the maximum allowed indent level
GetMaximumListStartNumber
 Returns the maximum allowed list start number.
GetMinimumListStartNumber
 Returns the minumum allowed list start number.
GetPlainText()
 Returns the entire text in a plain text form.
GetPlainText(TextRange)
 Returns a substring of the text in a plain text form. The start and end of the substring is identified by a given TextRange.
GetSubscriptStatus()
 Returns whether All, None or a Mixed of characters in the entire text are subscripted.
GetSubscriptStatus(TextRange)
 Returns whether All, None or a Mixed set of characters in a given text range are subscripted.
GetSuperscriptStatus()
 Returns whether All, None or a Mixed of characters in the entire text are superscripted.
GetSuperscriptStatus(TextRange)
 Returns whether All, None or a Mixed set of characters in a given text range are superscripted.
GetUnderlineStatus()
 Returns whether All, None or a Mixed of characters in the entire text are underlined.
GetUnderlineStatus(TextRange)
 Returns whether All, None or a Mixed set of characters in a given text range are underlined.
SetAllCapsStatus(Boolean)
 Sets the characters in the entire text to be in all caps or not.
SetAllCapsStatus(TextRange, Boolean)
 Sets the characters in a given text range to be in all caps or not.
SetBoldStatus(Boolean)
 Sets the characters in the entire text to be bold or not bold.
SetBoldStatus(TextRange, Boolean)
 Sets the characters in a given text range to be bold or not bold.
SetIndentLevel
 Sets the number of tab stops that the paragraph should be indented.
SetItalicStatus(Boolean)
 Sets the characters in the entire text to be italic or not italic.
SetItalicStatus(TextRange, Boolean)
 Sets the characters in a given text range to be italic or not italic.
SetListStartNumber
 Sets the list start number on the paragraphs in a given text range.
SetListType
 Sets the ListType of a paragraph.
SetPlainText(String)
 Sets the entire text with the given text in a plain text form.
SetPlainText(TextRange, String)
 Sets the text with the given text in a plain text form in a range.
SetSubscriptStatus(Boolean)
 Sets the characters in the entire text to be subscript or not subscript.
SetSubscriptStatus(TextRange, Boolean)
 Sets the characters in a given text range to be subscript or not subscript.
SetSuperscriptStatus(Boolean)
 Sets the characters in the entire text to be superscript or not superscript.
SetSuperscriptStatus(TextRange, Boolean)
 Sets the characters in a given text range to be superscript or not superscript.
SetUnderlineStatus(Boolean)
 Sets the characters in the entire text to be underlined or not underlined.
SetUnderlineStatus(TextRange, Boolean)
 Sets the characters in a given text range to be underlined or not underlined.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FormattedText Class
Autodesk.Revit.DB Namespace