Revit 2024 API
CylindricalHelix Methods
The CylindricalHelix type exposes the following members.
Methods
Name | Description
Create
 Create a cylindrical helix.
See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace