Revit 2024 API
IMemberForcesServer Members
The IMemberForcesServer type exposes the following members.
Methods
Name | Description
MemberForcesUpdate
 The server's method that will be called when Revit User clicks Member Forces button in the MPP.
See Also
IMemberForcesServer Interface
Autodesk.Revit.DB.Structure Namespace