Revit 2024 API
ParameterValueProvider Members
The ParameterValueProvider type exposes the following members.
Constructors
Name | Description
ParameterValueProvider
 Constructs an instance of ParameterValueProvider.
Methods
Name | Description
Properties
Name | Description
Parameter
 The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element.
See Also
ParameterValueProvider Class
Autodesk.Revit.DB Namespace