Revit 2024 API
JournalingAttribute Properties
The JournalingAttribute type exposes the following members.
Properties
Name | Description
Mode
Journaling mode.
See Also
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace