Revit 2024 API
FabricationDimensionDefinition Members
The FabricationDimensionDefinition type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FabricationDimensionDefinition
Properties
Name | Description
IsModifiable
 If the fabrication dimension is modifiable by user.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 Fabrication dimension name.
Type
 Fabrication dimension type.
UnitType
 Fabrication dimension unit type.
See Also
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace