Revit 2024 API
LineLightShape Members
The LineLightShape type exposes the following members.
Constructors
Name | Description
LineLightShape()
 Creates a line light shape object with 2.0' emit length.
LineLightShape(Double)
 Creates a line light shape object with the given emit length.
LineLightShape(LineLightShape)
 Creates a copy of the given line light shape
Methods
Name | Description
Properties
Name | Description
EmitLength
 The emit length.
See Also
LineLightShape Class
Autodesk.Revit.DB.Lighting Namespace