Revit 2024 API
BalusterPlacement Members
The BalusterPlacement type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BalusterPlacement
Properties
Name | Description
BalusterPattern
 Accesses the object containing properties related to the baluster pattern.
BalusterPerTreadFamilyId
 The id of baluster per tread family.
BalusterPerTreadNumber
 The number of balusters per tread.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PostPattern
 Accesses the object containing properties related to the post pattern.
UseBalusterPerTreadOnStairs
 If true, one or more balusters will be included on each tread of an associated stair. If false, this is not guaranteed to happen.
See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace