Revit 2024 API
FieldValues Members
The FieldValues type exposes the following members.
Constructors
Name | Description
FieldValues(FieldValues)
 Creates a copy of the given FieldValues instance.
FieldValues(IList<ValueAtPoint>)
 Creates object from an array of domain point values
FieldValues(IList<VectorAtPoint>)
 Creates object from an array of domain point vectors
FieldValues(IList<ValueAtPoint>, XYZ)
 Creates object from an array of domain point values
Methods
Name | Description
Dispose
Releases all resources used by the FieldValues
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FieldValues Class
Autodesk.Revit.DB.Analysis Namespace