Revit 2024 API
RebarBendingDetailType Methods
The RebarBendingDetailType type exposes the following members.
Methods
Name | Description
Create
 Creates a new RebarBendingDetailType object.
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace