Revit 2024 API
ProjectLocationSet Members
The ProjectLocationSet type exposes the following members.
Constructors
Name | Description
ProjectLocationSet
Initializes a new instance of the ProjectLocationSet class
Methods
Name | Description
Clear
Removes every project location from the set, rendering it empty.
Contains
Tests for the existence of a project location within the set.
Erase
Removes a specified project location from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified project location into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of project locations that are in the set.
See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace