Revit 2024 API
CloudPoint Members
The CloudPoint type exposes the following members.
Constructors
Name | Description
CloudPoint
 Creates a new cloud point.
Methods
Name | Description
Operators
Name | Description
Implicit(CloudPoint to XYZ)
 Creates an XYZ object from this point cloud.
Fields
Name | Description
Color
The color
X
The X coordinate
Y
The Y coordinate
Z
The Z coordinate
See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace