Revit 2024 API
BuildingPad Members
The BuildingPad type exposes the following members.
Methods
Name | Description
Create
 Creates a new BuildingPad element and adds it to the document.
GetBoundary
 Gets the boundary of current BuildingPad element.
SetBoundary
 Set a given curve loops as the boundary of the current BuildingPad element.
Properties
Name | Description
AssociatedTopographySurfaceId
 The element id of a topography surface created by the introduction of this building pad.
HostId
 The element id of the topography surface hosting this BuidlingPad.
See Also
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace