Revit 2024 API
AreaBasedLoadType Members
The AreaBasedLoadType type exposes the following members.
Methods
Name | Description
Create
 Creates an area based load type.
Properties
Name | Description
ApparentPowerDensity
 The apparent power density of area based load type.
LoadClassification
 The load classification of area based load type.
LoadDensity
 The load density of area based load type.
PowerFactor
 The power factor of area based load type.
See Also
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace