Revit 2024 API
FailuresProcessingEventArgs Members
The FailuresProcessingEventArgs type exposes the following members.
Methods
Name | Description
GetFailuresAccessor
 Provides access to the failure information in the document.
GetProcessingResult
 Retrieves current status of the failures processing result.
SetProcessingResult
 Sets the result of the failures processing accomplished during this event callback.
Properties
Name | Description
See Also
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace