Revit 2024 API
WorksharingSaveAsOptions Methods
The WorksharingSaveAsOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace