Revit 2024 API
IFCHybridImport Members
The IFCHybridImport type exposes the following members.
Constructors
Name | Description
IFCHybridImport
 Constructs a new IFCHybridImport instance for importing IFC via Hybrid method.
Methods
Name | Description
CreateMap
Dispose
Releases all resources used by the IFCHybridImport
ImportElements
 Imports IFC Elements using non-open-source framework
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace