Revit 2024 API
PointLocationOnCurve Methods
The PointLocationOnCurve type exposes the following members.
Methods
Name | Description
Dispose
See Also
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace