Revit 2024 API
IExportContextBase Members
The IExportContextBase type exposes the following members.
Methods
Name | Description
OnCurve
 This method is called when a Curve is being output.
OnLineSegment
 This method is called after unhandled curve was tessellated to line segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
OnPolyline
 This method is called when a Polyline is being output.
OnPolylineSegments
 This method is called after unhandled curve was tessellated to polyline segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
OnText
 This method is called when a text annotation object is being output.
See Also
IExportContextBase Interface
Autodesk.Revit.DB Namespace