Revit 2024 API
RevitAPIPreEventArgs Members
The RevitAPIPreEventArgs type exposes the following members.
Methods
Name | Description
Cancel
 When the event is cancellable, may call the Cancel() method to cancel it.
Properties
Name | Description
See Also
RevitAPIPreEventArgs Class
Autodesk.Revit.DB.Events Namespace