Revit 2024 API
EditorInteraction Members
The EditorInteraction type exposes the following members.
Constructors
Name | Description
EditorInteraction()
 Construct a default interaction.
EditorInteraction(EditorInteractionType)
 Construct the interaction with the specified type.
Methods
Name | Description
Properties
Name | Description
InteractionType
 The type of interaction.
See Also
EditorInteraction Class
Autodesk.Revit.UI Namespace