Revit 2024 API
Floor Members
The Floor type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
 Creates a new instance of architectural floor within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Boolean, Line, Double)
 Creates a new instance of floor within the project.
GetDefaultFloorType
 Returns id of default floor type.
GetNormalAtVerticalProjectionPoint
 Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical projection of an arbitrary point in project space.
GetSlabShapeEditor
 Gets a SlabShapeEditor that can be used to add or modify points of this Floor.
GetSpanDirectionSymbolIds
Retrieves span direction symbol ElementIds.
GetVerticalProjectionPoint
 Return a surface point on either the top or bottom face of a floor slab corresponding to the vertical projection of an arbitrary point in project space.
Properties
Name | Description
FloorType
 Retrieves/sets an object that represents the type of the floor.
SketchId
 Returns id of the sketch.
SlabShapeEditor |  Obsolete.
Get the SlabShapeEditor used for slab shape editing.
SpanDirectionAngle
 Retrieve the span direction angle of the floor.
See Also
Floor Class
Autodesk.Revit.DB Namespace