Revit 2024 API
Definition Members
The Definition type exposes the following members.
Methods
Name | Description
GetDataType
 Gets a ForgeTypeId identifying the data type describing values of the parameter.
GetGroupTypeId
 Returns the identifier of the parameter definition's parameter group.
Properties
Name | Description
Name
The user visible name for the parameter.
ParameterGroup |  Obsolete.
 Returns the group ID of the parameter definition.
See Also
Definition Class
Autodesk.Revit.DB Namespace