Revit 2024 API
SplitButtonData Members
The SplitButtonData type exposes the following members.
Constructors
Name | Description
SplitButtonData
Constructs a new instance of SplitButtonData.
Methods
Name | Description
Properties
Name | Description
See Also
SplitButtonData Class
Autodesk.Revit.UI Namespace