Revit 2024 API
RebarCoverType Members
The RebarCoverType type exposes the following members.
Methods
Name | Description
Create
 Creates a new CoverType in the document.
Properties
Name | Description
CoverDistance
 A distance that can be used as a concrete cover value in a document.
See Also
RebarCoverType Class
Autodesk.Revit.DB.Structure Namespace