Revit 2024 API
AreaBasedLoadData Members
The AreaBasedLoadData type exposes the following members.
Methods
Name | Description
AddElectricalLoadArea
 Adds electrical load area into the area based load.
CanConnectToUpstreamNode
 Verifies that the area based load can connect to the upstream electrical analytical node. If the area based load already has an upstream node or the upstream node is full of downstream nodes, the area based load can't connect to the upstream node.
CanDisconnectFromUpstreamNode
 Verifies that the area based load can disconnect from the upstream electrical analytical node. If the area based load hasn't an upstream node, it can't disconnect from the upstream node.
ConnectToUpstreamNode
 Connects to an upstream electrical analytical node.
DisconnectFromUpstreamNode
 Disconnects from an upstream electrical analytical node.
GetElectricalLoadAreas
 Gets electrical load areas which the area based load includes.
GetUpstreamNodeId
 Gets the upstream electrical analytical node id.
RemoveElectricalLoadArea
 Removes electrical load area from the area based load.
Properties
Name | Description
ApparentLoad
 The electrical apparent load of the area based load.
ApparentPowerDensity
 The apparent power density of the area based load.
AreaBasedLoadType
 The electrical area based load type of the area based load.
Current
 The current of the area based load .
LoadClassification
 The load classification of the area based load.
LoadDensity
 The load density of the area based load.
LoadType
 The load type of the area based load.
PhasesNumber
 The Phases Number of the area based load.
PowerFactor
 The power factor of the area based load.
TrueLoad
 The electrical true load of the area based load.
Voltage
 The voltage of the area based load.
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace