Revit 2024 API
TriangleInShellComponent Methods
The TriangleInShellComponent type exposes the following members.
Methods
Name | Description
Dispose
See Also
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace