Revit 2024 API
CeilingType Members
The CeilingType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ThermalProperties
 The calculated and settable thermal properties of the CeilingType
See Also
CeilingType Class
Autodesk.Revit.DB Namespace