Revit 2024 API
FabricationPartBrowserChangedEventArgs Members
The FabricationPartBrowserChangedEventArgs type exposes the following members.
Methods
Name | Description
GetAllSolutionsPartsTypeCounts
 Returns the total fabrication part type usage count in all routing solutions.
GetCurrentSolutionPartTypeIds
 Returns set of fabrication part types that are used in the currently selected solution.
GetFabricationPartTypeIds
 Returns set of fabrication part types in use in the routing solution mode.
GetFilteredSolutionsPartsTypeCounts
 Returns the active fabrication part type usage count in fitlered routing solutions.
GetRequiredFabricationPartTypeIds
 Returns set of required fabrication part types in use in routing solution mode.
Properties
Name | Description
NumberOfSolutions
 The number of active solutions in routing solution mode.
Operation
 The operation associated with this event
ServiceId
 The identifier for the fabrication service.
See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace