Revit 2024 API
ImporterIFC Members
The ImporterIFC type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ImporterIFC
GetOptions
 Gets the collection of named options set by the importer client.
HybridCreateImportMap
HybridElementImport
 Imports IFC Elements using non-open-source framework.
ProcessIFCProject(IFCAnyHandle)
 The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements.
ProcessIFCProject(IFCAnyHandle, IDictionary<IFCAnyHandle, ElementId>)
SetFile
 Sets the handle to the IFC file being created during this import operation.
Properties
Name | Description
Document
 Gets the document associated with the import.
FullFileName
 The full file name of the IFC file to be import.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace