Revit 2024 API
ExternallyTaggedGeometryObject Methods
The ExternallyTaggedGeometryObject type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace