Revit 2024 API
Gutter Members
The Gutter type exposes the following members.
Methods
Name | Description
AddSegment
Add segments to the gutter.
 (Overrides HostedSweep.AddSegment(Reference).)
Properties
Name | Description
GutterType
Retrieves/set an object that represents the type of the Gutter.
See Also
Gutter Class
Autodesk.Revit.DB.Architecture Namespace