Revit 2024 API
MEPAnalyticalConnectionType Members
The MEPAnalyticalConnectionType type exposes the following members.
Methods
Name | Description
Create
 Creates an analytical connection type element.
FindTypeByName
 Finds the analytical connection type by its name.
IsNameUnused
 Checks if this is an unused name.
Properties
Name | Description
PressureLoss
 The pressure loss of this analytical connection type.
See Also
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace