Revit 2024 API
PaperSourceSet Members
The PaperSourceSet type exposes the following members.
Constructors
Name | Description
PaperSourceSet
Initializes a new instance of the PaperSourceSet class
Methods
Name | Description
Clear
Removes every item from the set, rendering it empty.
Contains
Tests for the existence of an item within the set.
Erase
Removes a specified object from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of objects that are in the set.
See Also
PaperSourceSet Class
Autodesk.Revit.DB Namespace