Revit 2024 API
NetworkCommunicationException Members
The NetworkCommunicationException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
NetworkCommunicationException Class
Autodesk.Revit.Exceptions Namespace