Revit 2024 API
Solid Members
The Solid type exposes the following members.
Methods
Name | Description
ComputeCentroid
Returns the Centroid of this solid.
GetBoundingBox
 Retrieves a box that circumscribes the solid geometry.
IntersectWithCurve
 Calculates and returns the intersection between a curve and this solid.
Properties
Name | Description
Edges
The edges that belong to the solid.
Faces
The faces that belong to the solid.
SurfaceArea
Returns the total surface area of this solid.
Volume
Returns the signed volume of this solid.
See Also
Solid Class
Autodesk.Revit.DB Namespace