Revit 2024 API
SynchronizeWithCentralOptions Members
The SynchronizeWithCentralOptions type exposes the following members.
Constructors
Name | Description
SynchronizeWithCentralOptions
 Constructs a new instance of SynchronizeWithCentralOptions initialized with default options.
Methods
Name | Description
Dispose
Releases all resources used by the SynchronizeWithCentralOptions
GetRelinquishOptions
 Gets the options which govern whether or not to relinquish elements and workset types.
SetRelinquishOptions
 Sets the options which govern whether or not to relinquish elements and workset types.
Properties
Name | Description
Comment
 User description of changes made since the last Sync with Central. Empty by default.
Compact
 Indicates whether Revit should compact the central model while synchronizing with central. This option reduces the size of the central model but many increase the time it takes to perform the save. False by default.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RelinquishBorrowedElements
 Indicates whether Revit should relinquish borrowed elements after synchronizing with central.
RelinquishFamilyWorksets
 Indicates whether Revit should relinquish Family worksets after synchronizing with central.
RelinquishProjectStandardWorksets
 Indicates whether Revit should relinquish Project Standard worksets after synchronizing with central.
RelinquishUserCreatedWorksets
 Indicates whether Revit should relinquish user-created Standard worksets after synchronizing with central.
RelinquishViewWorksets
 Indicates whether Revit should relinquish View worksets after synchronizing with central.
SaveLocalAfter
 True means to save local after saving changes to central. True by default. Silently ignored if the model in the current session is central rather than local.
SaveLocalBefore
 True means to save local before the first reload latest if there are changes not yet saved to local. True by default. Silently ignored if the model in the current session is central rather than local.
SaveLocalFile
 Indicates whether Revit will save the local file at least once while synchronizing with central.
See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace