Revit 2024 API
ImporterIFC Methods
The ImporterIFC type exposes the following members.
Methods
Name | Description
Dispose
GetOptions
 Gets the collection of named options set by the importer client.
HybridCreateImportMap
HybridElementImport
 Imports IFC Elements using non-open-source framework.
ProcessIFCProject(IFCAnyHandle)
 The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements.
ProcessIFCProject(IFCAnyHandle, IDictionary<IFCAnyHandle, ElementId>)
SetFile
 Sets the handle to the IFC file being created during this import operation.
See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace