Revit 2024 API
KeyBasedTreeEntryTable Members
The KeyBasedTreeEntryTable type exposes the following members.
Methods
Name | Description
GetKeyBasedTreeEntries
 Gets the KeyBasedTreeEntries for this table.
LoadFrom
 Loads KeyBasedTreeEntries from the specified external resource into this KeyBasedTreeEntryTable.
Reload
 Reloads KeyBasedTreeEntries from their currently-stored location into this KeyBasedTreeEntryTable.
ServerSupports
 Checks if the server referenced by the given ExternalResourceReference supports the ExternalResourceReferenceType of this KeyBasedTreeEntryTable.
Properties
Name | Description
See Also
KeyBasedTreeEntryTable Class
Autodesk.Revit.DB Namespace