Revit 2024 API
Plane Members
The Plane type exposes the following members.
Methods
Name | Description
Create
 Creates a Plane object defined by a local frame of reference.
CreateByNormalAndOrigin
 Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
CreateByOriginAndBasis
 Creates a Plane object defined by the two orthogonal unit vectors and passing through the origin point supplied as arguments.
CreateByThreePoints
 Creates a Plane object passing through three points supplied as arguments.
Properties
Name | Description
Normal
 Plane normal.
Origin
 Plane origin.
XVec
 Axis defining the first parametric direction of the plane.
YVec
 Axis defining the second parametric direction of the plane.
See Also
Plane Class
Autodesk.Revit.DB Namespace