Revit 2024 API
ExternalResourceMatchOptions Methods
The ExternalResourceMatchOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace