Revit 2024 API
AreaReinforcementType Members
The AreaReinforcementType type exposes the following members.
Methods
Name | Description
CreateDefaultAreaReinforcementType
 Creates a new AreaReinforcementType object with a default name.
Properties
Name | Description
See Also
AreaReinforcementType Class
Autodesk.Revit.DB.Structure Namespace