Revit 2024 API
EdgeArray Members
The EdgeArray type exposes the following members.
Constructors
Name | Description
EdgeArray
Initializes a new instance of the EdgeArray class
Methods
Name | Description
Append
Add the edge to the end of the array.
Clear
Removes every edge from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified edge into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an edge at a specified index within the array.
Size
Returns the number of edges that are in the array.
See Also
EdgeArray Class
Autodesk.Revit.DB Namespace