Revit 2024 API
Hub Methods
The Hub type exposes the following members.
Methods
Name | Description
GetHubConnectorManager
 Retrieves the ConnectorManager of the Hub.
GetOrigin
 Retrieves position of a Hub if such position is a 3D point.
HasOrigin
 Provides information if Hub has a specific location at point in 3D space.
See Also
Hub Class
Autodesk.Revit.DB.Structure Namespace