Revit 2024 API
RevisionsOnSheetUIServiceData Members
The RevisionsOnSheetUIServiceData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RevisionsOnSheetUIServiceData
GetParentHwnd
 return the parent handle
GetRevitElementIds
 return the list of revit Element Ids
Properties
Name | Description
Document
 return the document
IsReset
 flag to indicate the value has been reset
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ParamId
 the parameter id
See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace