Revit 2024 API
FootPrintRoof Members
The FootPrintRoof type exposes the following members.
Methods
Name | Description
GetProfiles
Retrieve all the curveLoops of FootPrintRoof.
Properties
Name | Description
CurtainGrids
Retrieve all the CurtainGrid objects of a FootPrintRoof.
DefinesSlope
Retrieve or set the DefinesSlope of the curve.
ExtendIntoWall
Retrieve or set whether extend into wall the curve.
Offset
Retrieve or set the Offset of the curve.
Overhang
Retrieve or set the Overhang of the curve.
SlopeAngle
Retrieve or set the SlopeAngle of the curve.
See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace