Revit 2024 API
AddInId Members
The AddInId type exposes the following members.
Constructors
Name | Description
AddInId
 creates an AddInId object with a given GUID
Methods
Name | Description
Dispose
Releases all resources used by the AddInId
GetAddInName
 name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns
GetAddInNameFromDocument
 name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
GetGUID
 value of the AddInId as a GUID
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AddInId Class
Autodesk.Revit.DB Namespace