Revit 2024 API
PipeScheduleType Members
The PipeScheduleType type exposes the following members.
Methods
Name | Description
Create
 Creates a new pipe schedule type with the given name.
GetPipeScheduleId
 Returns an existing pipe schedule type with the same name.
Properties
Name | Description
See Also
PipeScheduleType Class
Autodesk.Revit.DB.Plumbing Namespace