Revit 2024 API
CannotOpenBothCentralAndLocalException Members
The CannotOpenBothCentralAndLocalException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
CannotOpenBothCentralAndLocalException Class
Autodesk.Revit.Exceptions Namespace