Revit 2024 API
DefaultDivideSettings Members
The DefaultDivideSettings type exposes the following members.
Methods
Name | Description
GetDefaultDivideSettings
 Obtains the DefaultDivideSettings object for the specified document.
GetSurfaceDistance
 Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
GetSurfaceLayout
 Gets the default Divided Surface layout for U or V gridlines.
GetSurfaceNumber
 Gets the default Divided Surface number for a fixed number layout for U or V gridlines.
SetSurfaceDistance
 Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
SetSurfaceLayout
 Sets the default Divided Surface layout for U or V gridlines.
SetSurfaceNumber
 Sets the default Divided Surface number for a fixed number layout for U or V gridlines.
Properties
Name | Description
PathDistance
 A default Divided Path distance for a fixed, minimum, or maximum distance layout.
PathLayout
 A default Divided Path layout.
PathMeasurementType
 A default Divided Path measurement type for distance layouts.
PathNumber
 A default Divided Path number for a fixed number layout.
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace