Revit 2024 API
IndexPoint Members
The IndexPoint type exposes the following members.
Constructors
Name | Description
IndexPoint
 Constructs the point primitive.
Methods
Name | Description
GetSizeInShortInts
 Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Properties
Name | Description
Index
 The index of the point's vertex.
See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace