Revit 2024 API
StructuralSectionLProfile Members
The StructuralSectionLProfile type exposes the following members.
Constructors
Name | Description
StructuralSectionLProfile
 Creates a new instance of Structural Section L Profile shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
See Also
StructuralSectionLProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace