Revit 2024 API
Family Members
The Family type exposes the following members.
Methods
Name | Description
CanHaveStructuralSection
 Identifies if this Family can have a structural section.
CanLoadFamilies
 Checks whether the document is in a state that allows the loading of families.
ExtractPartAtom
 Writes a PartAtom XML from the contents of a family object.
GetFamilySymbolIds
 Gets the ids of the FamilySymbols owned by this Family.
GetFamilyTypeParameterValues
 Returns all applicable values for a FamilyType parameter of this family.
HasLargeSketches
 Checks whether the family contains sketches with a large number of elements.
IsAppropriateCategoryId
 Identifies if the input category id can be assigned as the new category for this family.
Properties
Name | Description
CurtainPanelHorizontalSpacing
 For Curtain Panel families, the horizontal spacing of the driving mesh.
CurtainPanelTilePattern
 For Curtain Panel families, the choice of tile pattern.
CurtainPanelVerticalSpacing
 For Curtain Panel families, the vertical spacing of the driving mesh.
FamilyCategory
Retrieves or sets a Category object that represents the category or sub category in which the elements ( this family could generate ) reside.
FamilyCategoryId
 The id of the category or sub category in which the elements that this family could generate reside.
FamilyPlacementType
 Identifies the type of placement required by a given family.
IsConceptualMassFamily
 Whether the Family is a Conceptual Mass family.
IsCurtainPanelFamily
 Whether the Family is a Curtain Panel family. Curtain Panel family symbols are used as the ObjectTypes of DividedSurface elements.
IsEditable
 True if the family supports editing, false otherwise.
IsInPlace
 True if the family is an in-place family, false if the family is a loadable family.
IsOwnerFamily
 True if the family is the owner family for its own editable document, false otherwise.
IsParametric
 Identifies whether the family contains parametric relations between some of its elements.
IsUserCreated
 Determine whether the family has been defined by the user.
ShowSpatialElementCalculationPoint
 For families that can have a calculation point for spatial elements, hide or show the calculation point. SpatialElementCalculationPoint elements.
StructuralCodeName
 The family's structural code name.
StructuralFamilyNameKey
 The family's structural section shape name key.
StructuralMaterialType
 The family's structural material type.
StructuralSectionShape
 The family's structural section shape.
See Also
Family Class
Autodesk.Revit.DB Namespace