Revit 2024 API
Wall Methods
The Wall type exposes the following members.
Methods
Name | Description
CanHaveProfileSketch
 Checks whether this wall has or can have a profile sketch.
Create(Document, IList<Curve>, Boolean)
 Creates a non rectangular profile wall within the project using the default wall type.
Create(Document, Curve, ElementId, Boolean)
 Creates a new rectangular profile wall within the project using the default wall style.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean)
 Creates a non rectangular profile wall within the project using the specified wall type.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean, XYZ)
 Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean)
 Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
CreateProfileSketch
 Creates a new Wall profile Sketch.
Flip
 The wall orientation will be flipped.
GetStackedWallMemberIds
 Get the sub walls which belongs to the wall.
IsWallCrossSectionValid
 Checks whether the desired cross section is valid for the current wall.
RemoveProfileSketch
 Reverts an edited wall to its original shape.
See Also
Wall Class
Autodesk.Revit.DB Namespace