Revit 2024 API
PointCloudFilter Members
The PointCloudFilter type exposes the following members.
Methods
Name | Description
Clone
 Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.
Dispose
Releases all resources used by the PointCloudFilter
PrepareForCell
 Informs the filter that a series of points within a given cell is about to be checked.
TestCell
 Checks whether a given cell, i.e. a box aligned with the XYZ axes, is inside, outside or on the border of the volume of interest.
TestPoint
Checks if a point is inside the volume of interest.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace