Revit 2024 API
CircuitNamingScheme Members
The CircuitNamingScheme type exposes the following members.
Methods
Name | Description
Create
 Creates a new CircuitNamingScheme.
GetCombinedParameters
 Gets the combined parameters.
IsNameUnique
 Validates whether the CircuitNamingScheme name is unique in document.
IsValidCombinedParameters
 Validates whether the combined parameters is valid.
SetCombinedParameters
 Sets combined parameters array.
Properties
Name | Description
See Also
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace