Revit 2024 API
FilterInverseRule Members
The FilterInverseRule type exposes the following members.
Constructors
Name | Description
FilterInverseRule
 Constructs a new instance of FilterInverseRule.
Methods
Name | Description
GetInnerRule
 Gets the rule being inverted.
SetInnerRule
 Gets the rule being inverted.
Properties
Name | Description
See Also
FilterInverseRule Class
Autodesk.Revit.DB Namespace