Revit 2024 API
Point Members
The Point type exposes the following members.
Methods
Name | Description
Create(XYZ)
 Creates a point at the given coordinates.
Create(XYZ, ElementId)
 Creates a point at the given coordinates and assigns it the specified GraphicsStyle.
Properties
Name | Description
Coord
 Returns the coordinates of the point.
Reference
Returns a stable reference to the point.
See Also
Point Class
Autodesk.Revit.DB Namespace