Revit 2024 API
SpatialElementCalculationPoint Members
The SpatialElementCalculationPoint type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Position
 The position of the "in" spatial element calculation point.
See Also
SpatialElementCalculationPoint Class
Autodesk.Revit.DB Namespace