Revit 2024 API
ExportLinetypeInfo Members
The ExportLinetypeInfo type exposes the following members.
Constructors
Name | Description
ExportLinetypeInfo()
 Constructs a new default ExportLinetypeInfo.
ExportLinetypeInfo(String)
 Constructs a new ExportLinetypeInfo using the destination linetype name as input.
ExportLinetypeInfo(ExportLinetypeInfo)
 Constructs a new copy of the input ExportLinetypeInfo object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportLinetypeInfo
Properties
Name | Description
DestinationLinetypeName
 The destination linetype name (the name of the linetype in the exported format).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportLinetypeInfo Class
Autodesk.Revit.DB Namespace