Revit 2024 API
ReferenceArrayArray Members
The ReferenceArrayArray type exposes the following members.
Constructors
Name | Description
ReferenceArrayArray
Initializes a new instance of the ReferenceArrayArray class
Methods
Name | Description
Append
Clear
Removes every ReferenceArray from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a ReferenceArray at a specified index within the array.
Size
Returns the number of ReferenceArrays that are in the array.
See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace