Revit 2024 API
DataStorage Members
The DataStorage type exposes the following members.
Methods
Name | Description
Create
 Creates a new DataStorage element and adds it to the document.
Properties
Name | Description
See Also
DataStorage Class
Autodesk.Revit.DB.ExtensibleStorage Namespace