Revit 2024 API
FabricationVersionInfo Methods
The FabricationVersionInfo type exposes the following members.
Methods
Name | Description
Dispose
See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace