Revit 2024 API
GlobalParameter Members
The GlobalParameter type exposes the following members.
Methods
Name | Description
CanChangeReporting
 Tests whether the global parameter permits a change of its current value of the IsReporting attribute.
CanLabelDimension
 Tests whether a dimension can be labeled by the global parameter.
Create
 Creates a new Global Parameter in the given document.
GetAffectedElements
 Returns all elements of which properties are driven by this global parameter.
GetAffectedGlobalParameters
 Returns all other global parameters which refer to this global parameter in their formulas.
GetFormula
 Returns the parameter's expression in form of a string.
GetLabeledDimensions
 Returns all dimension elements that are currently labeled by this global parameter.
GetLabelName
 Returns the name of this parameter's label, which is used to label dimension elements.
GetValue
 Obtains the curent value of the global parameter.
HasValidTypeForReporting
 Tests that the global parameter has data of a type that supports reporting.
IsValidFormula
 Tests that the given expression is a valid as formula for this parameter.
LabelDimension
 Labels a dimension with this global parameter.
SetDrivingDimension
 Set a dimension to drive the value of this parameter.
SetFormula
 Sets a formula expression for this parameter.
SetValue
 Sets a new value of the global parameter.
UnlabelDimension
 Unlabels a dimension that is currently labeled by this global parameter.
Properties
Name | Description
IsDrivenByDimension
 Indicates whether this parameter is driven by a dimension or not.
IsDrivenByFormula
 Indicates whether this parameter is driven by a formula or not.
IsReporting
 Indicates whether this is a reporting global parameter or not.
See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace