Revit 2024 API
PipeFittingAndAccessoryPressureDropData Members
The PipeFittingAndAccessoryPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PipeFittingAndAccessoryPressureDropData
GetPipeFittingAndAccessoryData
 Returns the fitting and accessory information
GetPresureDropItems
 Returns the pressure drop items
SetDefaultEntity
 Stores the default entity in the data.
Properties
Name | Description
CalculationType
 The calculation type, a bitmask of FittingAndAccessoryCalculationType.
IsCurrentEntityValid
 True if the current settings stored in the entity is valid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace