Revit 2024 API
ElementIsCurveDrivenFilter Members
The ElementIsCurveDrivenFilter type exposes the following members.
Constructors
Name | Description
ElementIsCurveDrivenFilter()
 Constructs a new instance of a filter to match only curve driven elements.
ElementIsCurveDrivenFilter(Boolean)
 Constructs a new instance of a filter to match only curve driven elements, with the option to match all elements which are not curve driven elements.
Methods
Name | Description
Properties
Name | Description
See Also
ElementIsCurveDrivenFilter Class
Autodesk.Revit.DB Namespace