Revit 2024 API
CurtainGridSetIterator Members
The CurtainGridSetIterator type exposes the following members.
Constructors
Name | Description
CurtainGridSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
CurtainGridSetIterator Class
Autodesk.Revit.DB Namespace