Revit 2024 API
CableTrayConduitRunBase Members
The CableTrayConduitRunBase type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Length
 The length of the whole (cable tray or conduit) run default 0.0
See Also
CableTrayConduitRunBase Class
Autodesk.Revit.DB.Electrical Namespace