Revit 2024 API
CombinableElement Members
The CombinableElement type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Combinations
The geometry combinations that this element belongs to.
See Also
CombinableElement Class
Autodesk.Revit.DB Namespace