Revit 2024 API
DGNImportOptions Members
The DGNImportOptions type exposes the following members.
Constructors
Name | Description
DGNImportOptions()
 Constructs a new instance of DGNImportOptions with default values of all properties.
DGNImportOptions(DGNImportOptions)
 Constructs a new instance of DGNImportOptions as a copy of the import options.
Methods
Name | Description
Properties
Name | Description
DGNModelViewName
 The model view name to be imported. Need user give a model view name to specify which model view need to be imported into Revit
IgnoreUnsupportedElementWarning
 If true, ignore warning messages about unsupported elements in the DGN file. If false, the import process is aborted if imported dgn files have unsupported elements.
See Also
DGNImportOptions Class
Autodesk.Revit.DB Namespace