Revit 2024 API
ElementIntersectsFilter Members
The ElementIntersectsFilter type exposes the following members.
Methods
Name | Description
IsCategorySupported
 Identifies if the input element is of a category supported by element intersection filters.
IsElementSupported
 Identifies if the input element is supported by element intersection filters.
Properties
Name | Description
See Also
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace