Revit 2024 API
RevitAPIPreDocEventArgs Members
The RevitAPIPreDocEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Document
 The document associated with the event.
See Also
RevitAPIPreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace