Revit 2024 API
FamilyPointLocation Members
The FamilyPointLocation type exposes the following members.
Methods
Name | Description
GetLocation
 Gets the location of the point.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the corresponding reference point in the Family document.
See Also
FamilyPointLocation Class
Autodesk.Revit.DB Namespace