Revit 2024 API
ReferenceArray Members
The ReferenceArray type exposes the following members.
Constructors
Name | Description
ReferenceArray
Initializes a new instance of the ReferenceArray class
Methods
Name | Description
Append
Add the reference to the end of the array.
Clear
Removes every reference from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified reference into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a reference at a specified index within the array.
Size
Returns the number of references that are in the array.
See Also
ReferenceArray Class
Autodesk.Revit.DB Namespace