Revit 2024 API
AssetSetIterator Properties
The AssetSetIterator type exposes the following members.
Properties
Name | Description
Current
See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace