Revit 2024 API
LightGroup Members
The LightGroup type exposes the following members.
Methods
Name | Description
AddLight
 Add a new light instance to the group
Dispose
Releases all resources used by the LightGroup
GetLights
 Get the set of contained light instances The set of light instances
RemoveLight
 Remove the given light instance from the set of light instances in this group
Properties
Name | Description
Id
 The ElementId of the LightGroup
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the LightGroup
See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace