Revit 2024 API
AssetPropertyUInt64 Members
The AssetPropertyUInt64 type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
Get the value of the property.
See Also
AssetPropertyUInt64 Class
Autodesk.Revit.DB.Visual Namespace