Revit 2024 API
AssetPropertyInt64 Members
The AssetPropertyInt64 type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Value
Get the value of the property.
See Also
AssetPropertyInt64 Class
Autodesk.Revit.DB.Visual Namespace