Revit 2024 API
Definitions Members
The Definitions type exposes the following members.
Constructors
Name | Description
Definitions
Constructs an empty set of parameter definitions.
Methods
Name | Description
Contains
Tests for the existence of a definition within the set.
Create
Creates a new parameter definition using specified options.
Dispose
Releases all resources used by the Definitions
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Retrieves an enumerator to the collection.
Properties
Name | Description
IsEmpty
Identifies if the definitions collection is empty.
Item
Retrieves a definition by a given name.
Size
The number of definitions in the collection.
See Also
Definitions Class
Autodesk.Revit.DB Namespace