Revit 2024 API
UIApplication Members
The UIApplication type exposes the following members.
Constructors
Name | Description
UIApplication
 Use a database level Application to construct a UI-level Application.
Methods
Name | Description
CanPostCommand
 Identifies if the given command can be posted, using PostCommand(RevitCommandId).
CreateAddInCommandBinding
Creates a new AddInCommandBinding.
CreateRibbonPanel(String)
 Create a new RibbonPanel on the Add-Ins tab.
CreateRibbonPanel(String, String)
 Create a new RibbonPanel on the specified tab.
CreateRibbonPanel(Tab, String)
 Create a new RibbonPanel on the designated standard Revit tab.
CreateRibbonTab
 Creates a new tab on the Revit user interface.
Dispose
Releases all resources used by the UIApplication
DoDragDrop(ICollection<String>)
Initiates a drag and drop operation of a collection of file names on the Revit user interface.
DoDragDrop(Object, IDropHandler)
Initiates a drag and drop operation with a custom drop implementation.
GetDockablePane
Gets a DockablePane object by its ID.
GetRibbonPanels()
 Get all the custom Panels on Add-Ins tab of Revit.
GetRibbonPanels(String)
 Get all the custom Panels on a designated Revit tab.
GetRibbonPanels(Tab)
 Get all the custom Panels on a designated standard Revit tab.
LoadAddIn
Loads add-ins from the given manifest file.
LoadPackageContents
Loads add-ins from the given packageContents.xml file.
OpenAndActivateDocument(String)
 Opens and activates a Revit document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean)
 Opens and activates a Revit document, include both local document or cloud document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback)
 Opens and activates a Revit document, include both local document or cloud document.
PostCommand
 Posts the command to the Revit message queue to be invoked when control returns from the current API context.
RegisterDockablePane
Adds a new dockable pane to the Revit user interface.
RemoveAddInCommandBinding
Removes an AddInCommandBinding.
Properties
Name | Description
ActiveAddInId
 Get current active external application or external command id.
ActiveUIDocument
Provides access to an object that represents the currently active project.
Application
 Returns the database level Application represented by this UI level Application.
DrawingAreaExtents
Get the rectangle that represents the screen pixel coordinates of drawing area.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsViewerModeActive
 Determines if Revit session is in Viewer mode.
LoadedApplications
 Returns an array of successfully loaded external applications.
MainWindowExtents
Get the rectangle that represents the screen pixel coordinates of the Revit main window.
MainWindowHandle
Get the handle of the Revit main window.
ProductIsRS
 Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
Events
Name | Description
ApplicationClosing
 Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
DialogBoxShowing
 Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box.
DisplayingOptionsDialog
 Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
DockableFrameFocusChanged
 Subscribe to this event to be notified when a Revit GenericDockableFrame has gained focus or lost focus in the Revit user interface. This event is called only for API-created GenericDockableFrames.
DockableFrameVisibilityChanged
 Subscribe to this event to be notified when a Revit GenericDockableFrame has been shown or hidden in the Revit user interface. This event is called only for API-created GenericDockableFrames.
FabricationPartBrowserChanged
 Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
FormulaEditing
 Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.
Idling
 Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction.
SelectionChanged
 Subscribe to the SelectionChanged event to be notified after the selection was changed.
ThemeChanged
 Subscribe to the ThemeChanged event to be notified after the theme was changed.
TransferredProjectStandards
 Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized.
TransferringProjectStandards
 Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.
ViewActivated
 Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document.
ViewActivating
 Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document.
See Also
UIApplication Class
Autodesk.Revit.UI Namespace