Revit 2024 API
FolderItemInfo Members
The FolderItemInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FolderItemInfo
Properties
Name | Description
ElementId
 The folder parameter Id
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The folder name
See Also
FolderItemInfo Class
Autodesk.Revit.DB Namespace