Revit 2024 API
CanExecuteEventArgs Members
The CanExecuteEventArgs type exposes the following members.
Methods
Name | Description
GetSelectedCategoryIds
Gets the category ids of selected elements.
Properties
Name | Description
CanExecute
The value that indicates whether the Command associated with this event can be executed.
IsChecked
The value that indicates whether the UI associated with the Command associated with this event is in a checked state.
See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace