Revit 2024 API
VertexStream Members
The VertexStream type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the VertexStream
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
VertexStream Class
Autodesk.Revit.DB.DirectContext3D Namespace