Revit 2024 API
ParameterValue Members
The ParameterValue type exposes the following members.
Methods
Name | Description
Copy
 Makes an identical copy of the given parameter value.
Dispose
Releases all resources used by the ParameterValue
IsEqual
 Tests equality with another instance of the same class.
IsSameType
 Tests another instance is of the same value type.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ParameterValue Class
Autodesk.Revit.DB Namespace