Revit 2024 API
DuctFittingAndAccessoryPressureDropUIDataItem Members
The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the DuctFittingAndAccessoryPressureDropUIDataItem
GetDuctFittingAndAccessoryData
 Gets the fitting data stored in the UI data item.
GetEntity
 Returns the entity set by UI server. or an invalid entity otherwise.
SetEntity
 Stores the entity in the UI data item.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace