Revit 2024 API
UpdaterInfo Members
The UpdaterInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the UpdaterInfo
Properties
Name | Description
AdditionalInformation
 Additional information about the updater.
ApplicationName
 Name of the application that owns the updater.
IsOptional
 Whether the updater is optional or not.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
UpdaterName
 Name of the updater.
See Also
UpdaterInfo Class
Autodesk.Revit.DB Namespace