Revit 2024 API
StructuralSectionGeneralC Members
The StructuralSectionGeneralC type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralC
 Creates a new instance of general Channel Cold Formed shape.
Methods
Name | Description
Properties
Name | Description
LipLength
 Lip segment length.
See Also
StructuralSectionGeneralC Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace