Revit 2024 API
WireConduitType Properties
The WireConduitType type exposes the following members.
Properties
Name | Description
Name
See Also
WireConduitType Class
Autodesk.Revit.DB.Electrical Namespace