Revit 2024 API
ProgressChangedEventArgs Members
The ProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Cancel
 Requests to cancel the progress bar's operation.
Properties
Name | Description
Caption
 The text from the progress bar caption that describes the operation in progress
LowerRange
 Lower part of progress bar range - always zero
Position
 Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
Stage
 The current stage of the progress bar
UpperRange
 Upper part of progress bar range - will be any non-zero number
See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace