Revit 2024 API
CurveUV Members
The CurveUV type exposes the following members.
Methods
Name | Description
As3DCurveInXYPlane
 Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.
ComputeDerivatives
 Computes the first derivative, the second derivative and the unit tangent vector at the specified parameter along the curve.
Create
 Create a CurveUV from a bounded 3D Curve lying in the XY plane.
Dispose
Releases all resources used by the CurveUV
Evaluate
 Evaluates and returns the point at the specified parameter along the curve.
GetEndParameter
 Gets the raw parameter value at the start or end of this curve.
Transform
 Transform this CurveUV by the given 2D affine transform if possible.
Properties
Name | Description
IsBound
 Describes whether the parameter of the curve is restricted to a particular interval.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
CurveUV Class
Autodesk.Revit.DB Namespace