Revit 2024 API
ElementTypeDuplicatedEventArgs Members
The ElementTypeDuplicatedEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
NewElementTypeId
 The id of the newly duplicated ElementType.
NewName
 The name of the newly duplicated ElementType.
OriginalElementTypeId
 The id of the element type that is duplicated.
See Also
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace