Revit 2024 API
KeynoteEntries Members
The KeynoteEntries type exposes the following members.
Methods
Name | Description
LoadKeynoteEntriesFromFile
 Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent.
Properties
Name | Description
See Also
KeynoteEntries Class
Autodesk.Revit.DB Namespace