Revit 2024 API
ServerInternalException Members
The ServerInternalException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
ServerInternalException Class
Autodesk.Revit.Exceptions Namespace