Revit 2024 API
StringParameterValue Properties
The StringParameterValue type exposes the following members.
Properties
Name | Description
Value
 The stored value
See Also
StringParameterValue Class
Autodesk.Revit.DB Namespace