Revit 2024 API
AnalysisResultSchema Members
The AnalysisResultSchema type exposes the following members.
Constructors
Name | Description
AnalysisResultSchema(AnalysisResultSchema)
 Constructs a new copy of the input AnalysisResultSchema object.
AnalysisResultSchema(String, String)
 Creates object and assigns name and description
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisResultSchema
GetNumberOfUnits
 returns number of possible units
GetUnitsMultiplier
 returns units multiplier by index
GetUnitsName
 returns units name by index
IsEqual
 Determines if the input object is equivalent to this AnalysisResultSchema.
SetUnits
 Sets names and multipliers of all units for result visualization
Properties
Name | Description
AnalysisDisplayStyleId
 ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden
CurrentUnits
 Stores the index in the array of applicable units
Description
 Description of analysis result in view
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsVisible
 If true analysis result is visible in view
Name
 Name of analysis result in view
Scale
 Multiplier used for displaying diagram or vector values in view.
See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace