Revit 2024 API
ConnectionInputPoint Members
The ConnectionInputPoint type exposes the following members.
Constructors
Name | Description
ConnectionInputPoint()
 Construct a default input point.
ConnectionInputPoint(XYZ)
 Construct an input point from 3d point. A new valid id will be auto-generated.
ConnectionInputPoint(XYZ, Guid)
 Construct an input point from 3d point and id.
Methods
Name | Description
Dispose
Releases all resources used by the ConnectionInputPoint
Properties
Name | Description
Id
 Unique id of this input point.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Point
 3d position of this input point.
See Also
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace