Revit 2024 API
DisabledDisciplineException Members
The DisabledDisciplineException type exposes the following members.
Methods
Name | Description
GetObjectData
Retrieves data needed to serialize the target object.
 (Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext).)
Properties
Name | Description
See Also
DisabledDisciplineException Class
Autodesk.Revit.Exceptions Namespace