Revit 2024 API
FilledRegionType Members
The FilledRegionType type exposes the following members.
Methods
Name | Description
IsValidBackgroundPatternId
 Check if the id is valid for a background pattern
IsValidFillPatternId
 Check if the id is a FillPatternElement or an invalidElementId
IsValidForegroundPatternId
 Check if the id is valid for a foreground pattern
IsValidLineWeight
 Indicates whether the given line weight value is valid.
IsValidMasking
 Check that in a family the FillRegionType is always masking.
IsValidSolidFillPatternId
 Checks if the id is valid for a background pattern
Properties
Name | Description
BackgroundPatternColor
 The background fill pattern color.
BackgroundPatternId
 The background fill pattern Id.
ForegroundPatternColor
 The foreground fill pattern color.
ForegroundPatternId
 The foreground fill pattern Id.
IsMasking
 If true then the FilledRegion will cover the lines and edges of objects behind it. If false then lines and edges will remain visible.
LineWeight
 The line weight of the fill pattern.
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace