Revit 2024 API
IFCConnectedWallData Members
The IFCConnectedWallData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the IFCConnectedWallData
Properties
Name | Description
ElementId
 The element id to which this element is joined.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Location
 The location for the join.
See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace