Revit 2020 API
TemporaryViewModes Methods
The TemporaryViewModes type exposes the following members.
Methods
Name | Description
DeactivateAllModes
 Deactivates all temporary modes that are currently active.
DeactivateMode
 Deactivates the given temporary mode.
GetCaption
 A text caption to use for the given mode.
IsModeActive
 Tests whether a given mode is currently active or not.
IsModeAvailable
 Tests whether a temporary view mode is currently available in the associated view.
IsModeEnabled
 Tests whether a temporary view mode is currently enabled in the associated view.
IsValidState
 Tests whether the given state is valid for the associated view and the context the view is currently in.
See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace