Revit 2020 API
FamilySizeTableColumn Methods
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace