Revit 2020 API
FormatOptions Methods
The FormatOptions type exposes the following members.
Methods
Name | Description
CanHaveUnitSymbol()
 Checks whether a unit symbol can be specified for the display unit in this FormatOptions.
CanHaveUnitSymbol(DisplayUnitType)
 Checks whether a unit symbol can be specified for a given display unit.
CanSuppressLeadingZeros()
 Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressLeadingZeros(DisplayUnitType)
 Checks whether leading zeros can be suppressed for a given display unit.
CanSuppressSpaces()
 Checks whether spaces can be suppressed for the display unit in this FormatOptions.
CanSuppressSpaces(DisplayUnitType)
 Checks whether spaces can be suppressed for a given display unit.
CanSuppressTrailingZeros()
 Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressTrailingZeros(DisplayUnitType)
 Checks whether trailing zeros can be suppressed for a given display unit.
CanUsePlusPrefix()
 Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
CanUsePlusPrefix(DisplayUnitType)
 Checks whether a plus prefix can be displayed for a given display unit.
Dispose
GetValidUnitSymbols()
 Gets all valid unit symbols for the display unit in this FormatOptions.
GetValidUnitSymbols(DisplayUnitType)
 Gets all valid unit symbols for a given display unit.
IsValidAccuracy(Double)
 Checks whether an accuracy is valid for the display unit in this FormatOptions.
IsValidAccuracy(DisplayUnitType, Double)
 Checks whether an accuracy is valid for a given display unit.
IsValidForUnitType
 Checks whether this FormatOptions is valid for a given unit type.
IsValidUnitSymbol(UnitSymbolType)
 Checks whether a unit symbol is valid for the display unit in this FormatOptions.
IsValidUnitSymbol(DisplayUnitType, UnitSymbolType)
 Checks whether a unit symbol is valid for a given display unit.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace