Revit 2020 API
ViewSchedule Properties
The ViewSchedule type exposes the following members.
Properties
Name | Description
BodyTextTypeId
 Defines the default text style used for the data section of the schedule.
Definition
 The primary ScheduleDefinition.
EmbeddedDefinition
 The embedded ScheduleDefinition.
HeaderTextTypeId
 Defines the default text style used in the column headers in the body section of the schedule.
ImageRowHeight
 Defines the image row height in the schedule.
IsInternalKeynoteSchedule
 Identifies if this ViewSchedule is an internal schedule used when keynotes are filtered based on the elements that are shown on a sheet.
IsTitleblockRevisionSchedule
 Identifies if this ViewSchedule is an internal schedule used to display revision schedules as part of a titleblock.
KeyScheduleParameterName
 In a key schedule, the name of the parameter for choosing one of the keys.
TitleTextTypeId
 Defines the default text style used in the header section of the schedule.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace