Revit 2020 API
ThermalAsset Methods
The ThermalAsset type exposes the following members.
Methods
Name | Description
Copy
 Produces a copy of the asset.
Dispose
Equals(ThermalAsset)
 Determines whether this thermal asset is equal to another.
See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace