Revit 2020 API
FieldBuilder Methods
The FieldBuilder type exposes the following members.
Methods
Name | Description
Dispose
NeedsSubSchemaGUID
 Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
NeedsUnits
 Checks whether the field type requires explicit unit conversions.
Ready
 Checks whether the builder may be used.
SetDocumentation
 Sets the documentation string for the Field.
SetSubSchemaGUID
 Sets the GUID of the Schema of the Entities that are intended to be stored in this field.
SetUnitType
 Sets the type of units for the field.
See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace