Revit 2020 API
BasePoint Properties
The BasePoint type exposes the following members.
Properties
Name | Description
IsShared
 Indicates whether the BasePoint is shared. The project's survey point is a BasePoint which is shared.
Position
 Position of the BasePoint.
SharedPosition
 Shared position of the BasePoint.
See Also
BasePoint Class
Autodesk.Revit.DB Namespace