Revit 2020 API
FamilySizeTableColumn Members
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FamilySizeTableColumn
Properties
Name | Description
DisplayUnitType
 The Display unit type of the column.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The column name.
UnitType
 The Unit type of the column.
See Also
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace