Revit 2020 API
CanExecuteEventArgs Properties
The CanExecuteEventArgs type exposes the following members.
Properties
Name | Description
CanExecute
The value that indicates whether the Command associated with this event can be executed.
See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace