Revit 2020 API
Units Methods
The Units type exposes the following members.
Methods
Name | Description
Dispose
GetFormatOptions
 Gets the default FormatOptions for a unit type.
GetModifiableUnitTypes
 Gets all unit types for which the default FormatOptions can be modified.
IsModifiableUnitType
 Checks whether the default FormatOptions can be modified for a given unit type.
SetFormatOptions
 Sets the default FormatOptions for a unit type.
See Also
Units Class
Autodesk.Revit.DB Namespace