Revit 2020 API
DGNExportOptions Properties
The DGNExportOptions type exposes the following members.
Properties
Name | Description
FileVersion
 The DGN file version. Default value of fileVersion is DGNFileFormat.Default.
MasterUnits
 The master units. Default value of masterUnits is true.
MergedViews
 Whether to merge all views in one file (via XRefs). Default value of mergedViews is false.
SeedName
 The name of the DGN seed. Default value of seedName is empty.
See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace