Revit 2020 API
Application Methods
The Application type exposes the following members.
Methods
Name | Description
CopyModel
 Copies an existing model to a new file. Overwriting a file of the same name is allowed.
Dispose
ExtractPartAtomFromFamilyFile
 Writes a PartAtom XML from the contents of a family file.
GetAssets
 Gets all the Assets of the specified type.
GetFailureDefinitionRegistry
 Returns the instance of FailureDefinitionRegistry.
GetLibraryPaths
 Returns path information identifying where Revit searches for content.
GetRevitServerNetworkHosts
 Gets the list of all Revit Server Network hosts in current session.
GetWorksharingCentralGUID
 Gets the worksharing central GUID of the given server-based model.
IsJournalPlaying
 Determines if the application is currently in journal playback mode.
IsValidThickness
 Checks if the input value is valid to be supplied as a thickness (for an extrusion, or blend, or wall layer, or similar geometric construct).
NewFamilyDocument
 New family document, including family, titleblock, and annotation symbol
NewProjectDocument(String)
 New project document
NewProjectDocument(UnitSystem)
 Creates a new project document with no template file specified.
NewProjectTemplateDocument
 New project template document
OpenBuildingComponentDocument
 Opens a Building Component document from disk.
OpenDocumentFile(String)
 Opens a document from disk.
OpenDocumentFile(ModelPath, OpenOptions)
 Opens a document from disk or cloud.
OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback)
 Opens a document from disk or cloud.
OpenIFCDocument(String)
 Opens an IFC document from disk using default options.
OpenIFCDocument(String, IFCImportOptions)
 Opens an IFC document from disk using custom options.
OpenSharedParameterFile
Enables access to shared parameter groups and definitions that are maintained on disk.
PurgeReleasedAPIObjects
 Explicitly purges all API objects that have been released but are still awaiting to be finalized
RegisterFailuresProcessor
 Registers Revit application-wide instance of Failures Processor.
SetLibraryPaths
 Sets path information identifying where Revit searches for content.
UpdateRenderAppearanceLibrary
 Updates the stored render appearance library, giving the Revit session access to any new RPC content.
WriteJournalComment
 Writes a comment to the Revit journal file.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace