Revit 2020 API
FormatOptions Members
The FormatOptions type exposes the following members.
Constructors
Name | Description
FormatOptions()
 Creates a new FormatOptions object that represents default formatting.
FormatOptions(DisplayUnitType)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(FormatOptions)
 Creates a copy of a FormatOptions object.
FormatOptions(DisplayUnitType, UnitSymbolType)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(DisplayUnitType, Double)
 Creates a new FormatOptions object that represents custom formatting.
FormatOptions(DisplayUnitType, UnitSymbolType, Double)
 Creates a new FormatOptions object that represents custom formatting.
Methods
Name | Description
CanHaveUnitSymbol()
 Checks whether a unit symbol can be specified for the display unit in this FormatOptions.
CanHaveUnitSymbol(DisplayUnitType)
 Checks whether a unit symbol can be specified for a given display unit.
CanSuppressLeadingZeros()
 Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressLeadingZeros(DisplayUnitType)
 Checks whether leading zeros can be suppressed for a given display unit.
CanSuppressSpaces()
 Checks whether spaces can be suppressed for the display unit in this FormatOptions.
CanSuppressSpaces(DisplayUnitType)
 Checks whether spaces can be suppressed for a given display unit.
CanSuppressTrailingZeros()
 Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressTrailingZeros(DisplayUnitType)
 Checks whether trailing zeros can be suppressed for a given display unit.
CanUsePlusPrefix()
 Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
CanUsePlusPrefix(DisplayUnitType)
 Checks whether a plus prefix can be displayed for a given display unit.
Dispose
Releases all resources used by the FormatOptions
GetValidUnitSymbols()
 Gets all valid unit symbols for the display unit in this FormatOptions.
GetValidUnitSymbols(DisplayUnitType)
 Gets all valid unit symbols for a given display unit.
IsValidAccuracy(Double)
 Checks whether an accuracy is valid for the display unit in this FormatOptions.
IsValidAccuracy(DisplayUnitType, Double)
 Checks whether an accuracy is valid for a given display unit.
IsValidForUnitType
 Checks whether this FormatOptions is valid for a given unit type.
IsValidUnitSymbol(UnitSymbolType)
 Checks whether a unit symbol is valid for the display unit in this FormatOptions.
IsValidUnitSymbol(DisplayUnitType, UnitSymbolType)
 Checks whether a unit symbol is valid for a given display unit.
Properties
Name | Description
Accuracy
 The accuracy to which values will be rounded.
DisplayUnits
 The units and display format used to format values.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RoundingMethod
 The method used to round values: round to nearest, round up, or round down.
SuppressLeadingZeros
 Indicates if leading zeros should be suppressed in feet and fractional inches.
SuppressSpaces
 Indicates if spaces around the dash should be suppressed in feet and fractional inches.
SuppressTrailingZeros
 Indicates if trailing zeros after the decimal point should be suppressed.
UnitSymbol
 The unit symbol that should be displayed to indicate the units of the value.
UseDefault
 Indicates whether default or custom formatting should be used.
UseDigitGrouping
 Indicates if digit grouping symbols should be displayed.
UsePlusPrefix
 Indicates if a plus sign prefix should be displayed for positive and zero values.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace