Revit 2020 API
Surface Methods
The Surface type exposes the following members.
Methods
Name | Description
Dispose
Project
 Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
ProjectWithGuessPoint
 Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
See Also
Surface Class
Autodesk.Revit.DB Namespace