Revit 2020 API
MEPModel Members
The MEPModel type exposes the following members.
Methods
Name | Description
Properties
Name | Description
AssignedElectricalSystems
Retrieves the electrical systems this electrical panel currently is assigned to.
ConnectorManager
Retrieves the Connector Manager from this MEPModel.
ElectricalSystems
Retrieves the electrical systems that are currently created using this MEPModel.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace