Revit 2020 API
SpotDimension Members
The SpotDimension type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Location
Get a location point object. This is the location of the spot dimension.
 (Overrides Element.Location.)
SpotDimensionType
 The dimension style of this dimension.
See Also
SpotDimension Class
Autodesk.Revit.DB Namespace