Revit 2020 API
Curve Properties
The Curve type exposes the following members.
Properties
Name | Description
ApproximateLength
The approximate length of the curve.
IsBound
Describes whether the parameter of the curve is restricted to a particular interval.
IsCyclic
The boolean value that indicates whether this curve is cyclic.
Length
The exact length of the curve.
Period
The period of this curve.
Reference
Returns a stable reference to the curve.
See Also
Curve Class
Autodesk.Revit.DB Namespace