Revit 2020 API
ElectricalEquipment Members
The ElectricalEquipment type exposes the following members.
Methods
Name | Description
Properties
Name | Description
DistributionSystem
get or set the Distribution System for the Electrical Equipment.
See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace