Revit 2020 API
Entity Methods
The Entity type exposes the following members.
Methods
Name | Description
Clear(String)
 Resets the field to its default value.
Clear(Field)
 Resets the field to its default value.
Dispose
Get<FieldType>(String)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field)
 Retrieves the value of the field in the entity.
Get<FieldType>(String, DisplayUnitType)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field, DisplayUnitType)
 Retrieves the value of the field in the entity.
IsValid
 Checks whether this Entity has a live Schema corresponding to it.
ReadAccessGranted
 Checks whether this Entity may be retrieved by the current add-in.
RecognizedField
 Checks whether a Field belongs to the same Schema as this Entity.
Set<FieldType>(String, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType)
 Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, DisplayUnitType)
 Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, DisplayUnitType)
 Stores the value of the field in the entity.
WriteAccessGranted
 Checks whether this Entity may be stored by the current add-in.
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace