Revit 2020 API
Mesh Members
The Mesh type exposes the following members.
Methods
Name | Description
Properties
Name | Description
MaterialElementId
Element ID of the material from which this mesh is composed.
NumTriangles
The number of triangles that the mesh contains.
Transformed
Transforms this mesh and returns the result.
Triangle
Retrieves a specific triangle.
Vertices
Retrieves all vertices used to define this mesh. Intended for indexed access.
See Also
Mesh Class
Autodesk.Revit.DB Namespace