Revit 2020 API
ViewSchedule Methods
The ViewSchedule type exposes the following members.
Methods
Name | Description
CanGroupHeaders
 Indicates if selected headers can be grouped for this schedule.
CanUngroupHeaders
 Indicates if selected headers can be ungrouped.
CreateKeynoteLegend
 Creates a keynote legend.
CreateKeySchedule
 Create a key schedule.
CreateMaterialTakeoff
 Creates a material takeoff.
CreateNoteBlock
 Creates a note block.
CreateRevisionSchedule
 Creates a revision schedule.
CreateSchedule(Document, ElementId)
 Creates a regular schedule.
CreateSchedule(Document, ElementId, ElementId)
 Creates a regular schedule that can relate to a specific area scheme.
CreateSheetList
 Creates a sheet list.
CreateViewList
 Creates a view list.
Export
 Exports the schedule data to a text file.
GetDefaultNameForKeynoteLegend
 Gets the default view name that will be used when creating a keynote legend.
GetDefaultNameForKeySchedule
 Gets the default view name that will be used when creating a key schedule.
GetDefaultNameForMaterialTakeoff
 Gets the default view name that will be used when creating a material takeoff.
GetDefaultNameForNoteBlock
 Gets the default view name that will be used when creating a note block.
GetDefaultNameForRevisionSchedule
 Gets the default view name that will be used when creating a revision schedule.
GetDefaultNameForSchedule(Document, ElementId)
 Gets the default view name that will be used when creating a regular schedule.
GetDefaultNameForSchedule(Document, ElementId, ElementId)
 Gets the default view name that will be used when creating a schedule.
GetDefaultNameForSheetList
 Gets the default view name that will be used when creating a sheet list.
GetDefaultNameForViewList
 Gets the default view name that will be used when creating a view list.
GetDefaultParameterNameForKeySchedule
 Gets the default parameter name that will be used when creating a key schedule.
GetTableData
 Gets the writable table data object.
GetValidCategoriesForKeySchedule
 Gets a list of categories that can be used for a key schedule.
GetValidCategoriesForMaterialTakeoff
 Gets a list of categories that can be used for a material takeoff.
GetValidCategoriesForSchedule
 Gets a list of categories that can be used for a regular schedule.
GetValidFamiliesForNoteBlock
 Gets a list of families that can be used for a note block.
GroupHeaders
 Groups schedule header cells.
HasImageField
 Checks whether the schedule definition includes any image-related fields and if any elements in the schedule actually have images in those fields.
IsDataOutOfDate
 Indicates whether the schedule data is out of date.
IsValidCategoryForKeySchedule
 Checks whether a category can be used for a key schedule.
IsValidCategoryForMaterialTakeoff
 Checks whether a category can be used for a material takeoff.
IsValidCategoryForSchedule
 Checks whether a category can be used for a regular schedule.
IsValidFamilyForNoteBlock
 Checks whether a family can be used for a note block.
IsValidTextTypeId
 Identifies if the input id represents a valid text type id for use in the schedule properties.
RefreshData
 Rebuilds the schedule data if it is out of date.
RestoreImageSize
 Restores all images to their original sizes.
UngroupHeaders
 Ungroups selected headers of schedule.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace