Revit 2020 API
AssetPropertyDistance Methods
The AssetPropertyDistance type exposes the following members.
Methods
Name | Description
IsValidValue
 Checks that the value is a valid value for this property.
See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace