Revit 2020 API
ReinforcementRoundingManager Members
The ReinforcementRoundingManager type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ReinforcementRoundingManager
Properties
Name | Description
Element
 The owner of the reinforcement rounding overrides.
IsActiveOnElement
 Defines whether reinforcement rounding is activated for the particular element.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LengthDisplayUnit
 The length units used when displaying the reinforcement rounding values.
See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace