Revit 2020 API
MEPModel Properties
The MEPModel type exposes the following members.
Properties
Name | Description
AssignedElectricalSystems
Retrieves the electrical systems this electrical panel currently is assigned to.
ConnectorManager
Retrieves the Connector Manager from this MEPModel.
ElectricalSystems
Retrieves the electrical systems that are currently created using this MEPModel.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace