Revit 2020 API
AssetPropertyDistance Members
The AssetPropertyDistance type exposes the following members.
Methods
Name | Description
IsValidValue
 Checks that the value is a valid value for this property.
Properties
Name | Description
DisplayUnitType
 Unit distance.
Value
 Value of the property.
See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace