Revit 2020 API
DocumentSavingAsEventArgs Members
The DocumentSavingAsEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsSavingAsMasterFile
 Indicates whether the document is to be saved as master file.
PathName
 Target path to which the document is to be saved.
See Also
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace