Revit 2020 API
Rebar Members
The Rebar type exposes the following members.
Methods
Name | Description
CanApplyPresentationMode
 Checks if a presentation mode can be applied for this rebar in the given view.
CanBeMatchedWithMultipleShapes
 Checks if this Rebar can be matched with multiple Rebar Shapes.
CanSuppressFirstOrLastBar
 Checks if the first or last bar in rebar set can be hidden in the given view.
CanUseHookType
 Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType
ClearPresentationMode
 Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
ConstraintsCanBeEdited
For ShapeDriven Rebar: returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. Examples of where this method would return false are: Rebar in Groups (which do not have constraints), or legacy, sketch-based Rebar elements created before the introduction of RebarShape families in version 2009.
For FreeForm rebar: constraints can be edited if there is a valid external server Guid assigned to that Rebar
ContainsValidArcRadiiForStyleAndBarType
 Checks that all arcs in the chain of curves have radii that are not less than minimum bend radius for bar type and style
CreateFreeForm(Document, Guid, RebarBarType, Element)
 Creates a free form rebar that can have constraints.
CreateFreeForm(Document, RebarBarType, Element, IList<CurveLoop>, RebarFreeFormValidationResult)
 Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
CreateFreeForm(Document, RebarBarType, Element, IList<IList<Curve>>, RebarFreeFormValidationResult)
 Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
CreateFromCurves
 Creates a new instance of a shape driven Rebar element within the project.
CreateFromCurvesAndShape
 Creates a new instance of a shape driven Rebar element within the project. The instance will have the default shape parameters from the RebarShape. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true, then both the curves and hooks must match the RebarShape definition. Otherwise, the hooks can be different than the defaults specified in the RebarShape
CreateFromRebarShape
 Creates a new shape driven Rebar, as an instance of a RebarShape. The instance will have the default shape parameters from the RebarShape, and its location is based on the bounding box of the shape in the shape definition. Hooks are removed from the shape before computing its bounding box. If appropriate hooks can be found in the document, they will be assigned arbitrarily.
DoesBarExistAtPosition
 Checks whether a bar exists at the specified position.
FindMatchingPredefinedPresentationMode
 Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetAllRebarShapeIds
 Gets the ids of the RebarShapes elements that defines the shapes of the rebar.
GetBendData
 Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves
 A chain of curves representing the centerline of the rebar.
GetCouplerId
 Get the id of the Rebar Coupler that is applied to the rebar at the specified end.
GetEndTreatmentTypeId
 Get the id of the EndTreatmentType to be applied to the rebar.
GetFreeFormAccessor
 Returns an interface providing access to free-form properties and methods for this Rebar element.
GetFullGeometryForView
 Generates full geometry for the Rebar for a specific view.
GetHookOrientation
 Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
GetHookTypeId
 Get the id of the RebarHookType to be applied to the rebar.
GetHostId
 The element that contains the rebar.
GetParameterValueAtIndex
 Get the parameter value for a bar at the specified index. The parameter Id. The bar index in the rebar distribution. Accepts only values between 0 and NumberOfBarPositions-1. The ParameterValue for given parameterId and barPositionIndex. Throws exception if barPositionIndex is outside boundaries.
GetPresentationMode
 Gets the presentation mode for this rebar set when displayed in the given view.
GetRebarConstraintsManager
 Returns an object for managing the external constraints on the Rebar element
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetShapeDrivenAccessor
 Returns an interface providing access to shape-driven properties and methods for this Rebar element.
GetShapeId
 Returns the id of the RebarShape element that defines the shape of the rebar.
HasPresentationOverrides
 Identifies if this Rebar has overridden default presentation settings for the given view.
HookAngleMatchesRebarShapeDefinition
 Checks that the hook angle of the specified RebarHookType matches the hook angle used in the Rebar's RebarShape at the specified end of the bar.
IsBarHidden
 Identifies if a given bar in this rebar set is hidden in this view.
IsRebarFreeForm
 Returns true if the rebar is free form and false if shape driven.
IsRebarInSection
 Identifies if this Rebar is shown as a cross-section in the given view.
IsRebarShapeDriven
 Returns true if the rebar is shape driven and false if free form.
IsSolidInView
 Checks if this rebar element is shown solidly in a 3D view.
IsUnobscuredInView
 Checks if this rebar element is shown unobscured in a view.
RebarShapeMatchesCurvesAndHooks
 Checks if rebarShape matches curves and hooks. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will only check the curves argument, and will ignore the hook information.
SetBarHiddenStatus
 Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetHookOrientation
 Defines the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
SetHookTypeId
 Set the id of the RebarHookType to be applied to the rebar.
SetHostId
 The element that contains the rebar.
SetPresentationMode
 Sets the presentation mode for this rebar set when displayed in the given view.
SetSolidInView
 Sets this rebar element to be shown solidly in a 3D view.
SetUnobscuredInView
 Sets this rebar element to be shown unobscured in a view.
Properties
Name | Description
DistributionType
 The type of rebar distribution(also known as Rebar Set Type).
IncludeFirstBar
 Identifies if the first bar in rebar set is shown.
IncludeLastBar
 Identifies if the last bar in rebar set is shown.
LayoutRule
 Identifies the layout rule of rebar set.
MaxSpacing
 Identifies the maximum spacing between rebar in rebar set.
NumberOfBarPositions
 The number of potential bars in the set.
Quantity
 Identifies the number of bars in rebar set.
ReadOnlyParameters
 When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected.
ScheduleMark
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
TotalLength
 The length of an individual bar multiplied by Quantity.
Volume
 The volume of an individual bar multiplied by Quantity.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace