Revit 2020 API
Field Methods
The Field type exposes the following members.
Methods
Name | Description
CompatibleDisplayUnitType
 Checks if the specified type is compatible with the field description.
Dispose
SubEntityReadAccessGranted
 Checks whether there is read access to subentities storable in this field.
SubEntityWriteAccessGranted
 Checks whether there is write access to subentities storable in this field.
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace