Revit 2020 API
ControlledApplication Methods
The ControlledApplication type exposes the following members.
Methods
Name | Description
GetFailureDefinitionRegistry
 Returns the instance of FailureDefinitionRegistry.
GetLibraryPaths
 Returns path information identifying where Revit searches for content.
IsJournalPlaying
 Determines if the application is currently in journal playback mode.
OpenSharedParameterFile
Enables access to shared parameter groups and definitions that are maintained on disk.
RegisterFailuresProcessor
 Registers Revit application-wide instance of Failures Processor.
SetLibraryPaths
 Sets path information identifying where Revit searches for content.
WriteJournalComment
 Writes a comment to the Revit journal file.
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace