Revit 2020 API
DocumentSavedAsEventArgs Properties
The DocumentSavedAsEventArgs type exposes the following members.
Properties
Name | Description
IsSavingAsMasterFile
 Indicates whether the document is to be saved as master file.
OriginalPath
 Original path of the document.
See Also
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace