Revit 2020 API
ImageImportOptions Properties
The ImageImportOptions type exposes the following members.
Properties
Name | Description
Placement
Identifies which point of the image will be aligned to the placement point RefPoint.
Resolution
Resolution to use (in dpi) for the image to be imported.
See Also
ImageImportOptions Class
Autodesk.Revit.DB Namespace