Revit 2020 API
ScheduleSheetInstance Properties
The ScheduleSheetInstance type exposes the following members.
Properties
Name | Description
IsTitleblockRevisionSchedule
 Identifies if this ScheduleSheetInstance is a revision schedule in a titleblock family.
Point
 Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Rotation
 Rotation of the ScheduleInstance.
ScheduleId
 Id of the "master" schedule that generates this ScheduleInstance.
See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace