Revit 2020 API
ElementNode Properties
The ElementNode type exposes the following members.
Properties
Name | Description
Document
 Gets the document associated with the element.
ElementId
 The Id of the element.
See Also
ElementNode Class
Autodesk.Revit.DB Namespace