Revit 2020 API
RouteAnalysisSettings Methods
The RouteAnalysisSettings type exposes the following members.
Methods
Name | Description
GetExcludedCategoryIds
 Returns ElementIds for Category elements which are excluded by route calculation.
GetIgnoredCategoryIds
 Returns ElementIds for Category elements which are ignored by route calculation.
GetRouteAnalysisSettings
 Returns the RouteAnalysisSettings element for a given document.
IsLargeGeometryAllowed
 Returns if large geometry is allowed for path of travel creation or not.
SetIgnoredCategoryIds
 Sets the ElementIds for Category elements which are ignored by route calculation.
See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace