Revit 2020 API
ImageView Methods
The ImageView type exposes the following members.
Methods
Name | Description
Create(Document, ImageTypeOptions)
 Create an ImageView containing an image imported from disk.
Create(Document, String) |  Obsolete.
 Create an ImageView containing an image imported from disk.
See Also
ImageView Class
Autodesk.Revit.DB Namespace