Revit 2020 API
ImageImportOptions Members
The ImageImportOptions type exposes the following members.
Constructors
Name | Description
ImageImportOptions
Default constructor. Sets all options to their default values.
Methods
Name | Description
Properties
Name | Description
Placement
Identifies which point of the image will be aligned to the placement point RefPoint.
Resolution
Resolution to use (in dpi) for the image to be imported.
See Also
ImageImportOptions Class
Autodesk.Revit.DB Namespace