Revit 2020 API
FillPattern Methods
The FillPattern type exposes the following members.
Methods
Name | Description
Dispose
ExpandDots
 Corrects pattern dots to make them be drawn properly for Revit.
GetFillGrid
 Gets the specified fill grid.
GetFillGrids
 Gets all fill grids in this fill pattern
IsEqual
 Check if the contents in two fill patterns are equal.
SetFillGrid
 Sets the fill grid.
SetFillGrids
 Set the fill grids in this fill pattern.
See Also
FillPattern Class
Autodesk.Revit.DB Namespace