Revit 2020 API
ElectricalSystem Properties
The ElectricalSystem type exposes the following members.
Properties
Name | Description
ApparentCurrent
 The ApparentCurrent value of the Electrical System.
ApparentCurrentPhaseA
 The ApparentCurrentPhaseA value of the Electrical System.
ApparentCurrentPhaseB
 The ApparentCurrentPhaseB value of the Electrical System.
ApparentCurrentPhaseC
 The ApparentCurrentPhaseC value of the Electrical System.
ApparentLoad
 The ApparentLoad value of the Electrical System.
ApparentLoadPhaseA
 The ApparentLoadPhaseA value of the Electrical System.
ApparentLoadPhaseB
 The ApparentLoadPhaseB value of the Electrical System.
ApparentLoadPhaseC
 The ApparentLoadPhaseC value of the Electrical System.
BalancedLoad
 Reports whether the BalancedLoad is on or off.
CircuitConnectionType
 The circuit connection type of the electrical system.
CircuitNumber
 The CircuitNumber of the Electrical System.
CircuitPathMode
 The circuit path mode of the electrical system.
CircuitType
 The circuit type of the Electrical System.
GroundConductorsNumber
 The GroundConductors Number of the Electrical System.
HasCustomCircuitPath
 Checks whether the electrical system circuit path has been customized. If not, the property CircuitPathMode cannot be set as Custom explicitly.
HasPathOffset
 Whether the circuit path has a valid offset.
HotConductorsNumber
 The HotConductors Number of the Electrical System.
IsBasePanelFeedThroughLugsOccupied
 Checks if the feed through lugs of the base panel is already occupied.
Length
 The Length value of the Electrical System.
LoadClassifications
 The LoadClassifications used in the Electrical System.
LoadName
 The LoadName of the Electrical System.
NeutralConductorsNumber
 The NeutralConductors Number of the Electrical System.
PanelName
 The Panel name of the Electrical System.
PathOffset
 The offset of the horizontal segments of the circuit path.
PolesNumber
 The Poles Number of the Electrical System.
PowerFactor
 The PowerFactor value of the Electrical System.
PowerFactorState
 The PowerFactorState type of the Electrical System.
Rating
 The Rating value of the Electrical System.
RunsNumber
 The Runs Number of the Electrical System.
StartSlot
 The Start Slot where the Electrical System is located in its panel.
SystemType
 The Electrical System Type of the Electrical System.
TrueCurrent
 The TrueCurrent value of the Electrical System.
TrueCurrentPhaseA
 The TrueCurrentPhaseA value of the Electrical System.
TrueCurrentPhaseB
 The TrueCurrentPhaseB value of the Electrical System.
TrueCurrentPhaseC
 The TrueCurrentPhaseC value of the Electrical System.
TrueLoad
 The TrueLoad value of the Electrical System.
TrueLoadPhaseA
 The TrueLoadPhaseA value of the Electrical System.
TrueLoadPhaseB
 The TrueLoadPhaseB value of the Electrical System.
TrueLoadPhaseC
 The TrueLoadPhaseC value of the Electrical System.
Voltage
 The Voltage value of the Electrical System.
VoltageDrop
 The VoltageDrop value of the Electrical System.
WireSizeString
 The WireSize as a String of the Electrical System
WireType
 The wire type of the Electrical System.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace