Revit 2020 API
PathOfTravel Methods
The PathOfTravel type exposes the following members.
Methods
Name | Description
Create(View, XYZ, XYZ)
 Creates a new path of travel between two points.
Create(View, XYZ, XYZ, PathOfTravelCalculationStatus)
 Creates a new path of travel between two points and provides creation result status.
CreateMapped(View, IList<XYZ>, IList<XYZ>)
 Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points.
CreateMapped(View, IList<XYZ>, IList<XYZ>, IList<PathOfTravelCalculationStatus>)
 Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points and provides creation result statuses.
CreateMultiple(View, IList<XYZ>, IList<XYZ>)
 Creates multiple new paths of travel between same size sets of start and end points.
CreateMultiple(View, IList<XYZ>, IList<XYZ>, IList<PathOfTravelCalculationStatus>)
 Creates multiple new paths of travel between same size sets of start and end points and provides creation result statuses.
GetCurves
 Gets the array of curves representing the path of travel.
Update
 Updates the path of travel by recalculating the path between the original start and end points.
UpdateMultiple(Document, IList<ElementId>)
 Updates the specified paths of travel by recalculating each path using their original start and end points.
UpdateMultiple(Document, IList<ElementId>, IList<PathOfTravelCalculationStatus>)
 Updates the specified paths of travel by recalculating each path using their original start and end points and provides creation result statuses.
See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace