Revit 2020 API
ElementNode Members
The ElementNode type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Document
 Gets the document associated with the element.
ElementId
 The Id of the element.
See Also
ElementNode Class
Autodesk.Revit.DB Namespace