Revit 2020 API
Edge Methods
The Edge type exposes the following members.
Methods
Name | Description
AsCurve
Returns a curve that corresponds to the edge's parametric orientation.
AsCurveFollowingFace
Returns a curve that corresponds to this edge as oriented in its topological direction on the specified face.
ComputeDerivatives
Returns the vectors describing the edge at the specified parameter.
Evaluate
Evaluates a parameter on the edge.
EvaluateOnFace
Evaluates a parameter on the edge to produce UV coordinates on the face.
GetEndPointReference
Returns a stable reference to the start or the end point of the edge.
GetFace
Returns one of the two faces that meet at the edge.
Tessellate
Returns a polyline approximation to the edge.
TessellateOnFace
Returns a polyline approximation to the edge in UV parameters of the face.
See Also
Edge Class
Autodesk.Revit.DB Namespace