Revit 2020 API
ReinforcementRoundingManager Methods
The ReinforcementRoundingManager type exposes the following members.
Methods
Name | Description
Dispose
See Also
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace