Revit 2020 API
RebarShape Methods
The RebarShape type exposes the following members.
Methods
Name | Description
Create
 Create a new instance of a Rebar Shape, which defines the shape of a rebar.
GetAllowed
 Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
GetCurvesForBrowser
 Generate curves for the shape, as used in the shape browser.
GetDefaultHookAngle
 Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180).
GetDefaultHookOrientation
 Get the hook orientation.
GetEndTreatmentTypeId
 get the id of the end treatment for the designated shape end
GetMultiplanarDefinition
 The optional 3D structure of the shape.
GetRebarShapeDefinition
 Return the definition of the RebarShape.
HasEndTreatment
 returns true if the shape has end treatment for at least one end.
IsSameShapeIgnoringHooks
 Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties.
SetAllowed
 Specify which bar types can be used with this RebarShape. Bar types are allowed by default.
SetEndTreatmentTypeId
 set the end treatment type id for the designated shape end
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace