Revit 2020 API
ImageType Properties
The ImageType type exposes the following members.
Properties
Name | Description
ExternalResourceType
 The type of external resources that represents images.
IsViewImage
 The ImageType was created via "Save to Project as Image" function. For such ImageTypes the file path is an empty string.
PageNumber
 The number of the page in a multi-page file, that was used to create the image in the ImageType.
Path
 The path to the file from which the ImageType was loaded.
PathType
 The path type that was used to refer to the file from which the ImageType was loaded.
See Also
ImageType Class
Autodesk.Revit.DB Namespace