Revit 2020 API
PathOfTravel Properties
The PathOfTravel type exposes the following members.
Properties
Name | Description
LineStyle
 The line style of the path.
PathEnd
 The end point of the path. The Z coordinate is ignored.
PathMidpoint
 The midpoint of the path. The Z coordinate is always zero.
PathStart
 The start point of the path. The Z coordinate is ignored.
See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace