Revit 2020 API
StructuralConnectionHandler Methods
The StructuralConnectionHandler type exposes the following members.
Methods
Name | Description
AddElementIds
 Adds element ids to the connection. All element ids in an array should be of applicable category.
AddReferences
 Adds references to the connection. All references should be of applicable category.
Create(Document, IList<ElementId>)
 Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. Elements should be of the following structural categories: framings, columns, walls, floors or foundations. The first of given elements is set as the primary one.
Create(Document, IList<ElementId>, ElementId)
 Creates a new instance of a Structural Connection Handler, which defines the connection between given elements. Elements should be of the following structural categories: framings, columns, walls, floors or foundations. The first of given elements is set as primary one.
Create(Document, IList<ElementId>, String)
 Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler.
GetConnectedElementIds
 Retrieves list of element ids of connected elements.
GetInputReferences
 Gets references of input elements.
GetOrigin
 Retrieves origin point of Structural Connection Handler element.
GetSubPartIds |  Obsolete.
 Gets ids of subpart elements. After connection regeneration ids may become invalid.
IsCustom
 Checks if Structural Connection Handler has the custom connection style.
IsDetailed
 Checks if Structural Connection Handler has the detailed connection style.
RemoveElementIds
 Removes element ids from the connection. All element ids in an array should belong to the connection.
RemoveReferences
 Removes references from the connection. All references in an array should belong to the connection.
SetDefaultElementOrder
 Sorts the connected elements connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut.
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace