Revit 2022 API
ViewSheetSet Members
The ViewSheetSet type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Name
The view sheet set name.
 (Overrides Element.Name.)
Views
The views.
See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace