Revit 2022 API
ScheduleSheetInstance Methods
The ScheduleSheetInstance type exposes the following members.
Methods
Name | Description
Create
 Create an instance of a schedule on a sheet.
See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace