Revit 2022 API
GroupNode Methods
The GroupNode type exposes the following members.
Methods
Name | Description
GetSymbolId
 The Id of the symbol associated with the node.
GetTransform
 A transformation matrix associated with the node.
See Also
GroupNode Class
Autodesk.Revit.DB Namespace