Revit 2022 API
ElectricalSystemSet Properties
The ElectricalSystemSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of objects that are in the set.
See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace