Revit 2022 API
LinkNode Members
The LinkNode type exposes the following members.
Methods
Name | Description
GetDocument
 Returns the document associated with the link.
Properties
Name | Description
See Also
LinkNode Class
Autodesk.Revit.DB Namespace