Revit 2022 API
AnalyticalModelColumn Members
The AnalyticalModelColumn type exposes the following members.
Methods
Name | Description
Properties
Name | Description
BaseExtension
 The base extension option.
BaseExtensionMethod
 The bottom extension method option.
BaseExtensionPlaneId
 The bottom extension plane ID option.
TopExtension
 The top extension option.
TopExtensionMethod
 The top extension method option.
TopExtensionPlaneId
 The top extension plane ID option.
See Also
AnalyticalModelColumn Class
Autodesk.Revit.DB.Structure Namespace