Revit 2022 API
LineLoad Methods
The LineLoad type exposes the following members.
Methods
Name | Description
Create(Document, AnalyticalModelStick, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, AnalyticalModelSurface, Int32, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, XYZ, XYZ, XYZ, XYZ, LineLoadType, SketchPlane)
 Creates a new non-hosted line load within the project using data at point.
GetCurve
 Returns curve that define geometry of the line load.
SetPoints
 Sets start and end point of the line load.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace