Revit 2022 API
SpatialElement Methods
The SpatialElement type exposes the following members.
Methods
Name | Description
GetBoundarySegments
Returns the boundary segments.
See Also
SpatialElement Class
Autodesk.Revit.DB Namespace