Revit 2022 API
BaseImportOptions Methods
The BaseImportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetLayerSelection
 Get all set layers name which user want to import into Revit.
SetLayerSelection
 Set the layers name which user want to import into Revit.
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace