Revit 2022 API
BoundaryValidation Members
The BoundaryValidation type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BoundaryValidation
IsValidHorizontalBoundary
 Identifies whether the given curve loops compose a valid horizontal boundary.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BoundaryValidation Class
Autodesk.Revit.DB Namespace