Revit 2022 API
Schema Methods
The Schema type exposes the following members.
Methods
Name | Description
Dispose
EraseSchemaAndAllEntities |  Obsolete.
 Erases all Entities corresponding to this Schema from all open documents, and erases this Schema from memory.
GetField
 Gets a Field of a given name from the Schema.
ListFields
 The complete list of fields in the Schema, sorted by name.
ListSchemas
 Lists all schemas in memory.
Lookup
 Finds the Schema corresponding to the GUID in memory.
ReadAccessGranted
 Checks whether Entities of this Schema may be retrieved by the current add-in.
WriteAccessGranted
 Checks whether Entities of this Schema may be stored by the current add-in.
See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace