Revit 2022 API
WorksetTable Methods
The WorksetTable type exposes the following members.
Methods
Name | Description
Dispose
GetActiveWorksetId
 Returns the active workset's WorksetId.
GetWorkset(Guid)
 Returns the workset from a input Guid.
GetWorkset(WorksetId)
 Returns the workset from a input WorksetId.
IsWorksetNameUnique
 Checks if the given workset name is unique in the document.
RenameWorkset
 Renames the workset.
SetActiveWorksetId
 Sets the active workset.
See Also
WorksetTable Class
Autodesk.Revit.DB Namespace