Revit 2022 API
ViewSheetSet Properties
The ViewSheetSet type exposes the following members.
Properties
Name | Description
Name
The view sheet set name.
 (Overrides Element.Name.)
Views
The views.
See Also
ViewSheetSet Class
Autodesk.Revit.DB Namespace