Revit 2022 API
AnalyticalModelSurface Methods
The AnalyticalModelSurface type exposes the following members.
Methods
Name | Description
GetHiddenOpenings
 Retrieves Identifiers of all hidden openings.
GetLocalCoordinateSystem(XYZ)
 Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
GetLoops
 Retrieves Analytical Model Loops with respect to the loopType.
GetOpeningLoops
 Retrieves Array of CurveLoops of Analytical Surface Opening.. Only valid openings for hide are allowed.
GetOpenings
 Retrieves Analytical Surface Openings Identifiers valid to be used in showOpening/hideOpening functions.
GetPlane
 Returns plane on which Analytical Model Surface Element is lying. Only planar surface elements are valid for this function.
HasOpenings
 Checks if the analytical model surface have any openings.
HideOpening
 Hides set of curves originating from Opening.
IsOpeningHidden
 Returns true if opening with given Identifier is hidden.
IsPlanar
 Indicates if the Analytical Model Surface Element is planar.
IsValidOpeningForHide
 Returns true if opening with given Identifier could be hidden, false for all other Identifiers.
SetLoops
 Set new analytical model geometry (newLoops) for analytical surface elements such as floors and slabs.
ShowOpening
 Shows previously hidden set of curves originating from Opening.
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace