Revit 2022 API
BoundaryValidation Methods
The BoundaryValidation type exposes the following members.
Methods
Name | Description
Dispose
IsValidHorizontalBoundary
 Identifies whether the given curve loops compose a valid horizontal boundary.
See Also
BoundaryValidation Class
Autodesk.Revit.DB Namespace