Revit 2022 API
SketchEditScope Methods
The SketchEditScope type exposes the following members.
Methods
Name | Description
IsSketchEditingSupported
 Checks whether sketch can be edited.
Start
 Starts a sketch edit mode.
See Also
SketchEditScope Class
Autodesk.Revit.DB Namespace