Revit 2022 API
RevisionSettings Methods
The RevisionSettings type exposes the following members.
Methods
Name | Description
GetAlphanumericRevisionSettings |  Obsolete.
 Returns a copy of the AlphanumericRevisionSettings owned by this RevisionSettings object.
GetNumericRevisionSettings |  Obsolete.
 Returns a copy of the NumericRevisionSettings owned by this RevisionSettings object.
GetRevisionSettings
 Returns the RevisionSettings for the given project document.
IsAcceptableRevisionCloudSpacing
 Rounds the given raw value and checks whether it is an acceptable cloud spacing value after it is rounded.
RoundRevisionCloudSpacing
 Rounds the given revision cloud spacing value according to the document's settings.
SetAlphanumericRevisionSettings |  Obsolete.
 Replaces the current alphanumeric revision numbering settings with the specified AlphanumericRevisionSettings.
SetNumericRevisionSettings |  Obsolete.
 Replaces the current numeric revision numbering settings with the specified NumericRevisionSettings.
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace