Revit 2022 API
EnergyAnalysisSpace Properties
The EnergyAnalysisSpace type exposes the following members.
Properties
Name | Description
AnalyticalVolume
 The volume for this space.
Area
 The area for this space.
CADObjectUniqueId
 The unique id of the originating CAD object (model element) associated with this space.
ComposedName
 The composed name for this space.
Description
 The description.
InnerVolume
 The analytical volume for this space.
SpaceName
 The name.
See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace