Revit 2022 API
AnalyticalModelSupport Members
The AnalyticalModelSupport type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the AnalyticalModelSupport
GetCurve
 Retrieves the curve providing support.
GetFace
 Retrieves surface providing support,
GetPoint
 Retrieves the point providing support.
GetPriority
 Retrieves the priority of the support provided.
GetSupportingElement
 Retrieves the actual Element Id providing support.
GetSupportType
 Gets the type of support provided.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AnalyticalModelSupport Class
Autodesk.Revit.DB.Structure Namespace