Revit 2022 API
ViewSystemsAnalysisReport Methods
The ViewSystemsAnalysisReport type exposes the following members.
Methods
Name | Description
Create
 Creates a new view for the systems analysis report.
GetLatestSystemsAnalysisReport
 Gets the latest report of systems analysis.
GetReportContent
 Gets the report content in this view.
IsAnalysisCompleted
 Indicates if the background systems analysis has completed or not.
RequestSystemsAnalysis
 Requests a new systems analysis in the background.
See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace