Revit 2022 API
IndependentTag Methods
The IndependentTag type exposes the following members.
Methods
Name | Description
AddReferences
 Adds the provided list of references to the tag's list of references.
CanLeaderEndConditionBeAssigned
 Checks whether the LeaderEndCondition can be changed.
Create(Document, ElementId, ElementId, Reference, Boolean, TagOrientation, XYZ)
 Places a tag on an element or subelement.
Create(Document, ElementId, Reference, Boolean, TagMode, TagOrientation, XYZ)
 Places a tag on an element or subelement.
GetLeaderElbow
 Returns the position of the elbow of the tag's leader that points to specified reference.
GetLeaderEnd
 Returns the end position of the tag's leader that points to specified reference.
GetTaggedElementIds
 Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each subelement that is being referenced by the tag.
GetTaggedLocalElement |  Obsolete.
 Get the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element.
GetTaggedLocalElementIds
 Returns a set of IDs for all tagged local elements, if any. A local element ID will be provided for each subelement that is being referenced by the tag.
GetTaggedLocalElements
 Get the tagged local elements, if any. An Element will be provided for each subelement that is being referenced by the tag.
GetTaggedReference |  Obsolete.
 Get the host reference of the tag.
GetTaggedReferences
 Get the host references of the tag.
HasLeaderElbow
 Whether the tag's leader that points to the reference has an elbow point or not.
IsTaggedOnSubelement
 Returns true if the tag is tagged on a subelement.
RemoveReferences
 Removes the provided list of references from the tag's list of references.
SetLeaderElbow
 Set the position of the elbow of the tag's leader that points to specified reference.
SetLeaderEnd
 Set the end position of the tag's leader that points to specified reference.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace