Revit 2022 API
GeometryInstance Members
The GeometryInstance type exposes the following members.
Methods
Name | Description
GetInstanceGeometry()
Computes the geometric representation of the instance.
GetInstanceGeometry(Transform)
Computes a transformation of the geometric representation of the instance.
GetSymbolGeometry()
Computes the geometric representation of the symbol which generates this instance.
GetSymbolGeometry(Transform)
Computes a transformation of the geometric representation of the symbol which generates this instance.
Properties
Name | Description
Symbol
The symbol element that this object is referring to.
SymbolGeometry
The geometric representation of the symbol which generates this instance.
Transform
The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance.
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace