Revit 2022 API
ElectricalSystemSet Methods
The ElectricalSystemSet type exposes the following members.
Methods
Name | Description
Clear
Removes every item from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace