Revit 2022 API
SpatialElement Members
The SpatialElement type exposes the following members.
Methods
Name | Description
GetBoundarySegments
Returns the boundary segments.
Properties
Name | Description
Area
The area.
Level
Gets the level of the room.
Location
The location of the element.
 (Overrides Element.Location.)
Name
A human readable name for the Element.
 (Overrides Element.Name.)
Number
The number.
Perimeter
The perimeter.
See Also
SpatialElement Class
Autodesk.Revit.DB Namespace