Revit 2022 API
Viewport Members
The Viewport type exposes the following members.
Methods
Name | Description
CanAddViewToSheet
 Verifies that the view can be added to the ViewSheet.
Create
 Creates a new Viewport at a given location on a sheet.
GetBoxCenter
 Returns the center of the outline of the viewport on the sheet, excluding the viewport label.
GetBoxOutline
 Returns the outline of the viewport on the sheet, excluding the viewport label.
GetLabelOutline
 Gets the outline viewport's label on the sheet.
SetBoxCenter
 Moves this viewport so that the center of the box outline (excluding the viewport label) is at a given point.
Properties
Name | Description
LabelLineLength
 The length of the viewport label line in sheet space, measured in feet.
LabelOffset
 The offset is a two-dimensional vector from left bottom corner of the viewport with Rotation set to None to the left end of the viewport label line. The Z coordinate is ignored.
Rotation
 The rotation of the viewport on the sheet.
SheetId
 The element id of the ViewSheet on which the viewport appears, or InvalidElementId if this viewport does not associate a view with placement onto a sheet.
ViewId
 The element id of the associated View.
See Also
Viewport Class
Autodesk.Revit.DB Namespace