Revit 2022 API
Viewport Methods
The Viewport type exposes the following members.
Methods
Name | Description
CanAddViewToSheet
 Verifies that the view can be added to the ViewSheet.
Create
 Creates a new Viewport at a given location on a sheet.
GetBoxCenter
 Returns the center of the outline of the viewport on the sheet, excluding the viewport label.
GetBoxOutline
 Returns the outline of the viewport on the sheet, excluding the viewport label.
GetLabelOutline
 Gets the outline viewport's label on the sheet.
SetBoxCenter
 Moves this viewport so that the center of the box outline (excluding the viewport label) is at a given point.
See Also
Viewport Class
Autodesk.Revit.DB Namespace