Revit 2022 API
ElementId Methods
The ElementId type exposes the following members.
Methods
Name | Description
Compare
Compares two element ids.
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetHashCode
 Gets the integer value of the id as hash code
 (Overrides Object.GetHashCode().)
ToString
 Gets a String representation of the integer value of the id.
 (Overrides Object.ToString().)
See Also
ElementId Class
Autodesk.Revit.DB Namespace