Revit 2022 API
PointLoad Methods
The PointLoad type exposes the following members.
Methods
Name | Description
Create(Document, AnalyticalModel, XYZ, XYZ, PointLoadType)
 Creates a new hosted point load within the project.
Create(Document, AnalyticalModelStick, AnalyticalElementSelector, XYZ, XYZ, PointLoadType)
 Creates a new hosted point load within the project.
Create(Document, XYZ, XYZ, XYZ, PointLoadType, SketchPlane)
 Creates a new non-hosted point load within the project using data at point.
See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace