Revit 2022 API
Definition Methods
The Definition type exposes the following members.
Methods
Name | Description
GetDataType
 Gets a ForgeTypeId identifying the data type describing values of the parameter.
GetGroupTypeId
 Returns the identifier of the parameter definition's parameter group.
GetSpecTypeId |  Obsolete.
 Gets the identifier of the spec describing values of the parameter.
See Also
Definition Class
Autodesk.Revit.DB Namespace