Revit 2022 API
AnalyticalModelStick Members
The AnalyticalModelStick type exposes the following members.
Methods
Name | Description
GetAlignmentMethod
 Gets the alignment method for a given selector.
GetLocalCoordinateSystem(Double)
 Gets the local coordinate system (LCS) that reflects analytical model orientation at the specified parameter value along a curve.
GetLocalCoordinateSystem(XYZ)
 Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
GetMemberForces
 Gets the member forces associated with this element.
GetProjectionPlaneY
 Retrieves analytical model projection information for Y direction.
GetProjectionPlaneZ
 Retrieves analytical model projection information for Z direction.
GetProjectionY
 Retrieves analytical model projection information for Y direction.
GetProjectionZ
 Retrieves analytical model projection information for Z direction.
GetReleases
 Gets the releases of element.
GetReleaseType
 Gets the release type.
RemoveAllMemberForces
 Removes all member forces associated with element.
RemoveMemberForces
 Removes member forces defined for given position.
SetAlignmentMethod
 Sets the alignment method for a given selector.
SetMemberForces(MemberForces)
 Sets Member Forces to element.
SetMemberForces(Boolean, XYZ, XYZ)
 Adds Member Forces to element.
SetProjection(AnalyticalElementSelector, ElementId, ElementId)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, ElementId, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, StickElementProjectionY, ElementId)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, StickElementProjectionY, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
SetReleases
 Sets the releases of element.
SetReleaseType
 Sets the release type.
Properties
Name | Description
See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace