Revit 2022 API
TransformWithBoundary Members
The TransformWithBoundary type exposes the following members.
Constructors
Name | Description
TransformWithBoundary
 Constructs a new copy of the input TransformWithBoundary object.
Methods
Name | Description
Dispose
Releases all resources used by the TransformWithBoundary
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
TransformWithBoundary Class
Autodesk.Revit.DB Namespace