Revit 2022 API
RebarCoupler Properties
The RebarCoupler type exposes the following members.
Properties
Name | Description
CouplerMark
 gets and sets the coupler mark
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace