Revit 2022 API
ElectricalSystemSetIterator Methods
The ElectricalSystemSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
ElectricalSystemSetIterator Class
Autodesk.Revit.DB.Electrical Namespace