Revit 2022 API
ScheduleSheetInstance Members
The ScheduleSheetInstance type exposes the following members.
Methods
Name | Description
Create
 Create an instance of a schedule on a sheet.
Properties
Name | Description
IsTitleblockRevisionSchedule
 Identifies if this ScheduleSheetInstance is a revision schedule in a titleblock family.
Point
 Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Rotation
 Rotation of the ScheduleInstance.
ScheduleId
 Id of the primary schedule that generates this ScheduleInstance.
See Also
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace