Revit 2022 API
AreaLoad Methods
The AreaLoad type exposes the following members.
Methods
Name | Description
Create(Document, AnalyticalModelSurface, XYZ, AreaLoadType)
 Creates a new hosted area load within the project.
Create(Document, IList<CurveLoop>, XYZ, AreaLoadType)
 Creates a new non-hosted area load within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType)
 Creates a new non-hosted area load within the project.
GetLoops
 Returns curve loops that define geometry of the area load.
GetRefPoint
 Returns the physical location of the reference point.
SetLoops
 Sets curve loops that define geometry of the area load.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace