Revit 2022 API
ElectricalSystemSetIterator Members
The ElectricalSystemSetIterator type exposes the following members.
Constructors
Name | Description
ElectricalSystemSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
ElectricalSystemSetIterator Class
Autodesk.Revit.DB.Electrical Namespace