Revit 2022 API
AnalyticalModelSketchComponent Members
The AnalyticalModelSketchComponent type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the AnalyticalModelSketchComponent
EnableAutoDetect
 Enables Auto-detect on Sketch Component.
GetAnalyticalAlignmentMethod
 Retrieves Analytical Alignment Method preset for Sketch Component.
GetAnalyticalProjectionDatumPlane
 Retrieves Datum Plane ElementId for Analytical Projection
GetAnalyticalProjectionType
 Retrieves Analytical Projection Type preset for Sketch Component.
GetAutoDetectMatchedElements
 Retrieves ElementIds that Sketch Component is Auto-detecting against.
GetComponentElementId
 Retrieves ElementId of Sketch Component, if such an operation makes sense.
IsAutoDetectEnabled
 Indicates whether Auto-detect is enabled on the given Sketch component.
IsValidAnalyticalAlignmentMethod
 Indicates whether Analytical Alignment Method is valid for Sketch Component.
IsValidAnalyticalProjectionType
 Indicates whether Analytical Projection Type is valid for Sketch Component.
IsValidDatumPlaneForProjection
 Indicates whether Datum Plane is valid Analytical Projection of Sketch Component.
SetAnalyticalAlignmentMethod
 Sets the Alignment Method to the supplied Analytical Alignment Method
SetAnalyticalProjectionDatumPlane
 Sets the Analytical Projection to supplied Datum Plane.
SetAnalyticalProjectionType
 Sets the Analytical Projection to the supplied Analytical Projection Type.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace