Revit 2022 API
AnalyticalModel Methods
The AnalyticalModel type exposes the following members.
Methods
Name | Description
Approximate
 Switches between non-approximated (e.g., Curved) Analytical Models and approximated (made up of lines only) Analytical Models
CanApproximate
 Indicates if Analytical Model can be approximated or not.
CanDisableAutoDetect
 Indicates if Analytical Auto-detect can be disabled programmatically
CanHaveRigidLinks
 Indicates if Analytical Model supports Rigid Links.
CanUseHardPoints
 Indicates if Analytical Model can use Hard Points.
CloneAdjustment
 The method clones the adjustment of one end of the AM on another AM, with respect to the one of the ends. One of the Analytical Model ends
Disconnect
 Unjoin from Hub Element.
Enable
 Enables or disables Analytical Model, if the Element allows a one-operation Analytical Model toggle.
EnableAutoDetect
 Enable or disable Analytical Auto-detect.
GetAnalyticalModelSketchComponents
 Retrieves a collection of AnalyticalModelSketchComponent objects, which are useful for those Analytical Models that have finer calibration below the Element level.
GetAnalyticalModelSupports
 Retrieves the AnalyticalModelSupport array, which is useful to extract Analytical Support Information from Elements.
GetAnalyzeAs
 Returns value of Analyze As parameter for Analytical Model.
GetApproximationDeviation
 Retrieves amount by which approximation is made.
GetAutoDetectMatchedElements
 Retrieves other Element Ids that this Element is Auto-detecting against.
GetCurve
 Returns the single curve of the Analytical Model, if it is only one curve.
GetCurves
 Retrieves all curves for the Analytical Model of a given type.
GetElementId
 Retrieves Element Id of the structural element corresponding to the Analytical Model.
GetLocalCoordinateSystem
 Gets the local coordinate system (LCS) for an analytical model element.
GetManualAdjustmentMatchedElements
 Retrieves other Element Ids against which the Analytical Model has been adjusted.
GetOffset
 Gets the offset of the analytical model at end.
GetPoint
 Retrieves point of the Analytical Model.
GetReference
 Returns a reference to a given curve within the analytical model.
GetRigidLink
 Returns rigid link curve corresponding to selector.
HasDeletedLinks
 Indicates if Analytical Model contains deleted Analytical Links.
HasRigidLinksWith
 Indicates if Analytical Model has Rigid Links with specified element.
IsAnalyzeAsValid
 Determines if the given Analyze As parameter is valid for this Element.
IsApproximated
 Indicates if Analytical Model is approximated or not.
IsAutoDetectEnabled
 Reports if Analytical Auto-detect for the given direction is enabled.
IsElementFullySupported
 Indicates if Analytical Model is fully supported.
IsEnabled
 Reports whether the Analytical Model is enabled or disabled.
IsManuallyAdjusted
 Indicates if the Analytical Model has been manually adjusted by the user.
IsModified
 Checks if AM has been adjusted from auto-detect at any end.
IsSingleCurve
 Indicates if the Analytical Model can be expressed as a single curve.
IsSinglePoint
 Indicates if the Analytical Model can be expressed as a single point.
IsValidDirectionForAutoDetect
 Tests if the supplied direction is valid for Analytical Auto-detect.
IsValidForManualAdjustment
 Indicates if the identified reference is acceptable for Manual Analytical Adjustment.
IsValidManualAdjustmentSource
 Indicates if the identified reference is acceptable as a source for Manual Analytical Adjustment.
IsValidManualAdjustmentTarget
 Indicates if reference is acceptable as a "Target" for Manual Analytical Adjustment.
IsValidRigidLinksOption
 Indicates if Rigid Links option is valid for the Analytical Model.
IsValidSelector
 Indicates if the input selector is valid for the Analytical Model.
ManuallyAdjust
 Perform Manual Analytical Adjustment on analytical model, with respect to another Element
ResetLinks
 The function is trying to recreate analytical link elements that were deleted by the user.
ResetManualAdjustment
 Resets all manual adjustments performed by the user onto the Analytical Model.
SetAnalyzeAs
 Sets value of Analyze As parameter for this Element.
SetApproximationDeviation
 Adjusts the amount by which approximation is made.
SetOffset
 Sets the offset of the analytical model at end.
SetUsesHardPoints
 Sets Hard Points for the Analytical Model.
SupportsManualAdjustment
 Indicates if the Element supports Manual Analytical Adjustment.
UsesHardPoints
 Indicates if the Analytical Model is using Hard Points during approximation.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace