Revit 2022 API
TransformWithBoundary Methods
The TransformWithBoundary type exposes the following members.
Methods
Name | Description
Dispose
See Also
TransformWithBoundary Class
Autodesk.Revit.DB Namespace