Revit 2022 API
GeometryInstance Methods
The GeometryInstance type exposes the following members.
Methods
Name | Description
GetInstanceGeometry()
Computes the geometric representation of the instance.
GetInstanceGeometry(Transform)
Computes a transformation of the geometric representation of the instance.
GetSymbolGeometry()
Computes the geometric representation of the symbol which generates this instance.
GetSymbolGeometry(Transform)
Computes a transformation of the geometric representation of the symbol which generates this instance.
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace