Revit 2022 API
SetupEnergySimulationDialog Methods
The SetupEnergySimulationDialog type exposes the following members.
Methods
Name | Description
Dispose
Show
 Shows the SetupEnergySimulationDialog to the user as a modal dialog.
See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace