Revit 2022 API
Definition Members
The Definition type exposes the following members.
Methods
Name | Description
GetDataType
 Gets a ForgeTypeId identifying the data type describing values of the parameter.
GetGroupTypeId
 Returns the identifier of the parameter definition's parameter group.
GetSpecTypeId |  Obsolete.
 Gets the identifier of the spec describing values of the parameter.
Properties
Name | Description
Name
The user visible name for the parameter.
ParameterGroup
 Returns the group ID of the parameter definition.
ParameterType |  Obsolete.
Returns the user visible interpretation of the parameter data.
See Also
Definition Class
Autodesk.Revit.DB Namespace