Revit 2022 API
AnalyticalModelSurface Properties
The AnalyticalModelSurface type exposes the following members.
Properties
Name | Description
AlignmentMethod
 The alignment method option.
BottomExtension
 The bottom extension option.
BottomExtensionMethod
 The bottom extension method option.
BottomExtensionPlaneId
 The bottom extension plane ID option.
HasExtension
 Indicates if the element supports an extension option.
ProjectionPlaneZ
 The Z projection option.
ProjectionZ
 The Z projection option.
TopExtension
 The top extension option.
TopExtensionMethod
 The top extension method option.
TopExtensionPlaneId
 The top extension plane ID option.
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace