Revit 2022 API
AnalyticalModel Properties
The AnalyticalModel type exposes the following members.
Properties
Name | Description
RigidLinksOption
 Indicates if parameters indicate if Rigid Links should be formed.
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace