Revit 2022 API
FilledRegion Methods
The FilledRegion type exposes the following members.
Methods
Name | Description
Create
 Creates a filled region from the given boundaries.
GetBoundaries
 Gets the boundaries.
GetValidLineStyleIdsForFilledRegion
 Gets the line style Ids which are permitted to be assigned to a filled region.
IsValidFilledRegionTypeId
 Indicates whether the given Id is a valid filled region type Id.
IsValidLineStyleIdForFilledRegion
 Indicates whether the given Id is a valid line style Id.
SetLineStyleId
 Sets the line style Id for all boundaries.
See Also
FilledRegion Class
Autodesk.Revit.DB Namespace