Revit 2021.1 API
AssetPropertyDistance Properties
The AssetPropertyDistance type exposes the following members.
Properties
Name | Description
DisplayUnitType |  Obsolete.
 Unit distance.
Value
 Value of the property.
See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace