Revit 2021.1 API
StairsEditScope Properties
The StairsEditScope type exposes the following members.
Properties
Name | Description
IsPermitted
 Tells if the StairsEditScope is permitted to start.
See Also
StairsEditScope Class
Autodesk.Revit.DB Namespace