Revit 2021.1 API
InternalDefinition Methods
The InternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
SetAllowVaryBetweenGroups
 Whether or not the parameter values can vary across group members.
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace