Revit 2021.1 API
AreaReinforcement Methods
The AreaReinforcement type exposes the following members.
Methods
Name | Description
Create(Document, Element, XYZ, ElementId, ElementId, ElementId)
 Creates a new AreaReinforcement object based on a host boundary.
Create(Document, Element, IList<Curve>, XYZ, ElementId, ElementId, ElementId)
 Creates a new AreaReinforcement object from an array of curves. This method replaces the NewAreaReinforcement method, which has been deprecated.
GetBoundaryCurveIds
 Retrieves the set of curves forming the boundary of the Area Reinforcement.
GetHostId
 The element that contains the Area Reinforcement.
GetRebarInSystemIds
 Returns the ids of the RebarInSystem elements owned by the AreaReinforcement element.
IsSolidInView
 Checks if this Area Reinforcement is shown solidly in a 3D view.
IsUnobscuredInView
 Checks if Area Reinforcement is shown unobscured in a view.
RemoveAreaReinforcementSystem
 Deletes the specified AreaReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
SetSolidInView
 Sets this Area Reinforcement to be shown solidly in a 3D view.
SetUnobscuredInView
 Sets Area Reinforcement to be shown unobscured in a view.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace