Revit 2021.1 API
FormatOptions Methods
The FormatOptions type exposes the following members.
Methods
Name | Description
CanHaveSymbol()
 Checks whether a symbol can be specified to display the unit in this FormatOptions.
CanHaveSymbol(ForgeTypeId)
 Checks whether a symbol can be specified to display a given unit.
CanHaveUnitSymbol() |  Obsolete.
 Checks whether a unit symbol can be specified for the display unit in this FormatOptions.
CanHaveUnitSymbol(DisplayUnitType) |  Obsolete.
 Checks whether a unit symbol can be specified for a given display unit.
CanSuppressLeadingZeros()
 Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressLeadingZeros(DisplayUnitType) |  Obsolete.
 Checks whether leading zeros can be suppressed for a given display unit.
CanSuppressLeadingZeros(ForgeTypeId)
 Checks whether leading zeros can be suppressed for a given unit.
CanSuppressSpaces()
 Checks whether spaces can be suppressed for the display unit in this FormatOptions.
CanSuppressSpaces(DisplayUnitType) |  Obsolete.
 Checks whether spaces can be suppressed for a given display unit.
CanSuppressSpaces(ForgeTypeId)
 Checks whether spaces can be suppressed for a given unit.
CanSuppressTrailingZeros()
 Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressTrailingZeros(DisplayUnitType) |  Obsolete.
 Checks whether trailing zeros can be suppressed for a given display unit.
CanSuppressTrailingZeros(ForgeTypeId)
 Checks whether trailing zeros can be suppressed for a given unit.
CanUsePlusPrefix()
 Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
CanUsePlusPrefix(DisplayUnitType) |  Obsolete.
 Checks whether a plus prefix can be displayed for a given display unit.
CanUsePlusPrefix(ForgeTypeId)
 Checks whether a plus prefix can be displayed for a given unit.
Dispose
GetSymbolTypeId
 Gets the identifier of the symbol indicating the unit quantifying the value.
GetUnitTypeId
 Gets the identifier of the unit used to quantify values.
GetValidSymbols()
 Gets the identifiers of all valid symbols for the unit in this FormatOptions.
GetValidSymbols(ForgeTypeId)
 Gets the identifiers of all valid symbols for a given unit.
GetValidUnitSymbols() |  Obsolete.
 Gets all valid unit symbols for the display unit in this FormatOptions.
GetValidUnitSymbols(DisplayUnitType) |  Obsolete.
 Gets all valid unit symbols for a given display unit.
IsValidAccuracy(Double)
 Checks whether an accuracy is valid for the display unit in this FormatOptions.
IsValidAccuracy(DisplayUnitType, Double) |  Obsolete.
 Checks whether an accuracy is valid for a given display unit.
IsValidAccuracy(ForgeTypeId, Double)
 Checks whether an accuracy is valid for a given unit.
IsValidForSpec
 Checks whether this FormatOptions is valid for a given spec.
IsValidForUnitType |  Obsolete.
 Checks whether this FormatOptions is valid for a given unit type.
IsValidSymbol(ForgeTypeId)
 Checks whether a symbol is valid for the unit in this FormatOptions.
IsValidSymbol(ForgeTypeId, ForgeTypeId)
 Checks whether a symbol is valid for a given unit.
IsValidUnitSymbol(UnitSymbolType) |  Obsolete.
 Checks whether a unit symbol is valid for the display unit in this FormatOptions.
IsValidUnitSymbol(DisplayUnitType, UnitSymbolType) |  Obsolete.
 Checks whether a unit symbol is valid for a given display unit.
SetSymbolTypeId
 Sets the symbol that should be displayed to indicate the unit quantifying the value.
SetUnitTypeId
 Sets the unit used to quantify values.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace