Revit 2021.1 API
RebarBarType Properties
The RebarBarType type exposes the following members.
Properties
Name | Description
BarDiameter
 Defines bar diameter of rebar
DeformationType
 Defines bar deformation type.
MaximumBendRadius
 Defines maximum bend radius of rebar
StandardBendDiameter
 Defines bar bend diameter for rebar whose style is standard
StandardHookBendDiameter
 Defines hook bend diameter for rebar whose style is standard
StirrupTieBendDiameter
 Defines bar and hook bend diameter for rebar whose style is stirrup/tie
See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace