Revit 2021.1 API
CorrectionFactor Members
The CorrectionFactor type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Factor
 Get factor value of wire correction factor.
Temperature
 Get temperature which is used for specifying correction factor.
See Also
CorrectionFactor Class
Autodesk.Revit.DB.Electrical Namespace