Revit 2021.1 API
View3D Properties
The View3D type exposes the following members.
Properties
Name | Description
IsLocked
 Indicates if the view is locked.
IsPerspective
 Identifies whether this is a perspective view.
IsSectionBoxActive
 Identifies whether or not the section box is active in this 3D view.
See Also
View3D Class
Autodesk.Revit.DB Namespace