Revit 2021.1 API
Sketch Members
The Sketch type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Profile
Returns the Profile of the Sketch.
SketchPlane
Returns the Sketch Plane of the Sketch.
See Also
Sketch Class
Autodesk.Revit.DB Namespace