Revit 2021.1 API
DGNExportOptions Properties
The DGNExportOptions type exposes the following members.
Properties
Name | Description
FileVersion
 The DGN file version. Default value of fileVersion is DGNFileFormat.Default.
MasterUnits |  Obsolete.
 The master units. Default value of masterUnits is true.
MergedViews
 Whether to merge all views in one file (via XRefs). Default value of mergedViews is false.
SeedName
 The name of the DGN seed. Default value of seedName is empty.
WorkingUnits
 If true, Master Units will be used. If false, Sub Units will be used. Default value of WorkingUnits is true.
See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace