Revit 2021.1 API
IndependentTag Methods
The IndependentTag type exposes the following members.
Methods
Name | Description
CanLeaderEndConditionBeAssigned
 Checks whether the LeaderEndCondition can be changed.
Create(Document, ElementId, ElementId, Reference, Boolean, TagOrientation, XYZ)
 Places a tag on an element or subelement.
Create(Document, ElementId, Reference, Boolean, TagMode, TagOrientation, XYZ)
 Places a tag on an element or subelement.
GetTaggedLocalElement
 Get the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element.
GetTaggedReference
 Get the host reference of the tag.
IsTaggedOnSubelement
 Returns true if the tag is tagged on a subelement.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace