Revit 2021.1 API
IndependentTag Members
The IndependentTag type exposes the following members.
Methods
Name | Description
CanLeaderEndConditionBeAssigned
 Checks whether the LeaderEndCondition can be changed.
Create(Document, ElementId, ElementId, Reference, Boolean, TagOrientation, XYZ)
 Places a tag on an element or subelement.
Create(Document, ElementId, Reference, Boolean, TagMode, TagOrientation, XYZ)
 Places a tag on an element or subelement.
GetTaggedLocalElement
 Get the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element.
GetTaggedReference
 Get the host reference of the tag.
IsTaggedOnSubelement
 Returns true if the tag is tagged on a subelement.
Properties
Name | Description
HasElbow
 Whether the tag's leader has an elbow point or not.
HasLeader
 Whether the tag has a leader or not.
IsMaterialTag
 Identifies if it is a material tag or not.
IsMulticategoryTag
 Identifies if it is a multi-category tag or not.
IsOrphaned
 Identifies if the tag is orphaned or not.
LeaderElbow
 The position of the elbow of the tag's leader.
LeaderEnd
 The position of the leader end for a tag using free end leader behavior.
LeaderEndCondition
 The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
MultiReferenceAnnotationId
 The multi-reference annotation which owns this tag.
TaggedElementId
 The LinkElementId of the tagged element. If the tag is tagged on a subelement of linked element, it returns the LinkElementId of the element.
TaggedLocalElementId
 The ID of the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element ID.
TagHeadPosition
 The position of the head of tag in model coordinates.
TagOrientation
 The tag orientation of the tag's head, such as horizontal or vertical.
TagText
 The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace