Revit 2021.1 API
SpotDimension Members
The SpotDimension type exposes the following members.
Methods
Name | Description
Properties
Name | Description
LeaderHasShoulder
 True is dimension has leader with shoulder, false otherwise.
LeaderShoulderPosition
 Position of spot dimension's leader shoulder point.
SpotDimensionType
 The dimension style of this dimension.
See Also
SpotDimension Class
Autodesk.Revit.DB Namespace