Revit 2021.1 API
TopographyEditScope Properties
The TopographyEditScope type exposes the following members.
Properties
Name | Description
IsPermitted
 Tests if the TopographyEditScope is permitted to start.
See Also
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace