Revit 2021.1 API
ImageType Methods
The ImageType type exposes the following members.
Methods
Name | Description
CanReload
 Check whether the ImageType can be reloaded from file.
Create(Document, ImageTypeOptions)
 Creates a new ImageType element and loads the image into it.
Create(Document, String) |  Obsolete.
 Creates a new ImageType element and loads the image into it.
GetImage
Get the bitmap image stored in the image symbol.
IsLoadedFromFile |  Obsolete.
 Checks whether the ImageType was loaded from a file. Revit may generate some ImageTypes internally, such as the ImageTypes created by "Save to Project as Image".
Reload
 Reloads the ImageType from the file found at the location specified by the Path property, using the same PageNumber and resolution.
ReloadFrom(String) |  Obsolete.
 Reloads the ImageType from a new image file.
ReloadFrom(ImageTypeOptions)
 Reloads the image in the ImageType from a new image file, and for a new PageNumber.
Unload
 Unload the linked image.
See Also
ImageType Class
Autodesk.Revit.DB Namespace