Revit 2021.1 API
ShapeImporter Methods
The ShapeImporter type exposes the following members.
Methods
Name | Description
Convert
 Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose
IsServiceAvailable
 Checks whether the data conversion service is available.
SetDefaultLengthUnit
 Sets the length unit to be used if not specified in the input SAT file.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace