Revit 2021.1 API
DimensionType Properties
The DimensionType type exposes the following members.
Properties
Name | Description
AlternateUnits
 The alternate units display mode for this DimensionType.
AlternateUnitsPrefix
 The prefix text for the alternate units value.
AlternateUnitsSuffix
 The suffix text for the alternate units value.
StyleType
 The dimension style type of this DimensionType.
UnitType |  Obsolete.
 The unit type of this dimension style.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace