Revit 2021.1 API
Viewport Properties
The Viewport type exposes the following members.
Properties
Name | Description
Rotation
 The rotation of the viewport on the sheet.
SheetId
 The element id of the ViewSheet on which the viewport appears, or InvalidElementId if this viewport does not associate a view with placement onto a sheet.
ViewId
 The element id of the associated View.
See Also
Viewport Class
Autodesk.Revit.DB Namespace