Revit 2021.1 API
MEPModel Properties
The MEPModel type exposes the following members.
Properties
Name | Description
AssignedElectricalSystems |  Obsolete.
Retrieves the electrical systems this electrical panel currently is assigned to.
ConnectorManager
 Retrieves the Connector Manager from this MEPModel.
ElectricalSystems |  Obsolete.
Retrieves the electrical systems that are currently created using this MEPModel.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace