Revit 2021.1 API
Definition Methods
The Definition type exposes the following members.
Methods
Name | Description
GetSpecTypeId
 Gets the identifier of the spec describing values of the parameter.
See Also
Definition Class
Autodesk.Revit.DB Namespace