Revit 2021.1 API
Field Methods
The Field type exposes the following members.
Methods
Name | Description
CompatibleDisplayUnitType |  Obsolete.
 Checks if the specified type is compatible with the field description.
CompatibleUnit
 Checks if the specified unit is compatible with the field description.
Dispose
GetSpecTypeId
 Gets the spec describing the values stored in this field.
SubEntityReadAccessGranted
 Checks whether there is read access to subentities storable in this field.
SubEntityWriteAccessGranted
 Checks whether there is write access to subentities storable in this field.
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace