Revit 2021.1 API
Floor Properties
The Floor type exposes the following members.
Properties
Name | Description
FloorType
Retrieves/set an object that represents the type of the floor.
SlabShapeEditor
Get the SlabShapeEditor used for slab shape editing.
SpanDirectionAngle
Retrieve the span direction angle of the floor
See Also
Floor Class
Autodesk.Revit.DB Namespace