Revit 2021.1 API
DocumentSavedAsEventArgs Properties
The DocumentSavedAsEventArgs type exposes the following members.
Properties
Name | Description
IsSavingAsCentralFile
 Indicates whether the document is to be saved as central file.
IsSavingAsMasterFile |  Obsolete.
 Indicates whether the document is to be saved as master file.
OriginalPath
 Original path of the document.
See Also
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace