Revit 2021.1 API
RebarInSystem Methods
The RebarInSystem type exposes the following members.
Methods
Name | Description
CanApplyPresentationMode
 Checks if a presentation mode can be applied for this rebar in the given view.
ClearPresentationMode
 Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
DoesBarExistAtPosition
 Checks whether a bar exists at the specified position.
FindMatchingPredefinedPresentationMode
 Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetBarPositionTransform
 Return a transform representing the relative position of any individual bar in the set.
GetBendData
 Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves
 A chain of curves representing the centerline of the rebar.
GetDistributionPath
 The distribution path of a rebar set.
GetHookTypeId
 Get the id of the RebarHookType to be applied to the rebar.
GetHostId
 The element that contains the rebar.
GetPresentationMode
 Gets the presentaion mode for this rebar set when displayed in the given view.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
HasPresentationOverrides
 Identifies if this RebarInSystem has overridden default presentation settings for the given view.
IsBarHidden
 Identifies if a given bar in this rebar set is hidden in this view.
IsRebarInSection
 Identifies if this RebarInSystem is shown as a cross-section in the given view.
IsSolidInView
 Checks if this rebar element is shown solidly in a 3D view.
IsUnobscuredInView
 Checks if this rebar element is shown unobscured in a view.
SetBarHiddenStatus
 Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetPresentationMode
 Sets the presentation mode for this rebar set when displayed in the given view.
SetSolidInView
 Sets this rebar element to be shown solidly in a 3D view.
SetUnobscuredInView
 Sets RebarInSystem element to be shown unobscured in a view.
See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace