Revit 2021.1 API
ExternalDefinitionCreationOptions Methods
The ExternalDefinitionCreationOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace