Revit 2021.1 API
Sketch Properties
The Sketch type exposes the following members.
Properties
Name | Description
Profile
Returns the Profile of the Sketch.
SketchPlane
Returns the Sketch Plane of the Sketch.
See Also
Sketch Class
Autodesk.Revit.DB Namespace