Revit 2021.1 API
Wall Members
The Wall type exposes the following members.
Methods
Name | Description
Create(Document, IList<Curve>, Boolean)
 Creates a non rectangular profile wall within the project using the default wall type.
Create(Document, Curve, ElementId, Boolean)
 Creates a new rectangular profile wall within the project using the default wall style.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean)
 Creates a non rectangular profile wall within the project using the specified wall type.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean, XYZ)
 Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean)
 Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
Flip
 The wall orientation will be flipped.
GetStackedWallMemberIds
 Get the sub walls which belongs to the wall.
Properties
Name | Description
CurtainGrid
 Get the grid object of a curtain wall
Flipped
 Property to test whether the wall orientation is flipped.
IsStackedWall
 Identifies if the wall is a stacked wall.
IsStackedWallMember
 Identifies if the wall is a member of a stacked wall.
Orientation
 The normal vector projected from the exterior side of the wall.
StackedWallOwnerId
 Gets the stacked wall which contains this stacked wall member.
StructuralUsage
 Retrieves or changes the wall's designated structural usage.
WallType
Retrieves or changes the type of the wall.
Width
 Get the overall thickness of the wall.
See Also
Wall Class
Autodesk.Revit.DB Namespace