Revit 2021.1 API
Dimension Methods
The Dimension type exposes the following members.
Methods
Name | Description
IsTextPositionAdjustable
 Indicates if this dimension is supported to set/get TextPosition/LeaderEndPosition.
ResetTextPosition
 Resets the text position of the dimension to the initial position determined by its type and parameters.
See Also
Dimension Class
Autodesk.Revit.DB Namespace