Revit 2021.1 API
Definition Members
The Definition type exposes the following members.
Methods
Name | Description
GetSpecTypeId
 Gets the identifier of the spec describing values of the parameter.
Properties
Name | Description
Name
The user visible name for the parameter.
ParameterGroup
 Returns the group ID of the parameter definition.
ParameterType
Returns the user visible interpretation of the parameter data.
UnitType |  Obsolete.
 Returns the UnitType of the parameter definition.
See Also
Definition Class
Autodesk.Revit.DB Namespace