Revit 2021.1 API
Wall Methods
The Wall type exposes the following members.
Methods
Name | Description
Create(Document, IList<Curve>, Boolean)
 Creates a non rectangular profile wall within the project using the default wall type.
Create(Document, Curve, ElementId, Boolean)
 Creates a new rectangular profile wall within the project using the default wall style.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean)
 Creates a non rectangular profile wall within the project using the specified wall type.
Create(Document, IList<Curve>, ElementId, ElementId, Boolean, XYZ)
 Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean)
 Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
Flip
 The wall orientation will be flipped.
GetStackedWallMemberIds
 Get the sub walls which belongs to the wall.
See Also
Wall Class
Autodesk.Revit.DB Namespace