Revit 2021.1 API
DocumentSavingAsEventArgs Properties
The DocumentSavingAsEventArgs type exposes the following members.
Properties
Name | Description
IsSavingAsCentralFile
 Indicates whether the document is to be saved as central file.
IsSavingAsMasterFile |  Obsolete.
 Indicates whether the document is to be saved as master file.
PathName
 Target path to which the document is to be saved.
See Also
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace