Revit 2021.1 API
OptionalFunctionalityUtils Methods
The OptionalFunctionalityUtils type exposes the following members.
Methods
Name | Description
IsDGNExportAvailable
 Checks whether the DGN Export functionality is available in the installed Revit.
IsDGNImportLinkAvailable
 Checks whether the DGN Import/Link functionality is available in the installed Revit.
IsDWFExportAvailable
 Checks whether the DWF/DWFx Export functionality is available in the installed Revit.
IsDWGExportAvailable
 Checks whether the DWG Export functionality is available in the installed Revit.
IsDWGImportLinkAvailable
 Checks whether the DWG Import/Link functionality is available in the installed Revit.
IsDXFExportAvailable
 Checks whether the DXF Export functionality is available in the installed Revit.
IsFBXExportAvailable
 Checks whether the FBX Export functionality is available in the installed Revit.
IsGraphicsAvailable
 Checks whether the graphics functionality is available to support display, print, and export functionality.
IsIFCAvailable
 Checks whether IFC functionality is available in the installed Revit.
IsNavisworksExporterAvailable
 Checks whether a Navisworks Exporter is available in the installed Revit.
IsPDFImportAvailable
 Checks whether PDF import is available in the installed Revit.
IsSATImportLinkAvailable
 Checks whether the SAT Import/Link functionality is available in the installed Revit.
IsShapeImporterAvailable
 Checks whether the ShapeImporter functionality is available in the installed Revit.
IsSKPImportLinkAvailable
 Checks whether the SKP Import/Link functionality is available in the installed Revit.
See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace