Revit 2021.1 API
PointCloudType Methods
The PointCloudType type exposes the following members.
Methods
Name | Description
Create
 Creates a new point cloud type for a given point cloud engine.
GetPath
 Gets the path of the link source from which the points are loaded.
See Also
PointCloudType Class
Autodesk.Revit.DB Namespace