Revit 2021.1 API
ModelPath Methods
The ModelPath type exposes the following members.
Methods
Name | Description
Compare
 Compares this ModelPath with another
Dispose
GetModelGUID
 A GUID identifying the Revit cloud model.
GetProjectGUID
 A GUID identifying the BIM 360 project to which the model is associated.
See Also
ModelPath Class
Autodesk.Revit.DB Namespace