Revit 2027 API
ImageExportOptions Methods
The ImageExportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetFileName |  Gets the file name that will be produced when exporting a view to an image.
GetViewsAndSheets |  Gets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.
IsValidFileName |  Verify if File name is valid
IsValidForSaveToProjectAsImage |  Verify if ImageExportOptions object is valid for calling saveToProjectAsImage
SetViewsAndSheets |  Sets a list of views and sheets to be exported. Used only when ExportRange is SetOfViews.
Top
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace