Revit 2027 API
ParameterAccess Class
 Provides a common mechanism to access parameters, including extended properties.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterAccess
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ParameterAccess : IDisposable
Public Class ParameterAccess
	Implements IDisposable
public ref class ParameterAccess : IDisposable
type ParameterAccess =
    class
        interface IDisposable
    end
The ParameterAccess type exposes the following members.
Constructors
Name | Description
ParameterAccess |  Constructs a new ParameterAccess object bound to the given host document.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ParameterAccess
GetParameter(ElementId, ElementId) |  Retrieves the parameter value for the parameter on the given element.
GetParameter(LinkElementId, Document, ElementId) |  Retrieves the parameter value for the parameter belonging to the parameter document on the given element.
ListParameters(ElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
ListParameters(LinkElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
Top
See Also
Reference
Autodesk.Revit.DB Namespace