Revit 2027 API
DXFExportOptions Class
 The export options used by exporting DXF format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DXFExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DXFExportOptions : ACADExportOptions
Public Class DXFExportOptions
	Inherits ACADExportOptions
public ref class DXFExportOptions : public ACADExportOptions
type DXFExportOptions =
    class
        inherit ACADExportOptions
    end
The DXFExportOptions type exposes the following members.
Constructors
Name | Description
DXFExportOptions() |  Constructs a new instance of DXFImportOptions with default values of all properties.
DXFExportOptions(DXFExportOptions) |  Constructs a new instance of DXFImportOptions as a copy of the export options.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetPredefinedOptions |  Returns an instance DXFExportOptions containing settings from a predefined export setup.
Top
See Also
Reference
Autodesk.Revit.DB Namespace