Revit 2027 API
MeshTriangle Class
One triangle of a mesh.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MeshTriangle
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MeshTriangle
Public Class MeshTriangle
public ref class MeshTriangle
type MeshTriangle = class end
The MeshTriangle type exposes the following members.
Properties
Name | Description
Index | The index of the vertex in the Vertices array of the mesh, for indexed access.
Vertex | A vertex of the triangle.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace