Revit 2027 API
RoofType Class
 Represents a specific type of roof.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.RoofType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoofType : HostObjAttributes
Public Class RoofType
	Inherits HostObjAttributes
public ref class RoofType : public HostObjAttributes
type RoofType =
    class
        inherit HostObjAttributes
    end
The RoofType type exposes the following members.
Properties
Name | Description
ThermalProperties |  The calculated and settable thermal properties of the RoofType
Top
Methods
Name | Description
Top
Remarks
 All roof type objects available in the project can be retrieved from the Document object via the RoofTypes property. Every Roof object has a RoofType property that returns a RoofType object representing the type. This same RoofType property can also be used to change the type of the roof by setting it to a different type.
See Also
Reference
Autodesk.Revit.DB Namespace