Revit 2027 API
ValueAtPoint Class
 Stores values at one domain point. Each value corresponds to a "measurement" for which this value was calculated.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueAtPointBase
 Autodesk.Revit.DB.Analysis.ValueAtPoint
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ValueAtPoint : ValueAtPointBase
Public Class ValueAtPoint
	Inherits ValueAtPointBase
public ref class ValueAtPoint : public ValueAtPointBase
type ValueAtPoint =
    class
        inherit ValueAtPointBase
    end
The ValueAtPoint type exposes the following members.
Constructors
Name | Description
ValueAtPoint(IList<Double>) |  Creates object from an array of values
ValueAtPoint(ValueAtPoint) |  Creates a copy of the given ValueAtPoint instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace