Revit 2027 API
ContourSettingItem Class
 Contour setting item that stores the information of a single contour or a set of contours.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ContourSettingItem
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ContourSettingItem : IDisposable
Public Class ContourSettingItem
	Implements IDisposable
public ref class ContourSettingItem : IDisposable
type ContourSettingItem =
    class
        interface IDisposable
    end
The ContourSettingItem type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Start |  The contour range start elevation.
Step |  The increment elevation of the contour range.
Stop |  The contour range stop elevation.
SubCategoryId |  The contour line style subcategory id.
Type |  The contour setting item type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ContourSettingItem
Top
See Also
Reference
Autodesk.Revit.DB Namespace