Revit 2027 API
ReferenceArrayArray Properties
The ReferenceArrayArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a ReferenceArray at a specified index within the array.
Size | Returns the number of ReferenceArrays that are in the array.
Top
See Also
Reference
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace