Revit 2027 API
TextNoteOptions Methods
The TextNoteOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
TextNoteOptions Class
Autodesk.Revit.DB Namespace