Revit 2027 API
AnalyticalSurfaceBase Properties
The AnalyticalSurfaceBase type exposes the following members.
Properties
Name | Description
SketchId |  Sketch associated to this Revit element.
Top
See Also
Reference
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace