Revit 2027 API
DoubleClickOptions Methods
The DoubleClickOptions type exposes the following members.
Methods
Name | Description
Dispose
GetAction |  Returns the active user's desired action for a particular double-click target.
GetDoubleClickOptions |  Returns the current user's DoubleClickOptions.
IsSupportedAction |  Checks whether the specified double-click target supports the specified action.
SetAction |  Changes the double-click action associated with a specified target.
Top
See Also
Reference
DoubleClickOptions Class
Autodesk.Revit.UI Namespace