Revit 2027 API
TextElement Class
 Base class representing text elements in Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.TextElement
 Autodesk.Revit.DB.AnnotationLabel
 Autodesk.Revit.DB.TextNote
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextElement : Element
Public Class TextElement
	Inherits Element
public ref class TextElement : public Element
type TextElement =
    class
        inherit Element
    end
The TextElement type exposes the following members.
Properties
Name | Description
BaseDirection |  Direction of the base line of the text element.
Coord |  Position of the text (in model coordinates.)
Height |  Height of the area of the text content.
HorizontalAlignment |  Horizontal alignment of the text content within the text area of the element.
IsTextWrappingActive
 A flag identifying whether text-wrapping is currently active in this text element or not.
 If text wrapping is active the width of the text box remains constant and the text will wrap. The height of the text box will automatically adjust to accomodate the height of the text.
 If text wrapping is not active the text does not wrap and the width of the text box adjusts with the width of the longest line of text. As the text width changes, the position of the text may change depending on the HorizontalAlignment
KeepRotatedTextReadable |  A flag to control how text behaves inside a rotated text element.
Symbol | Get the type of the TextElement object.
Text |  The content of the element as a plain string stripped of all formating.
UpDirection |  Direction along the vertical axis of letters of the text note.
VerticalAlignment |  Vertical alignment of the text.
Width |  Width of the area of the text content.
Top
Methods
Name | Description
GetMaximumAllowedWidth() |  Returns the maximum width the text element can be assigned.
GetMaximumAllowedWidth(Document, ElementId) |  Returns the maximum width the text element can be created with.
GetMinimumAllowedWidth() |  Returns the minimum width the text element can be assigned.
GetMinimumAllowedWidth(Document, ElementId) |  Returns the minimum width a text element can be created with.
Top
Remarks
 TextElement is a base class for other annotation classes, like TextNote, which have additional, more specific functionality.
See Also
Reference
Autodesk.Revit.DB Namespace