Revit 2027 API
RegenerationAttribute Class
 The custom regeneration attribute to control the regeneration behavior of the external command or external application.
Inheritance Hierarchy
System.Object
 System.Attribute
 Autodesk.Revit.Attributes.RegenerationAttribute
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RegenerationAttribute : Attribute
Public Class RegenerationAttribute
	Inherits Attribute
public ref class RegenerationAttribute : public Attribute
type RegenerationAttribute =
    class
        inherit Attribute
    end
The RegenerationAttribute type exposes the following members.
Constructors
Name | Description
RegenerationAttribute | Constructs a new RegenerationAttribute.
Top
Properties
Name | Description
Option | Regeneration option.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.Attributes Namespace