Revit 2027 API
DataStorage Class
 An element which allows an API applications to organize and store data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ExtensibleStorage.DataStorage
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DataStorage : Element
Public Class DataStorage
	Inherits Element
public ref class DataStorage : public Element
type DataStorage =
    class
        inherit Element
    end
The DataStorage type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new DataStorage element and adds it to the document.
Top
Remarks
 Applications can create instances of these elements to logically organize different sets of ExtensibleStorage entities into separate elements. This allows an application to update one set of data in a local workshared project without locking other elements.
See Also
Reference
Autodesk.Revit.DB.ExtensibleStorage Namespace