Revit 2027 API
DimensionEqualityLabelFormatting Class
 Instances of this class represent individual parameters used to make up a dimension equality formula for continuous linear or angular dimensions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DimensionEqualityLabelFormatting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DimensionEqualityLabelFormatting : IDisposable
Public Class DimensionEqualityLabelFormatting
	Implements IDisposable
public ref class DimensionEqualityLabelFormatting : IDisposable
type DimensionEqualityLabelFormatting =
    class
        interface IDisposable
    end
The DimensionEqualityLabelFormatting type exposes the following members.
Constructors
Name | Description
DimensionEqualityLabelFormatting |  Constructs a new instance of a DimensionEqualityLabelFormatting object with specified settings.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LabelType |  The parameter value to be shown.
LeadingSpaces |  The number of spaces to include before the parameter value.
Prefix |  The prefix to include before the parameter value.
Suffix |  The suffix to include after the parameter value.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DimensionEqualityLabelFormatting
GetFormatOptions |  Gets the format options used to show the parameter value.
IsValidFormatOptions |  Checks whether a FormatOptions object is valid for the LabelType.
SetFormatOptions |  Sets the format options used to show the parameter value.
Top
See Also
Reference
Autodesk.Revit.DB Namespace