Revit 2027 API
SpaceSetIterator Properties
The SpaceSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
SpaceSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace