Revit 2027 API
RebarShapeTerminationsData Class
 Class that stores data about rebar shape's terminations (e.g. hooks, cranks, end treatments)
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeTerminationsData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeTerminationsData : IDisposable
Public Class RebarShapeTerminationsData
	Implements IDisposable
public ref class RebarShapeTerminationsData : IDisposable
type RebarShapeTerminationsData =
    class
        interface IDisposable
    end
The RebarShapeTerminationsData type exposes the following members.
Constructors
Name | Description
RebarShapeTerminationsData |  Creates a new instance of RebarShapeTerminationData with the default values.
Top
Properties
Name | Description
EndTreatmentTypeIdAtEnd |  Identifies the end treatement type at the end of the rebar shape. Setting this property to a valid value, will set the HookAngleAtEnd to 0 and HasCrankAtEnd to false.
EndTreatmentTypeIdAtStart |  Identifies the end treatment type at the start of the rebar shape. Setting this property to a valid value, will set the HookAngleAtStart to 0 and HasCrankAtStart to false.
HasCrankAtEnd |  Identifies if the rebar shape has crank at end. Setting this property to true, will set the HookAngleAtEnd to 0 and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
HasCrankAtStart |  Identifies if the rebar shape has crank at start. Setting this property to true, will set the HookAngleAtStart to 0 and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
HookAngleAtEnd |  Identifies the hook angle (in degrees) at the end of the rebar shape. The angle must be at least 0 and no more than 180. In case it is 0 it will be considered that the shape doesn't have a hook. Common values are 0, 90, 135, and 180. Setting this property to a value strictly greater than 0 and less or almost equal with 180 will set the HasCrankAtEnd to false and EndTreatmentTypeIdAtEnd to ElementId.InvalidElementId.
HookAngleAtStart |  Identifies the hook angle (in degrees) at the start of the rebar shape. The angle must be at least 0 and no more than 180. In case it is 0 it will be considered that the shape doesn't have a hook. Common values are 0, 90, 135, and 180. Setting this property to a value strictly greater than 0 and less or almost equal with 180 will set the HasCrankAtStart to false and EndTreatmentTypeIdAtStart to ElementId.InvalidElementId.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TerminationOrientationAtEnd
Identifies the orientation of the termination (e.g. hook, crank) at end.
The default value is Left.
TerminationOrientationAtStart
Identifies the orientation of the termination (e.g. hook, crank) at start.
The default value is Left.
TerminationRotationAngleAtEnd
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of the rebar shape.
The default value is 0.
TerminationRotationAngleAtStart
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the start of the rebar shape.
The default value is 0.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarShapeTerminationsData
GetDocument |  Gets the document containing the end treatment ids.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace