Revit 2027 API
LoadTypeBase Class
 The base class for LoadTypes
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.LoadTypeBase
 Autodesk.Revit.DB.Structure.AreaLoadType
 Autodesk.Revit.DB.Structure.LineLoadType
 Autodesk.Revit.DB.Structure.PointLoadType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LoadTypeBase : ElementType
Public Class LoadTypeBase
	Inherits ElementType
public ref class LoadTypeBase : public ElementType
type LoadTypeBase =
    class
        inherit ElementType
    end
The LoadTypeBase type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace