Revit 2027 API
IntegerParameterValue Properties
The IntegerParameterValue type exposes the following members.
Properties
Name | Description
Value |  The stored value
Top
See Also
Reference
IntegerParameterValue Class
Autodesk.Revit.DB Namespace