Revit 2027 API
WireType Properties
The WireType type exposes the following members.
Properties
Name | Description
Conduit |  The conduit type of the wire type.
Insulation |  The conductor insulation material of the wire type.
IsInUse |  Indicates whether the wire type is in use.
MaxSize |  The max conductor size name of the wire type.
NeutralMultiplier |  The neutral multiplier type of the wire type.
NeutralRequired |  Whether or not the neutral point is required.
NeutralSize |  The maximum neutral size of the wire type.
TemperatureRating |  The conductor temperature rating of the wire type.
WireMaterial |  The conductor material of the wire type.
Top
See Also
Reference
WireType Class
Autodesk.Revit.DB.Electrical Namespace