Revit 2027 API
CombinableElementArrayIterator Properties
The CombinableElementArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
CombinableElementArrayIterator Class
Autodesk.Revit.DB Namespace