Revit 2027 API
ExternalServiceOptions Methods
The ExternalServiceOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace