Revit 2027 API
AssemblyDifferenceMemberCount Class
 The two assemblies being compared have different number of members
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 Autodesk.Revit.DB.AssemblyDifferenceMemberCount
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyDifferenceMemberCount : AssemblyDifference
Public Class AssemblyDifferenceMemberCount
	Inherits AssemblyDifference
public ref class AssemblyDifferenceMemberCount : public AssemblyDifference
type AssemblyDifferenceMemberCount =
    class
        inherit AssemblyDifference
    end
The AssemblyDifferenceMemberCount type exposes the following members.
Properties
Name | Description
Count1 |  Number of members in the first assembly
Count2 |  Number of members in the second assembly
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace