Revit 2027 API
RadialArray Methods
The RadialArray type exposes the following members.
Methods
Name | Description
ArrayElementsWithoutAssociation |  Creates a new radial array from a set of elements based on an input rotation axis.
ArrayElementWithoutAssociation |  Creates a new radial array from a single element based on an input rotation axis.
Create(Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember) |  Creates a new radial array element from a single element based on an input rotation axis.
Create(Document, View, ICollection<ElementId>, Int32, Line, Double, ArrayAnchorMember) |  Creates a new radial array element from a set of elements based on an input rotation axis.
GetCopiedMemberIds | Retrieves the copied member ids from the array. The first item in an array contains the original elements from which the array was created. All other items in the array are copies.
(Overrides BaseArray.GetCopiedMemberIds())
GetMinimumSize |  Returns the minimum size for a radial array based on the document.
GetNumberOfMembersIncludingPlaceholders |  Returns the number of items in an array, including placeholder items in families.
GetOriginalMemberIds | Retrieves the ids for the original elements from which the array was created. These elements form the first item in the array.
(Overrides BaseArray.GetOriginalMemberIds())
IsRotationAngleValid |  This indicates whether the input angle is valid.
IsValidNumberOfMembers |  This indicates whether the input count is a valid size for an array based on the document.
Top
See Also
Reference
RadialArray Class
Autodesk.Revit.DB Namespace