Revit 2027 API
DockablePaneState Class
 Describes where a dockable pane window should appear in the Revit user interface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.DockablePaneState
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DockablePaneState : IDisposable
Public Class DockablePaneState
	Implements IDisposable
public ref class DockablePaneState : IDisposable
type DockablePaneState =
    class
        interface IDisposable
    end
The DockablePaneState type exposes the following members.
Constructors
Name | Description
DockablePaneState() |  Creates a new DockablePaneState object.
DockablePaneState(DockablePaneState) |  Constructs a new copy of the input DockablePaneState object.
Top
Properties
Name | Description
DockPosition |  Which part of the Revit application frame the pane should dock to.
FloatingRectangle |  When %dockPosition% is Floating, this rectangle determines the size and position of the pane. Coordinates are relative to the upper-left-hand corner of the main Revit window. Note: the returned Rectangle is a copy. In order to change the pane state, you must call SetFloatingRectangle with a modified rectangle.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MinimumHeight |  When %dockPosition% is anything other than floating, the minimum height to use for the pane. Default is 200 pixels.
MinimumWidth |  When %dockPosition% is anything other than floating, the minimum width to use for the pane. Default is 200 pixels.
TabBehind |  Ignored unless %dockPosition% is Tabbed. The new pane will appear in a tab behind the specified existing pane ID.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DockablePaneState
SetFloatingRectangle |  When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window.
Top
See Also
Reference
Autodesk.Revit.UI Namespace