Revit 2027 API
ModelCurveNode Class
 A base class of output nodes that represent various model curves.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.CurveNode
 Autodesk.Revit.DB.PointNode
 Autodesk.Revit.DB.PolylineNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelCurveNode : RenderNode
Public Class ModelCurveNode
	Inherits RenderNode
public ref class ModelCurveNode : public RenderNode
type ModelCurveNode =
    class
        inherit RenderNode
    end
The ModelCurveNode type exposes the following members.
Properties
Name | Description
LineProperties |  Access to the line (pen) properties of the curve being drawn
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace