Revit 2027 API
PointNode Class
 An output node that represents a 3D point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.PointNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointNode : ModelCurveNode
Public Class PointNode
	Inherits ModelCurveNode
public ref class PointNode : public ModelCurveNode
type PointNode =
    class
        inherit ModelCurveNode
    end
The PointNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetPoint |  Returns the point object corresponding to the node.
Top
Remarks
 See also: OnPoint(PointNode).
See Also
Reference
Autodesk.Revit.DB Namespace