Revit 2027 API
ReferencePoint Methods
The ReferencePoint type exposes the following members.
Methods
Name | Description
GetCoordinatePlaneReferenceXY | A reference for the XY plane of the coordinate system.
GetCoordinatePlaneReferenceXZ | A reference for the XZ plane of the coordinate system.
GetCoordinatePlaneReferenceYZ | A reference for the YZ plane of the coordinate system.
GetCoordinateSystem | The position and orientation of the ReferencePoint.
GetHubId | Id of associated Hub.
GetInterpolatingCurves | The set of CurveByPoints elements that interpolate a ReferencePoint.
GetPointElementReference | Retrieve a copy of the rule that computes the location of the ReferencePoint relative to other elements in the document.
GetVisibility | Gets the visibility for the point.
SetCoordinateSystem | The position and orientation of the ReferencePoint.
SetPointElementReference | Change the rule for computing the location of the ReferencePoint relative to other elements in the document.
SetVisibility | Sets the visibility for the point.
Top
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace