Revit 2027 API
ViewOrientation3D Class
 Container for the point and vectors which define View3D's orientation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewOrientation3D
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewOrientation3D : IDisposable
Public Class ViewOrientation3D
	Implements IDisposable
public ref class ViewOrientation3D : IDisposable
type ViewOrientation3D =
    class
        interface IDisposable
    end
The ViewOrientation3D type exposes the following members.
Constructors
Name | Description
ViewOrientation3D |  Constructs a new ViewOrientation3D using the input eye position, up and forward directions.
Top
Properties
Name | Description
EyePosition |  The eye position point
ForwardDirection |  The forward direction vector
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
UpDirection |  The up direction vector
Top
Methods
Name | Description
Dispose | Releases all resources used by the ViewOrientation3D
Top
See Also
Reference
Autodesk.Revit.DB Namespace