Revit 2027 API
AssetPropertyDistance Properties
The AssetPropertyDistance type exposes the following members.
Properties
Name | Description
Value |  Value of the property.
Top
See Also
Reference
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace