Revit 2027 API
Panel Methods
The Panel type exposes the following members.
Methods
Name | Description
FindHostPanel |  Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel.
GetRefGridLines |  This method is used to get the reference gridlines.
Top
See Also
Reference
Panel Class
Autodesk.Revit.DB Namespace