Revit 2027 API
ExtElemChangeBeamSectionRegistry Methods
The ExtElemChangeBeamSectionRegistry type exposes the following members.
Methods
Name | Description
Dispose
RegisterInterface |  Registers a IExtElemChangeBeamSection
Unregister |  Unregisters IExtElemChangeBeamSection.
Top
See Also
Reference
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace