Revit 2027 API
OBJImportOptions Class
 The import options used to import OBJ format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.OBJImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class OBJImportOptions : BaseImportOptions
Public Class OBJImportOptions
	Inherits BaseImportOptions
public ref class OBJImportOptions : public BaseImportOptions
type OBJImportOptions =
    class
        inherit BaseImportOptions
    end
The OBJImportOptions type exposes the following members.
Constructors
Name | Description
OBJImportOptions() |  Constructs a new instance of OBJImportOptions with default values of all properties.
OBJImportOptions(OBJImportOptions) |  Constructs a new instance of OBJImportOptions as a copy of the import options.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace