Revit 2027 API
ArgumentException Methods
The ArgumentException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ArgumentException Class
Autodesk.Revit.Exceptions Namespace