Revit 2027 API
FaceDetailNode Class
 A base class of output nodes that represent face edges and face silhouettes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceEdgeNode
 Autodesk.Revit.DB.FaceSilhouetteNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceDetailNode : RenderNode
Public Class FaceDetailNode
	Inherits RenderNode
public ref class FaceDetailNode : public RenderNode
type FaceDetailNode =
    class
        inherit RenderNode
    end
The FaceDetailNode type exposes the following members.
Properties
Name | Description
LineProperties |  Access to the line (pen) properties of the curve being drawn.
Top
Methods
Name | Description
GetInstanceTransform |  Returns instance transform of the object being drawn.
GetLinkTransform |  Returns link transform of the object being drawn.
Top
See Also
Reference
Autodesk.Revit.DB Namespace