Revit 2027 API
RevitServerUnauthorizedException Methods
The RevitServerUnauthorizedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerUnauthorizedException Class
Autodesk.Revit.Exceptions Namespace