Revit 2027 API
DistributionSysType Class
 Represents a specific type of distribution system.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.DistributionSysType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DistributionSysType : ElementType
Public Class DistributionSysType
	Inherits ElementType
public ref class DistributionSysType : public ElementType
type DistributionSysType =
    class
        inherit ElementType
    end
The DistributionSysType type exposes the following members.
Properties
Name | Description
ElectricalPhase |  Get or set electrical phase (single, triple or undefined) of distribution system.
ElectricalPhaseConfiguration |  Get or set electrical phase configuration (Y, delta or undefined) of distribution system.
HighLegPhase |  The high-leg phase in the 3 phase 4 wires delta distribution system.
IsInUse |  Get the value which indicates whether this distribution system is in service now.
NumWires |  Get or set number of wires of distribution system.
VoltageLineToGround |  Get or set line to ground voltage of distribution system type.
VoltageLineToLine |  Get or set line to line voltage type of distribution system type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace