Revit 2027 API
StructuralAsset Methods
The StructuralAsset type exposes the following members.
Methods
Name | Description
Copy |  Produces a copy of the asset.
Dispose
Equals(StructuralAsset) |  Determines whether this structural asset is equal to another.
SetPoissonRatio |  Sets the Poisson ratio of the asset.
SetShearModulus |  Sets the shear modulus of the asset.
SetThermalExpansionCoefficient |  Sets the thermal expansion coefficient of the asset.
SetYoungModulus |  Sets the Young's modulus of the asset.
Top
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace