Revit 2027 API
InitialLuminousIntensity Properties
The InitialLuminousIntensity type exposes the following members.
Properties
Name | Description
Luminosity |  The luminosity value.
Top
See Also
Reference
InitialLuminousIntensity Class
Autodesk.Revit.DB.Lighting Namespace