Revit 2027 API
EnergyAnalysisConstruction Methods
The EnergyAnalysisConstruction type exposes the following members.
Methods
Name | Description
GetMaterialIds() |  Returns a list of ids of the associated materials to analytical construction.
Top
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace