Revit 2027 API
ConicalFace Properties
The ConicalFace type exposes the following members.
Properties
Name | Description
Axis | Axis of the surface.
HalfAngle | Half angle of the surface.
Origin | Origin of the surface.
Radius | Radii of the surface.
Top
See Also
Reference
ConicalFace Class
Autodesk.Revit.DB Namespace