Revit 2027 API
ConductorMaterial Class
 This class represents the definition of Conductor Material data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConductorMaterial
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConductorMaterial : IDisposable
Public Class ConductorMaterial
	Implements IDisposable
public ref class ConductorMaterial : IDisposable
type ConductorMaterial =
    class
        interface IDisposable
    end
The ConductorMaterial type exposes the following members.
Properties
Name | Description
Id |  The Conductor Material id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The Conductor Material name.
Top
Methods
Name | Description
Create |  Creates a Conductor Material.
Dispose | Releases all resources used by the ConductorMaterial
GetConductorMaterial |  Gets the Conductor Material data by given Conductor Material id.
GetConductorMaterialIdByName |  Gets the Conductor Material id by given Conductor Material name.
GetConductorMaterialIds |  Gets all the Conductor Material ids in the given document, sorted by name.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace