Revit 2027 API
ExternalService Class
 This base class represents an external service inside Revit application.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalService.ExternalService
 Autodesk.Revit.DB.ExternalService.MultiServerService
 Autodesk.Revit.DB.ExternalService.SingleServerService
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalService : IDisposable
Public Class ExternalService
	Implements IDisposable
public ref class ExternalService : IDisposable
type ExternalService =
    class
        interface IDisposable
    end
The ExternalService type exposes the following members.
Properties
Name | Description
Description |  The description for the service
IsSerializable |  Indicates whether executions of the service requires serialization in documents or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the service
NumberOfServers |  Indicates the number of servers currently registered with the service.
ServiceId |  The Id of the service
SupportActivation |  Indicates if the service supports activation/deactivation of the servers.
VendorId |  The vendor who provided the service
Top
Methods
Name | Description
AddServer |  Registers a server with its service.
Dispose | Releases all resources used by the ExternalService
GetDefaultServerId |  Returns the Id of the default server if one was assigned to the service.
GetOptions |  A copy of the options the service was registered with.
GetPublicAccessKey |  Access key to use to execute a service.
GetRegisteredServerIds |  Returns Ids of all servers registered for the service.
GetServer |  Returns the instance that provides implementation for a registered server.
IsRegisteredServerId |  Checks if the Id represents a valid server that has been registered for the service.
RemoveServer |  Removes/unregisters a server from the service.
Top
Remarks
 This is a base class from which SingleServerService and MultiServerService classes are inherited. It implements all basic methods, but the two inherited classes add more methods specific for that kind of service the class represents. Use this base class to get information about a service and its servers. Use the specific inherited classes to set or get active servers.
 Summary of common methods:
Adding and removing a server to and from a service
Getting information about a service
Querying a number of servers registered for a service
Accessing servers currently registered for a service
 Summary of the service-specific methods:
Getting and setting active server (or servers) for a service
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace