Revit 2027 API
IFCConnectedWallData Methods
The IFCConnectedWallData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace