Revit 2027 API
Vertex Class
 The base class for DirectContext3D vertices.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Vertex
 Autodesk.Revit.DB.DirectContext3D.VertexPosition
 Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
 Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal
 Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Vertex : IDisposable
Public Class Vertex
	Implements IDisposable
public ref class Vertex : IDisposable
type Vertex =
    class
        interface IDisposable
    end
The Vertex type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the Vertex
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace