Revit 2027 API
ReferenceUtils Class
 This is an utility class used for helper functions needed to manage references between elements and update geometry tags
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ReferenceUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReferenceUtils : IDisposable
Public Class ReferenceUtils
	Implements IDisposable
public ref class ReferenceUtils : IDisposable
type ReferenceUtils =
    class
        interface IDisposable
    end
The ReferenceUtils type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReferenceUtils
Top
See Also
Reference
Autodesk.Revit.DB Namespace