Revit 2027 API
FilterStringContains Class
 Tests whether string values from the document contain a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringContains
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringContains : FilterStringRuleEvaluator
Public Class FilterStringContains
	Inherits FilterStringRuleEvaluator
public ref class FilterStringContains : public FilterStringRuleEvaluator
type FilterStringContains =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringContains type exposes the following members.
Constructors
Name | Description
FilterStringContains |  Constructs an instance of FilterStringContains.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace