Revit 2027 API
KeyBasedTreeEntryError Class
 This class contains information about a problem encountered while creating a KeyBasedTreeEntries object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntryError
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntryError : IDisposable
Public Class KeyBasedTreeEntryError
	Implements IDisposable
public ref class KeyBasedTreeEntryError : IDisposable
type KeyBasedTreeEntryError =
    class
        interface IDisposable
    end
The KeyBasedTreeEntryError type exposes the following members.
Properties
Name | Description
ErrorType |  Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the KeyBasedTreeEntryError
GetEntry |  Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.
Top
Remarks
 This problem might be a duplicate entry, or an error in the specified parent-child relationships, or something else. See BuiltInKeyBasedTreeEntryErrorType for details.
See Also
Reference
Autodesk.Revit.DB Namespace