Revit 2027 API
CategoryNameMapIterator Methods
The CategoryNameMapIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the map.
Top
See Also
Reference
CategoryNameMapIterator Class
Autodesk.Revit.DB Namespace