Revit 2027 API
ElectricalAnalyticalLoadSet Class
 Represents the electrical analytical load set, it can contain a set of Electrical Analytical Equipment Loads.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalAnalyticalLoadSet : Element
Public Class ElectricalAnalyticalLoadSet
	Inherits Element
public ref class ElectricalAnalyticalLoadSet : public Element
type ElectricalAnalyticalLoadSet =
    class
        inherit Element
    end
The ElectricalAnalyticalLoadSet type exposes the following members.
Properties
Name | Description
QuantityOnStandBy |  The number of Equipment Loads that are not operational at any time.
TotalQuantity |  The total count of the Equipment Loads in the LoadSet.
Top
Methods
Name | Description
Create |  Creates an electrical analytical load set.
GetLoadIds |  Gets Equipment Load ids in the LoadSet.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace