Revit 2027 API
SpatialElementGeometryCalculator Methods
The SpatialElementGeometryCalculator type exposes the following members.
Methods
Name | Description
CalculateSpatialElementGeometry |  Compute the spatial element geometry and returns the boundary face information.
CanCalculateGeometry |  This indicates whether the input spatial element is a valid one.
Dispose
GetOptions |  The options that control the calculation.
IsRoomOrSpace |  This indicates whether the input spatial element is a room or a space.
Top
See Also
Reference
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace