Revit 2027 API
TemporaryGraphicsCommandData Methods
The TemporaryGraphicsCommandData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace