Revit 2027 API
ServerInternalException Methods
The ServerInternalException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ServerInternalException Class
Autodesk.Revit.Exceptions Namespace