Revit 2027 API
RebarReinforcementData Class
 class containing the id and the end of rebar on which the coupler stays
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReinforcementData
 Autodesk.Revit.DB.Structure.RebarReinforcementData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarReinforcementData : ReinforcementData
Public Class RebarReinforcementData
	Inherits ReinforcementData
public ref class RebarReinforcementData : public ReinforcementData
type RebarReinforcementData =
    class
        inherit ReinforcementData
    end
The RebarReinforcementData type exposes the following members.
Properties
Name | Description
End |  The end of the rebar. The end should be 0 or 1.
RebarId |  The id of the Rebar
Top
Methods
Name | Description
Create |  Creates a new instance of RebarReinforcementData, or null if the operation fails.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace