Revit 2027 API
DisabledDisciplineException Methods
The DisabledDisciplineException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
DisabledDisciplineException Class
Autodesk.Revit.Exceptions Namespace