Revit 2027 API
Fascia Class
An object that represents a fascia within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.HostedSweep
 Autodesk.Revit.DB.Architecture.Fascia
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Fascia : HostedSweep
Public Class Fascia
	Inherits HostedSweep
public ref class Fascia : public HostedSweep
type Fascia =
    class
        inherit HostedSweep
    end
The Fascia type exposes the following members.
Properties
Name | Description
FasciaType | Retrieves/set an object that represents the type of the Fascia.
Top
Methods
Name | Description
AddSegment | Add segments to the fascia.
(Overrides HostedSweep.AddSegment(Reference))
Top
Remarks
This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace