Revit 2027 API
ApplicationException Class
The exception that is thrown when a non-fatal application error occurs.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 More
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ApplicationException : Exception
<SerializableAttribute>
Public Class ApplicationException
	Inherits Exception
[SerializableAttribute]
public ref class ApplicationException : public Exception
[<SerializableAttribute>]
type ApplicationException =
    class
        inherit Exception
    end
The ApplicationException type exposes the following members.
Properties
Name | Description
FunctionId | The information of the function throwing the exception.
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides Exception.GetObjectData(SerializationInfo, StreamingContext))
Top
Remarks
This class is the base class of all Revit specified exceptions.
See Also
Reference
Autodesk.Revit.Exceptions Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.AccessDeniedException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.BackgroundTaskCancelledException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CorruptModelException
 Autodesk.Revit.Exceptions.ExternalApplicationException
 Autodesk.Revit.Exceptions.InternalException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.IOException
 Autodesk.Revit.Exceptions.NetworkCommunicationException
 Autodesk.Revit.Exceptions.OperationCanceledException
 Autodesk.Revit.Exceptions.ResourceNotFoundException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.ServerInternalException
 Autodesk.Revit.Exceptions.UnauthenticatedException