Revit 2027 API
EndTreatmentType Methods
The EndTreatmentType type exposes the following members.
Methods
Name | Description
Create(Document) |  Creates a new EndTreatmentType in the specified document.
Create(Document, String) |  Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter.
CreateDefaultEndTreatmentType |  Creates a new EndTreatmentType object with a default name.
Top
See Also
Reference
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace