Revit 2027 API
ExternalEvent Class
 A class that represent an external event.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalEvent
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalEvent : IDisposable
Public Class ExternalEvent
	Implements IDisposable
public ref class ExternalEvent : IDisposable
type ExternalEvent =
    class
        interface IDisposable
    end
The ExternalEvent type exposes the following members.
Properties
Name | Description
IsPending |  Checking whether an event has been raised but not yet executed.
Top
Methods
Name | Description
Create |  Creates an instance of external event.
CreateJournalable |  Creates an instance of external event which will have the ability to record its executions in the journal.
Dispose | Releases all resources used by the ExternalEvent
Raise |  Instructing Revit to raise (signal) the external event.
Top
Remarks
 An instance if this class will be returned to an external event's owner upon the event's creation. The event's owner will use this instance to signal that his application needs to be called by Revit. Revit will periodically check if any of the events have been signaled (raised), and will execute all events that were signaled (raised) by calling the Execute method on the events' respective handlers.
See Also
Reference
Autodesk.Revit.UI Namespace