Revit 2027 API
ViewPlan Class
 Represents floor plan, area plan, ceiling plan, and structural plan views in Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.ViewPlan
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewPlan : View
Public Class ViewPlan
	Inherits View
public ref class ViewPlan : public View
type ViewPlan =
    class
        inherit View
    end
The ViewPlan type exposes the following members.
Properties
Name | Description
AreaScheme | The area scheme.
Top
Methods
Name | Description
CheckPlanViewRangeValidity |  Checks if the plan view range is valid.
Create |  Creates a new ViewPlan.
CreateAreaPlan |  Creates a new area plan ViewPlan.
GetUnderlayBaseLevel |  Returns the element id of the level that defines the bottom of the underlay range.
GetUnderlayOrientation |  Returns the underlay orientation of this view.
GetUnderlayTopLevel |  Returns the element id of the level that defines the top of the underlay range.
GetViewRange |  Gets the view range.
SetUnderlayBaseLevel |  Sets the level whose elevation will determine the bottom of the underlay range. The elevation of the next highest level will be used to determine the top of the underlay range.
SetUnderlayOrientation |  Sets the underlay orientation for this view.
SetUnderlayRange |  Sets the underlay base and underlay top to the specified levels.
SetViewRange |  Sets the view range.
Top
Remarks
 In a plan view, the model is viewed as if cut by the cut plane and viewed from above, looking down. In ceiling plan views and structural plan views which look up, the model is viewed as if cut by the cut plane, and viewed as if looking down at a mirror.
See Also
Reference
Autodesk.Revit.DB Namespace