Revit 2027 API
StructuralSectionGeneralR Class
 Defines parameters for pipes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralR : StructuralSectionRound
Public Class StructuralSectionGeneralR
	Inherits StructuralSectionRound
public ref class StructuralSectionGeneralR : public StructuralSectionRound
type StructuralSectionGeneralR =
    class
        inherit StructuralSectionRound
    end
The StructuralSectionGeneralR type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralR |  Creates a new instance of Structural Section Pipe.
Top
Properties
Name | Description
WallDesignThickness |  Represents wall design thickness of rectangle.
WallNominalThickness |  Represents wall nominal thickness of rectangle.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace