Revit 2027 API
PostEventArgs Class
 The class is used as a base class for arguments of any post-event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PostEventArgs
 Autodesk.Revit.DB.Events.PostDocEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PostEventArgs : RevitEventArgs
Public Class PostEventArgs
	Inherits RevitEventArgs
public ref class PostEventArgs : public RevitEventArgs
type PostEventArgs =
    class
        inherit RevitEventArgs
    end
The PostEventArgs type exposes the following members.
Properties
Name | Description
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace