Revit 2027 API
FilterStringLess Class
 Tests whether string values from the document would sort before a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringLess
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringLess : FilterStringRuleEvaluator
Public Class FilterStringLess
	Inherits FilterStringRuleEvaluator
public ref class FilterStringLess : public FilterStringRuleEvaluator
type FilterStringLess =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringLess type exposes the following members.
Constructors
Name | Description
FilterStringLess |  Constructs an instance of FilterStringLess.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace