Revit 2027 API
StartingViewSettings Methods
The StartingViewSettings type exposes the following members.
Methods
Name | Description
GetStartingViewSettings |  Returns the starting view settings for the specified document.
IsAcceptableStartingView |  Checks whether the given Id is an acceptable starting view. InvalidElementId corresponds to "Last Viewed" and is therefore also acceptable.
Top
See Also
Reference
StartingViewSettings Class
Autodesk.Revit.DB Namespace