Revit 2027 API
FilterGlobalParameterAssociationRule Class
 A filter rule that operates on global parameters ElementId values in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterGlobalParameterAssociationRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterGlobalParameterAssociationRule : FilterNumericValueRule
Public Class FilterGlobalParameterAssociationRule
	Inherits FilterNumericValueRule
public ref class FilterGlobalParameterAssociationRule : public FilterNumericValueRule
type FilterGlobalParameterAssociationRule =
    class
        inherit FilterNumericValueRule
    end
The FilterGlobalParameterAssociationRule type exposes the following members.
Constructors
Name | Description
FilterGlobalParameterAssociationRule |  Constructs an instance of FilterGlobalParameterAssociationRule.
Top
Properties
Name | Description
RuleValue |  The user-supplied global parameter value against which values from a Revit document will be tested.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace