Revit 2027 API
ArgumentsInconsistentException Class
The exception that is thrown when each individual argument is OK, but a joint constraint is violated.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.ArgumentsInconsistentException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ArgumentsInconsistentException : ArgumentException
<SerializableAttribute>
Public Class ArgumentsInconsistentException
	Inherits ArgumentException
[SerializableAttribute]
public ref class ArgumentsInconsistentException : public ArgumentException
[<SerializableAttribute>]
type ArgumentsInconsistentException =
    class
        inherit ArgumentException
    end
The ArgumentsInconsistentException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace