Revit 2027 API
ExportLineweightInfo Methods
The ExportLineweightInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExportLineweightInfo Class
Autodesk.Revit.DB Namespace