Revit 2027 API
ProjectBrowserOptions Methods
The ProjectBrowserOptions type exposes the following members.
Methods
Name | Description
Dispose
GetProjectBrowserOptions |  Returns the current Revit instance's ProjectBrowserOptions.
Top
See Also
Reference
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace