Revit 2027 API
Pipe Properties
The Pipe type exposes the following members.
Properties
Name | Description
FlowState | The flow state of the pipe.
IsPlaceholder |  Identifies if the pipe is a placeholder or not.
PipeSegment |  The pipe segment that was assigned to this pipe according to the routing preference.
PipeType |  The pipe type of this pipe.
Top
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace