Revit 2027 API
NumberingFormattedParameter Methods
The NumberingFormattedParameter type exposes the following members.
Methods
Name | Description
Dispose
GetParameter |  Get the target parameter for formatting.
SetParameter |  Set the target parameter for formatting.
Top
See Also
Reference
NumberingFormattedParameter Class
Autodesk.Revit.DB Namespace