Revit 2027 API
CurveByPointsArray Class
An array that can contain CurveByPoints elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurveByPointsArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveByPointsArray : APIObject,
	IEnumerable
Public Class CurveByPointsArray
	Inherits APIObject
	Implements IEnumerable
public ref class CurveByPointsArray : public APIObject,
	IEnumerable
type CurveByPointsArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The CurveByPointsArray type exposes the following members.
Constructors
Name | Description
CurveByPointsArray | Initializes a new instance of the CurveByPointsArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a curve at a specified index within the array.
Size | Returns the number of curves that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every curve from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace