Revit 2027 API
PipeFittingAndAccessoryData Class
 The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeFittingAndAccessoryData : IDisposable
Public Class PipeFittingAndAccessoryData
	Implements IDisposable
public ref class PipeFittingAndAccessoryData : IDisposable
type PipeFittingAndAccessoryData =
    class
        interface IDisposable
    end
The PipeFittingAndAccessoryData type exposes the following members.
Properties
Name | Description
BehaviorType |  The behavior type of the pipe fitting or pipe accessory.
FluidDensity |  The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³).
FluidViscosity |  The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Origin |  The origin position of the pipe fitting or pipe accessory.
PartType |  The part type of the pipe fitting or pipe accessory.
ServerGUID |  The GUID of the pipe fitting or pipe accessory.
SystemClassification |  The system classification of the pipe fitting or pipe accessory.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipeFittingAndAccessoryData
GetAllConnectorData |  Gets the connector data of the pipe fitting or pipe accessory.
GetEntity |  Returns an Entity of the Schema of the serverGUID.
GetFamilyInstanceId |  Gets the Id of the fiting or accessory instance
Top
Remarks
 A FamilyInstance is the input data for the calculation, and the result is coefficient for each connector.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace