Revit 2027 API
SweptProfile Methods
The SweptProfile type exposes the following members.
Methods
Name | Description
Dispose
GetDrivingCurve |  Provides access to the curve that dictates the path of the swept profile.
GetSweptProfile |  Returns an object that describes the profile that is swept along the driving curve.
Top
See Also
Reference
SweptProfile Class
Autodesk.Revit.DB Namespace