Revit 2027 API
OptionalFunctionalityNotAvailableException Class
The exception that is thrown when the optional functionality is not available in the installed Revit
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class OptionalFunctionalityNotAvailableException : InvalidOperationException
<SerializableAttribute>
Public Class OptionalFunctionalityNotAvailableException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class OptionalFunctionalityNotAvailableException : public InvalidOperationException
[<SerializableAttribute>]
type OptionalFunctionalityNotAvailableException =
    class
        inherit InvalidOperationException
    end
The OptionalFunctionalityNotAvailableException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace