Revit 2027 API
SweptBlend Properties
The SweptBlend type exposes the following members.
Properties
Name | Description
BottomProfile | The curves which make up the bottom profile of the sketch.
BottomProfileSymbol | The bottom family symbol profile of the swept blend.
BottomSketch | The bottom profile sketch of the swept blend.
PathSketch | The sketched path for the swept blend.
SelectedPath | The selected curve used for the swept blend path.
TopProfile | The curves which make up the top profile of the sketch.
TopProfileSymbol | The top family symbol profile of the swept blend.
TopSketch | The top profile sketch of the swept blend.
Top
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace