Revit 2027 API
IFCAggregate Methods
The IFCAggregate type exposes the following members.
Methods
Name | Description
Add |  Adds an element to the aggregate.
AddAggregate |  Creates a nested aggregate and adds it to the aggregate.
AddValueOfType |  Adds an ifc object with primitive type of aggregate's item type to the aggregate.
Delete |  Delete the aggregate object from the IFCFile model.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetIFCAggregateIterator |  Returns a IFCAggregateIterator that iterates through the collection.
Top
See Also
Reference
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace