Revit 2027 API
SlabShapeEditor Class
 An object used for Slab Shape Editing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SlabShapeEditor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SlabShapeEditor : IDisposable
Public Class SlabShapeEditor
	Implements IDisposable
public ref class SlabShapeEditor : IDisposable
type SlabShapeEditor =
    class
        interface IDisposable
    end
The SlabShapeEditor type exposes the following members.
Properties
Name | Description
IsEnabled | Identifies if the slab shape editing functionality is enabled.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SlabShapeCreases | All of the creases that can be edited.
SlabShapeVertices | All of the vertices that can be edited.
Top
Methods
Name | Description
AddPoint |  Add a point to the element.
AddPoints |  Add an array of points to the element.
AddSplitLine |  Add a split line to the element.
CreateCreasesFromFoldingLines |  Convert selected folding lines to split lines
DeletePoint |  Delete a SlabShapeVertex from the element.
Dispose | Releases all resources used by the SlabShapeEditor
Enable | Enables the slab shape editing functionality.
ModifySubElement(SlabShapeCrease, Double) | Manipulates the crease on the corresponding slab, roof or floor.
ModifySubElement(SlabShapeVertex, Double) | Manipulates the vertex on the corresponding slab, roof or floor.
PickSupport | Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.
ResetSlabShape | Removes the modifications made during editing and resets the element geometry back to the unmodified state.
Top
Remarks
 The SlabShapeEditor can be obtained from a slab object, such as a roof or floor.
See Also
Reference
Autodesk.Revit.DB Namespace