Revit 2027 API
LocationPoint Properties
The LocationPoint type exposes the following members.
Properties
Name | Description
Point | The physical location of the element.
Rotation | The angle of rotation around the insertion point, in radians.
Top
See Also
Reference
LocationPoint Class
Autodesk.Revit.DB Namespace