Revit 2027 API
StructuralSectionStructuralTees Class
 Defines parameters for Structural Tees structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionStructuralTees : StructuralSectionGeneralT
Public Class StructuralSectionStructuralTees
	Inherits StructuralSectionGeneralT
public ref class StructuralSectionStructuralTees : public StructuralSectionGeneralT
type StructuralSectionStructuralTees =
    class
        inherit StructuralSectionGeneralT
    end
The StructuralSectionStructuralTees type exposes the following members.
Constructors
Name | Description
StructuralSectionStructuralTees |  Creates a new instance of Structural Section Tees shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing in the flange, in. (mm)
BoltSpacingWeb |  Standard bolt spacing in the web, in. (mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace