Revit 2027 API
OBJExportOptions Methods
The OBJExportOptions type exposes the following members.
Methods
Name | Description
IsGridAspectRatioSet |  Checks whether the GridAspectRatio tessellation parameter is explicitly set.
IsMaxEdgeLengthSet |  Checks whether the MaxEdgeLength tessellation parameter is explicitly set.
IsNormalToleranceSet |  Checks whether the NormalTolerance tessellation parameter is explicitly set.
IsSurfaceToleranceSet |  Checks whether the SurfaceTolerance tessellation parameter is explicitly set.
IsValidForGridAspectRatio |  Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter.
IsValidForMaxEdgeLength |  Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter.
IsValidForNormalTolerance |  Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter.
IsValidForSurfaceTolerance |  Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter.
SetTessellationSettings |  Sets all the tessellation parameters to its predefined values for the given resolution type.
Top
See Also
Reference
OBJExportOptions Class
Autodesk.Revit.DB Namespace