Revit 2027 API
AnalyticalToPhysicalAssociationManager Properties
The AnalyticalToPhysicalAssociationManager type exposes the following members.
Properties
Name | Description
EnableAssistedAssociation |  Indicates if associations between Analytical and Physical Elements should be created automatically.
Top
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace