Revit 2027 API
IFCAggregate Class
 A collection of IFC handles or attributes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCAggregate
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCAggregate : IEnumerable<IFCData>,
	IDisposable
Public Class IFCAggregate
	Implements IEnumerable(Of IFCData), IDisposable
public ref class IFCAggregate : IEnumerable<IFCData^>,
	IDisposable
type IFCAggregate =
    class
        interface IEnumerable<IFCData>
        interface IDisposable
    end
The IFCAggregate type exposes the following members.
Properties
Name | Description
Count |  The number of the data values in the aggregate.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Item |  Get the IFCData for this aggregate.
Top
Methods
Name | Description
Add |  Adds an element to the aggregate.
AddAggregate |  Creates a nested aggregate and adds it to the aggregate.
AddValueOfType |  Adds an ifc object with primitive type of aggregate's item type to the aggregate.
Delete |  Delete the aggregate object from the IFCFile model.
Dispose | Releases all resources used by the IFCAggregate
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetIFCAggregateIterator |  Returns a IFCAggregateIterator that iterates through the collection.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace