Revit 2027 API
DeleteWorksetSettings Methods
The DeleteWorksetSettings type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace