Revit 2027 API
ExternalApplicationException Class
The exception that is thrown when an issue in the Add-Ins resulted in an unexpected error.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ExternalApplicationException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ExternalApplicationException : ApplicationException
<SerializableAttribute>
Public Class ExternalApplicationException
	Inherits ApplicationException
[SerializableAttribute]
public ref class ExternalApplicationException : public ApplicationException
[<SerializableAttribute>]
type ExternalApplicationException =
    class
        inherit ApplicationException
    end
The ExternalApplicationException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
Remarks
Please contact your external application provider with the information about what led to this exception.
See Also
Reference
Autodesk.Revit.Exceptions Namespace