Revit 2027 API
ViewNode Properties
The ViewNode type exposes the following members.
Properties
Name | Description
LevelOfDetail |  The level of detail the view is going to be rendered at.
ViewId |  The Id of the view element.
Top
See Also
Reference
ViewNode Class
Autodesk.Revit.DB Namespace