Revit 2027 API
SpotDimensionType Class
 A type element containing the properties of a spot elevation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.DimensionType
 Autodesk.Revit.DB.SpotDimensionType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpotDimensionType : DimensionType
Public Class SpotDimensionType
	Inherits DimensionType
public ref class SpotDimensionType : public DimensionType
type SpotDimensionType =
    class
        inherit DimensionType
    end
The SpotDimensionType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace