Revit 2027 API
FamilyParameterSet Properties
The FamilyParameterSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
See Also
Reference
FamilyParameterSet Class
Autodesk.Revit.DB Namespace