Revit 2027 API
FamilyTypeSetIterator Class
An iterator to a FamilyType set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyTypeSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class FamilyTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class FamilyTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class FamilyTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type FamilyTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The FamilyTypeSetIterator type exposes the following members.
Constructors
Name | Description
FamilyTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace