Revit 2027 API
CanExecuteEventArgs Class
The event arguments used by AddInCommandBinding's CanExecute event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.CanExecuteEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CanExecuteEventArgs : CommandEventArgs
Public Class CanExecuteEventArgs
	Inherits CommandEventArgs
public ref class CanExecuteEventArgs : public CommandEventArgs
type CanExecuteEventArgs =
    class
        inherit CommandEventArgs
    end
The CanExecuteEventArgs type exposes the following members.
Properties
Name | Description
CanExecute | The value that indicates whether the Command associated with this event can be executed.
IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state.
Top
Methods
Name | Description
GetSelectedCategoryIds | Gets the category ids of selected elements.
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace