Revit 2027 API
ElectricalDemandFactorDefinition Properties
The ElectricalDemandFactorDefinition type exposes the following members.
Properties
Name | Description
AdditionalLoad |  Additional load to be included during demand load calculation.
IncludeAdditionalLoad |  Should the additional load (if set) be included in demand load calculations.
RuleType |  The rule type for this demand factor definition.
Top
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace