Revit 2027 API
ViewSystemsAnalysisReport Properties
The ViewSystemsAnalysisReport type exposes the following members.
Properties
Name | Description
AnalysisDateAndTime |  Identifies the analysis date and time when it was requested.
ReportStyle |  The report style that specifies the display content.
SystemsAnalysisOutputFolder |  The full path of the output folder for systems analysis.
SystemsAnalysisWorkflowFile |  The full path name of the original system analysis workflow file.
WeatherFile |  The full path name of the weather file used for the systems analysis.
Top
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace