Revit 2027 API
FaceToposolid Methods
The FaceToposolid type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a face toposolid attached to a non-vertical massing face.
GetReferencedFaces |  Gets the referenced faces of the face toposolid
SetFaceReferences |  Sets the referenced faces of the face toposolid
UpdateToFace |  Resets the face toposolid to its defining faces.
Top
See Also
Reference
FaceToposolid Class
Autodesk.Revit.DB Namespace