Revit 2027 API
PDFExportOptions Methods
The PDFExportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetExportInBackground |  Execute PDF export as a background process.
GetNamingRule |  Gets a copy of the naming rule.
IsValidNamingRule |  Whether naming rule is valid or not.
SetExportInBackground |  Execute PDF export as a background process.
SetNamingRule |  Sets the naming rule.
Top
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace