Revit 2027 API
AssemblyCodeTable Class
 AssemblyCodeTable represents the collection of ClassificationEntries for a document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.KeyBasedTreeEntryTable
 Autodesk.Revit.DB.AssemblyCodeTable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyCodeTable : KeyBasedTreeEntryTable
Public Class AssemblyCodeTable
	Inherits KeyBasedTreeEntryTable
public ref class AssemblyCodeTable : public KeyBasedTreeEntryTable
type AssemblyCodeTable =
    class
        inherit KeyBasedTreeEntryTable
    end
The AssemblyCodeTable type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetAssemblyCodeTable |  Returns the AssemblyCodeTable for the specified document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace