Revit 2027 API
AnalyticalNodeData Methods
The AnalyticalNodeData type exposes the following members.
Methods
Name | Description
Dispose
GetAnalyticalNodeData |  Returns AnalyticalNodeData associated with this element, if it exists.
GetConnectionStatus |  Returns the Connection Status for this Analytical Node.
Top
See Also
Reference
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace