Revit 2027 API
InitialColor Class
 This class is the base class for calculating initial light color.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.CustomInitialColor
 Autodesk.Revit.DB.Lighting.PresetInitialColor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialColor : IDisposable
Public Class InitialColor
	Implements IDisposable
public ref class InitialColor : IDisposable
type InitialColor =
    class
        interface IDisposable
    end
The InitialColor type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TemperatureValue |  The light color temperature value in Kelvins.
Top
Methods
Name | Description
Clone |  Creates a copy of the InitialColor derived object.
Dispose | Releases all resources used by the InitialColor
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace