Revit 2027 API
MullionTypeSetIterator Methods
The MullionTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
MullionTypeSetIterator Class
Autodesk.Revit.DB Namespace