Revit 2027 API
FamilySizeTableColumn Methods
The FamilySizeTableColumn type exposes the following members.
Methods
Name | Description
Dispose
GetSpecTypeId |  Gets the identifier of the spec describing values in the column.
GetUnitTypeId |  Gets the identifier of the unit quantifying values in the column.
Top
See Also
Reference
FamilySizeTableColumn Class
Autodesk.Revit.DB Namespace