Revit 2027 API
Instance Class
 The base class for all instance objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Instance : Element
Public Class Instance
	Inherits Element
public ref class Instance : public Element
type Instance =
    class
        inherit Element
    end
The Instance type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetTotalTransform |  Gets the total transform, which includes the true north transform for instances like import instances.
GetTransform |  Gets the transform of the instance.
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 Autodesk.Revit.DB.FamilyInstance
 Autodesk.Revit.DB.ImportInstance
 Autodesk.Revit.DB.PointCloudInstance
 Autodesk.Revit.DB.ProjectLocation
 Autodesk.Revit.DB.RevitLinkInstance