Revit 2027 API
ExternallyTaggedNonBRep Methods
The ExternallyTaggedNonBRep type exposes the following members.
Methods
Name | Description
SetUsage |  Controls the usage of this ExternallyTaggedNonBRep.
Top
See Also
Reference
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace