Revit 2027 API
FaceSplitter Properties
The FaceSplitter type exposes the following members.
Properties
Name | Description
SplitElementId |  The id of the element whose face is split by this element.
Top
See Also
Reference
FaceSplitter Class
Autodesk.Revit.DB Namespace