Revit 2027 API
RebarCurvesData Methods
The RebarCurvesData type exposes the following members.
Methods
Name | Description
AddBarGeometry(CurveLoop) |  Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(IList<Curve>) |  Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
CanAddBarGeometry
If the layout rule is Single or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.
If the layout rule is CustomSpacing, it will return true if GetNumberOfBarGeometry() is less the number of bars (specified by the formula), false otherwise.
For the other layout types, will return true.
ClearAllAddedBarGeometry |  This function will remove all bars geometry that were added by calling AddBarGeometry().
Dispose
GetAddedBarGeometry |  Gets the added curves that will represent the bar at index barIndex.
GetDistributionPath |  Gets the distribution path currently stored in the rebar.
GetNumberOfBarGeometry |  Gets the number of Bar Geometry that were added.
GetRebarUpdateCurvesData |  Gets a class that contains information used as input and output for rebar free form calculation.
SetDistributionPath |  Sets a new distribution path to be applied to the rebar. This information is set to the rebar after the API execution is finished successfully.
Top
See Also
Reference
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace