Revit 2027 API
AnalyticalDistributionNodePropertyData Class
 Represents the data and parameters of electrical analytical node.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalDistributionNodePropertyData : IDisposable
Public Class AnalyticalDistributionNodePropertyData
	Implements IDisposable
public ref class AnalyticalDistributionNodePropertyData : IDisposable
type AnalyticalDistributionNodePropertyData =
    class
        interface IDisposable
    end
The AnalyticalDistributionNodePropertyData type exposes the following members.
Properties
Name | Description
ConnectedPhases |  The electrical connected phases of the electrical analytical node to its upstream node.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalyticalDistributionNodePropertyData
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace