Revit 2027 API
TemporaryGraphicsCommandData Class
 The context data that can be provided to OnClick(TemporaryGraphicsCommandData).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.TemporaryGraphicsCommandData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TemporaryGraphicsCommandData : IExternalData,
	IDisposable
Public Class TemporaryGraphicsCommandData
	Implements IExternalData, IDisposable
public ref class TemporaryGraphicsCommandData : IExternalData,
	IDisposable
type TemporaryGraphicsCommandData =
    class
        interface IExternalData
        interface IDisposable
    end
The TemporaryGraphicsCommandData type exposes the following members.
Properties
Name | Description
Document |  The document.
Index |  The unique index of the temporary graphics object managed by TemporaryGraphicsManager.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TemporaryGraphicsCommandData
Top
See Also
Reference
Autodesk.Revit.UI Namespace