Revit 2027 API
RebarConstrainedHandle Class
 A class representing a handle on a Rebar that can be joined to a reference, such as a host Element's surface or cover, another Rebar's handle or to a generic surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarConstrainedHandle
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarConstrainedHandle : IDisposable
Public Class RebarConstrainedHandle
	Implements IDisposable
public ref class RebarConstrainedHandle : IDisposable
type RebarConstrainedHandle =
    class
        interface IDisposable
    end
The RebarConstrainedHandle type exposes the following members.
Properties
Name | Description
HandleBehavior |  Identifies the handle behavior.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AllowsConstraintToCustomTarget |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget] type.
AllowsConstraintToHostEdge |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] type.
AllowsConstraintToHostEdgeCover |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type.
AllowsConstraintToHostFaceOrToCover |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::FixedDistanceToHostFace] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCover] type.
AllowsConstraintToOtherRebarEdge |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToOtherRebar] type, where target is [!:Autodesk::Revit::DB::Structure::RebarConstraintType::TargetRebarConstraintType::Edge].
AllowsConstraintToSurface |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToSurface] type.
AllowsDistanceToHostEdgeOrHostEdgeCover |  Checks if the RebarConstrainedHandle allows distance for a constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type.
CanSetBehavior |  Checks if the input behavior can be set for this RebarConstrainedHandle.
Dispose | Releases all resources used by the RebarConstrainedHandle
GetCustomHandleTag |  Returns the tag of the handle. The type of the handle should be 'CustomHandle'.
GetEdgeNumber |  If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle.
GetHandleName |  Gets the name of the handle.
GetHandlePosition |  Gets the position of this handle as it is while editing constraints.
GetHandleSurface |  Gets the surface of this handle.
GetHandleType |  Returns the RebarHandleType of a RebarConstrainedHandle.
GetPossibleHandleBehaviors |  Gets a list of possible handle behaviors for the current handle.
GetRebarConstraintsManager |  Gets the RebarConstraintsManager that is associated with this handle.
IsCustomHandle |  Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'.
IsDraggable |  Checks that the RebarConstrainedHandle can be draggable in canvas (it has drag controls while editing constraints).
IsEdgeHandle |  Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.
IsEqual |  Checks if the specified RebarConstrainedHandle is the same as 'this'.
IsValid |  Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid.
Move |  Moves the handle with the specified vector.
Top
Remarks
A rebar element's flexible geometry is controlled by several handles. For example, the shape of a shape driven rebar is controlled by a handle at each end of the bar and a handle each edge. Another handle is used to control the location of the plane in which the rebar lies. An additional handle controls the length of a set of rebar.
RebarConstrainedHandles can only be constructed internally by Revit. They are available to the API by querying a Rebar element's RebarConstraintsManager.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace