Revit 2027 API
ExternalService Methods
The ExternalService type exposes the following members.
Methods
Name | Description
AddServer |  Registers a server with its service.
Dispose
GetDefaultServerId |  Returns the Id of the default server if one was assigned to the service.
GetOptions |  A copy of the options the service was registered with.
GetPublicAccessKey |  Access key to use to execute a service.
GetRegisteredServerIds |  Returns Ids of all servers registered for the service.
GetServer |  Returns the instance that provides implementation for a registered server.
IsRegisteredServerId |  Checks if the Id represents a valid server that has been registered for the service.
RemoveServer |  Removes/unregisters a server from the service.
Top
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace