Revit 2027 API
WireConduitTypeSet Class
A set that contains conduit types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireConduitTypeSet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WireConduitTypeSet : APIObject,
	IEnumerable
Public Class WireConduitTypeSet
	Inherits APIObject
	Implements IEnumerable
public ref class WireConduitTypeSet : public APIObject,
	IEnumerable
type WireConduitTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The WireConduitTypeSet type exposes the following members.
Constructors
Name | Description
WireConduitTypeSet | Initializes a new instance of the WireConduitTypeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of conduit types that are in the set.
Top
Methods
Name | Description
Clear | Removes every conduit type from the set, rendering it empty.
Contains | Tests for the existence of a conduit type within the set.
Erase | Removes a specified conduit type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified conduit type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace