Revit 2027 API
AreaTag Properties
The AreaTag type exposes the following members.
Properties
Name | Description
Area | The area that the tag is associated with.
AreaTagType | The tag type.
Top
See Also
Reference
AreaTag Class
Autodesk.Revit.DB Namespace