Revit 2027 API
Room Methods
The Room type exposes the following members.
Methods
Name | Description
IsPointInRoom | Determines if a point lies within the volume of the room.
Unplace |  Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.
Top
See Also
Reference
Room Class
Autodesk.Revit.DB.Architecture Namespace