Revit 2027 API
AnnotationLabel Properties
The AnnotationLabel type exposes the following members.
Properties
Name | Description
UseNonBreakingSpaces |  If non-breaking spaces should be used in the label text.
Top
See Also
Reference
AnnotationLabel Class
Autodesk.Revit.DB Namespace