Revit 2027 API
DocumentReloadingLatestEventArgs Class
 The event arguments used by the DocumentReloadingLatest event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadingLatestEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentReloadingLatestEventArgs : RevitAPIPreDocEventArgs
Public Class DocumentReloadingLatestEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class DocumentReloadingLatestEventArgs : public RevitAPIPreDocEventArgs
type DocumentReloadingLatestEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The DocumentReloadingLatestEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace