Revit 2027 API
RebarContainerIterator Methods
The RebarContainerIterator type exposes the following members.
Methods
Name | Description
Dispose
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace