Revit 2027 API
FilterStringBeginsWith Class
 Tests whether string values from the document begin with a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringBeginsWith
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringBeginsWith : FilterStringRuleEvaluator
Public Class FilterStringBeginsWith
	Inherits FilterStringRuleEvaluator
public ref class FilterStringBeginsWith : public FilterStringRuleEvaluator
type FilterStringBeginsWith =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringBeginsWith type exposes the following members.
Constructors
Name | Description
FilterStringBeginsWith |  Constructs an instance of FilterStringBeginsWith.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace