Revit 2027 API
CurveByPointsArrayIterator Methods
The CurveByPointsArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
CurveByPointsArrayIterator Class
Autodesk.Revit.DB Namespace