Revit 2027 API
LayoutRuleClearSpacing Class
This class indicate the layout rule of a Beam System is Clear-Spacing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleClearSpacing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LayoutRuleClearSpacing : LayoutRule
Public Class LayoutRuleClearSpacing
	Inherits LayoutRule
public ref class LayoutRuleClearSpacing : public LayoutRule
type LayoutRuleClearSpacing =
    class
        inherit LayoutRule
    end
The LayoutRuleClearSpacing type exposes the following members.
Constructors
Name | Description
LayoutRuleClearSpacing | Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Top
Properties
Name | Description
JustifyType | Get or set the type of justification.
Spacing | Get or set the spacing of the beam system.
Top
Methods
Name | Description
Top
Remarks
To use this type of LayoutRule, the distance between the beams and the justify-type must be set.
Example
private bool LayoutRuleClearSpacingInformation(BeamSystem beamSystem)
{
    //get the layoutRule of the beamsystem
    Autodesk.Revit.DB.LayoutRule layoutRule = beamSystem.LayoutRule;
    string message = "BeamSystem layout rule : " + layoutRule;
    //create a new instance of the LayoutRuleClearSpacing class
    LayoutRuleClearSpacing myLayoutRuleClearSpacing =
             new LayoutRuleClearSpacing(10.0, BeamSystemJustifyType.Beginning);
    //set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleClearSpacing;
    LayoutRuleClearSpacing clearSpacing = beamSystem.LayoutRule as LayoutRuleClearSpacing;
    if (null == clearSpacing)
    {
        return false;
    }
    //try to get the property value of the beamsystem LayoutRule
    BeamSystemJustifyType justifyType = clearSpacing.JustifyType;
    double spacing = clearSpacing.Spacing;
    message += "\nNew BeamSystem layout rule: " + clearSpacing;
    message += "\nNew BeamSystem spacing: " + spacing;
    message += "\nNew BeamSystem justification: " + justifyType;
    TaskDialog.Show("Revit",message);
    return true;
}
See Also
Reference
Autodesk.Revit.DB Namespace