Revit 2027 API
GeometryElement Class
Geometric representation of an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.GeometryElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GeometryElement : GeometryObject,
	IEnumerable<GeometryObject>
Public Class GeometryElement
	Inherits GeometryObject
	Implements IEnumerable(Of GeometryObject)
public ref class GeometryElement : public GeometryObject,
	IEnumerable<GeometryObject^>
type GeometryElement =
    class
        inherit GeometryObject
        interface IEnumerable<GeometryObject>
    end
The GeometryElement type exposes the following members.
Properties
Name | Description
MaterialElement | Element describing the material from which this element is composed.
Top
Methods
Name | Description
GetBoundingBox | Retrieves a box that encloses the geometry element.
GetEnumerator | Returns an enumerator that iterates through the collection.
GetEnumeratorNG | Returns an enumerator that iterates through the collection.
GetTransformed | Returns a transformed copy of the geometry in this element.
Top
Remarks
This class contains geometric primitives that are generated from the parametric description of the element. The member geometric primitives can be obtained directly from this object using the capabilities of IEnumerable.
See Also
Reference
Autodesk.Revit.DB Namespace