Revit 2027 API
AssemblyDifferenceMemberDifference Properties
The AssemblyDifferenceMemberDifference type exposes the following members.
Properties
Name | Description
MemberDifference |  Difference between the assembly members
MemberId1 |  Id of the member in the first assembly
MemberId2 |  Id of the member in the second assembly
Top
See Also
Reference
AssemblyDifferenceMemberDifference Class
Autodesk.Revit.DB Namespace