Revit 2027 API
RibbonItem Methods
The RibbonItem type exposes the following members.
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetContextualHelp | Gets the contextual help bound with this control.
SetContextualHelp | Sets the contextual help bound with this button.
Top
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace