Revit 2027 API
SpatialElementTag Class
 A tag attached to a SpatialElement (room, space or area) in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementTag
 Autodesk.Revit.DB.Architecture.RoomTag
 Autodesk.Revit.DB.AreaTag
 Autodesk.Revit.DB.Mechanical.SpaceTag
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialElementTag : Element
Public Class SpatialElementTag
	Inherits Element
public ref class SpatialElementTag : public Element
type SpatialElementTag =
    class
        inherit Element
    end
The SpatialElementTag type exposes the following members.
Properties
Name | Description
HasElbow |  Identifies if the tag's leader has an elbow point or not.
HasLeader |  Identifies if a leader is displayed for the tag or not.
IsOrphaned |  Identifies if the tag is orphaned or not.
IsTaggingLink |  Identifies if the tag has reference to a spatial element in a linked document or not.
LeaderElbow |  The position of the leader's elbow (middle point).
LeaderEnd |  The position of the leader's end.
LeaderStart |  The leader start point for tags that use leader start condition Free.
LeaderStartCondition |  The leader start condition of the tag, such as if the start of the leader is attached to the tag head or free floating.
Location | The location of the tag.
(Overrides Element.Location)
RotationAngle |  The rotation angle of the tag relative to its view
TagHeadPosition |  The position of the tag's head.
TagOrientation |  The orientation of the tag.
TagText |  The text displayed by the tag.
View |  The view in which the tag was placed.
Top
Methods
Name | Description
MoveToReferenceLocation |  Moves the SpatialElementTag to the location of SpatialElement that the tag is associated with.
Top
Remarks
 SpatialElementTag is the base class for RoomTag, SpaceTag and AreaTag. Zone tag is not derived from SpatialElementTag. See IndependentTag for more information.
See Also
Reference
Autodesk.Revit.DB Namespace