Revit 2027 API
RebarShape Class
 RebarShape specifies the shape type for a Rebar instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarShape
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShape : ElementType
Public Class RebarShape
	Inherits ElementType
public ref class RebarShape : public ElementType
type RebarShape =
    class
        inherit ElementType
    end
The RebarShape type exposes the following members.
Properties
Name | Description
HigherEnd |  Defines the higher end of rebar shape.
RebarStyle |  Whether the shape represents a standard bar or a stirrup.
ShapeFamilyId |  Get and return the rebar shape family id.
SimpleArc |  Check whether this shape consists of a single arc, possibly with hooks.
SimpleLine |  Check whether this shape consists of a single straight segment, possibly with hooks.
StirrupTieAttachment |  The attachment type of stirrup ties and rebars.
Top
Methods
Name | Description
Create |  Create a new instance of a Rebar Shape, which defines the shape of a rebar.
GetAllowed |  Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
GetCurvesForBrowser |  Generate curves for the shape, as used in the shape browser.
GetMultiplanarDefinition |  The optional 3D structure of the shape.
GetRebarShapeDefinition |  Return the definition of the RebarShape.
GetTerminationsData |  Gets the terminations (e.g. hook, crank) data.
HasEndTreatment |  Identifies if the rebar shape has end treatment at at least one end.
IsSameShapeIgnoringTerminations |  Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties.
RebarShapeMatchesCurvesAndTerminationsData |  Checks if rebarShape matches curves and terminations data. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will ignore the hook information. If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to false, then this method will ignore the end treatment information.
SetAllowed |  Specify which bar types can be used with this RebarShape. Bar types are allowed by default.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace