Revit 2027 API
Truss Properties
The Truss type exposes the following members.
Properties
Name | Description
Curves | Get all the truss curves.
Members | Get all the members of truss.
TrussType | Retrieve/set an object that represents the type of the truss.
Top
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace