Revit 2027 API
SpatialFieldManager Class
 Exposes all API for an external analysis application. Its primary role is creation, deletion and modification of SpatialFieldElement elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.SpatialFieldManager
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialFieldManager : Element
Public Class SpatialFieldManager
	Inherits Element
public ref class SpatialFieldManager : public Element
type SpatialFieldManager =
    class
        inherit Element
    end
The SpatialFieldManager type exposes the following members.
Properties
Name | Description
AllowInteractiveSettings |  If true interactive settings dialog and pick deletion are allowed.
CurrentMeasurement |  Stores the currently displayed measurement
LegendPosition |  Stores current position of analysis results legend element in view
LegendShowConfigurationName |  If true legend contains analysis configuration name.
LegendShowDescription |  If true legend contains analysis description.
LegendTextTypeId |  Stores element id of text associated with common (result-independent) part of legend in view.
NumberOfMeasurements |  Stores the total number of measurements
ResultsVisibleInView |  Enables analysis results visibility in the view.
UseRangeForAllMeasurements |  Governs how minimum and maximum values (the data range) are calculated.
Top
Methods
Name | Description
AddSpatialFieldPrimitive() |  Creates empty analysis results primitive not associated with any geometry element
AddSpatialFieldPrimitive(Reference) |  Creates an empty analysis results primitive associated with a reference.
AddSpatialFieldPrimitive(Curve, Transform) |  Creates empty analysis results primitive associated with a curve and a transform.
AddSpatialFieldPrimitive(Face, Transform) |  Creates empty analysis results primitive associated with a face and a transform.
AddSpatialFieldPrimitive(Reference, SpatialFieldPrimitiveHideMode) |  Creates an empty analysis results primitive associated with a reference, with the option to control how the reference element is hidden.
Clear |  Clear all analysis results managed by this manager object
CreateSpatialFieldManager |  Factory method - creates manager object for the given view
GetLegend |  Returns legend element or NULL
GetMaximum |  Calculates the maximum value for all primitives
GetMinimum |  Calculates the minimum value for all primitives
GetRegisteredResults |  Returns an array of indices of all registered results
GetResultSchema |  Returns result schema by index
GetSpatialFieldManager |  Retrieves manager object for the given view or returns NULL
IsResultSchemaNameUnique |  Verify the uniqueness of the name among all registered result schemas.
IsTextTypeIdValid |  Verify if text type id is valid.
RegisterResult |  Registers result and assigns it a unique result index
RemoveSpatialFieldPrimitive |  Removes analysis results primitive identified by the unique index
SetMeasurementDescriptions |  Sets Descriptions for all measurements
SetMeasurementNames |  Sets Names for all measurements
SetResultSchema |  Sets a new value for an existing result schema in the result registry
UpdateSpatialFieldPrimitive |  Populates analysis results data (or replaces the existing data) in the existing primitive identified by the unique index
Top
Example
Document doc = commandData.Application.ActiveUIDocument.Document;
UIDocument uiDoc = commandData.Application.ActiveUIDocument;
SpatialFieldManager sfm = SpatialFieldManager.GetSpatialFieldManager(doc.ActiveView);
if (null == sfm)
{
    sfm = SpatialFieldManager.CreateSpatialFieldManager(doc.ActiveView, 1);
}
Reference reference = uiDoc.Selection.PickObject(ObjectType.Face, "Select a face");
int idx = sfm.AddSpatialFieldPrimitive(reference);
Face face = doc.GetElement(reference).GetGeometryObjectFromReference(reference) as Face;
IList<UV> uvPts = new List<UV>();
BoundingBoxUV bb = face.GetBoundingBox();
UV min = bb.Min;
UV max = bb.Max;
uvPts.Add(new UV(min.U,min.V));
uvPts.Add(new UV(max.U,max.V));
FieldDomainPointsByUV pnts = new FieldDomainPointsByUV(uvPts);
List<double> doubleList = new List<double>();
IList<ValueAtPoint> valList = new List<ValueAtPoint>();
doubleList.Add(0);
valList.Add(new ValueAtPoint(doubleList));
doubleList.Clear();
doubleList.Add(10);
valList.Add(new ValueAtPoint(doubleList));
FieldValues vals = new FieldValues(valList);
AnalysisResultSchema resultSchema = new AnalysisResultSchema("Schema Name", "Description");
int schemaIndex = sfm.RegisterResult(resultSchema);
sfm.UpdateSpatialFieldPrimitive(idx, pnts, vals, schemaIndex);
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace