Revit 2027 API
ExporterIFC Methods
The ExporterIFC type exposes the following members.
Methods
Name | Description
ClearFaceWithElementHandleMap |  Clear face with element handle map.
Dispose
FindSpaceBoundingElementHandle |  Looks up the handle associated to the element and level id from the ExporterIFC's internal cache.
Get3DContextHandle |  Obtains the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
GetDoorWindowOpeningHandle |  Get the handle to the opening associated with a hosted (door/window) element from the internal cache.
GetFamilyInstanceAssemblyOffset | Obsolete.
 Obtains Translation to adjust Family Instance within an Assembly, based on Family Symbol origin change.
GetFamilyName |  Gets the name of the element assigned to the current export state.
GetFile |  Gets the handle to the IFC file being created during this export operation.
GetHostObjects |  Returns a collection containing the host object handles in the document.
GetLayerNameForPresentationLayer |  Get the layer name associated with an element from the default layer mapping table.
GetMaterialIdForCurrentExportState |  This gets the material id that is associated with the element in the current export state.
GetOptions |  Gets the collection of named options set by the exporter client.
GetOrCreateFillPattern |  Get (or create) the IfcFillPatternStyle associated with an ElementId.
GetPresentationLayerAssignments |  Get the list of the internally IfcPresentationLayerAssignments and their respective shape representations.
GetRelatedElements |  Gets all elements not associated to stories.
GetRelatedProducts |  Gets all products not associated to stories.
PopExportState |  Resets the internal state of the exporter to process the previously active input element (if any), or the default state if the stack is empty.
PopTransform |  Resets the internal transform of the exporter to process the previously active input element (if any), or the default transform if the stack is empty.
PushExportState |  Sets the internal state of the exporter to process the geometry and properties of the input element.
PushTransform |  Sets the internal transform of the exporter to process the geometry and properties of the input element.
RegisterDoorWindowForUncreatedOpening |  Registers a door or window in the ExporterIFC's internal cache. The ids registered correspond to openings in walls which have not been processed and created yet.
RegisterFaceWithElementHandle |  Register face with element handle to make sure the openings created are related to the right element.
RegisterSpaceBoundingElementHandle |  Stores a handle representing a space bounding element to the ExporterIFC's internal cache.
Set3DContextHandle |  Sets the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
SetCurrentExportedDocument |  Sets the exporter to process a particular document during export.
SetFile |  Sets the handle to the IFC file being created during this export operation.
SetMaterialIdForCurrentExportState |  This sets the material id that is to be associated with the element in the current export state.
SetOwnerHistoryHandle |  Sets the handle to the IfcOwnerHistory for the file.
Top
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace