Revit 2027 API
PointCloudFilter Methods
The PointCloudFilter type exposes the following members.
Methods
Name | Description
Clone |  Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.
Dispose
PrepareForCell |  Informs the filter that a series of points within a given cell is about to be checked.
TestCell |  Checks whether a given cell, i.e. a box aligned with the XYZ axes, is inside, outside or on the border of the volume of interest.
TestPoint | Checks if a point is inside the volume of interest.
Top
See Also
Reference
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace