Revit 2027 API
Field Class
 The description of a field within a Schema in the Extensible Storage framework. Contains the field's name, type, access control and documentation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExtensibleStorage.Field
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Field : IDisposable
Public Class Field
	Implements IDisposable
public ref class Field : IDisposable
type Field =
    class
        interface IDisposable
    end
The Field type exposes the following members.
Properties
Name | Description
ContainerType |  Reports whether this is a simple field containing one value, or a container of multiple values.
Documentation |  The overall description of the Field.
FieldName |  The name of the field.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
KeyType |  The type of the keys stored in the field.
Schema |  The Schema to which this Field belongs.
SubSchema |  The Schema describing the subentity (or subentities) stored in this Field.
SubSchemaGUID |  The GUID of the Schema describing the subentity (or subentities) stored in this Field.
ValueType |  The type of the values stored in the field.
Top
Methods
Name | Description
CompatibleUnit |  Checks if the specified unit is compatible with the field description.
Dispose | Releases all resources used by the Field
GetSpecTypeId |  Gets the spec describing the values stored in this field.
SubEntityReadAccessGranted |  Checks whether there is read access to subentities storable in this field.
SubEntityWriteAccessGranted |  Checks whether there is write access to subentities storable in this field.
Top
See Also
Reference
Autodesk.Revit.DB.ExtensibleStorage Namespace