Revit 2027 API
ApplicationEntryPoint Properties
The ApplicationEntryPoint type exposes the following members.
Properties
Name | Description
AddinFolder |  The full path to the Revit Macros module.
Top
See Also
Reference
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace