Revit 2027 API
Polyloop Methods
The Polyloop type exposes the following members.
Methods
Name | Description
ComputeArea |  Gets the area for this polygon.
Dispose
GetPoints |  Gets the array of points in the polygon.
Top
See Also
Reference
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace