Revit 2027 API
Workset Properties
The Workset type exposes the following members.
Properties
Name | Description
IsEditable |  Whether the workset is editable.
IsOpen |  Whether the workset is open (rather than closed).
IsVisibleByDefault |  Whether the workset is visible by default.
Kind |  Kind of the workset.
Top
See Also
Reference
Workset Class
Autodesk.Revit.DB Namespace