Revit 2027 API
ExtendedPropertiesLinkValues Methods
The ExtendedPropertiesLinkValues type exposes the following members.
Methods
Name | Description
AddValue(ForgeTypeId, Double) |  Add a double value for a given schema id.
AddValue(ForgeTypeId, Int32) |  Add an integer value for a given schema id.
AddValue(ForgeTypeId, String) |  Add a string value for a given schema id.
Dispose
Top
See Also
Reference
ExtendedPropertiesLinkValues Class
Autodesk.Revit.DB.ExternalData Namespace