Revit 2027 API
LoadUsage Class
 An object that represents a load usage.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadUsage
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LoadUsage : Element
Public Class LoadUsage
	Inherits Element
public ref class LoadUsage : public Element
type LoadUsage =
    class
        inherit Element
    end
The LoadUsage type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new LoadUsage.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace