Revit 2027 API
ReloadLatestOptions Class
 Options to control behavior of pure reload latest (not part of synchronize with central).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ReloadLatestOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReloadLatestOptions : IDisposable
Public Class ReloadLatestOptions
	Implements IDisposable
public ref class ReloadLatestOptions : IDisposable
type ReloadLatestOptions =
    class
        interface IDisposable
    end
The ReloadLatestOptions type exposes the following members.
Constructors
Name | Description
ReloadLatestOptions |  Constructs a new ReloadLatestOptions object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReloadLatestOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace