Revit 2027 API
DWFXExportOptions Class
DWFX Export options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CADExportOptions
 Autodesk.Revit.DB.DWFExportOptions
 Autodesk.Revit.DB.DWFXExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DWFXExportOptions : DWFExportOptions
Public Class DWFXExportOptions
	Inherits DWFExportOptions
public ref class DWFXExportOptions : public DWFExportOptions
type DWFXExportOptions =
    class
        inherit DWFExportOptions
    end
The DWFXExportOptions type exposes the following members.
Constructors
Name | Description
DWFXExportOptions | Default constructor. Sets all options to their default values.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace