Revit 2027 API
AirSystemData Methods
The AirSystemData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace