Revit 2027 API
MechanicalEquipmentSet Properties
The MechanicalEquipmentSet type exposes the following members.
Properties
Name | Description
Classification |  The classification for the mechanical equipment set.
OnDuty |  The number of pieces of mechanical equipment operating in parallel at any given time.
OnStandby |  The number of pieces of mechanical equipment that are not operational at any given time.
Top
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace