Revit 2027 API
StairsEditScope Methods
The StairsEditScope type exposes the following members.
Methods
Name | Description
Start(ElementId) |  Starts an stairs edit mode for an existing Stairs element
Start(ElementId, ElementId) |  Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs.
Top
See Also
Reference
StairsEditScope Class
Autodesk.Revit.DB Namespace