Revit 2027 API
ProjectLocationSet Properties
The ProjectLocationSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of project locations that are in the set.
Top
See Also
Reference
ProjectLocationSet Class
Autodesk.Revit.DB Namespace