Revit 2027 API
PolymeshTopology Methods
The PolymeshTopology type exposes the following members.
Methods
Name | Description
Dispose
GetFacet |  Returns a definition of one facet
GetFacets |  Returns a definitions of all facets of the polymesh
GetNormal |  Returns a normal vector at the given index
GetNormals |  Returns all normals assigned to the polymesh
GetPoint |  Returns one point at the given index.
GetPoints |  Returns all points of the polymesh.
GetUV |  Returns one UV coordinate at the given index.
GetUVs |  Returns all UV coordinates assigned to the polymesh
Top
See Also
Reference
PolymeshTopology Class
Autodesk.Revit.DB Namespace