Revit 2027 API
Material Properties
The Material type exposes the following members.
Properties
Name | Description
AppearanceAssetId |  The ElementId of the AppearanceAssetElement.
Color |  The color of the material.
CutBackgroundPatternColor |  The color of the material cut background pattern.
CutBackgroundPatternId |  The id of the FillPatternElement used as the background pattern of faces with this material in cut views.
CutForegroundPatternColor |  The color of the material cut foreground pattern.
CutForegroundPatternId |  The id of the FillPatternElement used as the foreground pattern of faces with this material in cut views.
EmbodiedCarbonAssetId |  The ElementId of the embodied carbon PropertySetElement.
MaterialCategory |  The name of the material category, e.g. 'Wood'
MaterialClass |  The name of the general material type, e.g. 'Wood.'
Shininess |  The shininess of the material.
Smoothness |  The smoothness of the material.
StructuralAssetId |  The ElementId of the structural PropertySetElement.
SurfaceBackgroundPatternColor |  The color of the material surface background pattern.
SurfaceBackgroundPatternId |  The id of the FillPatternElement used as the background pattern of faces with this material in normal views.
SurfaceForegroundPatternColor |  The color of the material surface foreground pattern.
SurfaceForegroundPatternId |  The id of the FillPatternElement used as the foreground pattern of faces with this material in normal views.
ThermalAssetId |  The ElementId of the thermal PropertySetElement.
Transparency |  The transparency of the material.
UseRenderAppearanceForShading |  True to use the render appearance settings for shaded view appearance; false to use the material's color and transparency value for shaded view appearance.
Top
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace