Revit 2027 API
StructuralSectionConcreteT Properties
The StructuralSectionConcreteT type exposes the following members.
Properties
Name | Description
CantileverHeight |  Flange cantilever thickness.
CantileverLength |  Flange cantilever length.
Top
See Also
Reference
StructuralSectionConcreteT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace