Revit 2027 API
RebarShapeConstraintDiameter Properties
The RebarShapeConstraintDiameter type exposes the following members.
Properties
Name | Description
ArcReferenceType |  The choice of rule for measuring the diameter.
Top
See Also
Reference
RebarShapeConstraintDiameter Class
Autodesk.Revit.DB.Structure Namespace