Revit 2027 API
SolidGeometryOptions Class
 A class containing optional information to control the geometry generation of the Solid by the SolidUtils routines.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SolidGeometryOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SolidGeometryOptions : IDisposable
Public Class SolidGeometryOptions
	Implements IDisposable
public ref class SolidGeometryOptions : IDisposable
type SolidGeometryOptions =
    class
        interface IDisposable
    end
The SolidGeometryOptions type exposes the following members.
Constructors
Name | Description
SolidGeometryOptions |  Creates a new SolidOptions class with solid tag settings.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SolidTag |  Optional solid tag for the Solid.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SolidGeometryOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace