Revit 2027 API
DocumentOpenedEventArgs Class
 The event arguments used by the DocumentOpened event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentOpenedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentOpenedEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentOpenedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentOpenedEventArgs : public RevitAPIPostDocEventArgs
type DocumentOpenedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentOpenedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace