Revit 2027 API
LoadNature Class
 An object that represents a load nature.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadNature
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LoadNature : Element
Public Class LoadNature
	Inherits Element
public ref class LoadNature : public Element
type LoadNature =
    class
        inherit Element
    end
The LoadNature type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new LoadNature.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace