Revit 2027 API
SpotLightDistribution Properties
The SpotLightDistribution type exposes the following members.
Properties
Name | Description
SpotBeamAngle |  The spot beam angle.
SpotFieldAngle |  The spot field angle.
TiltAngle |  The tilt angle.
Top
See Also
Reference
SpotLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace