Revit 2027 API
RadialDimension Methods
The RadialDimension type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of an Radial Dimension element within the project.
Top
See Also
Reference
RadialDimension Class
Autodesk.Revit.DB Namespace