Revit 2027 API
CurtainGridLine Methods
The CurtainGridLine type exposes the following members.
Methods
Name | Description
AddAllSegments | All the segments on this grid line will be added.
AddMullions |  Add mullions on the specified segments of a grid. If any segment already has a mullion, no change is made to that segment.
AddSegment | Add a segment based on the specified segment curve of the gridline.
RemoveSegment | Remove the segment specified by the input curve.
Top
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace