Revit 2027 API
FamilyInstance Class
 This object represents a single instance of a family type, such as a single I beam.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 Autodesk.Revit.DB.FamilyInstance
 Autodesk.Revit.DB.AnnotationSymbol
 Autodesk.Revit.DB.Mullion
 Autodesk.Revit.DB.Panel
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyInstance : Instance
Public Class FamilyInstance
	Inherits Instance
public ref class FamilyInstance : public Instance
type FamilyInstance =
    class
        inherit Instance
    end
The FamilyInstance type exposes the following members.
Properties
Name | Description
CanFlipFacing | Property to test whether the orientation of family instance facing can be flipped.
CanFlipHand | Property to test whether the orientation of family instance hand can be flipped.
CanFlipWorkPlane | Identifies if the instance can flip its work plane.
CanRotate | Property to test whether the family instance can be rotated by 180 degrees.
CanSplit | Identifies whether a particular family instance can be split at a point on it's defining curve (by Split(Double)).
ExtensionUtility | Property to check whether the instance can be extended and return the interface for extension operation.
FacingFlipped | Property to test whether the orientation of family instance facing is flipped.
FacingOrientation | Property to get the orientation of family instance facing.
FromRoom | The "From Room" set for the door or window in the last phase of the project.
FromRoom[Phase]
HandFlipped | Property to test whether the orientation of family instance hand is flipped.
HandOrientation | Property to get the orientation of family instance hand.
HasSpatialElementCalculationPoint | Identifies if this instance has a single SpatialElementCalculationPoint used as the search point for Revit to identify if the instance is inside a room or space.
HasSpatialElementFromToCalculationPoints | Identifies if this instance has a pair of SpatialElementCalculationPoints used as the search points for Revit to identify if the instance lies between up to two rooms or spaces.
Host | If the instance is contained within another element, this property returns the containing element. An instance that is face hosted will return the element containing the face.
HostFace | Property to get the reference to the host face of family instance.
HostParameter | If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve, as long as the family of the instance isn't work plane based.
Invisible | Property to test whether the family instance is invisible.
IsSlantedColumn |  Indicates if the family instance is a slanted column.
IsWorkPlaneFlipped | Identifies if the instance's work plane is flipped.
Location | This property is used to find the physical location of an instance within project.
(Overrides Element.Location)
MEPModel | Retrieves the MEP model for the family instance.
Mirrored | Property to test whether the family instance is mirrored. (only one axis is flipped)
Room | The room in which the instance is located (during the last phase of the project).
Room[Phase]
Space | The space in which the instance is located (during the last phase of the project).
Space[Phase]
StructuralMaterialId | Identifies the material that defines the instance's structural analysis properties.
StructuralMaterialType | This property returns the physical material from which the instance is made.
StructuralType | Provides the primary structural type of the instance, such as beam or column etc.
StructuralUsage | Provides the primary structural usage of the instance, such as brace, girder etc.
SuperComponent | Property to get the super component of current family instance.
Symbol | Returns or changes the FamilySymbol object that represents the type of the instance.
ToRoom | The "To Room" set for the door or window in the last phase of the project.
ToRoom[Phase]
Top
Methods
Name | Description
AddCoping | Adds a coping (cut) to a steel beam.
flipFacing | The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
FlipFromToRoom |  Flips the settings of "From Room" and "To Room" for the door or window instance.
flipHand | The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
GetCopingIds | Lists the elements currently used as coping cutters for this element.
GetFamilyPointPlacementReferences | Returns the Point Placement References for the Family Instance.
GetOriginalGeometry |  Returns the original geometry of the instance, before the instance is modified by joins, cuts, coping, extensions, or other post-processing.
GetReferenceByName |  Gets the family instance reference corresponding to the named reference plane in the instance's family.
GetReferenceName |  Gets the name of the reference plane in the family corresponding to the given family instance reference.
GetReferences |  Gets family instance references corresponding to the reference planes or reference lines of the given reference type in the instance's family.
GetReferenceType |  Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
GetSpatialElementCalculationPoint | Gets the location of the calculation point for this instance.
GetSpatialElementFromToCalculationPoints | Gets the locations for the calculation points for this instance.
GetSubComponentIds | Gets the sub component ElementIds of the current family instance.
GetSweptProfile | Gets the object that describes the profile that is swept along the driving curve for this instance.
HasModifiedGeometry | Identifies if the geometry of this FamilyInstance has been modified from the automatically generated default.
HasSweptProfile | Indicates if this instance can be represented as a swept profile.
RemoveCoping | Removes a coping (cut) from a steel beam.
rotate | The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
SetCopingIds | Specifies the set of coping cutters on this element.
Split | Splits the family instance element at a point on its defining curve.
Top
Remarks
 Examples of FamilyInstance objects within Autodesk Revit are Beams, Columns, Braces and Desks. The FamilyInstance object provides more detailed properties that enable the type of the family instance to be changed, thus changing their appearance within the project.
Example
public void GetInfo_FamilyInstance(FamilyInstance familyInstance)
{
    string message = "FamilyInstance : ";
    // Get FamilyInstance host name
    if (familyInstance.Host != null)
    {
        message += "\nFamilyInstance host name is : " + familyInstance.Host.Name;
    }
    foreach (ElementId materialId in familyInstance.GetMaterialIds(false))
    {
        Material material = familyInstance.Document.GetElement(materialId) as Material;
        message += "\nFamilyInstance e material : " + material.Name;
    }
    // Get FamilyInstance room name
    if (familyInstance.Room != null)
    {
        message += "\nFamilyInstance room name is : " + familyInstance.Room.Name;
    }
    // Get FamilyInstance structural type
    message += "\nFamilyInstance structural type is : " + familyInstance.StructuralType;
    // Get FamilyInstance structural usage
    message += "\nFamilyInstance structural usage is : " + familyInstance.StructuralUsage;
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace