Revit 2027 API
StructuralSectionGeneralT Properties
The StructuralSectionGeneralT type exposes the following members.
Properties
Name | Description
FlangeFillet |  Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet |  Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle |  Sloped flange angle. (rad)
SlopedWebAngle |  Sloped web angle. (rad)
TopWebFillet |  Top Web Fillet - fillet radius at the top of web.
WebToeOfFillet |  Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Top
See Also
Reference
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace