Revit 2027 API
BRepBuilderPersistentIds Methods
The BRepBuilderPersistentIds type exposes the following members.
Methods
Name | Description
AddSubTag |  Adds a correspondence between an ExternalGeometryId and a BRepBuilderGeometryId. Note that an existing correspondence in the map cannot be updated and that a particular BRepBuilderGeometryId may be related to at most one ExternalGeometryId.
Dispose
IsAssociatedBRepBuilderValid |  Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds.
IsBRepBuilderGeometryIdFaceOrEdge |  Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, the input BRepBuilderGeometryId must represent the ID of either a Face or an Edge.
IsValidBRepBuilderGeometryIdForNewCorrespondence |  Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input BRepBuilderGeometryId must not already exist.
IsValidExternalGeometryIdForNewCorrespondence |  Validates the input ExternalGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input ExternalGeometryId must not already exist.
Top
See Also
Reference
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace