Revit 2027 API
ExternalDataManagerDataItem Class
 Represents an item of the extenal data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalDataManagerDataItem
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalDataManagerDataItem : IDisposable
Public Class ExternalDataManagerDataItem
	Implements IDisposable
public ref class ExternalDataManagerDataItem : IDisposable
type ExternalDataManagerDataItem =
    class
        interface IDisposable
    end
The ExternalDataManagerDataItem type exposes the following members.
Constructors
Name | Description
ExternalDataManagerDataItem(ExternalDataManagerDataItem) |  Create a copy of the object.
ExternalDataManagerDataItem(ExternalDataManagerDataItemId) |  Constructor
Top
Properties
Name | Description
Count |  The count of the data item.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the data item.
Path |  The saved path of the data item.
PathType |  The path type of the saved path (e.g. "Absolute", "Relative", "Cloud").
ReferenceType |  The reference type of the data item (e.g. "Import", "Link", "Overlay", "Attachment").
Resolution |  The width and height of a image data item if applicable.
Size |  The file size (Bytes) of the data item if applicable.
Status |  The status of the data item.
Version |  The version of the data item.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalDataManagerDataItem
GetId |  Gets the id of the data item.
SetId |  Sets the id of the data item.
Top
Remarks
 A lightweight, UI-friendly wrapper around a piece of external data (image, model, point-cloud, etc.). Instances are returned by IExternalDataManagerServer.getData and displayed in the Manage Links dialog. Important implementation notes for server authors: Most properties are optional, so leave them at their default values when the information is not available. The dialog will gracefully hide columns that contain only default/invalid values. All user-visible strings (Name, ReferenceType, PathType) must be localized before they are passed to Revit. The identity (Id) must stay stable for the lifetime of the dialog session so that selections and previews remain valid. Consumers of this class (typically the UI) should treat objects as immutable once they have been handed over, and the server is responsible for creating fresh instances when data changes.
See Also
Reference
Autodesk.Revit.UI Namespace