Revit 2027 API
CheckoutElementsRequestTooLargeException Methods
The CheckoutElementsRequestTooLargeException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CheckoutElementsRequestTooLargeException Class
Autodesk.Revit.Exceptions Namespace