Revit 2027 API
ViewPrintingEventArgs Properties
The ViewPrintingEventArgs type exposes the following members.
Properties
Name | Description
Index |  The index of the view being printed out of the set of all views being printed.
TotalViews |  The number of all views being printed.
View |  The view to be printed.
Top
See Also
Reference
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace