Revit 2027 API
ConicalSurface Methods
The ConicalSurface type exposes the following members.
Methods
Name | Description
Create |  Creates a conical surface defined by a local reference frame and a half angle.
GetFrameOfReference |  Returns frame of reference associated with this ConicalSurface.
IsValidConeAngle |  Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
Top
See Also
Reference
ConicalSurface Class
Autodesk.Revit.DB Namespace