Revit 2027 API
DocumentReloadedLatestEventArgs Class
 The event arguments used by the DocumentReloadedLatestEvent event. This event will be raised when executing pull a latest changes from a central model.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadedLatestEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentReloadedLatestEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentReloadedLatestEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentReloadedLatestEventArgs : public RevitAPIPostDocEventArgs
type DocumentReloadedLatestEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentReloadedLatestEventArgs type exposes the following members.
Properties
Name | Description
Location |  Full path of the central model which is to be operated.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace