Revit 2027 API
PipeFittingAndAccessoryPressureDropData Methods
The PipeFittingAndAccessoryPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
GetPipeFittingAndAccessoryData |  Returns the fitting and accessory information
GetPresureDropItems |  Returns the pressure drop items
SetDefaultEntity |  Stores the default entity in the data.
Top
See Also
Reference
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace