Revit 2027 API
CentralModelException Class
The base class for exceptions that are common to both file-based and server-based central models or specific to just file-based central models.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 More
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class CentralModelException : ApplicationException
<SerializableAttribute>
Public Class CentralModelException
	Inherits ApplicationException
[SerializableAttribute]
public ref class CentralModelException : public ApplicationException
[<SerializableAttribute>]
type CentralModelException =
    class
        inherit ApplicationException
    end
The CentralModelException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CentralFileCommunicationException
 Autodesk.Revit.Exceptions.CentralModelAccessDeniedException
 Autodesk.Revit.Exceptions.CentralModelAlreadyExistsException
 Autodesk.Revit.Exceptions.CentralModelContentionException
 Autodesk.Revit.Exceptions.CentralModelVersionArchivedException
 Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException
 Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException
 Autodesk.Revit.Exceptions.ServerModelCorruptedException