Revit 2027 API
RouteAnalysisSettings Properties
The RouteAnalysisSettings type exposes the following members.
Properties
Name | Description
AnalysisZoneBottomOffset |  The bottom plane offset, in ft, of the zone used in route calculation. Default value is 8".
AnalysisZoneTopOffset |  The top plane offset, in ft, for the zone used in route calculation. Default value is 6'8".
EnableIgnoredCategoryIds
When this setting is true, elements with category ids returned by GetIgnoredCategoryIds will be ignored in route calculation. default is true as all elements with the Door Category Id are ignored by default.
IgnoreImports |  If true, import instances are ignored by route calculation. For imports to be ignored, also EnableIgnoredCategoryIds must be set to true.
MinimumLength |  The constant storing minimum allowed length of path of travel
Top
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace