Revit 2027 API
STLImportOptions Class
 The import options used to import STL format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.STLImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class STLImportOptions : BaseImportOptions
Public Class STLImportOptions
	Inherits BaseImportOptions
public ref class STLImportOptions : public BaseImportOptions
type STLImportOptions =
    class
        inherit BaseImportOptions
    end
The STLImportOptions type exposes the following members.
Constructors
Name | Description
STLImportOptions() |  Constructs a new instance of STLImportOptions with default values of all properties.
STLImportOptions(STLImportOptions) |  Constructs a new instance of STLImportOptions as a copy of the import options.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace