Revit 2027 API
Workset Methods
The Workset type exposes the following members.
Methods
Name | Description
Create |  Creates a new workset.
Top
See Also
Reference
Workset Class
Autodesk.Revit.DB Namespace