Revit 2027 API
RebarSpliceGeometry Methods
The RebarSpliceGeometry type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
RebarSpliceGeometry Class
Autodesk.Revit.DB.Structure Namespace