Revit 2027 API
DividedSurface Properties
The DividedSurface type exposes the following members.
Properties
Name | Description
AllGridRotation | Angle of rotation applied to the U- and V- directions together.
BorderTile | Determines the handling of tiles that overlap the surface's boundary.
ComponentRotation | The rotation of the pattern by a multiple of 90 degrees.
Host | The element whose surface has been divided.
HostReference | A reference to the divided face on the host.
IsComponentFlipped | Whether the pattern is flipped.
IsComponentMirrored | Whether the pattern is mirror-imaged.
NumberOfUGridlines | Get the number of U-gridlines used on the surface.
NumberOfVGridlines | Get the number of V-gridlines used on the surface.
UPatternIndent | The offset applied to the pattern by an integral number of grid nodes in the U-direction.
USpacingRule | Access to the rule for laying out the first series of equidistant parallel lines on the surface.
VPatternIndent | The offset applied to the pattern by an integral number of grid nodes in the V-direction.
VSpacingRule | Access to the rule for laying out the second series of equidistant parallel lines on the surface.
Top
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace