Revit 2027 API
RebarHandleNameData Class
 This class is used to contain the information about the rebar handle name defined by an external application.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarHandleNameData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarHandleNameData : IDisposable
Public Class RebarHandleNameData
	Implements IDisposable
public ref class RebarHandleNameData : IDisposable
type RebarHandleNameData =
    class
        interface IDisposable
    end
The RebarHandleNameData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarHandleNameData
GetCustomHandleTag |  Gets the handle tag for which we need to specify the name.
SetCustomHandleName |  Sets the name of the handle.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace