Revit 2027 API
FailureDefinition Methods
The FailureDefinition type exposes the following members.
Methods
Name | Description
AddResolutionType |  Adds a type of possible resolution for the failure.
CreateFailureDefinition |  Creates an instance of a FailureDefinition.
Dispose
GetApplicableResolutionTypes |  Retrieves a list of resolution types applicable to the failure.
GetDefaultResolutionType |  Retrieves the default resolution type for the failure.
GetDescriptionText |  Retrieves the description text of the failure.
GetResolutionCaption |  Retrieves the caption for a specific resolution type.
HasResolutions |  Checks if the FailureDefinition has at least one resolution.
IsResolutionApplicable |  Checks if the given resolution type is applicable to the failure.
SetDefaultResolutionType |  Sets the default resolution type for the failure.
Top
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace