Revit 2027 API
FaceToposolid Class
 An object that represents a face-based Toposolid within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.FaceToposolid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceToposolid : HostObject
Public Class FaceToposolid
	Inherits HostObject
public ref class FaceToposolid : public HostObject
type FaceToposolid =
    class
        inherit HostObject
    end
The FaceToposolid type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of a face toposolid attached to a non-vertical massing face.
GetReferencedFaces |  Gets the referenced faces of the face toposolid
SetFaceReferences |  Sets the referenced faces of the face toposolid
UpdateToFace |  Resets the face toposolid to its defining faces.
Top
See Also
Reference
Autodesk.Revit.DB Namespace