Revit 2027 API
ScheduleSheetInstance Methods
The ScheduleSheetInstance type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, XYZ) |  Create an instance of a schedule on a sheet.
Create(Document, ElementId, ElementId, XYZ, Int32) |  Creates an instance of a schedule segment on a sheet.
Top
See Also
Reference
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace