Revit 2027 API
ContinuousRailType Class
 A type element containing the properties of a continuous rail.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.ContinuousRailType
 Autodesk.Revit.DB.Architecture.HandRailType
 Autodesk.Revit.DB.Architecture.TopRailType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ContinuousRailType : ElementType
Public Class ContinuousRailType
	Inherits ElementType
public ref class ContinuousRailType : public ElementType
type ContinuousRailType =
    class
        inherit ElementType
    end
The ContinuousRailType type exposes the following members.
Properties
Name | Description
DefaultJoinOption |  The default join option between two rails.
EndOrTopExtensionLength |  The extension length of the rail termination at the end or top.
EndOrTopExtensionStyle |  The extension style of the rail termination at the end or top.
EndOrTopTermination |  The termination of the rail at the end or top.
FilletRadius |  The fillet radius of the rail join.
HandClearance |  The horizontal distance between the inner boundary of the rail and the path.
ProfileId |  The id of the profile of the rail
Projection |  The horizontal distance between the outer boundary of the rail and the path.
StartOrBottomExtensionLength |  The extension length of the rail termination at the beginning or bottom.
StartOrBottomExtensionStyle |  The extension style of the rail termination at the beginning or bottom.
StartOrBottomTermination |  The termination of the rail at the beginning or bottom.
Transition |  The transition option of the rail.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace