Revit 2027 API
RibbonButton Class
This class is the base class of PushButton and PulldownButton.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.PulldownButton
 Autodesk.Revit.UI.PushButton
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RibbonButton : RibbonItem
Public Class RibbonButton
	Inherits RibbonItem
public ref class RibbonButton : public RibbonItem
type RibbonButton =
    class
        inherit RibbonItem
    end
The RibbonButton type exposes the following members.
Properties
Name | Description
Image | The image of the button.
IsEnabledByContext | Indicates if this button can be executed. True if the pushbutton is permitted to be executed based on the current Revit context (active document, active view and active tool). False if the pushbutton is disabled because of the active context.
LargeImage | The large image shown on the button.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace