Revit 2027 API
SlabEdgeType Class
An object that represents the slab edge type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.HostedSweepType
 Autodesk.Revit.DB.SlabEdgeType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SlabEdgeType : HostedSweepType
Public Class SlabEdgeType
	Inherits HostedSweepType
public ref class SlabEdgeType : public HostedSweepType
type SlabEdgeType =
    class
        inherit HostedSweepType
    end
The SlabEdgeType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace