Revit 2027 API
AnalyticalToPhysicalAssociationManager Class
 Class which manages the associations between analytical elements and physical elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalToPhysicalAssociationManager : Element
Public Class AnalyticalToPhysicalAssociationManager
	Inherits Element
public ref class AnalyticalToPhysicalAssociationManager : public Element
type AnalyticalToPhysicalAssociationManager =
    class
        inherit Element
    end
The AnalyticalToPhysicalAssociationManager type exposes the following members.
Properties
Name | Description
EnableAssistedAssociation |  Indicates if associations between Analytical and Physical Elements should be created automatically.
Top
Methods
Name | Description
AddAssociation(ElementId, ElementId) |  Adds a new association between an analytical element and a physical element.
AddAssociation(ISet<ElementId>, ISet<ElementId>) |  Adds a new association between a group of analytical elements and a group of physical elements.
GetAnalyticalToPhysicalAssociationManager |  Returns the AnalyticalToPhysicalAssociationManager for this document.
GetAssociatedElementId |  Returns id of the element which is in association with the element with the given ElementId.
GetAssociatedElementIds |  Returns ids of the elements which are in association with the element with the given ElementId.
HasAssociation |  Verifies if the element has already defined an association.
IsAnalyticalElement |  Returns true if the element is an analytical element.
IsPhysicalElement |  Returns true if the element is a physical element.
RemoveAssociation |  This method will remove the association for the element with the given ElementId.
Top
Remarks
 An element can be part of only one association at a time. Physical elements can have one of these categories:
Columns
Curtain Wall Panels
Floors
Generic Models
Mass
Parts
Railings
Ramps
Roofs
Stairs
Structural Columns
Structural Foundation
Structural Framing
Structural Trusses
Structural Beam System
Walls
 Analytical elements can have one of these categories:
Analytical Member
Analytical Panel
See Also
Reference
Autodesk.Revit.DB.Structure Namespace