Revit 2027 API
RevitCommandId Class
 Represents a command id in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RevitCommandId
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitCommandId : IDisposable
Public Class RevitCommandId
	Implements IDisposable
public ref class RevitCommandId : IDisposable
type RevitCommandId =
    class
        interface IDisposable
    end
The RevitCommandId type exposes the following members.
Properties
Name | Description
CanHaveBinding |  Indicates whether the command can be assigned a binding to an external add-in.
HasBinding |  Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.
Id |  The command id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The command name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RevitCommandId
LookupCommandId |  Looks up and retrieves the Revit command id with the given id string.
LookupPostableCommandId |  Looks up and retrieves the Revit command id with the given id string.
Top
Remarks
 Each Revit command is assigned a command id and non-localized name. This class allows you to look up a command by its name, and represents any Revit command in the use of an AddInCommandBinding.
See Also
Reference
Autodesk.Revit.UI Namespace