Revit 2027 API
HVACLoadSpaceType Class
 The type element of space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.HVACLoadType
 Autodesk.Revit.DB.Analysis.HVACLoadSpaceType
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HVACLoadSpaceType : HVACLoadType
Public Class HVACLoadSpaceType
	Inherits HVACLoadType
public ref class HVACLoadSpaceType : public HVACLoadType
type HVACLoadSpaceType =
    class
        inherit HVACLoadType
    end
The HVACLoadSpaceType type exposes the following members.
Properties
Name | Description
IsPlenum |  True if the space type is plenum.
SpaceTypeName |  The space type name.
Top
Methods
Name | Description
Create |  Creates a space type.
IsNameUnique(String) |  Determines whether a potential space type name is unique.
IsNameUnique(Document, String) |  Determines whether a potential space type name is unique.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace