Revit 2027 API
DirectShapeTypeOptions Methods
The DirectShapeTypeOptions type exposes the following members.
Methods
Name | Description
Dispose
IsEqualTo |  Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same.
IsValid |  Determines whether a DirectShapeTypeOptions is internally consistent (valid).
Top
See Also
Reference
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace