Revit 2027 API
NumberingFormatSettings Methods
The NumberingFormatSettings type exposes the following members.
Methods
Name | Description
Dispose
GetParameter |  Get the parameter at the provided index incorporated into the numeric label.
GetParameters |  Get parameters incorporated into the numeric label.
RemoveParameter |  Remove a parameter from a specific index. The position where the parameter to be removed.
SetParameter |  Set parameter incorporated into the numeric label. Parameter to be added into the label The position where the parameter to be added
SetParameters |  Set parameters incorporated into the numeric label.
Top
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace