Revit 2027 API
GenericZone Class
 Provides access to the GenericZone Element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.GenericZone
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GenericZone : Element
Public Class GenericZone
	Inherits Element
public ref class GenericZone : public Element
type GenericZone =
    class
        inherit Element
    end
The GenericZone type exposes the following members.
Properties
Name | Description
Area |  The area for the zone, in square feet.
GeometricDefinition |  The geometric definition for this generic zone.
LevelOffset |  The offset distance from this zone to the associated level.
OccupiedArea |  The occupied area for the zone, in square feet.
OccupiedVolume |  The occupied volume for the zone, in cubic feet.
Perimeter |  The perimeter for the zone, in feet.
Volume |  The volume for the zone, in cubic feet.
Top
Methods
Name | Description
AddSpaces |  Adds spaces to the zone.
ConvertSpaceBasedToSketchBased |  Converts a space-based generic zone to a sketch-based generic zone.
CreateSketchBased |  Creates a new instance of a sketch-based generic zone and adds it to the document.
CreateSpaceBased |  Creates a new instance of a generic zone using a set of spaces and adds it to the document.
GetBoundaries |  Gets the boundaries for the generic zone.
GetDomainData |  Gets the domain data for the generic zone.
GetSketchId |  Gets the sketch id for the generic zone.
GetSpaceIds |  Gets a list of ElementIds of the associated spaces for the zone.
RemoveSpaces |  Removes spaces from the zone.
Top
Remarks
 A generic zone is a tool that provides for a method of selecting elements that somehow come in contact with the zone object. A zone is a non-hierarchical structure of geometric information, area or volume definitions for the purpose of analysis. A generic zone will contain specific domain requirements provided at creation of the element.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace