Revit 2027 API
ConnectorManager Class
 Provides access to the Connector Manager
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ConnectorManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConnectorManager : IDisposable
Public Class ConnectorManager
	Implements IDisposable
public ref class ConnectorManager : IDisposable
type ConnectorManager =
    class
        interface IDisposable
    end
The ConnectorManager type exposes the following members.
Properties
Name | Description
Connectors | Return all the Connectors of the Connector Manager.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Owner |  This property is used to retrieve the owner of the Connector Manager.
UnusedConnectors | Return all the unused Connectors of the Connector Manager.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConnectorManager
Lookup |  Lookup the connector using the unique index value that identify this connector.
Top
See Also
Reference
Autodesk.Revit.DB Namespace