Revit 2027 API
StairsPath Properties
The StairsPath type exposes the following members.
Properties
Name | Description
DownText |  The stairs down text.
DownTextOffset |  The offset of stairs down text.
ShowDownText |  Represents whether show stairs down text or not.
ShowUpText |  Represents whether show stairs up text or not.
StairsId |  The host stairs element id.
StairsPathOffset |  The offset of stairs path to center line of stairs.
TextOrientation |  The orientation of stair up and down text.
UpText |  The stairs up text.
UpTextOffset |  The offset of stairs up text.
Top
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace