Revit 2027 API
AreaBasedLoadData Class
 Represents the electrical area based load data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.ZoneElementDomainData
 Autodesk.Revit.DB.Electrical.AreaBasedLoadData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaBasedLoadData : ZoneElementDomainData
Public Class AreaBasedLoadData
	Inherits ZoneElementDomainData
public ref class AreaBasedLoadData : public ZoneElementDomainData
type AreaBasedLoadData =
    class
        inherit ZoneElementDomainData
    end
The AreaBasedLoadData type exposes the following members.
Properties
Name | Description
ApparentLoad |  The electrical apparent load of the area based load.
ApparentPowerDensity |  The apparent power density of the area based load.
AreaBasedLoadType |  The electrical area based load type of the area based load.
ConnectedPhases |  The electrical connected phases of the area based load to its upstream node.
Current |  The current of the area based load .
LoadClassification |  The load classification of the area based load.
LoadDensity |  The load density of the area based load.
LoadType |  The load type of the area based load.
PhasesNumber |  The number of electrical phases of the area based load.
PowerFactor |  The power factor of the area based load.
PowerFactorState |  The power factor state of the area based load.
TrueLoad |  The electrical true load of the area based load.
Voltage |  The voltage of the area based load.
Top
Methods
Name | Description
AddElectricalLoadArea |  Adds electrical load area into the area based load.
CanConnectToUpstreamNode |  Verifies that the area based load can connect to the upstream electrical analytical node. If the area based load already has an upstream node or the upstream node is full of downstream nodes, the area based load can't connect to the upstream node.
CanDisconnectFromUpstreamNode |  Verifies that the area based load can disconnect from the upstream electrical analytical node. If the area based load hasn't an upstream node, it can't disconnect from the upstream node.
ConnectToUpstreamNode |  Connects to an upstream electrical analytical node.
DisconnectFromUpstreamNode |  Disconnects from an upstream electrical analytical node.
GetElectricalLoadAreas |  Gets electrical load areas which the area based load includes.
GetUpstreamNodeId |  Gets the upstream electrical analytical node id.
RemoveElectricalLoadArea |  Removes electrical load area from the area based load.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace