Revit 2027 API
GroupNode Methods
The GroupNode type exposes the following members.
Methods
Name | Description
GetTransform |  A transformation matrix associated with the node.
Top
See Also
Reference
GroupNode Class
Autodesk.Revit.DB Namespace