Revit 2027 API
IFCData Methods
The IFCData type exposes the following members.
Methods
Name | Description
AsAggregate |  Gets storage value as IFCAggregate when its PrimitiveType is aggregate.
AsBoolean |  Gets storage value as boolean when its PrimitiveType is boolean.
AsDouble |  Gets storage value as double when its PrimitiveType is double.
AsInstance |  Gets storage value as IFCAnyHandle when its PrimitiveType is instance.
AsInteger |  Gets storage value as integer when its PrimitiveType is integer.
AsLogical |  Gets storage value as IFCLogical when its PrimitiveType is logical.
AsString |  Gets storage value as string when its PrimitiveType is string, binary or enumeration.
CreateBinary |  Creates a binary data object.
CreateBoolean |  Creates a boolean data object.
CreateBooleanOfType |  Creates a boolean data object of the specified type.
CreateDouble |  Creates a double data object.
CreateDoubleOfType |  Creates a double data object of the specified type.
CreateEnumeration |  Creates a enum data object.
CreateIFCAggregate |  Creates an IFCAggregate data object.
CreateIFCAnyHandle |  Creates an IFCAnyHandle data object.
CreateInteger |  Creates an integer data object.
CreateIntegerOfType |  Creates an integer data object of the specified type.
CreateLogical |  Creates a logical data object.
CreateLogicalOfType |  Creates a logical data object of the specified type.
CreateString |  Creates a string data object.
CreateStringOfType |  Creates a string data object of the specified type.
Dispose
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the hash code.
(Overrides Object.GetHashCode())
GetSimpleType |  Gets the IFC type name.
GetTypeList |  Gets the multiple strings represent one IFC type name.
HasSimpleType |  Determines if there is one corresponding IFC type.
SetSimpleType |  Sets the corresponding IFC type by its name.
SetTypeList
Top
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace