Revit 2027 API
EndTreatmentType Class
 An end treatment type object that is used to hold information about the end treatment applied to bars that are connected to a coupler.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.EndTreatmentType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EndTreatmentType : ElementType
Public Class EndTreatmentType
	Inherits ElementType
public ref class EndTreatmentType : public ElementType
type EndTreatmentType =
    class
        inherit ElementType
    end
The EndTreatmentType type exposes the following members.
Properties
Name | Description
EndTreatment |  String describing the end treatment
Top
Methods
Name | Description
Create(Document) |  Creates a new EndTreatmentType in the specified document.
Create(Document, String) |  Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter.
CreateDefaultEndTreatmentType |  Creates a new EndTreatmentType object with a default name.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace