Revit 2027 API
DuctSizeSettings Properties
The DuctSizeSettings type exposes the following members.
Properties
Name | Description
Item |  Get the DuctSizes for this DuctShape.
Top
See Also
Reference
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace