Revit 2027 API
HVACLoadBuildingType Methods
The HVACLoadBuildingType type exposes the following members.
Methods
Name | Description
Create |  Creates a building type element.
IsNameUnique(String) |  Determines whether a potential building type name is unique.
IsNameUnique(Document, String) |  Determines whether a potential building type name is unique.
IsValidTime |  Check if the string can be parsed to a valid time for opening time and closing time. A valid string can be "16:30" or "4:30 PM";
Top
See Also
Reference
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace