Revit 2027 API
Zone Methods
The Zone type exposes the following members.
Methods
Name | Description
CreateAreaBasedLoad |  Creates a new instance of an area based load and adds it to the document.
GetDomainData |  Gets the domain data for the zone.
Top
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace