Revit 2027 API
BoundarySegment Methods
The BoundarySegment type exposes the following members.
Methods
Name | Description
Dispose
GetCurve |  Get a copy of the curve that is formed along this boundary.
Top
See Also
Reference
BoundarySegment Class
Autodesk.Revit.DB Namespace