Revit 2027 API
RebarSpliceRules Methods
The RebarSpliceRules type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of RebarSpliceRules with the default options.
Dispose
SetMaximumAndMinimumBarLength |  Sets the maximum and minimum bar length.
Top
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace