Revit 2027 API
PanelTypeSetIterator Class
An iterator to a panel type set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PanelTypeSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class PanelTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class PanelTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class PanelTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type PanelTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The PanelTypeSetIterator type exposes the following members.
Constructors
Name | Description
PanelTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace