Revit 2027 API
AnalysisDisplayStyle Methods
The AnalysisDisplayStyle type exposes the following members.
Methods
Name | Description
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayColoredSurfaceSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Colored Surface for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayDeformedShapeSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Deformed Shape for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayDiagramSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Diagram for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayMarkersAndTextSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Markers and Text for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayVectorSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Vectors for the given document.
FindByName |  Finds analysis display style by name.
GetColoredSurfaceSettings |  Get colored surface settings object from the style.
GetColorSettings |  Get color settings object from the style.
GetDeformedShapeSettings |  Get deformed shape settings object from the style.
GetDiagramSettings |  Get diagram settings object from the style.
GetElements |  Returns set of all analysis display styles elements in the given document.
GetLegendSettings |  Get legend settings object from the style.
GetMarkersAndTextSettings |  Get markers and text settings object from the style.
GetVectorSettings |  Get vector settings object from the style.
HasColoredSurfaceSettings |  If true style has colored surface settings.
HasDeformedShapeSettings |  If true style has deformed shape settings.
HasDiagramSettings |  If true style has diagram settings.
HasMarkersAndTextSettings |  If true style has markers and text settings.
HasVectorSettings |  If true style has vector settings.
IsNameUnique |  Verify the uniqueness of the name among all analysis display style elements of the document.
IsTextTypeIdValid |  Verify if text type id is valid.
SetColoredSurfaceSettings |  Set colored surface settings object for the style.
SetColorSettings |  Set color settings object for the style.
SetDeformedShapeSettings |  Set deformed shape settings object for the style.
SetDiagramSettings |  Set diagram settings object for the style.
SetLegendSettings |  Set legend settings object for the style.
SetMarkersAndTextSettings |  Set markers and text settings object for the style.
SetName |  Set name of analysis display style element.
SetVectorSettings |  Set vector settings object for the style.
Top
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace