Revit 2027 API
ArgumentOutOfRangeException Methods
The ArgumentOutOfRangeException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ArgumentOutOfRangeException Class
Autodesk.Revit.Exceptions Namespace