Revit 2027 API
DisableAnalyticalModelCB Class
 Disable the analytical model for a structural wall.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureResolution
 Autodesk.Revit.DB.DisableAnalyticalModelCB
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DisableAnalyticalModelCB : FailureResolution
Public Class DisableAnalyticalModelCB
	Inherits FailureResolution
public ref class DisableAnalyticalModelCB : public FailureResolution
type DisableAnalyticalModelCB =
    class
        inherit FailureResolution
    end
The DisableAnalyticalModelCB type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace