Revit 2027 API
WorksharedOperationProgressChangedEventArgs Class
 The event arguments used by the WorksharedOperationProgressChanged event, this event will be raised when executing following workshared operations.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksharedOperationProgressChangedEventArgs : RevitAPISingleEventArgs
Public Class WorksharedOperationProgressChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class WorksharedOperationProgressChangedEventArgs : public RevitAPISingleEventArgs
type WorksharedOperationProgressChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The WorksharedOperationProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
Location |  Full path of the central model which is to be operated.
Status |  Gets API event status, reflect current operation execution status.
Top
Methods
Name | Description
Top
Remarks
Remarks
 For synchronizing with central operation, there are 4 steps. 1) Save to local (before save to central) - Serializes the streams from memory to local disk cache; [!:Autodesk::Revit::DB::Events::DocumentSaveToLocalProgressChangedEventArgs] 2) Reload latest - Downloads the streams from central model on server and merge them into local memory; [!:Autodesk::Revit::DB::Events::DocumentReloadLatestProgressChangedEventArgs] 3) Save to central - Uploads merged streams from local memory to server central model; [!:Autodesk::Revit::DB::Events::DocumentSaveToCentralProgressChangedEventArgs] 4) Save to local (after save to central) - Serializes the merged streams from memory to local disk cache; [!:Autodesk::Revit::DB::Events::DocumentSaveToLocalProgressChangedEventArgs]
 For document open operation, just download the model from server and then open it; [!:Autodesk::Revit::DB::Events::CreateRelatedFileProgressChangedEventArgs]
It is NOT recommended to deal with time-consuming work when handling WorksharedOperationProgressChanged event, otherwise it would increase synchronizing with central or model open time.
See Also
Reference
Autodesk.Revit.DB.Events Namespace