Revit 2027 API
Connector Methods
The Connector type exposes the following members.
Methods
Name | Description
ConnectTo | Make connection between two connectors.
DisconnectFrom | Remove connection between two connectors.
Dispose
GetFabricationConnectorInfo |  Gets fabrication connectivity information.
GetMEPConnectorInfo |  Gets MEP connector information.
IsConnectedTo | Identifies if the connector is connected to the specified connector.
Top
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace