Revit 2027 API
EnergyAnalysisWindowType Class
 The EnergyAnalysisWindowType class contains the thermal properties (e.g., heat transfer coefficient) of the window-type analytical openings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyAnalysisWindowType : Element
Public Class EnergyAnalysisWindowType
	Inherits Element
public ref class EnergyAnalysisWindowType : public Element
type EnergyAnalysisWindowType =
    class
        inherit Element
    end
The EnergyAnalysisWindowType type exposes the following members.
Properties
Name | Description
Description |  The description of the window type.
HeatTransferCoefficient | Obsolete.
 The heat transfer coefficient value (U-value) of the window type, in W/(m^2*K) (equivalent to kg/(k*s^3)).
IsSchematic |  Indicates if this originates from a schematic or analytical construction.
SolarHeatGainCoefficient |  The solar heat gain coefficient (SHGC-value) for the window type, from 0.0 to 1.0.
ThermalTransmittance |  The thermal transmittance value (U-value) of the window type, in W/(m^2*K) (equivalent to kg/(k*s^3)).
Transmittance |  The visual light transmittance value (VLT-value) for the window type, from 0.0 to 1.0.
WindowTypeName |  The name of the window type.
Top
Methods
Name | Description
GetSolarHeatGainCoefficientsForSolarIndicientAngles |  Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace