Revit 2027 API
CriticalPathIterator Class
 An iterator to traverse the critical path in the CriticalPathCollector.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.CriticalPathIterator
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CriticalPathIterator : IEnumerator<MEPNetworkSegmentId>
Public Class CriticalPathIterator
	Implements IEnumerator(Of MEPNetworkSegmentId)
public ref class CriticalPathIterator : IEnumerator<MEPNetworkSegmentId^>
type CriticalPathIterator =
    class
        interface IEnumerator<MEPNetworkSegmentId>
    end
The CriticalPathIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CriticalPathIterator
GetCurrent |  Gets the analytical segment id at the current iterating position.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next downstream segment on the critical path.
Reset |  Resets the iterator to the beginning segment.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace