Revit 2027 API
WrongUserException Methods
The WrongUserException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
WrongUserException Class
Autodesk.Revit.Exceptions Namespace