Revit 2027 API
DGNExportOptions Methods
The DGNExportOptions type exposes the following members.
Methods
Name | Description
GetExportLineweightTable |  Gets a copy of the line weight table.
GetPredefinedOptions |  Returns an instance DGNExportOptions containing settings from a predefined export setup.
GetPredefinedSetupNames |  Returns a list of names of predefined setups of DGN export options.
SetExportLineweightTable |  Sets the line weight table to use during export.
Top
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace