Revit 2027 API
FabricationPartInsulationLining Class
 Represents insulation or lining applied to a fabrication part.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FabricationPartInsulationLining
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationPartInsulationLining : Element
Public Class FabricationPartInsulationLining
	Inherits Element
public ref class FabricationPartInsulationLining : public Element
type FabricationPartInsulationLining =
    class
        inherit Element
    end
The FabricationPartInsulationLining type exposes the following members.
Properties
Name | Description
OwnerId |  The ElementId of the owner fabrication part.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace