Revit 2027 API
ExternalDefinitions Class
Supports the creation of new shared parameters definitions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definitions
 Autodesk.Revit.DB.ExternalDefinitions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalDefinitions : Definitions
Public Class ExternalDefinitions
	Inherits Definitions
public ref class ExternalDefinitions : public Definitions
type ExternalDefinitions =
    class
        inherit Definitions
    end
The ExternalDefinitions type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace