Revit 2027 API
KeyBasedTreeEntry Class
 A key-based tree entry, containing the key, parent key, and children keys (if applicable).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntry
 Autodesk.Revit.DB.ClassificationEntry
 Autodesk.Revit.DB.KeynoteEntry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntry : IDisposable
Public Class KeyBasedTreeEntry
	Implements IDisposable
public ref class KeyBasedTreeEntry : IDisposable
type KeyBasedTreeEntry =
    class
        interface IDisposable
    end
The KeyBasedTreeEntry type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Key |  The key of this entry.
ParentKey |  The parent key of this entry.
Top
Methods
Name | Description
Dispose | Releases all resources used by the KeyBasedTreeEntry
GetChildrenKeys |  Gets a collection containing the keys of all children entry objects from this entry.
Top
See Also
Reference
Autodesk.Revit.DB Namespace