Revit 2027 API
PipePlumbingFixtureFlowData Class
 The input and output data used by external servers for calculation of the pipe plumbing fixture flow.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipePlumbingFixtureFlowData : IDisposable
Public Class PipePlumbingFixtureFlowData
	Implements IDisposable
public ref class PipePlumbingFixtureFlowData : IDisposable
type PipePlumbingFixtureFlowData =
    class
        interface IDisposable
    end
The PipePlumbingFixtureFlowData type exposes the following members.
Properties
Name | Description
DimensionFlow |  The dimension flow which is used to calculate flow of the pipe. Units: (gal/min).
FixtureUnits |  The fixture units of the pipe.
Flow |  The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min).
FlowConfiguration |  The flow configuration mode of the pipe.
FlowConversionMode |  The flow conversion mode of the pipe.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipePlumbingFixtureFlowData
Top
Remarks
 FlowConfiguration, FixtureUnits, FlowConversionMode, and DimensionFlow are input field values for the calculation. Flow is output field value for the calculation.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace