Revit 2027 API
IntersectionResultArrayIterator Properties
The IntersectionResultArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
IntersectionResultArrayIterator Class
Autodesk.Revit.DB Namespace