Revit 2027 API
SketchBase Class
Provides access to the SketchBase in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SketchBase
 Autodesk.Revit.DB.Path3d
 Autodesk.Revit.DB.Sketch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SketchBase : Element
Public Class SketchBase
	Inherits Element
public ref class SketchBase : public Element
type SketchBase =
    class
        inherit Element
    end
The SketchBase type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
SketchBase is the base class of Sketch.
See Also
Reference
Autodesk.Revit.DB Namespace