Revit 2027 API
ClassificationEntry Class
 Represents an entry in the classification table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntry
 Autodesk.Revit.DB.ClassificationEntry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ClassificationEntry : KeyBasedTreeEntry
Public Class ClassificationEntry
	Inherits KeyBasedTreeEntry
public ref class ClassificationEntry : public KeyBasedTreeEntry
type ClassificationEntry =
    class
        inherit KeyBasedTreeEntry
    end
The ClassificationEntry type exposes the following members.
Constructors
Name | Description
ClassificationEntry |  Constructs a ClassificationEntry object
Top
Properties
Name | Description
CategoryId |  The id of the category associated with this entry.
Description |  The description associated with this entry.
Level |  The entry level in the classification table. The expected range is between 1 and 5 inclusive.
Top
Methods
Name | Description
HasBadCategoryId |  Checks if the category id is Revit BuiltInCategory id.
HasBadLevel |  Checks if the level is an integer in range between 1 and 5 inclusive.
HasInvalidKey |  Checks if the key matches the level and parent key.
Top
See Also
Reference
Autodesk.Revit.DB Namespace