Revit 2027 API
ProgressChangedEventArgs Class
 The event arguments used by the ProgressChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.ProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ProgressChangedEventArgs : RevitAPISingleEventArgs
Public Class ProgressChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class ProgressChangedEventArgs : public RevitAPISingleEventArgs
type ProgressChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The ProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
Caption |  The text from the progress bar caption that describes the operation in progress
LowerRange |  Lower part of progress bar range - always zero
Position |  Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
Stage |  The current stage of the progress bar
UpperRange |  Upper part of progress bar range - will be any non-zero number
Top
Methods
Name | Description
Cancel |  Requests to cancel the progress bar's operation.
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace