Revit 2027 API
VoltageTypeSet Properties
The VoltageTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of voltage types that are in the set.
Top
See Also
Reference
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace