Revit 2027 API
DuctPressureDropData Methods
The DuctPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace