Revit 2027 API
StairsLanding Properties
The StairsLanding type exposes the following members.
Properties
Name | Description
BaseElevation |  The base elevation of the landing.
IsAutomaticLanding |  True if the landing is an automatic landing, False otherwise.
Thickness |  The thickness of the landing.
Top
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace