Revit 2027 API
PipeSettings Properties
The PipeSettings type exposes the following members.
Properties
Name | Description
AnalysisForClosedLoopHydronicPipingNetworks |  Indicates whether to enable analysis for closed loop hydronic piping networks.
Centerline |  The abbreviation of the Centerline (=) string.
ConnectorSeparator |  The connector separator string.
ConnectorTolerance |  The connector tolerance value.
FittingAngleUsage |  Determine how to use fitting angle during pipe layout or modifying layout.
FittingAnnotationSize |  The value of fitting annotation size.
FlatOnBottom |  The abbreviation of the Flat On Bottom (FOB) string.
FlatOnTop |  The abbreviation of the Flat On Top (FOT) string.
SetDown |  The abbreviation of the Set Down (SD) string.
SetDownFromBottom |  The abbreviation of the Set Down from bottom of fitting (SDB) string.
SetUp |  The abbreviation of the Set Up (SU) string.
SetUpFromBottom |  The abbreviation of the Set Up from bottom of fitting(SUB) string.
SizePrefix |  The size prefix string.
SizeSuffix |  The size suffix string.
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
Top
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace