Revit 2027 API
IExportContext2D Methods
The IExportContext2D type exposes the following members.
Methods
Name | Description
OnElementBegin2D |  This method marks the beginning of an element to be exported.
OnElementEnd2D |  This method marks the end of an element being exported.
OnFaceEdge2D |  This method is called when a Face edge is being output.
OnFaceSilhouette2D |  This method is called when a Face silhouette is being output.
Top
See Also
Reference
IExportContext2D Interface
Autodesk.Revit.DB Namespace