Revit 2027 API
CoordinationModelLinkData Methods
The CoordinationModelLinkData type exposes the following members.
Methods
Name | Description
Dispose
GetCategoryNames |  Return the category names of all elements inside the current Coordination Model Link from Autodesk Docs.
GetPathType |  Returns the path type of the Coordination Model link.
 For a Coordination Model from Autodesk Docs, path type is Cloud.
 For a local Coordination Model, path type can be Absolute or Relative.
Top
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace