Revit 2027 API
AssemblyMemberDifferentType Class
 The two assembly members being compared have different type
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyMemberDifferentType : AssemblyMemberDifference
Public Class AssemblyMemberDifferentType
	Inherits AssemblyMemberDifference
public ref class AssemblyMemberDifferentType : public AssemblyMemberDifference
type AssemblyMemberDifferentType =
    class
        inherit AssemblyMemberDifference
    end
The AssemblyMemberDifferentType type exposes the following members.
Properties
Name | Description
TypeId1 |  Type id of the first assembly member
TypeId2 |  Type id of the second assembly member
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace