Revit 2027 API
ElementArrayIterator Methods
The ElementArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
ElementArrayIterator Class
Autodesk.Revit.DB Namespace