Revit 2027 API
PointOnFace Methods
The PointOnFace type exposes the following members.
Methods
Name | Description
GetFaceReference | Get a copy of the face reference.
SetFaceReference | Change the face reference.
Top
See Also
Reference
PointOnFace Class
Autodesk.Revit.DB Namespace