Revit 2027 API
DocumentPrintedEventArgs Class
 The event arguments used by the DocumentPrinted event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentPrintedEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentPrintedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentPrintedEventArgs : public RevitAPIPostDocEventArgs
type DocumentPrintedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentPrintedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetFailedViewElementIds |  Returns ElementIds of the views that that failed to print (if any).
GetPrintedViewElementIds |  Returns ElementIds of the views that printed successfully.
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace