Revit 2027 API
TilePattern Properties
The TilePattern type exposes the following members.
Properties
Name | Description
TilePatternType | The built-in system tile pattern specified by this object.
TilesPerSeedNode | Get the number of tiles located at each seed node.
Top
See Also
Reference
TilePattern Class
Autodesk.Revit.DB Namespace