Revit 2027 API
DocumentPrintedEventArgs Methods
The DocumentPrintedEventArgs type exposes the following members.
Methods
Name | Description
GetFailedViewElementIds |  Returns ElementIds of the views that that failed to print (if any).
GetPrintedViewElementIds |  Returns ElementIds of the views that printed successfully.
Top
See Also
Reference
DocumentPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace