Revit 2027 API
BRepBuilderEdgeGeometry Methods
The BRepBuilderEdgeGeometry type exposes the following members.
Methods
Name | Description
Create(Curve) |  Construct BRepBuilderEdgeGeometry based on any Revit Curve, including Line and Arc. The curve will be simplified if possible.
Create(XYZ, XYZ) |  Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points.
Dispose
Top
See Also
Reference
BRepBuilderEdgeGeometry Class
Autodesk.Revit.DB Namespace