Revit 2027 API
AssetSetIterator Methods
The AssetSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Reset
Top
See Also
Reference
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace