Revit 2027 API
CannotOpenBothCentralAndLocalException Class
The exception thrown when both a central model and also a local file for the same central model are opened in the same session.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class CannotOpenBothCentralAndLocalException : InvalidOperationException
<SerializableAttribute>
Public Class CannotOpenBothCentralAndLocalException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class CannotOpenBothCentralAndLocalException : public InvalidOperationException
[<SerializableAttribute>]
type CannotOpenBothCentralAndLocalException =
    class
        inherit InvalidOperationException
    end
The CannotOpenBothCentralAndLocalException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace