Revit 2027 API
FieldBuilder Class
 This class is used to create Fields in the Extensible Storage framework.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FieldBuilder : IDisposable
Public Class FieldBuilder
	Implements IDisposable
public ref class FieldBuilder : IDisposable
type FieldBuilder =
    class
        interface IDisposable
    end
The FieldBuilder type exposes the following members.
Constructors
Name | Description
FieldBuilder(FieldBuilder) |  Constructs a new copy of the input ESFieldBuilder object.
FieldBuilder(Field, SchemaBuilder) |  Constructs a new FieldBuilder using the field and associated SchemaBuilder object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FieldBuilder
NeedsSubSchemaGUID |  Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
NeedsUnits |  Checks whether the field type requires explicit unit conversions.
Ready |  Checks whether the builder may be used.
SetDocumentation |  Sets the documentation string for the Field.
SetSpec |  Sets the spec describing the field's values.
SetSubSchemaGUID |  Sets the GUID of the Schema of the Entities that are intended to be stored in this field.
Top
See Also
Reference
Autodesk.Revit.DB.ExtensibleStorage Namespace