Revit 2027 API
FilterElementIdRule Properties
The FilterElementIdRule type exposes the following members.
Properties
Name | Description
RuleValue |  The user-supplied value against which values from a Revit document will be tested.
Top
See Also
Reference
FilterElementIdRule Class
Autodesk.Revit.DB Namespace