Revit 2027 API
RevitAPIPreEventArgs Class
 The class is used as a base class for the arguments for any pre-event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 More
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitAPIPreEventArgs : RevitAPIEventArgs
Public Class RevitAPIPreEventArgs
	Inherits RevitAPIEventArgs
public ref class RevitAPIPreEventArgs : public RevitAPIEventArgs
type RevitAPIPreEventArgs =
    class
        inherit RevitAPIEventArgs
    end
The RevitAPIPreEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
Top
Remarks
 A pre-event is the event raised before executing the process that was related with the event.
See Also
Reference
Autodesk.Revit.DB.Events Namespace
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
 Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
 Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.UI.Events.ApplicationClosingEventArgs
 Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
 Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs
 Autodesk.Revit.UI.Events.FormulaEditingEventArgs
 Autodesk.Revit.UI.Events.IdlingEventArgs