Revit 2027 API
ViewsExportedByContextEventArgs Class
 The event arguments used by the ViewsExportedByContext event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ViewsExportedByContextEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewsExportedByContextEventArgs : RevitAPIPostDocEventArgs
Public Class ViewsExportedByContextEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ViewsExportedByContextEventArgs : public RevitAPIPostDocEventArgs
type ViewsExportedByContextEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ViewsExportedByContextEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetViewIds |  Gets the views that were exported by CustomExporter.
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace