Revit 2027 API
PropertyTableEntry Methods
The PropertyTableEntry type exposes the following members.
Methods
Name | Description
Create |  Creates a new PropertyTableEntry object.
Dispose
IsValidPropertyTableEntry |  Function used to check the input data is valid to create PropertyTableEntry object
Top
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace