Revit 2027 API
EdgeArrayArrayIterator Class
An iterator to an array or edge arrays.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.EdgeArrayArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class EdgeArrayArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class EdgeArrayArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class EdgeArrayArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type EdgeArrayArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The EdgeArrayArrayIterator type exposes the following members.
Constructors
Name | Description
EdgeArrayArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace