Revit 2027 API
DocumentPrintingEventArgs Methods
The DocumentPrintingEventArgs type exposes the following members.
Methods
Name | Description
GetSettings |  Gets the print settings of the active printing session.
GetViewElementIds |  Returns ElementIds of the views to be printed.
Top
See Also
Reference
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace