Revit 2027 API
FileArgumentNotFoundException Methods
The FileArgumentNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
FileArgumentNotFoundException Class
Autodesk.Revit.Exceptions Namespace