Revit 2027 API
RebarTrimExtendData Methods
The RebarTrimExtendData type exposes the following members.
Methods
Name | Description
AddBarGeometry(CurveLoop) |  Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(IList<Curve>) |  Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
CanAddBarGeometry |  Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise.
ClearAllAddedBarGeometry |  This function will remove all bars geometry that were added by calling AddBarGeometry().
CreateEndConstraint |  Creates a constraint for the end handle of the rebar. This constraint will be set preferred after the API execution is finished successfully.
CreateStartConstraint |  Creates a constraint for the start handle of the rebar. This constraint will be set preferred after the API execution is finished successfully.
Dispose
GetAddedBarGeometry |  Gets the added curves that will represent the bar at index barIndex.
GetNumberOfBarGeometry |  Gets the number of Bar Geometry that were added.
GetRebarUpdateCurvesData |  Gets a class that contains information used as input and output for rebar free form calculation.
Top
See Also
Reference
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace