Revit 2027 API
IntegerParameterValue Class
 A class that holds an Integer value of a parameter element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.IntegerParameterValue
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IntegerParameterValue : ParameterValue
Public Class IntegerParameterValue
	Inherits ParameterValue
public ref class IntegerParameterValue : public ParameterValue
type IntegerParameterValue =
    class
        inherit ParameterValue
    end
The IntegerParameterValue type exposes the following members.
Constructors
Name | Description
IntegerParameterValue() |  Default constructor
IntegerParameterValue(Int32) |  Value constructor
Top
Properties
Name | Description
Value |  The stored value
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace