Revit 2027 API
Ceiling Class
 Represents a ceiling in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.Ceiling
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Ceiling : CeilingAndFloor
Public Class Ceiling
	Inherits CeilingAndFloor
public ref class Ceiling : public CeilingAndFloor
type Ceiling =
    class
        inherit CeilingAndFloor
    end
The Ceiling type exposes the following members.
Properties
Name | Description
SketchId |  Returns id of the sketch.
Top
Methods
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId) |  Creates a new instance of ceiling within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Line, Double) |  Creates a new instance of ceiling within the project.
GetCeilingGridLines |  Get the geometric representation of the ceiling grid, optionally including the ceiling boundary.
Top
See Also
Reference
Autodesk.Revit.DB Namespace