Revit 2027 API
DockableFrameFocusChangedEventArgs Properties
The DockableFrameFocusChangedEventArgs type exposes the following members.
Properties
Name | Description
FocusGained |  True if the pane is being activated, false if it is being inactivated.
PaneId |  The identifier for dockable pane.
Top
See Also
Reference
DockableFrameFocusChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace