Revit 2027 API
SpatialElementGeometryResults Class
 The results of spatial element geometry calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpatialElementGeometryResults
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialElementGeometryResults : IDisposable
Public Class SpatialElementGeometryResults
	Implements IDisposable
public ref class SpatialElementGeometryResults : IDisposable
type SpatialElementGeometryResults =
    class
        interface IDisposable
    end
The SpatialElementGeometryResults type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SpatialElementGeometryResults
GetBoundaryFaceInfo |  Query the spatial element boundary face information with the given face.
GetGeometry |  The solid from the spatial element.
Top
Remarks
 The subfaces of a SpatialElement at the base height and top height are not associated with floors, roofs, and ceilings at the same height.
See Also
Reference
Autodesk.Revit.DB Namespace