Revit 2027 API
DGNImportOptions Properties
The DGNImportOptions type exposes the following members.
Properties
Name | Description
DGNModelViewName |  The model view name to be imported. Need user give a model view name to specify which model view need to be imported into Revit
IgnoreUnsupportedElementWarning |  If true, ignore warning messages about unsupported elements in the DGN file. If false, the import process is aborted if imported dgn files have unsupported elements.
Top
See Also
Reference
DGNImportOptions Class
Autodesk.Revit.DB Namespace