Revit 2027 API
BasePoint Class
 A class representing the Project Base Point and Survey Point. Each Revit project contains one project base point and one survey point. The project base point represents the origin of the project coordinate system. The survey point represents the origin of the shared coordinate system.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.BasePoint
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BasePoint : Element
Public Class BasePoint
	Inherits Element
public ref class BasePoint : public Element
type BasePoint =
    class
        inherit Element
    end
The BasePoint type exposes the following members.
Properties
Name | Description
Clipped |  Clipped state of the survey point (shared BasePoint). Change its state to clipped or unclipped, depending on how you want to move the survey point. To move the survey coordinate system in relation to the model, move the clipped survey point. To change the survey point to another location in the survey coordinate system, move the unclipped survey point. For project base point (non-shared BasePoint), this property will always return false. Trying to set the property will get an InvalidOperationException.
IsShared |  Indicates whether the BasePoint is shared. The project's survey point is a BasePoint which is shared.
Position |  Position of the BasePoint.
SharedPosition |  Shared position of the BasePoint based on the active ProjectLocation of its belonging Document. To get the shared position under other ProjectLocations, please use ProjectLocation.GetProjectPosition(BasePoint.Position).
Top
Methods
Name | Description
GetProjectBasePoint |  Gets the project base point for the document.
GetSurveyPoint |  Gets the survey point for the document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace