Revit 2027 API
Line Methods
The Line type exposes the following members.
Methods
Name | Description
CreateBound |  Creates a new instance of a bound linear curve.
CreateUnbound |  Creates a new instance of an unbound linear curve.
Top
See Also
Reference
Line Class
Autodesk.Revit.DB Namespace