Revit 2027 API
SpanDirectionSymbol Class
 Represents an instance of a Span Direction Symbol in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.SpanDirectionSymbol
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpanDirectionSymbol : IndependentTag
Public Class SpanDirectionSymbol
	Inherits IndependentTag
public ref class SpanDirectionSymbol : public IndependentTag
type SpanDirectionSymbol =
    class
        inherit IndependentTag
    end
The SpanDirectionSymbol type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Places a new instance of the Span Direction Symbol into the project relative to a particular host element and view.
GetDefaultPlacementPoint |  Gets the default placement point for the input element. The default position is in the middle of the bounding box of the top face.
Top
See Also
Reference
Autodesk.Revit.DB Namespace