Revit 2027 API
PathReinforcement Class
 An object that represents an Path Reinforcement within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.PathReinforcement
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PathReinforcement : Element
Public Class PathReinforcement
	Inherits Element
public ref class PathReinforcement : public Element
type PathReinforcement =
    class
        inherit Element
    end
The PathReinforcement type exposes the following members.
Properties
Name | Description
AdditionalOffset |  Additional offset of rebars in the Path Reinforcement.
AlternatingBarOrientation |  Orientation of alternating bars of Path Reinforcement.
AlternatingBarShapeId |  The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement.
PathReinforcementType |  Retrieves the type of the Path Reinforcement.
PrimaryBarOrientation |  Orientation of primary bars of Path Reinforcement.
PrimaryBarShapeId |  The RebarShape element that defines the shape of the primary bars of the Path Reinforcement.
Top
Methods
Name | Description
ConvertRebarInSystemToRebars |  Converts all RebarInSystem elements owned by the input PathReinforcement to equivalent Rebar elements.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId) |  Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId, ElementId) |  Creates a new PathReinforcement object from an array of curves and given Rebar Shape id.
GetCurveElementIds |  Retrieves the set of ElementIds of curves forming the boundary of the Path Reinforcement.
GetHostId |  The element that contains the Path Reinforcement.
GetOrCreateDefaultRebarShape |  Creates a new RebarShape object with a default name or returns existing one which fulfills Path Reinforcement bending data requirements.
GetRebarInSystemIds |  Returns the ids of the RebarInSystem elements owned by the PathReinforcement element.
IsAlternatingLayerEnabled |  Checks if alternating bars are present in Path Reinforcement.
IsUnobscuredInView |  Checks if Path Reinforcement is shown unobscured in a view.
IsValidAlternatingBarOrientation |  Checks if orientation for alternating bars is valid.
IsValidPrimaryBarOrientation |  Checks if orientation for primary bars is valid.
IsValidRebarShapeId |  Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement.
RemovePathReinforcementSystem |  Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
SetUnobscuredInView |  Sets Path Reinforcement to be shown unobscured in a view.
Top
Remarks
 This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.
Example
private void Getinfo_PathReinforcement(PathReinforcement pathReinforcement)
{
    string message = "PathReinforcement : ";
    // Show the NumBarDescriptions property
    IList<ElementId> rebarInSystemIds = pathReinforcement.GetRebarInSystemIds();
    message += "\nNumber of distinct bar shapes : " + rebarInSystemIds.Count;
    for (int i = 0; i < rebarInSystemIds.Count; i++)
    {
        RebarInSystem ris = doc.GetElement(rebarInSystemIds[0]) as RebarInSystem;
        message += "\nBar count : " + ris.Quantity;
        message += "\nBar type name : " + ris.Name;
        message += "\nBar length : " + ris.LookupParameter("Bar Length").AsDouble();
    }
    // Show the PathReinforcement Curves information
    IList<ElementId> curveIds = pathReinforcement.GetCurveElementIds();
    message += "\nPath Reinforcement has " + curveIds.Count + " path curves.";
    foreach (Autodesk.Revit.DB.ElementId ii in curveIds)
    {
        ModelCurve pathCurve = doc.GetElement(ii) as ModelCurve;
        if (null == pathCurve)
        {
            continue;
        }
        Curve curve = pathCurve.GeometryCurve;   // get the location curve
        XYZ start = curve.GetEndPoint(0);  // get the start point of the curve
        XYZ end = curve.GetEndPoint(1);    // get the end point of the curve
        message += "\nCurve: Start point (" + start.X + ", " + start.Y + ", " + start.Z + ")";
        message += "   End point (" + end.X + ", " + end.Y + ", " + end.Z + ")";
    }
    TaskDialog.Show("Revit", message);
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace