Revit 2027 API
AnalyticalPanel Properties
The AnalyticalPanel type exposes the following members.
Properties
Name | Description
Thickness |  Panel thickness, in the Revit default units.
Top
See Also
Reference
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace