Revit 2027 API
MEPAnalyticalSystem Class
 Represents an analytical system where the air or water is circulated to satisfy building energy requirements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPAnalyticalSystem : Element
Public Class MEPAnalyticalSystem
	Inherits Element
public ref class MEPAnalyticalSystem : public Element
type MEPAnalyticalSystem =
    class
        inherit Element
    end
The MEPAnalyticalSystem type exposes the following members.
Properties
Name | Description
AnalyticalSystemDomain |  The type of analytical system.
Top
Methods
Name | Description
Create |  Creates a new analytical system
GetAirSystemData |  Returns the air system data, null if not available.
GetWaterLoopData |  Returns the water loop data, null if not available.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace