Revit 2027 API
NumberSystem Methods
The NumberSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, LinkElementId, Reference) |  Creates a new instance of a NumberSystem associated to a host element and a view.
Create(Document, ElementId, LinkElementId, StairsNumberSystemReferenceOption, LinkElementId) |  Creates a new instance of a NumberSystem associated to a host element, a view, and a reference level of stairs if in a multistory stairs.
GetReferencePick |  Gets the reference curve.
SetReferencePick |  Sets the reference pick.
Top
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace