Revit 2027 API
FabricationPartRouteEnd Methods
The FabricationPartRouteEnd type exposes the following members.
Methods
Name | Description
CreateFromCenterline |  Create fabrication routing end from centerline point on straight element.
CreateFromConnector |  Create fabrication routing end from connector end point.
Dispose
Top
See Also
Reference
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace