Revit 2027 API
FilterStringGreater Class
 Tests whether string values from the document would sort after a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringGreater
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringGreater : FilterStringRuleEvaluator
Public Class FilterStringGreater
	Inherits FilterStringRuleEvaluator
public ref class FilterStringGreater : public FilterStringRuleEvaluator
type FilterStringGreater =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringGreater type exposes the following members.
Constructors
Name | Description
FilterStringGreater |  Constructs an instance of FilterStringGreater.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace