Revit 2027 API
JournalingAttribute Class
 The custom journaling attribute to control the journaling behavior of the external command.
Inheritance Hierarchy
System.Object
 System.Attribute
 Autodesk.Revit.Attributes.JournalingAttribute
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class JournalingAttribute : Attribute
Public Class JournalingAttribute
	Inherits Attribute
public ref class JournalingAttribute : public Attribute
type JournalingAttribute =
    class
        inherit Attribute
    end
The JournalingAttribute type exposes the following members.
Constructors
Name | Description
JournalingAttribute | Constructs a new JournalingAttribute.
Top
Properties
Name | Description
Mode | Journaling mode.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.Attributes Namespace