Revit 2027 API
ElementBinding Class
A base class for all types of binding that attach to an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Binding
 Autodesk.Revit.DB.ElementBinding
 Autodesk.Revit.DB.InstanceBinding
 Autodesk.Revit.DB.TypeBinding
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ElementBinding : Binding
Public MustInherit Class ElementBinding
	Inherits Binding
public ref class ElementBinding abstract : public Binding
[<AbstractClassAttribute>]
type ElementBinding =
    class
        inherit Binding
    end
The ElementBinding type exposes the following members.
Properties
Name | Description
Categories | Retrieve or set the categories to which a parameter definition will be bound.
Top
Methods
Name | Description
Top
Remarks
This base class provides methods that are common to all types of binding that work with elements.
See Also
Reference
Autodesk.Revit.DB Namespace