Revit 2027 API
AlignmentStationLabelSetOptions Class
 Represents an object containing options for creating a set of AlignmentStationLabel.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelSetOptions
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AlignmentStationLabelSetOptions
Public Class AlignmentStationLabelSetOptions
public ref class AlignmentStationLabelSetOptions
type AlignmentStationLabelSetOptions = class end
The AlignmentStationLabelSetOptions type exposes the following members.
Constructors
Name | Description
AlignmentStationLabelSetOptions |  Create an object with default values.
Top
Properties
Name | Description
EndStation |  The ending station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's DisplayedEndStation is used.
HasLeader |  Specifies if the label will have a leader. The default value is true.
Interval |  The interval between labels to be created in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, a predefined interval value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 100 ft. For survey imperial, the default is 100 USft (US survey). For metric, the default is 1000 m.
Offset |  The offset of the labels from the alignment, in Revit internal paper space units (standard Imperial feet). A positive offset creates labels to the right of the alignment, a negative - to the left. The default value is null. If null, a predefined offset value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 1/8". For survey imperial, the default is 1/8" (US survey). For metric, the default is 5 mm.
StartStation |  The starting station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's DisplayedStartStation is used.
TypeId |  Specifies the ElementId of the labels' type. The default value is InvalidElementId. in this case, CreateSet(Alignment, View, AlignmentStationLabelSetOptions) will throw an exception.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Infrastructure Namespace