Revit 2027 API
StructuralInstanceUsageFilter Properties
The StructuralInstanceUsageFilter type exposes the following members.
Properties
Name | Description
StructuralUsage |  The family instance structural usage.
Top
See Also
Reference
StructuralInstanceUsageFilter Class
Autodesk.Revit.DB.Structure Namespace