Revit 2027 API
FilterStringRule Class
 A filter rule that operates on string values in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterStringRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringRule : FilterValueRule
Public Class FilterStringRule
	Inherits FilterValueRule
public ref class FilterStringRule : public FilterValueRule
type FilterStringRule =
    class
        inherit FilterValueRule
    end
The FilterStringRule type exposes the following members.
Constructors
Name | Description
FilterStringRule |  Constructs an instance of FilterStringRule.
Top
Properties
Name | Description
RuleString |  The user-supplied string against which strings from a Revit document will be tested.
Top
Methods
Name | Description
GetEvaluator |  Gets the evaluator that implements the test for this rule.
SetEvaluator |  Sets the evaluator that implements the test for this rule.
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace