Revit 2027 API
TableCellCalculatedValueData Methods
The TableCellCalculatedValueData type exposes the following members.
Methods
Name | Description
Dispose
GetName |  Gets the name of the calculated value.
Top
See Also
Reference
TableCellCalculatedValueData Class
Autodesk.Revit.DB Namespace