Revit 2027 API
UpdaterId Class
 A unique identifier of an Updater
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.UpdaterId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class UpdaterId : IDisposable
Public Class UpdaterId
	Implements IDisposable
public ref class UpdaterId : IDisposable
type UpdaterId =
    class
        interface IDisposable
    end
The UpdaterId type exposes the following members.
Constructors
Name | Description
UpdaterId |  creates an instance of UpdaterId for given AddInId and a given GUID value
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the UpdaterId
GetAddInId |  AddInId of the UpdaterId
GetGUID |  GUID value of the UpdaterId
Top
Remarks
 UpdaterId used as a key to register and unregister Updaters and UpdateTriggers in Revit application UpdaterId needs to be a stable identity for a given updater.
See Also
Reference
Autodesk.Revit.DB Namespace