Revit 2027 API
FilterOperatorAndTextString Methods
The FilterOperatorAndTextString type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FilterOperatorAndTextString Class
Autodesk.Revit.DB Namespace