Revit 2027 API
AnalyticalLink Methods
The AnalyticalLink type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a AnalyticalLink element between two Hubs.
IsAutoGenerated |  Specifies whether or not an AnalyticalLink was created by an Analytical Element.
IsValidHub |  Checks whether input hub is valid for an AnalyticalLink.
Top
See Also
Reference
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace