Revit 2027 API
TessellatedShapeBuilderResult Class
 Describes what TessellatedShapeBuilder has construct.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TessellatedShapeBuilderResult
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TessellatedShapeBuilderResult : IDisposable
Public Class TessellatedShapeBuilderResult
	Implements IDisposable
public ref class TessellatedShapeBuilderResult : IDisposable
type TessellatedShapeBuilderResult =
    class
        interface IDisposable
    end
The TessellatedShapeBuilderResult type exposes the following members.
Properties
Name | Description
AreObjectsAvailable |  Shows whether 'issues' still contains the original data or whether these data have already been relinquished by 'getGeometricalObjects'. The former is true, the later is false.
HasInvalidData |  Whether there were any inconsistencies in the face sets, stored in the tessellated shape builder while building geometrical objects.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Outcome |  What kinds of geometrical objects were built.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TessellatedShapeBuilderResult
GetGeometricalObjects |  When called the first time, returns geometrical objects which were built. Later calls will throw exceptions.
GetIssuesForFaceSet |  Returns the array of issues encountered while processing a face set with index 'setIndex'.
GetNumberOfFaceSets |  Gets number of face sets for which 'this' result was obtained.
Top
See Also
Reference
Autodesk.Revit.DB Namespace