Revit 2027 API
RebarShapeConstraintArcLength Class
 An arc-length constraint associated with an arc in a RebarShapeDefinition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintArcLength : RebarShapeConstraint
Public Class RebarShapeConstraintArcLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintArcLength : public RebarShapeConstraint
type RebarShapeConstraintArcLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintArcLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintArcLength |  Create an arc-length constraint.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace