Revit 2027 API
DuctLining Methods
The DuctLining type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of duct lining.
Top
See Also
Reference
DuctLining Class
Autodesk.Revit.DB.Mechanical Namespace