Revit 2027 API
RepeaterCoordinates Class
 Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RepeaterCoordinates
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RepeaterCoordinates : IDisposable
Public Class RepeaterCoordinates
	Implements IDisposable
public ref class RepeaterCoordinates : IDisposable
type RepeaterCoordinates =
    class
        interface IDisposable
    end
The RepeaterCoordinates type exposes the following members.
Constructors
Name | Description
RepeaterCoordinates() |  Creates zero dimensional coordinates.
RepeaterCoordinates(Int32) |  Creates one dimensional coordinates.
RepeaterCoordinates(Int32, Int32) |  Creates two dimensional coordinates.
Top
Properties
Name | Description
DimensionCount |  The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RepeaterCoordinates
GetCoordinate |  Returns the coordinate in the given dimension.
Top
See Also
Reference
Autodesk.Revit.DB Namespace