Revit 2027 API
ExportPatternInfo Class
 A value used to represent the info stored in the ExportPatternTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportPatternInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportPatternInfo : IDisposable
Public Class ExportPatternInfo
	Implements IDisposable
public ref class ExportPatternInfo : IDisposable
type ExportPatternInfo =
    class
        interface IDisposable
    end
The ExportPatternInfo type exposes the following members.
Constructors
Name | Description
ExportPatternInfo() |  Constructs a new default ExportPatternInfo.
ExportPatternInfo(ExportPatternInfo) |  Constructs a new copy of the input ExportPatternInfo object.
ExportPatternInfo(String) |  Constructs a new ExportPatternInfo using the destination pattern name as input.
Top
Properties
Name | Description
DestinationPatternName |  The destination pattern name (the name of the pattern in the exported format).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportPatternInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace