Revit 2027 API
RibbonItemData Properties
The RibbonItemData type exposes the following members.
Properties
Name | Description
LongDescription |  Long description of the command tooltip
ToolTipImage | The image to show as a part of the button extended tooltip
Top
See Also
Reference
RibbonItemData Class
Autodesk.Revit.UI Namespace