Revit 2027 API
SymbolicCurve Methods
The SymbolicCurve type exposes the following members.
Methods
Name | Description
GetVisibility | Gets the visibility for the symbolic curve.
SetVisibility | Sets the visibility for the symbolic curve.
Top
See Also
Reference
SymbolicCurve Class
Autodesk.Revit.DB Namespace