Revit 2027 API
NumberingFormattedParameter Class
 Settings for parameters associated in the numbering formatting.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingFormattedParameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NumberingFormattedParameter : IDisposable
Public Class NumberingFormattedParameter
	Implements IDisposable
public ref class NumberingFormattedParameter : IDisposable
type NumberingFormattedParameter =
    class
        interface IDisposable
    end
The NumberingFormattedParameter type exposes the following members.
Constructors
Name | Description
NumberingFormattedParameter() |  Create an empty NumberingFormattedParameter object.
NumberingFormattedParameter(NumberingFormattedParameter) |  Copy the NumberingFormattedParameter.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Prefix |  Prefix corresponding to the included parameter.
SampleValue |  Sample values corresponding to the included parameter.
Separator |  Separators corresponding to the included parameter.
Suffix |  Suffix corresponding to the included parameter.
Top
Methods
Name | Description
Dispose | Releases all resources used by the NumberingFormattedParameter
GetParameter |  Get the target parameter for formatting.
SetParameter |  Set the target parameter for formatting.
Top
See Also
Reference
Autodesk.Revit.DB Namespace