Revit 2027 API
PaperSource Class
An object that represents a Paper Source of Print Setup within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PaperSource
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PaperSource : APIObject
Public Class PaperSource
	Inherits APIObject
public ref class PaperSource : public APIObject
type PaperSource =
    class
        inherit APIObject
    end
The PaperSource type exposes the following members.
Properties
Name | Description
Name |  Retrieve the paper source name of current project.
Top
Methods
Name | Description
Top
Remarks
This object derived from the APIObject base object.
See Also
Reference
Autodesk.Revit.DB Namespace