Revit 2027 API
IFCUserDefinedPropertySet Class
 Represents an element that contains an IFC user-defined property set stored in a Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IFCUserDefinedPropertySet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCUserDefinedPropertySet : Element
Public Class IFCUserDefinedPropertySet
	Inherits Element
public ref class IFCUserDefinedPropertySet : public Element
type IFCUserDefinedPropertySet =
    class
        inherit Element
    end
The IFCUserDefinedPropertySet type exposes the following members.
Properties
Name | Description
PropertySetType |  The user-defined property set type.
Top
Methods
Name | Description
AddProperty |  Adds a property to the property set.
ClearPropertySet |  Removes all properties from the property set.
CopyPropertySet |  Create copy of property set with new name.
Create |  Create an IFC user-defined property set with default values.
ExportToFile |  Export property sets to a text file.
FindPropertyByName |  Returns property by name.
FindPropertySetByName |  Returns property set element by name.
GetApplicableEntities |  Returns the list of IFC entities to which the property set is applicable.
GetProperties |  Returns the collection of properties in the property set.
ImportFromFile |  Import property sets from a text file.
IsPropertyAMemberOfPropertySet |  Checks whether a property exists in the property set.
IsValidName |  Checks whether the proposed name is valid and not exist in the specified document.
ListPropertySetNames |  Returns a list property set names stored in the document.
RemoveProperty |  Removes a property from the property set.
SetApplicableEntities |  Sets the list of IFC entities to which the property set is applicable.
Top
See Also
Reference
Autodesk.Revit.DB Namespace