Revit 2027 API
InternalDefinition Methods
The InternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
GetGroupTypeId |  Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs.
(Overrides Definition.GetGroupTypeId())
GetParameterTypeId |  Tests whether this definition identifies a built-in parameter or not.
GetTypeId |  Gets the identifier of the parameter.
SetAllowVaryBetweenGroups |  Whether or not the parameter values can vary across group members.
SetGroupTypeId |  Sets the built-in parameter group to which the parameter defined by this definition belongs.
Top
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace