Revit 2027 API
RebarShapeConstraintRadius Class
 A radius constraint associated with an arc in a RebarShapeDefinition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintRadius : RebarShapeConstraint
Public Class RebarShapeConstraintRadius
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintRadius : public RebarShapeConstraint
type RebarShapeConstraintRadius =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintRadius type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintRadius |  Create a radius constraint.
Top
Properties
Name | Description
ArcReferenceType |  The choice of rule for measuring the radius.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace