Revit 2027 API
ImageInstance Methods
The ImageInstance type exposes the following members.
Methods
Name | Description
Create |  Creates a new ImageInstance element placed in a view.
GetLocation |  Returns the location of one of the points of the ImageInstance
IsValidView |  Check that the view is a valid view for ImageInstance elements
SetLocation |  Moves the ImageInstance to the specified location
Top
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace