Revit 2027 API
EnergyAnalysisDetailModelOptions Class
Note: This API is now obsolete.
 Options that govern the calculations for the generation of the energy analysis detail model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This class is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
public class EnergyAnalysisDetailModelOptions : IDisposable
<ObsoleteAttribute("This class is deprecated in Revit 2027 and will be removed in the next version of Revit.")>
Public Class EnergyAnalysisDetailModelOptions
	Implements IDisposable
[ObsoleteAttribute(L"This class is deprecated in Revit 2027 and will be removed in the next version of Revit.")]
public ref class EnergyAnalysisDetailModelOptions : IDisposable
[<ObsoleteAttribute("This class is deprecated in Revit 2027 and will be removed in the next version of Revit.")>]
type EnergyAnalysisDetailModelOptions =
    class
        interface IDisposable
    end
The EnergyAnalysisDetailModelOptions type exposes the following members.
Constructors
Name | Description
EnergyAnalysisDetailModelOptions |  Constructs default options for energy analysis detailed model creation.
Top
Properties
Name | Description
EnergyModelType | Obsolete.
 It indicates whether the energy model is based on rooms/spaces or building elements.
ExportMullions |  Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces |  Indicates if to set and get the setting for if shading surfaces should be included.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SimplifyCurtainSystems |  Indicates if to specify the setting for simplified curtain systems.
Tier |  Level of computation for energy analysis model.
Top
Methods
Name | Description
Dispose | Releases all resources used by the EnergyAnalysisDetailModelOptions
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace