Revit 2027 API
NumberingSequenceInfo Class
 A class containing the information regarding a numbering sequence to be used in the UI
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingSequenceInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NumberingSequenceInfo : IDisposable
Public Class NumberingSequenceInfo
	Implements IDisposable
public ref class NumberingSequenceInfo : IDisposable
type NumberingSequenceInfo =
    class
        interface IDisposable
    end
The NumberingSequenceInfo type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the NumberingSequenceInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace