Revit 2027 API
ProgressChangedEventArgs Properties
The ProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
Caption |  The text from the progress bar caption that describes the operation in progress
LowerRange |  Lower part of progress bar range - always zero
Position |  Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged"
Stage |  The current stage of the progress bar
UpperRange |  Upper part of progress bar range - will be any non-zero number
Top
See Also
Reference
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace