Revit 2027 API
RebarShapeConstraintCircumference Class
 A circumference constraint associated with an arc in a RebarShapeDefinition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintCircumference : RebarShapeConstraint
Public Class RebarShapeConstraintCircumference
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintCircumference : public RebarShapeConstraint
type RebarShapeConstraintCircumference =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintCircumference type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintCircumference |  Create a circumference constraint.
Top
Properties
Name | Description
ArcReferenceType |  The choice of rule for measuring the diameter.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace