Revit 2027 API
PointOnEdge Methods
The PointOnEdge type exposes the following members.
Methods
Name | Description
GetEdgeReference | Get a copy of the edge or curve reference.
SetEdgeReference | Change the edge or curve reference.
Top
See Also
Reference
PointOnEdge Class
Autodesk.Revit.DB Namespace