Revit 2027 API
StructuralSectionGeneralS Class
 Defines parameters for Round Bar structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralS : StructuralSectionRound
Public Class StructuralSectionGeneralS
	Inherits StructuralSectionRound
public ref class StructuralSectionGeneralS : public StructuralSectionRound
type StructuralSectionGeneralS =
    class
        inherit StructuralSectionRound
    end
The StructuralSectionGeneralS type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralS |  Creates a new instance of Round Bar shape.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace