Revit 2027 API
BRepBuilderSurfaceGeometry Methods
The BRepBuilderSurfaceGeometry type exposes the following members.
Methods
Name | Description
Create |  Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, Boolean, BoundingBoxUV) |  Construct a BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are not supplied. In this case, the NURBS surface will be a piecewise polynomial surface.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, IList<Double>, Boolean, BoundingBoxUV) |  Construct BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are supplied. In this case, the NURBS surface will be a piecewise rational polynomial surface.
Dispose
Top
See Also
Reference
BRepBuilderSurfaceGeometry Class
Autodesk.Revit.DB Namespace