Revit 2027 API
UIMacroManager Class
 The UI macro manager to support Macro operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Macros.UIMacroManager
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class UIMacroManager : IDisposable
Public Class UIMacroManager
	Implements IDisposable
public ref class UIMacroManager : IDisposable
type UIMacroManager =
    class
        interface IDisposable
    end
The UIMacroManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MacroManager |  The DB macro manager.
Top
Methods
Name | Description
AddModule |  Adds a MacroModule to the application.
Dispose | Releases all resources used by the UIMacroManager
GetMacroManager |  Gets the UI Macro manager from the UI application.
RemoveModule |  Removes a MacroModule.
Top
See Also
Reference
Autodesk.Revit.UI.Macros Namespace