Revit 2027 API
FileAccessException Class
The exception that is thrown when the specified file could not be accessed, e.g. read-only, locked by the OS etc.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.IOException
 Autodesk.Revit.Exceptions.FileAccessException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class FileAccessException : IOException
<SerializableAttribute>
Public Class FileAccessException
	Inherits IOException
[SerializableAttribute]
public ref class FileAccessException : public IOException
[<SerializableAttribute>]
type FileAccessException =
    class
        inherit IOException
    end
The FileAccessException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace