Revit 2027 API
ComputationDataFor3DPathSet Methods
The ComputationDataFor3DPathSet type exposes the following members.
Methods
Name | Description
CreateFromCurves |  Creates a new instance of the ComputationDataFor3DPathSet class from the provided curves.
CreateFromRebar |  Creates a new instance of the ComputationDataFor3DPathSet class from the provided Rebar element.
Dispose
GetCurves |  Gets the curves that define the 3D path set.
GetTerminationPlaneNormal |  Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
SetTerminationPlaneNormal |  Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
Top
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace