Revit 2027 API
ConduitSizeSettings Methods
The ConduitSizeSettings type exposes the following members.
Methods
Name | Description
AddSize |  Inserts a new ConduitSize in to the conduit size settings. The conduit standard name determines the location of the new size in the size table.
CreateConduitStandardTypeFromExisingStandardType |  Creates one conduit standard type with the new name and assign the conduit sizes to it from the existing standard type.
DoesConduitStandardTypeExist |  Checks if the specified conduit standard exist.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetConduitSizeSettings |  Gets the conduit size settings of the project.
GetConduitSizeSettingsIterator |  Returns a ConduitSizeSettingIterator to the conduit size settings.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetSizeCount |  Gets the size count of the conduit size table. The conduit standard name the location of the size in the size table.
RemoveConduitStandardType |  Erases the existing ConduitSizes with this conduit standard name; the consuit standard type can not be removed if it is in use.
RemoveSize |  Erase the existing ConduitSize with this nominal diameter. The conduit standard name determines the location of the size in the size table.
Top
See Also
Reference
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace