Revit 2027 API
LeaderArrayIterator Class
An iterator to an array of leaders.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LeaderArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class LeaderArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class LeaderArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class LeaderArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type LeaderArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The LeaderArrayIterator type exposes the following members.
Constructors
Name | Description
LeaderArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace