Revit 2027 API
BuildingOperatingYearSchedule Class
 Represents an operating schedule that contains 365 daily usage BuildingOperatingDaySchedules.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.BuildingOperatingYearSchedule
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BuildingOperatingYearSchedule : Element
Public Class BuildingOperatingYearSchedule
	Inherits Element
public ref class BuildingOperatingYearSchedule : public Element
type BuildingOperatingYearSchedule =
    class
        inherit Element
    end
The BuildingOperatingYearSchedule type exposes the following members.
Properties
Name | Description
ScheduleName |  The name of the schedule.
Top
Methods
Name | Description
Create |  Creates a valid BuildingOperatingYearSchedule with the given name, where every day has the schedule daySchedule.
GetScheduleForDay |  Gets the BuildingOperatingDaySchedule for this day of the year.
SetScheduleForDay |  Sets the BuildingOperatingDaySchedule for this day of the year.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace