Revit 2027 API
FlexDuct Methods
The FlexDuct type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>) |  Creates a new flexible duct into the document, using a point array and flexible duct type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>) |  Creates a new flexible duct into the document, using a point array and flexible duct type.
IsFlexDuctTypeId |  Checks if given type is valid flexible duct type.
IsHVACSystemTypeId |  Checks if given type is valid HVAC system type.
Top
See Also
Reference
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace