Revit 2027 API
ExternallyTaggedNonBReps Methods
The ExternallyTaggedNonBReps type exposes the following members.
Methods
Name | Description
Add |  Adds a copy of the input ExternallyTaggedNonBRep to this collection.
CanAddExternallyTaggedNonBRep |  Checks if the input geometry could be added to this collection or not.
Dispose
Top
See Also
Reference
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace