Revit 2027 API
CitySet Methods
The CitySet type exposes the following members.
Methods
Name | Description
Clear | Removes every city from the set, rendering it empty.
Contains | Tests for the existence of a city within the set.
Erase | Removes a specified city from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified city into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
CitySet Class
Autodesk.Revit.DB Namespace