Revit 2027 API
FilteredWorksetCollector Methods
The FilteredWorksetCollector type exposes the following members.
Methods
Name | Description
Dispose
FirstWorkset |  Returns the first workset to pass the filter(s).
FirstWorksetId |  Returns the id of the first workset to pass the filter(s).
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetWorksetIdIterator |  Returns a FilteredWorksetIdIterator to the worksets passing the current filter.
GetWorksetIterator |  Returns a FilteredWorksetIterator to the worksets passing the current filter.
OfKind |  Applies a WorksetKindFilter to the collector.
ToWorksetIds |  Returns the complete set of workset ids that pass the filter(s).
ToWorksets |  Returns the complete set of worksets that pass the filter(s).
WherePasses |  Applies a workset filter to the collector.
Top
See Also
Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace