Revit 2027 API
ExternalApplicationArray Properties
The ExternalApplicationArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an item at a specified index within the array.
Size | Returns the number of objects that are in the array.
Top
See Also
Reference
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace