Revit 2027 API
ElementIntersectsSolidFilter Class
 A filter to find elements that intersect the given solid geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.ElementIntersectsFilter
 Autodesk.Revit.DB.ElementIntersectsSolidFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementIntersectsSolidFilter : ElementIntersectsFilter
Public Class ElementIntersectsSolidFilter
	Inherits ElementIntersectsFilter
public ref class ElementIntersectsSolidFilter : public ElementIntersectsFilter
type ElementIntersectsSolidFilter =
    class
        inherit ElementIntersectsFilter
    end
The ElementIntersectsSolidFilter type exposes the following members.
Constructors
Name | Description
ElementIntersectsSolidFilter(Solid) |  Constructs a filter to match elements which intersect the given element.
ElementIntersectsSolidFilter(Solid, Boolean) |  Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetSolid |  Gets the target solid geometry.
Top
Remarks
 The input solid used for this filter can be obtained from an existing element, created from scratch using the routines in GeometryCreationUtilities or builder classes, or the generated from the result of a secondary operation such as a Boolean operation. Similar to the ElementIntersectsElementFilter, this filter will not detect as intersecting elements which lack solid geometry, such as Rebar.
This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.
Example
// Find intersections between family instances and a selected element
Reference reference = uidoc.Selection.PickObject(ObjectType.Element, "Select element that will be checked for intersection with all family instances");
Element element = doc.GetElement(reference);
GeometryElement geomElement = element.get_Geometry(new Options());
Solid solid = null;
foreach (GeometryObject geomObj in geomElement)
{
    solid = geomObj as Solid;
    if (solid != null) break;
}
FilteredElementCollector collector = new FilteredElementCollector(doc);
collector.OfClass(typeof(FamilyInstance));
collector.WherePasses(new ElementIntersectsSolidFilter(solid)); // Apply intersection filter to find matches
TaskDialog.Show("Revit", collector.Count() + " family instances intersect with the selected element (" + element.Category.Name + " id:" + element.Id.ToString() + ")");
// Find intersections between family instances and a selected element
Reference reference = uidoc.Selection.PickObject(ObjectType.Element, "Select element that will be checked for intersection with all family instances");
Element element = doc.GetElement(reference);
GeometryElement geomElement = element.get_Geometry(new Options());
Solid solid = null;
foreach (GeometryObject geomObj in geomElement)
{
    solid = geomObj as Solid;
    if (solid != null) break;
}
FilteredElementCollector collector = new FilteredElementCollector(doc);
collector.OfClass(typeof(FamilyInstance));
collector.WherePasses(new ElementIntersectsSolidFilter(solid)); // Apply intersection filter to find matches
TaskDialog.Show("Revit", collector.Count() + " family instances intersect with the selected element (" + element.Category.Name + " id:" + element.Id.ToString() + ")");
See Also
Reference
Autodesk.Revit.DB Namespace