Revit 2027 API
IPipeFittingAndAccessoryPressureDropServer Methods
The IPipeFittingAndAccessoryPressureDropServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the pipe fitting and pipe accessory coefficient.
GetDataSchema |  Obtains the schema of the ESEntity.
IsApplicable |  Check if the server is applicable for the pipe fitting or pipe accessory.
Top
See Also
Reference
IPipeFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace