Revit 2027 API
DeleteWorksetSettings Class
 This class represents the settings used to delete a workset.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DeleteWorksetSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DeleteWorksetSettings : IDisposable
Public Class DeleteWorksetSettings
	Implements IDisposable
public ref class DeleteWorksetSettings : IDisposable
type DeleteWorksetSettings =
    class
        interface IDisposable
    end
The DeleteWorksetSettings type exposes the following members.
Constructors
Name | Description
DeleteWorksetSettings() |  Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.
DeleteWorksetSettings(DeleteWorksetOption, WorksetId) |  Constructs a DeleteWorksetSettings object.
Top
Properties
Name | Description
DeleteWorksetOption |  The current delete workset option.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
WorksetId |  The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DeleteWorksetSettings
Top
See Also
Reference
Autodesk.Revit.DB Namespace