Revit 2027 API
NumberingSchema Properties
The NumberingSchema type exposes the following members.
Properties
Name | Description
Enabled |  True if the NumberingSchema is in use. False otherwise.
HasRoomRelatedParameters |  Returns true if in the partitioning, matching or formatting there are parameters that require room associations.
MatchGeometry |  If true the matching for this numbering schema will consider the geometry of the input elements.
MaximumStartingNumber |  A static property defining the maximum number a numbering sequence can use as its starting number (the lowest number in the sequence).
NumberingParameterId |  The output parameter where the numbering schema generate the final number can now also be set.
Priority |  The priority for this numbering schema.
SchemaType | Obsolete.
 Uniquly identifies this numbering schema.
ScopeDefiningFilter |  The id of the filter that determines the scope for this schema.
Top
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace