Revit 2027 API
Mesh Properties
The Mesh type exposes the following members.
Properties
Name | Description
DistributionOfNormals |  Indicates the distribution of normal vectors along the tessellated mesh surface.
IsClosed |  Indicates whether the mesh is closed.
MaterialElementId | Element ID of the material from which this mesh is composed.
NumberOfNormals |  The number of normals associated with the mesh.
NumTriangles | The number of triangles that the mesh contains.
Transformed | Transforms this mesh and returns the result.
Triangle | Retrieves a specific triangle.
Vertices | Retrieves all vertices used to define this mesh. Intended for indexed access.
Top
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace