Revit 2027 API
FilteredWorksetIterator Methods
The FilteredWorksetIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  The current workset found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next workset passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
FilteredWorksetIterator Class
Autodesk.Revit.DB Namespace