Revit 2027 API
BackgroundTaskCancelledException Methods
The BackgroundTaskCancelledException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
BackgroundTaskCancelledException Class
Autodesk.Revit.Exceptions Namespace