Revit 2027 API
Arc Methods
The Arc type exposes the following members.
Methods
Name | Description
Create(XYZ, XYZ, XYZ) |  Creates a new geometric arc object based on three points.
Create(Plane, Double, Double, Double) |  Creates a new geometric arc object based on plane, radius, and angles.
Create(XYZ, Double, Double, Double, XYZ, XYZ) |  Creates a new geometric arc object based on center, radius, unit vectors, and angles.
Top
See Also
Reference
Arc Class
Autodesk.Revit.DB Namespace