Revit 2027 API
AreaReinforcement Methods
The AreaReinforcement type exposes the following members.
Methods
Name | Description
ConvertRebarInSystemToRebars |  Converts all RebarInSystem elements owned by the input AreaReinforcement to equivalent Rebar elements.
Create(Document, Element, XYZ, ElementId, ElementId, ElementId) |  Creates a new AreaReinforcement object based on a host boundary.
Create(Document, Element, IList<Curve>, XYZ, ElementId, ElementId, ElementId) |  Creates a new AreaReinforcement object from an array of curves. This method replaces the NewAreaReinforcement method, which has been deprecated.
GetBoundaryCurveIds |  Retrieves the set of curves forming the boundary of the Area Reinforcement.
GetHostId |  The element that contains the Area Reinforcement.
GetLayerDirection |  Gets the direction of the layer. The lines are distributed along this direction.
GetLineFromLayerAtIndex |  Gets the line from the desired layer at the specified index.
GetMovedLineTransform |  Returns a transform representing the movement of the line relative to its default position along the direction of the desired layer.
GetNumberOfLines |  Gets the number of lines on the specified layer. It also counts the excluded ones.
GetRebarInSystemIds |  Returns the ids of the RebarInSystem elements owned by the AreaReinforcement element.
IsLayerActive |  Identifies if the layer is active or not.
IsLineIncluded |  Checks whether the line from the desired layer at the specified position is included or not.
IsUnobscuredInView |  Checks if Area Reinforcement is shown unobscured in a view.
MoveLine |  This method applies the translation to the line from the desired layer, at the specified position. If the line was already moved, the method will concatenate the translation with the existing movement. The line will be translated only along the direction of the specified layer.
RemoveAreaReinforcementSystem |  Deletes the specified AreaReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
ResetMovedLineTransform |  Reset the transformation representing the movement of the line relative to its default position along the direction of the specified layer. The moved line transform will be set to Identity.
SetLayerActive |  Sets if the desired layer is active or not.
SetLineIncluded |  Sets if the line from desired layer at the specified position is included or not.
SetUnobscuredInView |  Sets Area Reinforcement to be shown unobscured in a view.
Top
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace