Revit 2027 API
RebarShapeConstraint Methods
The RebarShapeConstraint type exposes the following members.
Methods
Name | Description
Dispose
GetParamId |  Return the Id of the parameter associated with this constraint.
Top
See Also
Reference
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace