Revit 2027 API
FormatOptions Methods
The FormatOptions type exposes the following members.
Methods
Name | Description
CanHaveSymbol() |  Checks whether a symbol can be specified to display the unit in this FormatOptions.
CanHaveSymbol(ForgeTypeId) |  Checks whether a symbol can be specified to display a given unit.
CanSuppressLeadingZeros() |  Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressLeadingZeros(ForgeTypeId) |  Checks whether leading zeros can be suppressed for a given unit.
CanSuppressSpaces() |  Checks whether spaces can be suppressed for the display unit in this FormatOptions.
CanSuppressSpaces(ForgeTypeId) |  Checks whether spaces can be suppressed for a given unit.
CanSuppressTrailingZeros() |  Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
CanSuppressTrailingZeros(ForgeTypeId) |  Checks whether trailing zeros can be suppressed for a given unit.
CanUsePlusPrefix() |  Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
CanUsePlusPrefix(ForgeTypeId) |  Checks whether a plus prefix can be displayed for a given unit.
Dispose
GetSymbolTypeId |  Gets the identifier of the symbol indicating the unit quantifying the value.
GetUnitTypeId |  Gets the identifier of the unit used to quantify values.
GetValidSymbols() |  Gets the identifiers of all valid symbols for the unit in this FormatOptions.
GetValidSymbols(ForgeTypeId) |  Gets the identifiers of all valid symbols for a given unit.
IsValidAccuracy(Double) |  Checks whether an accuracy is valid for the display unit in this FormatOptions.
IsValidAccuracy(ForgeTypeId, Double) |  Checks whether an accuracy is valid for a given unit.
IsValidForSpec |  Checks whether this FormatOptions is valid for a given spec.
IsValidSymbol(ForgeTypeId) |  Checks whether a symbol is valid for the unit in this FormatOptions.
IsValidSymbol(ForgeTypeId, ForgeTypeId) |  Checks whether a symbol is valid for a given unit.
SetSymbolTypeId |  Sets the symbol that should be displayed to indicate the unit quantifying the value.
SetUnitTypeId |  Sets the unit used to quantify values.
Top
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace