Revit 2027 API
AssemblyType Class
 Type for construction assembly elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.AssemblyType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyType : ElementType
Public Class AssemblyType
	Inherits ElementType
public ref class AssemblyType : public ElementType
type AssemblyType =
    class
        inherit ElementType
    end
The AssemblyType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace