Revit 2027 API
LineAndTextAttrSymbol Class
An object that represents a dimension style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.FilledRegionType
 Autodesk.Revit.DB.GridType
 Autodesk.Revit.DB.LevelType
 Autodesk.Revit.DB.TextElementType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LineAndTextAttrSymbol : ElementType
Public Class LineAndTextAttrSymbol
	Inherits ElementType
public ref class LineAndTextAttrSymbol : public ElementType
type LineAndTextAttrSymbol =
    class
        inherit ElementType
    end
The LineAndTextAttrSymbol type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace