Revit 2027 API
ProjectLocationSet Methods
The ProjectLocationSet type exposes the following members.
Methods
Name | Description
Clear | Removes every project location from the set, rendering it empty.
Contains | Tests for the existence of a project location within the set.
Erase | Removes a specified project location from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified project location into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
ProjectLocationSet Class
Autodesk.Revit.DB Namespace