Revit 2027 API
FaceDetailNode Methods
The FaceDetailNode type exposes the following members.
Methods
Name | Description
GetInstanceTransform |  Returns instance transform of the object being drawn.
GetLinkTransform |  Returns link transform of the object being drawn.
Top
See Also
Reference
FaceDetailNode Class
Autodesk.Revit.DB Namespace