Revit 2027 API
Form Properties
The Form type exposes the following members.
Properties
Name | Description
AreProfilesConstrained | Get/set if the form's profiles are constrained.
BaseOffset | Retrieve/set the base offset of the form object. It is only valid for locked form.
CurveLoopReferencesOnProfile | The curve references in certain curve loop, specified by profile index and curve loop index.
HasOneOrMoreReferenceProfiles | Tell if the form has any reference profile.
HasOpenGeometry | Tell if the form has an open geometry.
IsInXRayMode | Get/set if the form is in X-Ray mode.
PathCurveCount | The number of curves in the form path.
PathCurveReference | The curve reference in the path, specified by curve index.
ProfileCount | The number of profiles in the form.
ProfileCurveLoopCount | The number of curve loops in certain profile, specified by profile index.
TopOffset | Retrieve/set the top offset of the form object. It is only valid for locked form.
Top
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace