Revit 2027 API
StructuralSectionGeneralLA Properties
The StructuralSectionGeneralLA type exposes the following members.
Properties
Name | Description
LipLength |  Lip segment length.
Top
See Also
Reference
StructuralSectionGeneralLA Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace