Revit 2027 API
ConnectionInputPointInfo Class
 An object that holds description information about a connection input point
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ConnectionInputPointInfo
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConnectionInputPointInfo : IDisposable
Public Class ConnectionInputPointInfo
	Implements IDisposable
public ref class ConnectionInputPointInfo : IDisposable
type ConnectionInputPointInfo =
    class
        interface IDisposable
    end
The ConnectionInputPointInfo type exposes the following members.
Constructors
Name | Description
ConnectionInputPointInfo() |  Construct a default input point.
ConnectionInputPointInfo(String, Int32, String) |  Construct an input point info.
Top
Properties
Name | Description
InputMemberIndex |  A index of the input member to which the restriction applies.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PointSelectionText |  A string used to select input point by some connections.
RestrictionType |  A type of input point restriction.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConnectionInputPointInfo
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace