Revit 2027 API
DockablePaneProviderData Methods
The DockablePaneProviderData type exposes the following members.
Methods
Name | Description
GetFrameworkElement |  Wrapper function that returns the FrameworkElement for this provider.
Top
See Also
Reference
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace