Revit 2027 API
StructuralConnectionHandlerType Properties
The StructuralConnectionHandlerType type exposes the following members.
Properties
Name | Description
ConnectionGuid |  The GUID to use for identifying connection geometry generation algorithm.
Top
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace