Revit 2027 API
CriticalPathIterator Methods
The CriticalPathIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  Gets the analytical segment id at the current iterating position.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next downstream segment on the critical path.
Reset |  Resets the iterator to the beginning segment.
Top
See Also
Reference
CriticalPathIterator Class
Autodesk.Revit.DB.Analysis Namespace