Revit 2027 API
IFCAggregateIterator Methods
The IFCAggregateIterator type exposes the following members.
Methods
Name | Description
Dispose
MoveNext |  Increments the iterator to the next object in the IFCAggregate.
Reset |  Resets the iterator to the beginning of the aggregate.
Top
See Also
Reference
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace