Revit 2027 API
CentralFileCommunicationException Methods
The CentralFileCommunicationException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CentralFileCommunicationException Class
Autodesk.Revit.Exceptions Namespace