Revit 2027 API
RuledFace Class
A ruled face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.RuledFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RuledFace : Face
Public Class RuledFace
	Inherits Face
public ref class RuledFace : public Face
type RuledFace =
    class
        inherit Face
    end
The RuledFace type exposes the following members.
Properties
Name | Description
Curve | Profile curves of the surface.
IsExtruded | Determines if this is an extruded ruled surface.
Point | Profile points of the surface.
RulingsAreParallel | Determines if the rulings of this ruled surface are parallel.
Top
Methods
Name | Description
Top
Remarks
 A ruled surface is created by sweeping a line between two profile curves or between a curve and a point (a point and a curve). For details on the parameterization, refer to the documentation for RuledSurface.
Example
private void GetRuledFaceInfo(Face face)
{
    RuledFace ruledFace = face as RuledFace;
    if (null != ruledFace)
    {
        Curve curve = ruledFace.get_Curve(0);
        XYZ point = ruledFace.get_Point(0);
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace