Revit 2027 API
ConduitSizeSettingIterator Methods
The ConduitSizeSettingIterator type exposes the following members.
Methods
Name | Description
Dispose
HasCurrent |  Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the enumerator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
ConduitSizeSettingIterator Class
Autodesk.Revit.DB.Electrical Namespace