Revit 2027 API
DockableFrameFocusChangedEventArgs Class
 The event arguments used by the DockableFrameActivatedChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DockableFrameFocusChangedEventArgs : RevitAPISingleEventArgs
Public Class DockableFrameFocusChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class DockableFrameFocusChangedEventArgs : public RevitAPISingleEventArgs
type DockableFrameFocusChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The DockableFrameFocusChangedEventArgs type exposes the following members.
Properties
Name | Description
FocusGained |  True if the pane is being activated, false if it is being inactivated.
PaneId |  The identifier for dockable pane.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace