Revit 2027 API
ExtendedPropertiesBindings Methods
The ExtendedPropertiesBindings type exposes the following members.
Methods
Name | Description
AddCategories |  Adds multiple categories to the bindings.
AddCategory |  Adds a category id to the bindings.
Dispose
Top
See Also
Reference
ExtendedPropertiesBindings Class
Autodesk.Revit.DB.ExternalData Namespace