Revit 2027 API
AssetSet Methods
The AssetSet type exposes the following members.
Methods
Name | Description
Clear
Contains
Erase
ForwardIterator
GetEnumerator
Insert
ReverseIterator
Top
See Also
Reference
AssetSet Class
Autodesk.Revit.DB.Visual Namespace