Revit 2027 API
CableTrayType Methods
The CableTrayType type exposes the following members.
Methods
Name | Description
IsValidBendMultiplier |  Identifies if the input bend multiplier is valid.
Top
See Also
Reference
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace