Revit 2027 API
HostedSweepType Class
An object that represents the attributes for sweep host objects in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.HostedSweepType
 Autodesk.Revit.DB.Architecture.FasciaType
 Autodesk.Revit.DB.Architecture.GutterType
 Autodesk.Revit.DB.SlabEdgeType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HostedSweepType : HostObjAttributes
Public Class HostedSweepType
	Inherits HostObjAttributes
public ref class HostedSweepType : public HostObjAttributes
type HostedSweepType =
    class
        inherit HostObjAttributes
    end
The HostedSweepType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace