Revit 2027 API
ViewDisplaySketchyLines Methods
The ViewDisplaySketchyLines type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace