Revit 2027 API
ScheduleHeightsOnSheet Class
 Heights information of a schedule on sheet.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ScheduleHeightsOnSheet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ScheduleHeightsOnSheet : IDisposable
Public Class ScheduleHeightsOnSheet
	Implements IDisposable
public ref class ScheduleHeightsOnSheet : IDisposable
type ScheduleHeightsOnSheet =
    class
        interface IDisposable
    end
The ScheduleHeightsOnSheet type exposes the following members.
Properties
Name | Description
ColumnHeaderHeight |  The height of all schedule header part, including the gap line between header and body.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TitleHeight |  The height of schedule title on sheet view.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ScheduleHeightsOnSheet
GetBodyRowHeights |  Returns each row's height of schedule body on sheet view.
Top
Remarks
 This class returns the heights of schedule title, column header and each body row on sheet view.
See Also
Reference
Autodesk.Revit.DB Namespace