Revit 2027 API
RebarSpliceByRulesResult Class
 Class that encapsulates the result of the splice by rules operation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarSpliceByRulesResult
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarSpliceByRulesResult : IDisposable
Public Class RebarSpliceByRulesResult
	Implements IDisposable
public ref class RebarSpliceByRulesResult : IDisposable
type RebarSpliceByRulesResult =
    class
        interface IDisposable
    end
The RebarSpliceByRulesResult type exposes the following members.
Properties
Name | Description
Error |  Identifies the error that occured during the splice by rules operation. In case of success the value of this property will be Success.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarSpliceByRulesResult
GetSpliceGeometries |  Gets the RebarSpliceGeometry collection which is the result of the splice by rules operation.
Top
Remarks
 This class contains a collection of RebarSpliceGeometry which is the result of the splice and a RebarSpliceByRulesError member. After splice by rules operation check the Error member for RebarSpliceByRulesError.Success value and retrieve the RebarSpliceGeometry collection. If the splice by rules operation fails the Error member will contain a meaninful error.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace