Revit 2027 API
Blend Methods
The Blend type exposes the following members.
Methods
Name | Description
GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles.
SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles.
Top
See Also
Reference
Blend Class
Autodesk.Revit.DB Namespace