Revit 2027 API
HermiteFace Properties
The HermiteFace type exposes the following members.
Properties
Name | Description
MixedDerivs | Mixed derivatives of the surface.
Params | Parameters of the surface.
Points | Interpolation points of the surface.
Tangents | Tangents of the surface.
Top
See Also
Reference
HermiteFace Class
Autodesk.Revit.DB Namespace