Revit 2027 API
SweepProfile Class
Represents a profile for sweep or swept blend elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SweepProfile
 Autodesk.Revit.DB.CurveLoopsProfile
 Autodesk.Revit.DB.FamilySymbolProfile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SweepProfile : APIObject
Public Class SweepProfile
	Inherits APIObject
public ref class SweepProfile : public APIObject
type SweepProfile =
    class
        inherit APIObject
    end
The SweepProfile type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace