Revit 2027 API
RectangleLightShape Class
 This class encapsulates a rectangle light shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightShape
 Autodesk.Revit.DB.Lighting.RectangleLightShape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RectangleLightShape : LightShape
Public Class RectangleLightShape
	Inherits LightShape
public ref class RectangleLightShape : public LightShape
type RectangleLightShape =
    class
        inherit LightShape
    end
The RectangleLightShape type exposes the following members.
Constructors
Name | Description
RectangleLightShape() |  Creates a rectangle light shape object with 4.0' emit length and a 2.0' emit width.
RectangleLightShape(RectangleLightShape) |  Creates a copy of the given rectangle light shape
RectangleLightShape(Double, Double) |  Creates a rectangle light shape object with the given emit length and width.
Top
Properties
Name | Description
EmitLength |  The emit length.
EmitWidth |  The emit width.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace