Revit 2027 API
StructuralSectionZProfileWithLips Class
 Defines parameters for Z Profile with lips structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionZProfileWithLips : StructuralSectionGeneralLZ
Public Class StructuralSectionZProfileWithLips
	Inherits StructuralSectionGeneralLZ
public ref class StructuralSectionZProfileWithLips : public StructuralSectionGeneralLZ
type StructuralSectionZProfileWithLips =
    class
        inherit StructuralSectionGeneralLZ
    end
The StructuralSectionZProfileWithLips type exposes the following members.
Constructors
Name | Description
StructuralSectionZProfileWithLips |  Creates a new instance of Structural Section Z Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace