Revit 2027 API
DocumentSavingAsEventArgs Class
 The event arguments used by the DocumentSavingAs event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSavingAsEventArgs : RevitAPIPreDocEventArgs
Public Class DocumentSavingAsEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class DocumentSavingAsEventArgs : public RevitAPIPreDocEventArgs
type DocumentSavingAsEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The DocumentSavingAsEventArgs type exposes the following members.
Properties
Name | Description
IsSavingAsCentralFile |  Indicates whether the document is to be saved as central file.
PathName |  Target path to which the document is to be saved.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace