Revit 2027 API
AnalyticalElement Properties
The AnalyticalElement type exposes the following members.
Properties
Name | Description
AnalyzeAs |  This represents the Analyze As parameter assigned to Analytical Element.
ConnectorManager |  Retrieves the Connector Manager from this AnalyticalElement.
MaterialId |  Defines the Material Id for the Analytical Element.
StructuralRole |  The enum value depicting structural role asigned to the Analytical Element.
Top
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace