Revit 2027 API
ExportPatternTableIterator Class
 An iterator to a set of Pattern table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportPatternTableIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportPatternTableIterator : IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
Public Class ExportPatternTableIterator
	Implements IEnumerator(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo))
public ref class ExportPatternTableIterator : IEnumerator<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>
type ExportPatternTableIterator =
    class
        interface IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
    end
The ExportPatternTableIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportPatternTableIterator
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace