Revit 2027 API
MEPBuildingConstructionSetIterator Class
An iterator to a MEPBuildingConstruction set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class MEPBuildingConstructionSetIterator : APIObject,
	IEnumerator
Public MustInherit Class MEPBuildingConstructionSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class MEPBuildingConstructionSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type MEPBuildingConstructionSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The MEPBuildingConstructionSetIterator type exposes the following members.
Constructors
Name | Description
MEPBuildingConstructionSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace