Revit 2027 API
DocumentOpeningEventArgs Class
 The event arguments used by the DocumentOpening event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentOpeningEventArgs : RevitAPIPreEventArgs
Public Class DocumentOpeningEventArgs
	Inherits RevitAPIPreEventArgs
public ref class DocumentOpeningEventArgs : public RevitAPIPreEventArgs
type DocumentOpeningEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The DocumentOpeningEventArgs type exposes the following members.
Properties
Name | Description
DocumentType |  Type of the document, e.g. Project or Template.
PathName |  Path of the document to be opened.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace