Revit 2027 API
FamilySizeTable Class
 Contains size information for a family.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilySizeTable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilySizeTable : IDisposable
Public Class FamilySizeTable
	Implements IDisposable
public ref class FamilySizeTable : IDisposable
type FamilySizeTable =
    class
        interface IDisposable
    end
The FamilySizeTable type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberOfColumns |  Number of columns in the table.
NumberOfRows |  Number of rows in the table.
Top
Methods
Name | Description
AsValueString |  Gets the table cell value as a string.
Dispose | Releases all resources used by the FamilySizeTable
GetColumnHeader |  Gets a column of the table at at given index.
IsValidColumnIndex |  Checks if the column index is valid.
Top
See Also
Reference
Autodesk.Revit.DB Namespace