Revit 2027 API
Level Properties
The Level type exposes the following members.
Properties
Name | Description
Elevation |  Retrieves or changes the elevation above or below the ground level.
ProjectElevation |  Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set.
Top
See Also
Reference
Level Class
Autodesk.Revit.DB Namespace