Revit 2027 API
SystemZoneData Methods
The SystemZoneData type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a system-zone data domain class.
Top
See Also
Reference
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace