Revit 2027 API
ComboBox Properties
The ComboBox type exposes the following members.
Properties
Name | Description
Current | Gets or sets the current checked ComboBox member of the ComboBox.
Image | The image shown on the ComboBox.
Top
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace