Revit 2027 API
PipeInsulation Methods
The PipeInsulation type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of pipe insulation.
Top
See Also
Reference
PipeInsulation Class
Autodesk.Revit.DB.Plumbing Namespace