Revit 2027 API
ColorOptions Class
 A class providing access to color settings which affect the colors applied to specific views.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ColorOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ColorOptions : IDisposable
Public Class ColorOptions
	Implements IDisposable
public ref class ColorOptions : IDisposable
type ColorOptions =
    class
        interface IDisposable
    end
The ColorOptions type exposes the following members.
Properties
Name | Description
AlertColor |  The color of the current canvas theme used to highlight elements when a special alert is required.
BackgroundColor |  The background color of the current canvas theme applied to views.
CalculatingColor |  The color of the current canvas theme used to render elements when some aspect of their properties is currently being recalculated.
EditingColor |  The color of the current canvas theme used to render elements when editing.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PreselectionColor |  The color of the current canvas theme used to highlight candidates for selection before they are selected.
SelectionColor |  The color of the current canvas theme used to highlight selected elements.
SelectionSemitransparent |  Indicates whether or not selections will be shown in a semi-transparent manner in current canvas theme.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ColorOptions
GetColorOptions |  Returns the current Revit instance's ColorOptions.
Top
Remarks
 ColorOptions are managed and stored along with other global application options and thus impact the application as a whole.
See Also
Reference
Autodesk.Revit.DB Namespace