Revit 2027 API
ComboBoxCurrentChangedEventArgs Properties
The ComboBoxCurrentChangedEventArgs type exposes the following members.
Properties
Name | Description
NewValue | The current item for the ComboBox after the change.
OldValue | The current item for the ComboBox before the change.
Top
See Also
Reference
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace