Revit 2027 API
LineLoad Methods
The LineLoad type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, XYZ, XYZ, LineLoadType) |  Creates a new hosted line load within the project.
Create(Document, ElementId, Curve, XYZ, XYZ, LineLoadType) |  Creates a new custom line load within the project.
Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType) |  Creates a new hosted line load within the project.
GetCurve |  Returns curve that define geometry of the line load.
IsCurveInsideHostBoundaries |  Indicates if the curve is inside panel's boundaries or on panel's edges or if the curve is on the member's curve.
IsValidHostId |  Indicates if the provided host id can host line loads.
SetCurve |  Sets the curve for the line load.
SetPoints |  Sets start and end point of the line load.
Top
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace