Revit 2027 API
ExternalDefinitionCreationOptions Class
 An option class used for creating a new shared parameter definition, including options such as name, type, visibility, Guid description and modifiable flag.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalDefinitionCreationOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalDefinitionCreationOptions : IDisposable
Public Class ExternalDefinitionCreationOptions
	Implements IDisposable
public ref class ExternalDefinitionCreationOptions : IDisposable
type ExternalDefinitionCreationOptions =
    class
        interface IDisposable
    end
The ExternalDefinitionCreationOptions type exposes the following members.
Constructors
Name | Description
ExternalDefinitionCreationOptions |  Constructs the options using a specified name and type.
Top
Properties
Name | Description
Description |  The description of the parameter definition to be created. The description will be used as tooltip in the Revit UI including in the properties palette. The default is an empty string.
GUID |  The GUID to use for this parameter definition. If not explicitly set, a random GUID is used.
HideWhenNoValue |  This property indicates whether this parameter should be hidden from the properties palette when it doesn't have a value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the parameter definition to be created.
UserModifiable |  This property indicates whether this parameter can be modified by UI user or not.
Visible |  True if the parameter is visible to the user, false if it is hidden and accessible only via the API. The default is true.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalDefinitionCreationOptions
GetDataType |  Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category.
SetDataType |  Sets the parameter's data type.
Top
See Also
Reference
Autodesk.Revit.DB Namespace