Revit 2027 API
ExternalCommandsData Methods
The ExternalCommandsData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExternalCommandsData Class
Autodesk.Revit.UI Namespace