Revit 2027 API
CustomInitialColor Properties
The CustomInitialColor type exposes the following members.
Properties
Name | Description
Temperature |  The custom color temperature value.
Top
See Also
Reference
CustomInitialColor Class
Autodesk.Revit.DB.Lighting Namespace