Revit 2027 API
ThinLinesOptions Class
 A utility class containing setting related to the Thin Lines option which affects the display in the UI.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ThinLinesOptions
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ThinLinesOptions : IDisposable
Public Class ThinLinesOptions
	Implements IDisposable
public ref class ThinLinesOptions : IDisposable
type ThinLinesOptions =
    class
        interface IDisposable
    end
The ThinLinesOptions type exposes the following members.
Properties
Name | Description
AreThinLinesEnabled |  A static property defining if the 'Thin Lines' setting is on or off in current Revit Application Session.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ThinLinesOptions
Top
See Also
Reference
Autodesk.Revit.UI Namespace