Revit 2027 API
ConduitSizeIterator Methods
The ConduitSizeIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  Returns the current ConduitSize.
HasCurrent |  Identifies if the iterator has a current item.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace