Revit 2027 API
FloorType Properties
The FloorType type exposes the following members.
Properties
Name | Description
IsFoundationSlab |  Returns whether the element FloorAttributes type is FoundationSlab.
StructuralMaterialId |  Returns the identifier of the material that defines the element's structural analysis properties.
ThermalProperties |  The calculated and settable thermal properties of the FloorType
Top
See Also
Reference
FloorType Class
Autodesk.Revit.DB Namespace