Revit 2027 API
ModelEllipse Class
Represents a ModelEllipse within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.ModelCurve
 Autodesk.Revit.DB.ModelEllipse
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelEllipse : ModelCurve
Public Class ModelEllipse
	Inherits ModelCurve
public ref class ModelEllipse : public ModelCurve
type ModelEllipse =
    class
        inherit ModelCurve
    end
The ModelEllipse type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from ModelCurve::geometryCurve property.
See Also
Reference
Autodesk.Revit.DB Namespace