Revit 2027 API
Extrusion Class
A extrusion solid or void form.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Extrusion
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Extrusion : GenericForm
Public Class Extrusion
	Inherits GenericForm
public ref class Extrusion : public GenericForm
type Extrusion =
    class
        inherit GenericForm
    end
The Extrusion type exposes the following members.
Properties
Name | Description
EndOffset | The offset of the end of the extrusion relative to the sketch plane.
Sketch | Returns the Sketch of the Extrusion.
StartOffset | The offset of the start of the extrusion relative to the sketch plane.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace