Revit 2027 API
RevitServerException Methods
The RevitServerException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerException Class
Autodesk.Revit.Exceptions Namespace