Revit 2027 API
Ellipse Methods
The Ellipse type exposes the following members.
Methods
Name | Description
CreateCurve |  Creates a new geometric ellipse or elliptical arc object.
Top
See Also
Reference
Ellipse Class
Autodesk.Revit.DB Namespace