Revit 2027 API
TemporaryGraphicsManager Class
 A class that provides functionality to create temporary graphics in a Revit model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TemporaryGraphicsManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TemporaryGraphicsManager : IDisposable
Public Class TemporaryGraphicsManager
	Implements IDisposable
public ref class TemporaryGraphicsManager : IDisposable
type TemporaryGraphicsManager =
    class
        interface IDisposable
    end
The TemporaryGraphicsManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddControl |  Creates an in-canvas control.
Clear |  Clear all temporary graphics objects managed by this manager.
Dispose | Releases all resources used by the TemporaryGraphicsManager
GetAll |  Returns all temporary graphics object indexes managed by this manager.
GetTemporaryGraphicsManager |  Gets a TemporaryGraphicsManager reference of the document.
RemoveControl |  Deletes the existing control identified by the unique index.
SetTooltip |  Sets the tooltip for the temporary graphics object.
SetVisibility |  Changes the visibility of temporary graphics object.
UpdateControl |  Updates the in-canvas control identified by the unique index.
Top
Remarks
 The graphics created by this class are temporary or transient. They are not subject to undo and are not saved. It's caller's responsiblity to manage their lifetime, creation and destruction, though Revit will destroy all of them when closing the model.
See Also
Reference
Autodesk.Revit.DB Namespace