Revit 2027 API
TextBoxEnterPressedEventArgs Class
The event arguments used by TextBox's EnterPressed event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.UI.Events.RibbonItemEventArgs
 Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextBoxEnterPressedEventArgs : RibbonItemEventArgs
Public Class TextBoxEnterPressedEventArgs
	Inherits RibbonItemEventArgs
public ref class TextBoxEnterPressedEventArgs : public RibbonItemEventArgs
type TextBoxEnterPressedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
The TextBoxEnterPressedEventArgs type exposes the following members.
Constructors
Name | Description
TextBoxEnterPressedEventArgs | Initializes a new instance of the TextBoxEnterPressedEventArgs class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace