Revit 2027 API
EvaluatedParameter Class
 Hold the evaluated ParameterValue and Definition of a parameter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EvaluatedParameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EvaluatedParameter : IDisposable
Public Class EvaluatedParameter
	Implements IDisposable
public ref class EvaluatedParameter : IDisposable
type EvaluatedParameter =
    class
        interface IDisposable
    end
The EvaluatedParameter type exposes the following members.
Properties
Name | Description
Definition |  Definition of the parameter.
HasValue |  This property is true when the parameter value was successfully obtained, false otherwise.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StorageType |  The storage type describes the type that is used internally within the parameter to store its value.
Value |  Evaluated value of the parameter.
Top
Methods
Name | Description
AsValueString(Document) |  Get the parameter value as a string with units.
AsValueString(Document, FormatOptions) |  Get the parameter value as a string with units.
Dispose | Releases all resources used by the EvaluatedParameter
Top
See Also
Reference
Autodesk.Revit.DB Namespace