Revit 2027 API
PolylineSegments Methods
The PolylineSegments type exposes the following members.
Methods
Name | Description
Dispose
GetVertices |  Returns an array of vertices of the polyline segments.
Top
See Also
Reference
PolylineSegments Class
Autodesk.Revit.DB Namespace