Revit 2027 API
FunctionId Methods
The FunctionId type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
Top
See Also
Reference
FunctionId Class
Autodesk.Revit.Exceptions Namespace