Revit 2027 API
BuildingPad Class
 Represents a BuildingPad element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.Architecture.BuildingPad
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BuildingPad : CeilingAndFloor
Public Class BuildingPad
	Inherits CeilingAndFloor
public ref class BuildingPad : public CeilingAndFloor
type BuildingPad =
    class
        inherit CeilingAndFloor
    end
The BuildingPad type exposes the following members.
Properties
Name | Description
AssociatedTopographySurfaceId |  The element id of a topography surface created by the introduction of this building pad.
HostId |  The element id of the topography surface hosting this BuidlingPad.
Top
Methods
Name | Description
Create |  Creates a new BuildingPad element and adds it to the document.
GetBoundary |  Gets the boundary of current BuildingPad element.
SetBoundary |  Set a given curve loops as the boundary of the current BuildingPad element.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace