Revit 2027 API
PipeInsulationType Class
 This class represents a pipe insulation type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Plumbing.PipeInsulationType
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeInsulationType : ElementType
Public Class PipeInsulationType
	Inherits ElementType
public ref class PipeInsulationType : public ElementType
type PipeInsulationType =
    class
        inherit ElementType
    end
The PipeInsulationType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace