Revit 2027 API
ReinforcementSettings Properties
The ReinforcementSettings type exposes the following members.
Properties
Name | Description
HostStructuralRebar |  Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar.
NumberingMethod |  Identifies the type of the numbering method.
RebarPresentationInSection |  The default presentation mode for rebar sets, when:
The view direction is perpendicular to the rebar normal and the rebar set is cut.
The view direction is not perpendicular to the rebar normal and the view direction is not parallel to the rebar normal.
RebarPresentationInView |  The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut.
RebarShapeDefinesEndTreatments |  End Treatments are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
RebarShapeDefinesHooks |  Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
RebarVaryingLengthNumberSuffix |  A unique identifier used for a bar within a variable length rebar set.
Top
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace