Revit 2027 API
Part Class
 This element represents a part of another element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Part
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Part : Element
Public Class Part
	Inherits Element
public ref class Part : public Element
type Part =
    class
        inherit Element
    end
The Part type exposes the following members.
Properties
Name | Description
Excluded |  True if the part is excluded, false otherwise
OriginalCategoryId |  The category Id of the original element corresponding to this Part.
PartMaker |  The PartMaker that created this Part.
Top
Methods
Name | Description
CanOffsetFace |  Checks if it is possible to offset the given face.
GetFaceOffset |  Get face offset of the given part face.
GetSourceElementIds |  Gets a collection of elements from which this Part is created by the PartMaker. May return more than one source only if there is merge involved somewhere in the history of this Part.
GetSourceElementOriginalCategoryIds |  Gets the category ids of the source elements which were used to form this part.
ResetFaceOffset |  Resets the offset applied to the given part face.
ResetPartShape |  Resets all face offsets applied to part faces.
SetFaceOffset |  Offsets the given part face in the direction that points out of the solid shape with the specified amount. Negative value will offset the face into the solid shape.
Top
Remarks
 A part is associated with a PartMaker element that creates it.
See Also
Reference
Autodesk.Revit.DB Namespace