Revit 2027 API
EdgeArray Properties
The EdgeArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an edge at a specified index within the array.
Size | Returns the number of edges that are in the array.
Top
See Also
Reference
EdgeArray Class
Autodesk.Revit.DB Namespace