Revit 2027 API
FilterNumericRuleEvaluator Class
 Base for all classes that compare numeric values from Revit to a user-supplied filter value.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterNumericRuleEvaluator
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterNumericRuleEvaluator : IDisposable
Public Class FilterNumericRuleEvaluator
	Implements IDisposable
public ref class FilterNumericRuleEvaluator : IDisposable
type FilterNumericRuleEvaluator =
    class
        interface IDisposable
    end
The FilterNumericRuleEvaluator type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilterNumericRuleEvaluator
Evaluate(Int64, Int64) |  Derived classes should override this method to implement the desired test.
Evaluate(Double, Double, Double) |  Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not.
Top
Remarks
 A class derived from FilterNumericRuleEvaluator must handle both integer and double-precision types. For double-precision comparisons, an epsilon value is given. The evaluator class should use this value in a manner appropriate to the comparison being implemented.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterNumericRuleEvaluator
 Autodesk.Revit.DB.FilterNumericEquals
 Autodesk.Revit.DB.FilterNumericGreater
 Autodesk.Revit.DB.FilterNumericGreaterOrEqual
 Autodesk.Revit.DB.FilterNumericLess
 Autodesk.Revit.DB.FilterNumericLessOrEqual