Revit 2027 API
LoadCase Properties
The LoadCase type exposes the following members.
Properties
Name | Description
NatureId |  The nature ID of the load case.
Number |  Returns unique load case number.
SubcategoryId |  Build-in or user defined subcategory of Structural Load Cases (OST_LoadCases) category.
Top
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace