Revit 2027 API
FabricSheet Class
 An object that represents an Fabric Sheet Element within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.FabricSheet
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricSheet : Element
Public Class FabricSheet
	Inherits Element
public ref class FabricSheet : public Element
type FabricSheet =
    class
        inherit Element
    end
The FabricSheet type exposes the following members.
Properties
Name | Description
BendFinalLoopOrientationVector |  Direction of local Fabric Sheet Y axis in bending polyline LCS.
BentFabricBendDirection |  Specifies which wire direction of the fabric sheet is bent.
BentFabricLongitudinalCutLength |  Specifies the cut length of the fabric sheet perpendicular to the bend edge.
BentFabricStraightWiresLocation |  Specifies the location of straight bars with respect to bent bars in the fabric sheet.
CoverOffset |  The additional cover offset of the Fabric Sheet.
CutOverallLength |  The sheet length after cutting has taken place.
CutOverallWidth |  The sheet length after cutting has taken place.
CutSheetMass |  The sheet mass after cutting has taken place.
DistributionOfWiresAtCover |  The distribution of wires that is closest to the cover.
FabricAreaOwnerId |  The Fabric Area Id.
FabricHostReference |  Controls if Single Fabric Sheet should be cut by the Host Cover
FabricLocation |  The Fabric Sheet location in the host.
FabricNumber |  Specifies the numerical parameter assigned to the fabric sheet and any sheet of the same type, dimension, material, shape, and partition.
HostId |  The structure element that contains the Fabric Sheet.
IsBent |  The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet.
SketchId |  The id of the Sketch element for this element.
Top
Methods
Name | Description
Create(Document, Element, ElementId) |  Creates a new instance of a single flat Fabric Sheet element within the project.
Create(Document, ElementId, ElementId, CurveLoop) |  Creates a new instance of a single bent Fabric Sheet element within the project.
GetBendProfile |  Returns the profile (not including generated fillets) that defines the shape of the Fabric Sheet bending.
GetBendProfileWithFillets |  Returns the profile with generated fillets that defines the shape of the Fabric Sheet bending.
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetSegmentParameterIdsAndLengths |  Returns the array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.).
GetSheetLocation |  Gets the position and the orientation of the Fabric Sheet instance.
GetWireCenterlines() |  Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
GetWireCenterlines(WireDistributionDirection) |  Gets a list of curves representing the wires centerlines of the Fabric Sheet.
IsCoverOffsetValid |  Identifies if the specified value is valid for use as a cover offset.
IsNotBent |  Method to verify that a fabric sheet is flat.
IsSingleFabricSheetWithinHost |  Identifies if the specified single Fabric Sheet position is within the host.
IsUnobscuredInView |  Checks if this fabric sheet is shown unobscured in a view.
IsValidHost(Element) |  Checks whether an element is a valid host for fabric sheet.
IsValidHost(Document, ElementId) |  Checks whether an element is a valid host for fabric sheet.
PlaceInHost |  Inserts the single Fabric Sheet instance into the host element.
SetBendProfile |  Sets new profile that defines the shape of the Fabric Sheet bending.
SetSegmentLength |  Sets the value of the bent fabric sheet segment(like A, B, C, D etc.)
SetUnobscuredInView |  Sets this fabric sheet to be shown unobscured in a view.
Top
Remarks
 Beginning with Revit 2016, fabric sheets can be either flat or bent. Both kinds of fabric sheets are implemented by this FabricSheet class. Fabric sheets are created as either flat or bent. Once created, the kind of a fabric sheet cannot be changed. The Fabric Sheet element is available only in the Autodesk Revit Structure product.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace