Revit 2027 API
ElementIntersectsSolidFilter Methods
The ElementIntersectsSolidFilter type exposes the following members.
Methods
Name | Description
GetSolid |  Gets the target solid geometry.
Top
See Also
Reference
ElementIntersectsSolidFilter Class
Autodesk.Revit.DB Namespace