Revit 2027 API
Arc Class
A circular arc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.Arc
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Arc : Curve
Public Class Arc
	Inherits Curve
public ref class Arc : public Curve
type Arc =
    class
        inherit Curve
    end
The Arc type exposes the following members.
Properties
Name | Description
Center | Returns the center of the arc.
Normal | Returns the normal to the plane in which the arc is defined.
Radius | Returns the radius of the arc.
XDirection | Returns the X direction.
YDirection | Returns the Y direction.
Top
Methods
Name | Description
Create(XYZ, XYZ, XYZ) |  Creates a new geometric arc object based on three points.
Create(Plane, Double, Double, Double) |  Creates a new geometric arc object based on plane, radius, and angles.
Create(XYZ, Double, Double, Double, XYZ, XYZ) |  Creates a new geometric arc object based on center, radius, unit vectors, and angles.
Top
Remarks
The arc lies in the plane defined by center and normal.
See Also
Reference
Autodesk.Revit.DB Namespace