Revit 2027 API
WorksharingTooltipInfo Methods
The WorksharingTooltipInfo type exposes the following members.
Methods
Name | Description
Dispose
GetRequesters |  The ordered list of unique user names of users who have outstanding editing requests for the specified element.
Top
See Also
Reference
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace