Revit 2027 API
ViewSchedule Properties
The ViewSchedule type exposes the following members.
Properties
Name | Description
BodyTextTypeId |  Defines the default text style used for the data section of the schedule.
Definition |  The primary ScheduleDefinition.
EmbeddedDefinition |  The embedded ScheduleDefinition.
HasStripedRows |  Indicates whether this schedule has striped rows.
HeaderTextTypeId |  Defines the default text style used in the column headers in the body section of the schedule.
IsHeaderFrozen |  A static property defining if the schedule header frozen setting is turned on or off in current Revit Application Session.
IsInternalKeynoteSchedule |  Identifies if this ViewSchedule is an internal schedule used when keynotes are filtered based on the elements that are shown on a sheet.
IsTitleblockRevisionSchedule |  Identifies if this ViewSchedule is an internal schedule used to display revision schedules as part of a titleblock.
KeyScheduleParameterName |  In a key schedule, the name of the parameter for choosing one of the keys.
RowHeight |  Defines the schedule body rows height.
RowHeightOverride |  Defines the override that is applied to the row height.
TitleTextTypeId |  Defines the default text style used in the header section of the schedule.
UseStripedRowsOnSheets |  Indicates whether a property setting of true will also change the display of this schedule to show striped rows on a sheet. If true, setting that property to true will also change the display. If false, striped rows will not display for this schedule on a sheet no matter what value is set for HasStripedRows.
Top
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace