Revit 2027 API
StructuralSectionStructuralTees Properties
The StructuralSectionStructuralTees type exposes the following members.
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing in the flange, in. (mm)
BoltSpacingWeb |  Standard bolt spacing in the web, in. (mm)
Top
See Also
Reference
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace