Revit 2027 API
AreaReinforcementType Class
 An object that specifies the type of a Structural Area Reinforcement element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.AreaReinforcementType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaReinforcementType : ElementType
Public Class AreaReinforcementType
	Inherits ElementType
public ref class AreaReinforcementType : public ElementType
type AreaReinforcementType =
    class
        inherit ElementType
    end
The AreaReinforcementType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CreateDefaultAreaReinforcementType |  Creates a new AreaReinforcementType object with a default name.
Top
Remarks
 The clear cover settings can be accessed via this object.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace