Revit 2027 API
PanelScheduleSheetInstance Class
 The class represents an instance of a panel schedule placed on sheet.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.PanelScheduleSheetInstance
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PanelScheduleSheetInstance : Element
Public Class PanelScheduleSheetInstance
	Inherits Element
public ref class PanelScheduleSheetInstance : public Element
type PanelScheduleSheetInstance =
    class
        inherit Element
    end
The PanelScheduleSheetInstance type exposes the following members.
Properties
Name | Description
Origin |  The sheet instance offset in drawing sheet coordinates.
ScheduleId |  The panel schedule id.
Top
Methods
Name | Description
Create |  Creates a new instance of panel schedule on sheet and adds it to the document.
GetSchedule |  Gets the panel schedule view.
SplitSegment |  Split the panel schedule into Thrown if the index is out of bounds.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace