Revit 2027 API
HVACZoneData Properties
The HVACZoneData type exposes the following members.
Properties
Name | Description
ZoneEquipmentId |  The id of the zone equipment related to the zone.
Top
See Also
Reference
HVACZoneData Class
Autodesk.Revit.DB.Mechanical Namespace