Revit 2027 API
AssetPropertyDoubleArray4d Class
 Represents a color property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyDoubleArray4d : AssetProperty
Public Class AssetPropertyDoubleArray4d
	Inherits AssetProperty
public ref class AssetPropertyDoubleArray4d : public AssetProperty
type AssetPropertyDoubleArray4d =
    class
        inherit AssetProperty
    end
The AssetPropertyDoubleArray4d type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetValueAsColor |  Gets the value property as a color.
GetValueAsDoubles |  Gets the value property as doubles.
IsValidValue(Color) |  Checks that the value is a valid value for this property.
IsValidValue(IList<Double>) |  Checks that the value is a valid value for this property.
SetValueAsColor |  Sets the value property as a color.
SetValueAsDoubles |  Sets the value of the property.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace