Revit 2027 API
Outline Class
 Outline is a generic object that provides a bounding box/bounding outline. It supports operations to scale and transform. It also supports intersections and contains operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Outline
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Outline : IDisposable
Public Class Outline
	Implements IDisposable
public ref class Outline : IDisposable
type Outline =
    class
        interface IDisposable
    end
The Outline type exposes the following members.
Constructors
Name | Description
Outline(Outline) |  Constructs a new copy of the input Outline object.
Outline(XYZ, XYZ) |  Constructor that uses a minimum and maximum XYZ point to initialize the outline.
Top
Properties
Name | Description
IsEmpty |  Identifies if the outline represents an empty outline.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaximumPoint |  The maximum point of the bounding box.
MinimumPoint |  The minimum point of the bounding box.
Top
Methods
Name | Description
AddPoint |  Adds a point to the bounding box, expanding it if the point is outside the existing boundary.
Contains |  Determine if this Outline contains the specified point to within a tolerance.
ContainsOtherOutline |  Determine if this Outline contains another Outline to within tolerance.
Dispose | Releases all resources used by the Outline
GetDiagonalLength |  Get the length of outline's diagonal. If called on empty outline, 0. is returned
Intersects |  Determine if this Outline intersects the input Outline to within a specified tolerance.
IsScaleValid |  Checks if given scale is valid. Should be greater than zero.
Scale |  Scales the bounding box by given scale.
Top
See Also
Reference
Autodesk.Revit.DB Namespace