Revit 2027 API
CentralFileCommunicationException Class
The exception thrown when there is a network communication error involving a file-based central model.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CentralFileCommunicationException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class CentralFileCommunicationException : CentralModelException
<SerializableAttribute>
Public Class CentralFileCommunicationException
	Inherits CentralModelException
[SerializableAttribute]
public ref class CentralFileCommunicationException : public CentralModelException
[<SerializableAttribute>]
type CentralFileCommunicationException =
    class
        inherit CentralModelException
    end
The CentralFileCommunicationException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace