Revit 2027 API
AnalyticalOpening Class
 An element that represents an Opening in an Analytical Panel element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalElement
 Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
 Autodesk.Revit.DB.Structure.AnalyticalOpening
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalOpening : AnalyticalSurfaceBase
Public Class AnalyticalOpening
	Inherits AnalyticalSurfaceBase
public ref class AnalyticalOpening : public AnalyticalSurfaceBase
type AnalyticalOpening =
    class
        inherit AnalyticalSurfaceBase
    end
The AnalyticalOpening type exposes the following members.
Properties
Name | Description
PanelId |  ElementId of the AnalyticalPanel parent.
Top
Methods
Name | Description
Create |  Creates a new instance of an Analytical Opening within the project.
IsCurveLoopValidForAnalyticalOpening |  Checks if curve loop is valid for Analytical Opening.
Top
Remarks
 It can cut only one Analytical Panel at a time.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace