Revit 2027 API
StructuralSectionGeneralT Methods
The StructuralSectionGeneralT type exposes the following members.
Methods
Name | Description
GetFlangeThicknessInFlangeCenter |  Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInQuarterWidth |  Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm.
GetWebThicknessInHeightCenter |  Returns thickness of web measured in the 0.5 * height,
Top
See Also
Reference
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace