Revit 2027 API
TextBoxData Properties
The TextBoxData type exposes the following members.
Properties
Name | Description
Image | The image of the TextBox.
Top
See Also
Reference
TextBoxData Class
Autodesk.Revit.UI Namespace