Revit 2027 API
IFCExtrusionCreationData Methods
The IFCExtrusionCreationData type exposes the following members.
Methods
Name | Description
AddOpening |  Adds an opening to the data.
ClearOpenings |  Removes all cached openings from the data.
Dispose
GetLocalPlacement |  Gets the reference to the IfcLocalPlacement handle used when creating the extrusion.
GetOpenings |  Gets a collection of all of the openings stored in this data.
SetLocalPlacement |  Sets the data to reference an IfcLocalPlacement handle when creating the extrusion. Side effect: will set ReuseLocalPlacement to true.
Top
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace