Revit 2027 API
ModelCurveNode Properties
The ModelCurveNode type exposes the following members.
Properties
Name | Description
LineProperties |  Access to the line (pen) properties of the curve being drawn
Top
See Also
Reference
ModelCurveNode Class
Autodesk.Revit.DB Namespace