Revit 2027 API
FabricationSaveJobOptions Class
 Options for FabricationPart.SaveAsFabricationJob() method.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationSaveJobOptions : IDisposable
Public Class FabricationSaveJobOptions
	Implements IDisposable
public ref class FabricationSaveJobOptions : IDisposable
type FabricationSaveJobOptions =
    class
        interface IDisposable
    end
The FabricationSaveJobOptions type exposes the following members.
Constructors
Name | Description
FabricationSaveJobOptions() |  Default Constructor
FabricationSaveJobOptions(Boolean) |  Constructor
Top
Properties
Name | Description
AddHolesForTaps |  Set true to have holes for taps on straights added to the created fabrication job.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationSaveJobOptions
Top
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace