Revit 2027 API
IMultiServerService Methods
The IMultiServerService type exposes the following members.
Methods
Name | Description
CanExecute |  Implement this to test whether a particular server should be executed.
Top
See Also
Reference
IMultiServerService Interface
Autodesk.Revit.DB.ExternalService Namespace