Revit 2027 API
ParameterValuePresenceRule Class
 Tests whether an element's parameter has a value or not.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.ParameterValuePresenceRule
 Autodesk.Revit.DB.HasNoValueFilterRule
 Autodesk.Revit.DB.HasValueFilterRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ParameterValuePresenceRule : FilterRule
Public Class ParameterValuePresenceRule
	Inherits FilterRule
public ref class ParameterValuePresenceRule : public FilterRule
type ParameterValuePresenceRule =
    class
        inherit FilterRule
    end
The ParameterValuePresenceRule type exposes the following members.
Properties
Name | Description
Parameter |  The parameter which will be evaluated to pass this rule.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace