Revit 2027 API
ImagePlacementOptions Class
 ImagePlacementOptions are used to describe where an ImageInstance should be placed in a view
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ImagePlacementOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ImagePlacementOptions : IDisposable
Public Class ImagePlacementOptions
	Implements IDisposable
public ref class ImagePlacementOptions : IDisposable
type ImagePlacementOptions =
    class
        interface IDisposable
    end
The ImagePlacementOptions type exposes the following members.
Constructors
Name | Description
ImagePlacementOptions() |  Constructs a new ImagePlacementOptions that will place an ImageInstance with its center at the origin of the model
ImagePlacementOptions(XYZ, BoxPlacement) |  Constructs a new ImagePlacementOptions for placing an ImageInstance
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Location |  The location in the model where a point of the ImageInstance, determined by the PlacementPoint property, is going to be inserted.
PlacementPoint |  Identifies which point of the ImageInstance will be aligned to the Location
Top
Methods
Name | Description
Dispose | Releases all resources used by the ImagePlacementOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace