Revit 2027 API
CombinableElementArrayIterator Class
An iterator to an CombinableElement array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CombinableElementArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class CombinableElementArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class CombinableElementArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class CombinableElementArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type CombinableElementArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The CombinableElementArrayIterator type exposes the following members.
Constructors
Name | Description
CombinableElementArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace