Revit 2027 API
CurtainGridSetIterator Methods
The CurtainGridSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
CurtainGridSetIterator Class
Autodesk.Revit.DB Namespace