Revit 2027 API
WallSweepInfo Methods
The WallSweepInfo type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Determines if the input object is equivalent to this WallSweepInfo.
Top
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace