Revit 2027 API
ContinuousRail Methods
The ContinuousRail type exposes the following members.
Methods
Name | Description
GetEndExtensionPath |  Retrieves the start extension path.
GetPath |  Retrieves the rail path.
GetStartExtensionPath |  Retrieves the start extension path.
GetSupports |  Returns all the railing supports attached to the rail.
Top
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace