Revit 2027 API
Dimension Class
 An object that represents a dimension within the Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.AngularDimension
 Autodesk.Revit.DB.LinearDimension
 Autodesk.Revit.DB.RadialDimension
 Autodesk.Revit.DB.SpotDimension
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Dimension : Element
Public Class Dimension
	Inherits Element
public ref class Dimension : public Element
type Dimension =
    class
        inherit Element
    end
The Dimension type exposes the following members.
Properties
Name | Description
Above | The text shown above the segment's value.
AreReferencesAvailable |  Indicates if this dimension's references can be resolved.
AreSegmentsEqual | Indicates if all segments are forced to be equal.
Below | The text shown below the segment's value.
Curve |  A curve that represents the dimension line.
DimensionShape | The shape of this dimension.
DimensionType |  The dimension style of this dimension.
FamilyLabel | The family parameter label of the dimension.
HasLeader |  True if dimension has leader, false otherwise.
IsLocked |  Indicates if this dimension is locked.
IsValid |  Indicates if this dimension is valid.
LeaderEndPosition |  The position of the dimension's leader end point.
Name | Retrieves or changes the name associated with the Dimension.
NumberOfSegments | The number of segments for the dimension.
Origin |  The dimension origin.
Prefix | The text shown before the segment's value.
References |  Returns an array of geometric references to which the dimension is attached.
Segments | The segments in the dimension.
Suffix | The text shown after the segment's value.
TextPosition |  The position of the dimension text's drag point.
Value |  The value of the dimension.
ValueOverride | The text that replaces the segment's value.
ValueString |  The dimension value as a user visible string.
View |  Supplies the view that contains the dimension if the dimension is view specific.
Top
Methods
Name | Description
HasOneSegment |  Determines whether a dimension has one segment.
IsTextPositionAdjustable |  Indicates if this dimension is supported to set/get TextPosition/LeaderEndPosition.
ResetTextPosition |  Resets the text position of the dimension to the initial position determined by its type and parameters.
Top
Example
public void GetInfo_Dimension(Dimension dimension)
{
    string message = "Dimension : ";
    // Get Dimension name
    message += "\nDimension name is : " + dimension.Name;
    // Get Dimension Curve
    Autodesk.Revit.DB.Curve curve = dimension.Curve;
    if (curve != null && curve.IsBound)
    {
        // Get curve start point
        message += "\nCurve start point:(" + curve.GetEndPoint(0).X + ", "
             + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
        // Get curve end point
        message += "; Curve end point:(" + curve.GetEndPoint(1).X + ", "
             + curve.GetEndPoint(1).Y + ", " + curve.GetEndPoint(1).Z + ")";
    }
    // Get Dimension type name
    message += "\nDimension type name is : " + dimension.DimensionType.Name;
    // Get Dimension view name
    message += "\nDimension view name is : " + dimension.View.Name;
    // Get Dimension reference count
    message += "\nDimension references count is " + dimension.References.Size;
    if (BuiltInCategory.OST_Dimensions == dimension.Category.BuiltInCategory)
    {
        message += "\nDimension is a permanent dimension.";
    }
    else if (BuiltInCategory.OST_Constraints == dimension.Category.BuiltInCategory)
    {
        message += "\nDimension is a constraint element.";
    }
    Autodesk.Revit.UI.TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace