Revit 2027 API
Conduit Methods
The Conduit type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of conduit.
IsValidConduitType |  Identifies if a conduit type is valid.
Top
See Also
Reference
Conduit Class
Autodesk.Revit.DB.Electrical Namespace