Revit 2027 API
ConnectorSetIterator Class
An iterator to a set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ConnectorSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ConnectorSetIterator : APIObject,
	IEnumerator
Public MustInherit Class ConnectorSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ConnectorSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ConnectorSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ConnectorSetIterator type exposes the following members.
Constructors
Name | Description
ConnectorSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace