Revit 2027 API
CeilingAndFloor Class
A base class that provides support for all ceiling and floor objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.Architecture.BuildingPad
 Autodesk.Revit.DB.Ceiling
 Autodesk.Revit.DB.Floor
 Autodesk.Revit.DB.Toposolid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CeilingAndFloor : HostObject
Public Class CeilingAndFloor
	Inherits HostObject
public ref class CeilingAndFloor : public HostObject
type CeilingAndFloor =
    class
        inherit HostObject
    end
The CeilingAndFloor type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace