Revit 2027 API
DuctFittingAndAccessoryPressureDropUIDataItem Class
 Each duct fitting or duct accessory FamilyInstance has one DuctFittingAndAccessoryPressureDropUIDataItem.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctFittingAndAccessoryPressureDropUIDataItem : IDisposable
Public Class DuctFittingAndAccessoryPressureDropUIDataItem
	Implements IDisposable
public ref class DuctFittingAndAccessoryPressureDropUIDataItem : IDisposable
type DuctFittingAndAccessoryPressureDropUIDataItem =
    class
        interface IDisposable
    end
The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctFittingAndAccessoryPressureDropUIDataItem
GetDuctFittingAndAccessoryData |  Gets the fitting data stored in the UI data item.
GetEntity |  Returns the entity set by UI server. or an invalid entity otherwise.
SetEntity |  Stores the entity in the UI data item.
Top
Remarks
 One family instance has one UI data item. The UI data item contains a corresponding DuctFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.
See Also
Reference
Autodesk.Revit.UI.Mechanical Namespace