Revit 2027 API
LinkConversionData Methods
The LinkConversionData type exposes the following members.
Methods
Name | Description
Dispose
GetOptions |  Extra information used during the creation of the Revit document.
Top
See Also
Reference
LinkConversionData Class
Autodesk.Revit.DB Namespace