Revit 2027 API
BaseImportOptions Methods
The BaseImportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetDefaultLengthUnit |  Get the default length unit used for importing unitless files.
GetLayerSelection |  Get all set layers name which user want to import into Revit.
SetDefaultLengthUnit |  Set the default length unit used for importing unitless files.
SetLayerSelection |  Set the layers name which user want to import into Revit.
Top
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace