Revit 2027 API
PerformanceAdviser Methods
The PerformanceAdviser type exposes the following members.
Methods
Name | Description
AddRule |  Adds a performance adviser rule to the list of rules.
DeleteRule |  Deletes a performance adviser rule from the list of rules.
Dispose
ExecuteAllRules |  Executes all rules in the list on a given document.
ExecuteRules(Document, IList<PerformanceAdviserRuleId>) |  Executes selected rules on a given document.
ExecuteRules(Document, IList<Int32>) |  Executes selected rules on a given document.
GetAllRuleIds |  Retrieves an enumeration of rule Ids.
GetElementFilterFromRule(Int32, Document) |  Retrieves a filter to restrict elements to be checked.
GetElementFilterFromRule(PerformanceAdviserRuleId, Document) |  Retrieves a filter to restrict elements to be checked.
GetNumberOfRules |  Retrieves number of performance adviser rules in the list.
GetPerformanceAdviser |  Returns the only instance of PerformanceAdviser in the Application.
GetRuleDescription(Int32) |  Retrieves the description of the rule.
GetRuleDescription(PerformanceAdviserRuleId) |  Retrieves the description of the rule.
GetRuleId |  Retrieves an id of a rule for a given index in the list.
GetRuleName(Int32) |  Retrieves the name of the rule.
GetRuleName(PerformanceAdviserRuleId) |  Retrieves the name of the rule.
IsRuleEnabled(Int32) |  Retrieves an enabled/disabled status for the given rule.
IsRuleEnabled(PerformanceAdviserRuleId) |  Retrieves an enabled/disabled status for the given rule.
PostWarning |  Reports a problem detected during execution of a rule.
SetRuleEnabled(Int32, Boolean) |  Retrieves an enabled/disabled status for the given rule.
SetRuleEnabled(PerformanceAdviserRuleId, Boolean) |  Retrieves an enabled/disabled status for the given rule.
WillRuleCheckElements(Int32) |  Reports if rule needs to be executed on individual elements.
WillRuleCheckElements(PerformanceAdviserRuleId) |  Reports if rule needs to be executed on individual elements.
Top
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace