Revit 2027 API
HVACLoadSpaceType Methods
The HVACLoadSpaceType type exposes the following members.
Methods
Name | Description
Create |  Creates a space type.
IsNameUnique(String) |  Determines whether a potential space type name is unique.
IsNameUnique(Document, String) |  Determines whether a potential space type name is unique.
Top
See Also
Reference
HVACLoadSpaceType Class
Autodesk.Revit.DB.Analysis Namespace