Revit 2027 API
CableType Properties
The CableType type exposes the following members.
Properties
Name | Description
ConductorMaterial |  The Conductor Material of this Cable Type.
CoreType |  The core type of the cable type.
InsulationMaterial |  The Conductor Insulation Material of this Cable Type.
TemperatureRating |  The Conductor Temperature Rating of this Cable Type.
Top
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace