Revit 2027 API
AssetPropertyTime Properties
The AssetPropertyTime type exposes the following members.
Properties
Name | Description
Value | Get the value of the property
Top
See Also
Reference
AssetPropertyTime Class
Autodesk.Revit.DB.Visual Namespace