Revit 2027 API
ReferenceWithContext Methods
The ReferenceWithContext type exposes the following members.
Methods
Name | Description
Dispose
GetInstanceTransform |  Gets the transform of the instance.
GetReference |  Gets the reference of the geometric object.
Top
See Also
Reference
ReferenceWithContext Class
Autodesk.Revit.DB Namespace