Revit 2027 API
RebarShapeConstraint Class
 A dimension or other constraint that takes part in a RebarShapeDefinition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 More
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraint : IDisposable
Public Class RebarShapeConstraint
	Implements IDisposable
public ref class RebarShapeConstraint : IDisposable
type RebarShapeConstraint =
    class
        interface IDisposable
    end
The RebarShapeConstraint type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarShapeConstraint
GetParamId |  Return the Id of the parameter associated with this constraint.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
 Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
 Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference
 Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter
 Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
 Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength