Revit 2027 API
DetailCurve Class
 A curve that is used to create a detail drawing. A detail curve is visible only in the view in which it is drawn.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.DetailArc
 Autodesk.Revit.DB.DetailEllipse
 Autodesk.Revit.DB.DetailLine
 Autodesk.Revit.DB.DetailNurbSpline
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DetailCurve : CurveElement
Public Class DetailCurve
	Inherits CurveElement
public ref class DetailCurve : public CurveElement
type DetailCurve =
    class
        inherit CurveElement
    end
The DetailCurve type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace