Revit 2027 API
RevitServerCollaborationNotAvailableException Class
The exception that is thrown when Collaboration fails because of an external resource (e.g., Amazon S3) failure.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerCollaborationNotAvailableException : RevitServerException
<SerializableAttribute>
Public Class RevitServerCollaborationNotAvailableException
	Inherits RevitServerException
[SerializableAttribute]
public ref class RevitServerCollaborationNotAvailableException : public RevitServerException
[<SerializableAttribute>]
type RevitServerCollaborationNotAvailableException =
    class
        inherit RevitServerException
    end
The RevitServerCollaborationNotAvailableException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace