Revit 2027 API
FilterDoubleRule Class
 A filter rule that operates on double-precision numeric values in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterDoubleRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterDoubleRule : FilterNumericValueRule
Public Class FilterDoubleRule
	Inherits FilterNumericValueRule
public ref class FilterDoubleRule : public FilterNumericValueRule
type FilterDoubleRule =
    class
        inherit FilterNumericValueRule
    end
The FilterDoubleRule type exposes the following members.
Constructors
Name | Description
FilterDoubleRule |  Constructs an instance of FilterDoubleRule.
Top
Properties
Name | Description
Epsilon |  The tolerance within which two floating-point values may be considered equal.
RuleValue |  The user-supplied value against which values from a Revit document will be tested.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace