Revit 2027 API
StructuralSectionRoundHSS Class
 Defines parameters for pipes known as Round HSS (HollowStructuralSection).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionRoundHSS : StructuralSectionGeneralR
Public Class StructuralSectionRoundHSS
	Inherits StructuralSectionGeneralR
public ref class StructuralSectionRoundHSS : public StructuralSectionGeneralR
type StructuralSectionRoundHSS =
    class
        inherit StructuralSectionGeneralR
    end
The StructuralSectionRoundHSS type exposes the following members.
Constructors
Name | Description
StructuralSectionRoundHSS |  Creates a new instance of Structural Section Round HSS shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace