Revit 2027 API
ExtendedPropertiesLinkData Class
 Represents the data needed to establish or update an ExtendedPropertiesLink. To be used as part of the result of invoking an external server in order to update or create an ExtendedPropertiesLink.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkData
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtendedPropertiesLinkData : IDisposable
Public Class ExtendedPropertiesLinkData
	Implements IDisposable
public ref class ExtendedPropertiesLinkData : IDisposable
type ExtendedPropertiesLinkData =
    class
        interface IDisposable
    end
The ExtendedPropertiesLinkData type exposes the following members.
Constructors
Name | Description
ExtendedPropertiesLinkData |  Constructs an empty object which can be used to add parameter schemas, bindings, and values.
Top
Properties
Name | Description
ContainerName |  The extended properties container name used as a custom group in the properties palette.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Region |  The region of the account that contains the parameter definitions.
Top
Methods
Name | Description
AddParameterSchemaWithBindings |  Adds a schema id to the extended properties link.
AddValues |  Adds the provided parameter values to the Revit Element identified by %elementId%.
Dispose | Releases all resources used by the ExtendedPropertiesLinkData
HasSchema |  Queries whether the schema already exists in this data.
IsValidContainerName |  Validates that the given name is valid for use as the container name of an extended properties link.
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace