Revit 2027 API
PathReinSpanSymbol Methods
The PathReinSpanSymbol type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of PathReinSpanSymbol in the project.
Top
See Also
Reference
PathReinSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace