Revit 2027 API
RebarShapeDrivenAccessor Methods
The RebarShapeDrivenAccessor type exposes the following members.
Methods
Name | Description
ComputeDrivingCurves |  Compute the driving curves.
Dispose
FlipRebar |  Flips the rebar by flipping the ends and the bar segments.
FlipRebarSet |  Flips the rebar set by changing the RebarPlane with the OutOfPlaneExtent and vice versa.
GetBarPositionTransform |  Return a transform representing the relative position of any individual bar in the set.
GetDistributionPath |  The distribution path of a rebar set.
ScaleToBox |  Move and resize the bar to fit within a specified box. The arguments are interpreted as an arbitrary rectangle in 3D with vertices: origin, origin+xVec, origin+xVec+yVec, origin+yVec. The algorithm then proceeds as follows. First the bar is given the default values of the shape parameters from the shape definition. Then, if it is possible to do so without violating the shape definition, the parameter values are scaled so that the width and height of the shape (including bar thickness) match the lengths of xVec and yVec. If there is no way to do this within the shape definition due to overconstraining, a compromise is attempted, such as scaling the whole shape until either the width or the height is correct. Finally the shape is rotated to match the coordinate system of the box. The algorithm is the same one used in one-click placement.
ScaleToBoxFor3D |  Move and resize a spiral or multiplanar instance to fit within a specified box. The arguments are interpreted as an arbitrary rectangle in 3D with vertices: origin, origin+xVec, origin+xVec+yVec, origin+yVec. One end of the rebar shape is inscribed in this rectangle following the procedure described for the ScaleToBox method. The other end is placed in the parallel plane at distance (center-to-center) given by the height argument, in the direction of (xVec x yVec). Note that spiral shapes interpret the input arguments using a different convention than multiplanar shapes. For spiral shapes, the spiral start will be placed in the rectangle defined by origin, xVec, yVec, and the end of the spiral will be placed in the parallel plane. For multiplanar shapes, the rebar is placed with its primary shape definition located in the parallel plane defined by the height argument, and its connector segments extending in the direction opposite (xVec x yVec). This method replaces ScaleToBoxForSpiral() from prior releases.
SetLayoutAsCustomSpacing |  Sets the Layout Rule property of rebar set to Custom Spacing.
SetLayoutAsFixedNumber |  Sets the Layout Rule property of rebar set to FixedNumber.
SetLayoutAsMaximumSpacing |  Sets the Layout Rule property of rebar set to MaximumSpacing
SetLayoutAsMinimumClearSpacing |  Sets the Layout Rule property of rebar set to MinimumClearSpacing
SetLayoutAsNumberWithSpacing |  Sets the Layout Rule property of rebar set to NumberWithSpacing
SetLayoutAsSingle |  Sets the Layout Rule property of rebar set to Single.
SetRebarShapeId |  Changes the RebarShape element that defines the shape of the rebar. Changing the value of this member causes the Rebar instance to choose values for its shape parameters to preserve its previous shape as closely as possible
Top
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace