Revit 2027 API
PropertySetElement Methods
The PropertySetElement type exposes the following members.
Methods
Name | Description
Create(Document, EmbodiedCarbonAsset) |  Creates a new PropertySetElement to contain the given asset.
Create(Document, StructuralAsset) |  Creates a new PropertySetElement to contain the given asset.
Create(Document, ThermalAsset) |  Creates a new PropertySetElement to contain the given asset.
Duplicate |  Creates a duplicate of this PropertySetElement.
GetEmbodiedCarbonAsset |  Gets a copy of the EmbodiedCarbonAsset.
GetStructuralAsset |  Gets a copy of the StructuralAsset.
GetThermalAsset |  Gets a copy of the ThermalAsset.
SetEmbodiedCarbonAsset |  Sets a copy of the given EmbodiedCarbonAsset to be used in the PropertySetElement.
SetStructuralAsset |  Sets a copy of the given StucturalAsset to be used in the PropertySetElement.
SetThermalAsset |  Sets a copy of the given ThermalAsset to be used in the PropertySetElement.
Top
See Also
Reference
PropertySetElement Class
Autodesk.Revit.DB Namespace