Revit 2027 API
BoundingBoxIsInsideFilter Properties
The BoundingBoxIsInsideFilter type exposes the following members.
Properties
Name | Description
Tolerance |  Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
Top
See Also
Reference
BoundingBoxIsInsideFilter Class
Autodesk.Revit.DB Namespace