Revit 2027 API
FlexPipe Properties
The FlexPipe type exposes the following members.
Properties
Name | Description
EndTangent |  Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
FlexPipeType |  The flex pipe type of this flex pipe.
FlowState | The flow state of the pipe.
Points | The points of the flex pipe.
StartTangent |  Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Top
See Also
Reference
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace