Revit 2027 API
RenderingQualitySettings Methods
The RenderingQualitySettings type exposes the following members.
Methods
Name | Description
Dispose
IsCustomQuality |  Checks if the current rendering quality is custom or not.
IsValidRenderLevel |  Validate the render level is between 1 and 40
IsValidRenderTime |  Validate the render time is between 1 and 32768.
Top
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace