Revit 2027 API
ExternalFileReference Class
 A class that contains the details of a reference to a file outside of a given document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalFileReference
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalFileReference : IDisposable
Public Class ExternalFileReference
	Implements IDisposable
public ref class ExternalFileReference : IDisposable
type ExternalFileReference =
    class
        interface IDisposable
    end
The ExternalFileReference type exposes the following members.
Properties
Name | Description
ExternalFileReferenceType |  The type of external file which this object references.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PathType |  The path type of the link (relative, absolute, or server).
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalFileReference
GetAbsolutePath |  Returns an absolute path to the referenced file, regardless of whether the PathType.Enum is relative or absolute.
GetLinkedFileStatus |  Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file.
GetPath |  Gets the path of the link, relative or absolute according to the link's settings
GetReferencingId |  Gets the ElementId corresponding to the element which this ExternalFileReference is associated with.
IsValidExternalFileReference |  Checks an ExternalFileReference to see if it is properly created.
IsValidPathTypeForExternalFileReference |  Checks whether a PathType enum value will be valid to use with this ExternalFileReference.
Top
See Also
Reference
Autodesk.Revit.DB Namespace