Revit 2027 API
NetworkCommunicationException Methods
The NetworkCommunicationException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
NetworkCommunicationException Class
Autodesk.Revit.Exceptions Namespace