Revit 2027 API
FabricWireType Properties
The FabricWireType type exposes the following members.
Properties
Name | Description
BendDiameter |  Determines the bending diameter of the wire.
WireDiameter |  Determines the diameter of the wire.
Top
See Also
Reference
FabricWireType Class
Autodesk.Revit.DB.Structure Namespace