Revit 2027 API
LossFactor Class
 This class is the base class for calculating lighting loss factor.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LossFactor
 Autodesk.Revit.DB.Lighting.AdvancedLossFactor
 Autodesk.Revit.DB.Lighting.BasicLossFactor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LossFactor : IDisposable
Public Class LossFactor
	Implements IDisposable
public ref class LossFactor : IDisposable
type LossFactor =
    class
        interface IDisposable
    end
The LossFactor type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LossFactorValue |  The calculated loss factor value
Top
Methods
Name | Description
Clone |  Creates a copy of the LossFactor derived object.
Dispose | Releases all resources used by the LossFactor
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace