Revit 2027 API
StructuralSectionGeneralLZ Class
 Defines parameters for Z Cold Formed shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralLZ : StructuralSectionColdFormed
Public Class StructuralSectionGeneralLZ
	Inherits StructuralSectionColdFormed
public ref class StructuralSectionGeneralLZ : public StructuralSectionColdFormed
type StructuralSectionGeneralLZ =
    class
        inherit StructuralSectionColdFormed
    end
The StructuralSectionGeneralLZ type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralLZ |  Creates a new instance of Z Cold Formed shape.
Top
Properties
Name | Description
BottomFlangeLength |  Bottom Flange segment length.
LipLength |  Lip segment length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace