Revit 2027 API
ViewCropRegionShapeManager Methods
The ViewCropRegionShapeManager type exposes the following members.
Methods
Name | Description
Dispose
GetAnnotationCropShape |  Gets the annotation crop box assigned to the view.
GetCropShape |  Gets the crop boundaries that are curently active.
GetSplitRegionMaximum |  Returns the proportional location of the maximum boundary of the specified split crop region.
GetSplitRegionMinimum |  Returns the proportional location of the minimum boundary of the specified split crop region.
GetSplitRegionOffset |  Returns the offset for the specified split crop region.
IsCropRegionShapeValid |  Verifies that boundary represents one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
RemoveCropRegionShape |  Removes any non-rectangular boundary of the view's crop.
RemoveSplit |  Removes any split applied to the view's crop.
RemoveSplitRegion |  Removes one region in split crop.
SetCropShape |  Sets the boundary of the view's crop to the specified shape.
SplitRegionHorizontally |  Splits horizontally one region in split crop.
SplitRegionVertically |  Splits vertically one region in split crop.
Top
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace