Revit 2027 API
ConduitSize Methods
The ConduitSize type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace