Revit 2027 API
PropertyLine Properties
The PropertyLine type exposes the following members.
Properties
Name | Description
Area |  The area of the PropertyLine element, if it is close loop, the value would be greater than 0, otherwise it will return -1.
SketchId |  Get the sketch Id of the PropertyLine element if it is sketch-based. Otherwise it will return invalidElementId.
Top
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace