Revit 2027 API
DirectContext3DHandleSettings Methods
The DirectContext3DHandleSettings type exposes the following members.
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose
GetColor |  Gets the color of the handle and the associated DirectContext3D graphics.
GetTransparency |  Gets the transparency value of the handle and the associated DirectContext3D graphics.
IsEqual |  Check if the contents of two instances of settings are equal.
SetColor |  Sets the color of the handle and the associated DirectContext3D graphics.
SetTransparency |  Sets the transparency value of the handle and the associated DirectContext3D graphics.
SetVisibility |  Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
Top
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace