Revit 2027 API
ModelCurve Properties
The ModelCurve type exposes the following members.
Properties
Name | Description
IsReferenceLine | Indicates if this curve is a reference curve.
Subcategory | The subcategory.
TrussCurveType | The truss curve type of this model curve.
Top
See Also
Reference
ModelCurve Class
Autodesk.Revit.DB Namespace