Revit 2027 API
HostObject Methods
The HostObject type exposes the following members.
Methods
Name | Description
FindInserts |  Gets the ids of the instances inserted into this host object.
Top
See Also
Reference
HostObject Class
Autodesk.Revit.DB Namespace