Revit 2027 API
LinkedResourceOpeningEventArgs Properties
The LinkedResourceOpeningEventArgs type exposes the following members.
Properties
Name | Description
LinkedResourcePathName |  Path of the linked resource.
ResourceType |  The desired linked resource type.
Top
See Also
Reference
LinkedResourceOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace