Revit 2027 API
AreaTagFilter Class
 A filter used to match area tags.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.AreaTagFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaTagFilter : ElementSlowFilter
Public Class AreaTagFilter
	Inherits ElementSlowFilter
public ref class AreaTagFilter : public ElementSlowFilter
type AreaTagFilter =
    class
        inherit ElementSlowFilter
    end
The AreaTagFilter type exposes the following members.
Constructors
Name | Description
AreaTagFilter |  Constructs a filter which matches only areas.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB Namespace