Revit 2027 API
HostedSweep Properties
The HostedSweep type exposes the following members.
Properties
Name | Description
Angle | Retrieve/set the angle of the hosted sweep object relative its references (Unit : Radian).
HorizontalFlipped | Retrieve the horizontal flip status of the hosted sweep object.
HorizontalOffset | Retrieve/set the horizontal offset of the hosted sweep object.
Length | Retrieve the length of the hosted sweep object.
ReferenceCurve | The curve on which the hosted sweep segment is created.
VerticalFlipped | Retrieve the vertical flip status of the hosted sweep object.
VerticalOffset | Retrieve/set the vertical offset of the hosted sweep object.
Top
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace