Revit 2027 API
ModelCurve Methods
The ModelCurve type exposes the following members.
Methods
Name | Description
ChangeToReferenceLine | Changes this curve to a reference curve.
GetVisibility | Gets the visibility for the model curve in a family document.
SetVisibility | Sets the visibility for the model curve in a family document.
Top
See Also
Reference
ModelCurve Class
Autodesk.Revit.DB Namespace