Revit 2027 API
ExportLayerTableIterator Class
 An iterator to a set of Layer table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLayerTableIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLayerTableIterator : IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
Public Class ExportLayerTableIterator
	Implements IEnumerator(Of KeyValuePair(Of ExportLayerKey, ExportLayerInfo))
public ref class ExportLayerTableIterator : IEnumerator<KeyValuePair<ExportLayerKey^, ExportLayerInfo^>>
type ExportLayerTableIterator =
    class
        interface IEnumerator<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
    end
The ExportLayerTableIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLayerTableIterator
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace