Revit 2027 API
FamilySizeTableColumn Class
 Contains column information for a FamilySizeTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilySizeTableColumn
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilySizeTableColumn : IDisposable
Public Class FamilySizeTableColumn
	Implements IDisposable
public ref class FamilySizeTableColumn : IDisposable
type FamilySizeTableColumn =
    class
        interface IDisposable
    end
The FamilySizeTableColumn type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The column name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FamilySizeTableColumn
GetSpecTypeId |  Gets the identifier of the spec describing values in the column.
GetUnitTypeId |  Gets the identifier of the unit quantifying values in the column.
Top
See Also
Reference
Autodesk.Revit.DB Namespace