Revit 2027 API
FormArray Class
An array that contains form objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FormArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FormArray : APIObject, IEnumerable
Public Class FormArray
	Inherits APIObject
	Implements IEnumerable
public ref class FormArray : public APIObject,
	IEnumerable
type FormArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The FormArray type exposes the following members.
Constructors
Name | Description
FormArray | Initializes a new instance of the FormArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a form at a specified index within the array.
Size | Returns the number of forms that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every form from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace