Revit 2027 API
StructuralSectionRoundBar Class
 Defines parameters for Round Bar structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionRoundBar : StructuralSectionGeneralS
Public Class StructuralSectionRoundBar
	Inherits StructuralSectionGeneralS
public ref class StructuralSectionRoundBar : public StructuralSectionGeneralS
type StructuralSectionRoundBar =
    class
        inherit StructuralSectionGeneralS
    end
The StructuralSectionRoundBar type exposes the following members.
Constructors
Name | Description
StructuralSectionRoundBar |  Creates a new instance of Structural Section Round Bar shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace