Revit 2027 API
InvalidObjectException Methods
The InvalidObjectException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
InvalidObjectException Class
Autodesk.Revit.Exceptions Namespace