Revit 2027 API
IntersectingElementData Class
 Stores information of an element that intersects with another element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IntersectingElementData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IntersectingElementData : IDisposable
Public Class IntersectingElementData
	Implements IDisposable
public ref class IntersectingElementData : IDisposable
type IntersectingElementData =
    class
        interface IDisposable
    end
The IntersectingElementData type exposes the following members.
Properties
Name | Description
IntersectedElementId |  Id of the intersected element.
IntersectingElementId |  Id of the intersecting element.
IntersectionType |  The intersection type.
IntersectionVolume |  The intersection volume.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IntersectingElementData
Top
See Also
Reference
Autodesk.Revit.DB Namespace