Revit 2027 API
DuctFittingAndAccessoryConnectorData Methods
The DuctFittingAndAccessoryConnectorData type exposes the following members.
Methods
Name | Description
Dispose
GetCoordination |  Gets the coordination of the connector
Top
See Also
Reference
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace