Revit 2027 API
ProjectPosition Class
 ProjectPosition is a class used to represent a geographical offset and rotation. It can be used to represent the position of a project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ProjectPosition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ProjectPosition : IDisposable
Public Class ProjectPosition
	Implements IDisposable
public ref class ProjectPosition : IDisposable
type ProjectPosition =
    class
        interface IDisposable
    end
The ProjectPosition type exposes the following members.
Constructors
Name | Description
ProjectPosition(ProjectPosition) |  Creates a copy of the ProjectPosition.
ProjectPosition(Double, Double, Double, Double) |  Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation.
Top
Properties
Name | Description
Angle |  Angle from True North.
EastWest |  East/West offset.
Elevation |  Elevation above ground level.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NorthSouth |  North/South offset
Top
Methods
Name | Description
Dispose | Releases all resources used by the ProjectPosition
Top
See Also
Reference
Autodesk.Revit.DB Namespace