Revit 2027 API
DuctSizeIterator Class
 An iterator to a set of MEP duct sizes from DuctSizes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctSizeIterator
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctSizeIterator : IEnumerator<MEPSize>
Public Class DuctSizeIterator
	Implements IEnumerator(Of MEPSize)
public ref class DuctSizeIterator : IEnumerator<MEPSize^>
type DuctSizeIterator =
    class
        interface IEnumerator<MEPSize>
    end
The DuctSizeIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctSizeIterator
GetCurrent |  Returns the current MEPSize.
HasCurrent |  Identifies if the iterator has a current item.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace