Revit 2027 API
FamilySymbolFilter Class
 A filter used to find all family symbols of the given family.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.FamilySymbolFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilySymbolFilter : ElementQuickFilter
Public Class FamilySymbolFilter
	Inherits ElementQuickFilter
public ref class FamilySymbolFilter : public ElementQuickFilter
type FamilySymbolFilter =
    class
        inherit ElementQuickFilter
    end
The FamilySymbolFilter type exposes the following members.
Constructors
Name | Description
FamilySymbolFilter |  Constructs a new instance of a filter to find all family symbols of the given family.
Top
Properties
Name | Description
FamilyId |  The family id.
Top
Methods
Name | Description
Top
Remarks
This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
Note that it may be faster to get a list of symbol ids from GetFamilySymbolIds() rather than to iterate all of the contents of a document with this filter applied.
See Also
Reference
Autodesk.Revit.DB Namespace