Revit 2027 API
StdPostedWarning Methods
The StdPostedWarning type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
StdPostedWarning Class
Autodesk.Revit.DB Namespace