Revit 2027 API
RoomTagFilter Class
 A filter used to match room tags.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Architecture.RoomTagFilter
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoomTagFilter : ElementSlowFilter
Public Class RoomTagFilter
	Inherits ElementSlowFilter
public ref class RoomTagFilter : public ElementSlowFilter
type RoomTagFilter =
    class
        inherit ElementSlowFilter
    end
The RoomTagFilter type exposes the following members.
Constructors
Name | Description
RoomTagFilter |  Constructs a filter which matches only rooms.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace