Revit 2027 API
RebarCoverType Properties
The RebarCoverType type exposes the following members.
Properties
Name | Description
CoverDistance |  A distance that can be used as a concrete cover value in a document.
Top
See Also
Reference
RebarCoverType Class
Autodesk.Revit.DB.Structure Namespace