Revit 2027 API
AnalyticalNodeData Class
 This class holds information related to analytical model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.AnalyticalNodeData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalNodeData : IDisposable
Public Class AnalyticalNodeData
	Implements IDisposable
public ref class AnalyticalNodeData : IDisposable
type AnalyticalNodeData =
    class
        interface IDisposable
    end
The AnalyticalNodeData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalyticalNodeData
GetAnalyticalNodeData |  Returns AnalyticalNodeData associated with this element, if it exists.
GetConnectionStatus |  Returns the Connection Status for this Analytical Node.
Top
Remarks
 This class is attached to a ReferencePoint.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace