Revit 2027 API
ApplicationClosingEventArgs Class
 The event arguments used by the ApplicationClosing event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.ApplicationClosingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ApplicationClosingEventArgs : RevitAPIPreEventArgs
Public Class ApplicationClosingEventArgs
	Inherits RevitAPIPreEventArgs
public ref class ApplicationClosingEventArgs : public RevitAPIPreEventArgs
type ApplicationClosingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The ApplicationClosingEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace