Revit 2027 API
ConnectionInputPoint Methods
The ConnectionInputPoint type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace