Revit 2027 API
Transform1D Methods
The Transform1D type exposes the following members.
Methods
Name | Description
AlmostEqual |  Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Assign |  Assigns values from the input transformation to this transformation.
Dispose
GetInverse |  Gets the inverse transformation of this transformation.
Multiply |  Multiplies this transformation by the specified transformation and returns the result.
OfPoint |  Applies the transformation to the 1-dimensional point and returns the result.
OfVector |  Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result.
SetToIdentity |  Set this TrfUV to the identity transform
TransformParameterDomain |  Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.
Top
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace