Revit 2027 API
HostObjectSubcomponentInfo Methods
The HostObjectSubcomponentInfo type exposes the following members.
Methods
Name | Description
Dispose
GetCurveLoop |  Gets the CurveLoop representing the base profile curve loop of the roof or floor slab
GetPlane |  Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.
Top
See Also
Reference
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace