Revit 2027 API
ContinuousRail Class
 Represents a continuous rail element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.ContinuousRail
 Autodesk.Revit.DB.Architecture.HandRail
 Autodesk.Revit.DB.Architecture.TopRail
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ContinuousRail : Element
Public Class ContinuousRail
	Inherits Element
public ref class ContinuousRail : public Element
type ContinuousRail =
    class
        inherit Element
    end
The ContinuousRail type exposes the following members.
Properties
Name | Description
HostRailingId |  The id of the host Railing that contains this rail.
Length |  The length of the rail.
Top
Methods
Name | Description
GetEndExtensionPath |  Retrieves the start extension path.
GetPath |  Retrieves the rail path.
GetStartExtensionPath |  Retrieves the start extension path.
GetSupports |  Returns all the railing supports attached to the rail.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace