Revit 2027 API
FabricationConnectorInfo Methods
The FabricationConnectorInfo type exposes the following members.
Methods
Name | Description
Dispose
HasDoubleWallConnector |  Checks if there are any double wall connectors fabricated.
IsValid |  Checks if the connector has fabrication parameters associated with it that can be set.
Top
See Also
Reference
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace