Revit 2027 API
StructuralSectionGeneralU Properties
The StructuralSectionGeneralU type exposes the following members.
Properties
Name | Description
FlangeFillet |  Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet |  Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle |  Sloped flange angle. (rad)
WebToeOfFillet |  Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Top
See Also
Reference
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace