Revit 2027 API
StructuralSectionIParallelFlange Class
 Defines parameters for I-shape Parallel Flange structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionIParallelFlange : StructuralSectionGeneralI
Public Class StructuralSectionIParallelFlange
	Inherits StructuralSectionGeneralI
public ref class StructuralSectionIParallelFlange : public StructuralSectionGeneralI
type StructuralSectionIParallelFlange =
    class
        inherit StructuralSectionGeneralI
    end
The StructuralSectionIParallelFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionIParallelFlange |  Creates a new instance of Structural Section I Parallel Flange shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace