Revit 2027 API
PipeFittingAndAccessoryData Methods
The PipeFittingAndAccessoryData type exposes the following members.
Methods
Name | Description
Dispose
GetAllConnectorData |  Gets the connector data of the pipe fitting or pipe accessory.
GetEntity |  Returns an Entity of the Schema of the serverGUID.
GetFamilyInstanceId |  Gets the Id of the fiting or accessory instance
Top
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace