Revit 2027 API
TopographyEditScope Class
 A TopographyEditScope allows an application to create and maintain an editing session for a TopographySurface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EditScope
 Autodesk.Revit.DB.Architecture.TopographyEditScope
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TopographyEditScope : EditScope
Public Class TopographyEditScope
	Inherits EditScope
public ref class TopographyEditScope : public EditScope
type TopographyEditScope =
    class
        inherit EditScope
    end
The TopographyEditScope type exposes the following members.
Constructors
Name | Description
TopographyEditScope |  Instantiates a TopographyEditScope object.
Top
Properties
Name | Description
Top
Methods
Name | Description
Start |  Starts a topography surface edit mode for an existing TopographySurface element.
Top
Remarks
 Start/end of a TopographyEditScope will start/end a transaction group. After a TopographyEditScope is started, an application can start transactions and edit the topography surface. Individual transactions the application creates inside TopographyEditScope will not appear in the undo menu. All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into TopographyEditScope constructor.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace