Revit 2027 API
ToposolidType Methods
The ToposolidType type exposes the following members.
Methods
Name | Description
GetContourSetting |  Get the contour setting object from the current toposolid type.
SetContourSettting |  Set the contour setting for the current toposolid type by copying from an existing contour setting object.
Top
See Also
Reference
ToposolidType Class
Autodesk.Revit.DB Namespace