Revit 2027 API
AnnotationSymbol Properties
The AnnotationSymbol type exposes the following members.
Properties
Name | Description
AnnotationSymbolType |  The AnnotationSymbol style of this AnnotationSymbol.
Top
See Also
Reference
AnnotationSymbol Class
Autodesk.Revit.DB Namespace