Revit 2027 API
HermiteSpline Properties
The HermiteSpline type exposes the following members.
Properties
Name | Description
ControlPoints | The control points of the Hermite spline.
IsPeriodic | Returns whether the Hermite spline is periodic or not.
Parameters | Returns the params of the Hermite spline.
Tangents | Returns the tangents of the Hermite spline.
Top
See Also
Reference
HermiteSpline Class
Autodesk.Revit.DB Namespace