Revit 2027 API
DockablePaneProviderData Class
 Information about a new dockable pane being added to the Revit user interface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.DockablePaneProviderData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DockablePaneProviderData
Public Class DockablePaneProviderData
public ref class DockablePaneProviderData
type DockablePaneProviderData = class end
The DockablePaneProviderData type exposes the following members.
Constructors
Name | Description
DockablePaneProviderData | Initializes a new instance of the DockablePaneProviderData class
Top
Properties
Name | Description
ContextualHelp |  The contextual help associated with the pane.
EditorInteraction |  Defines the interaction this pane has with the Active Editor when the pane becomes active.
FrameworkElement |  The Windows Presentation Framework object containing the pane's user interface.
FrameworkElementCreator |  A creator that will be called for the pane if the FrameworkElement is not set.
InitialState |  The initial position of the docking pane.
VisibleByDefault |  Controls the default visibility of the pane upon the first time the pane/plugin is loaded into Revit.
Top
Methods
Name | Description
GetFrameworkElement |  Wrapper function that returns the FrameworkElement for this provider.
Top
See Also
Reference
Autodesk.Revit.UI Namespace