Revit 2027 API
MEPCalculationServerInfo Class
 a struct to hold the information about a MEP calucation servers
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPCalculationServerInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPCalculationServerInfo : IDisposable
Public Class MEPCalculationServerInfo
	Implements IDisposable
public ref class MEPCalculationServerInfo : IDisposable
type MEPCalculationServerInfo =
    class
        interface IDisposable
    end
The MEPCalculationServerInfo type exposes the following members.
Constructors
Name | Description
MEPCalculationServerInfo() |  Constructs a new MEPCalculationServerInfo with default settings.
MEPCalculationServerInfo(IExternalServer) |  Create a new MEPCalculationServerInfo by an external server.
MEPCalculationServerInfo(MEPCalculationServerInfo) |  Constructs a new copy of the input MEPCalculationServerInfo object.
Top
Properties
Name | Description
Description |  The Description of the server.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PipeUseDefinitionOnTypeGUID |  The guid value ("3BF616F9-6B98-4A21-80FF-DA1120C8F6D6") of Use Definition On Type. It is not a server id, but a guid to tell if the loss method is "Use Definition On Type" or not. If the loss method is "Use Definition On Type", we use the loss method of the family type to calculate.
ServerId |  The Id of the server.
ServerName |  The Name of the server.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPCalculationServerInfo
GetMEPCalculationServerInfo |  Gets a MEPCalculationServerInfo by family instance.
Top
See Also
Reference
Autodesk.Revit.DB Namespace