Revit 2027 API
RevitAPIEventArgs Methods
The RevitAPIEventArgs type exposes the following members.
Methods
Name | Description
Dispose
IsCancelled |  Indicates whether the event is being cancelled.
Top
See Also
Reference
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace