Revit 2027 API
StructuralElementDefinitionData Methods
The StructuralElementDefinitionData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace