Revit 2027 API
FabricationPartType Class
 Represents a fabrication component type in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.FabricationPartType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationPartType : ElementType
Public Class FabricationPartType
	Inherits ElementType
public ref class FabricationPartType : public ElementType
type FabricationPartType =
    class
        inherit ElementType
    end
The FabricationPartType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a fabrication part type element based on a specific fabrication servic button and condition.
Lookup |  Looks up an existing fabrication part type based on a specfic fabrication service button and condition.
ResetAssemblyTypes |  Resets the assembly types of all assembly instances with one or more FabricationPart element. The document where the assemblies with FabricationPart will be reset.
Top
Remarks
 For the product-based MAP parts, every size is a new part type in Revit. For others, one part type can have many sizes.
See Also
Reference
Autodesk.Revit.DB Namespace