Revit 2027 API
WorksharingDisplayGraphicSettings Methods
The WorksharingDisplayGraphicSettings type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
WorksharingDisplayGraphicSettings Class
Autodesk.Revit.DB Namespace