Revit 2027 API
ViewDisplayBackground Methods
The ViewDisplayBackground type exposes the following members.
Methods
Name | Description
CreateGradient |  Creates an object that can be passed to View.SetBackground method to set the background of the Gradient type.
CreateImage |  Creates an object that can be passed to View.SetBackground method to set the background of the Image type.
CreateSky |  Creates an object that can be passed to View.SetBackground method to set the background of the SunAndClouds type.
Dispose
Top
See Also
Reference
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace