Revit 2027 API
FilteredElementCollector Class
 This class is used to search, filter and iterate through a set of elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredElementCollector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilteredElementCollector : IEnumerable<Element>,
	IDisposable
Public Class FilteredElementCollector
	Implements IEnumerable(Of Element), IDisposable
public ref class FilteredElementCollector : IEnumerable<Element^>,
	IDisposable
type FilteredElementCollector =
    class
        interface IEnumerable<Element>
        interface IDisposable
    end
The FilteredElementCollector type exposes the following members.
Constructors
Name | Description
FilteredElementCollector(Document) |  Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.
FilteredElementCollector(Document, ElementId) |  Constructs a new FilteredElementCollector that will search and filter the visible elements in a view.
FilteredElementCollector(Document, ICollection<ElementId>) |  Constructs a new FilteredElementCollector that will search and filter a specified set of elements.
FilteredElementCollector(Document, ElementId, ElementId) |  Constructs a new FilteredElementCollector that will search and filter the visible elements from a Revit link in a host document view.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
ContainedInDesignOption |  Applies an ElementDesignOptionFilter to the collector.
Dispose | Releases all resources used by the FilteredElementCollector
Excluding |  Applies an ExclusionFilter to the collector.
FirstElement |  Returns the first element to pass the filter(s).
FirstElementId |  Returns the id of the first element to pass the filter(s).
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetElementCount |  Gets the number of elements in your current filter.
GetElementIdIterator |  Returns an element id iterator to the elements passing the filters.
GetElementIterator |  Returns an element iterator to the elements passing the filters.
GetEnumerator | Returns an enumerator that iterates through a collection.
IntersectWith |  Intersects the set of elements passing the filter in this collector with the set of elements passing the filter in another collector.
IsViewValidForElementIteration |  Identifies if the particular element is valid for iteration of drawn elements.
OfCategory |  Applies an ElementCategoryFilter to the collector.
OfCategoryId |  Applies an ElementCategoryFilter to the collector.
OfClass |  Applies an ElementClassFilter to the collector.
OwnedByView |  Applies an ElementOwnerViewFilter to the collector.
ToElementIds |  Returns the complete set of element ids that pass the filter(s).
ToElements |  Returns the complete set of elements that pass the filter(s).
UnionWith |  Unites the set of elements passing the filter in this collector with the set of elements passing the filter in another collector.
WhereElementIsCurveDriven |  Applies an ElementIsCurveDrivenFilter to the collector.
WhereElementIsElementType |  Applies an ElementIsElementTypeFilter to the collector.
WhereElementIsNotElementType |  Applies an inverted ElementIsElementTypeFilter to the collector.
WhereElementIsViewIndependent |  Applies an ElementOwnerViewFilter to the collector.
WherePasses |  Applies an element filter to the collector.
Top
Remarks
Developers can assign a variety of conditions to filter the elements that are returned. This class requires that at least one condition be set before making the attempt to access the elements.
Revit will attempt to organize the filters in order to minimize expansion of elements regardless of the order in which conditions and filters are applied.
There are three groups of methods that you can use on a given collector once you have applied filter(s) to it. One group provides collections of all passing elements, a second finds the first match of the given filter(s), and a third provides an iterator that is evaluated lazily (each element is tested by the filter only when the iterator reaches it). You should only use one of the methods from these group at a time; the collector will reset if you call another method to extract elements. Thus, if you have previously obtained an iterator, it will be stopped and traverse no more elements if you call another method to extract elements.
In .NET, this class supports the IEnumerable interface for Elements. You can use this class with LINQ queries and operations to process lists of elements. Note that because the ElementFilters and the shortcut methods offered by this class process elements in native code before their managed wrappers are generated, better performance will be obtained by using as many native filters as possible on the collector before attempting to process the results using LINQ queries.
One special consideration when using this class in .NET: the debugger will attempt to traverse the members of the collector because of its implementation of IEnumerable. You may see strange results if you also attempt to extract the first element or all elements from the collector while the debugger is also looking at the contents of the collector.
See Also
Reference
Autodesk.Revit.DB Namespace