Revit 2027 API
MEPFamilyConnectorInfo Methods
The MEPFamilyConnectorInfo type exposes the following members.
Methods
Name | Description
GetAssociateFamilyParameterId |  Gets the associate family parameter id of the specified connector parameter id.
GetConnectorParameterValue |  Gets the parameter value of the specified connector parameter id.
Top
See Also
Reference
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace