Revit 2027 API
InvalidDataStreamException Methods
The InvalidDataStreamException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
InvalidDataStreamException Class
Autodesk.Revit.Exceptions Namespace