Revit 2027 API
ExportLineweightTable Methods
The ExportLineweightTable type exposes the following members.
Methods
Name | Description
Add |  Inserts a (key, info) pair into Export line weight table.
Clear |  Removes all contents stored in Export line weight table.
ContainsKey |  Checks whether a line weight key exists in the table.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetExportLineweightInfo |  Gets a copy of the ExportLineweightInfo corresponding to the given ExportLineweightKey.
GetKeys |  Gets all the keys stored in the map.
GetLineweightTableIterator | Returns a ExportLineweightTableIterator that iterates through the collection.
GetValues |  Returns all the values stored in the map.
Remove |  Removes the pair (key, info) corresponding to the given ExportLineweightKey.
Top
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace