Revit 2027 API
WireConduitTypeSet Methods
The WireConduitTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every conduit type from the set, rendering it empty.
Contains | Tests for the existence of a conduit type within the set.
Erase | Removes a specified conduit type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified conduit type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace