Revit 2027 API
StructuralWallUsageFilter Properties
The StructuralWallUsageFilter type exposes the following members.
Properties
Name | Description
StructuralWallUsage |  The wall structural usage.
Top
See Also
Reference
StructuralWallUsageFilter Class
Autodesk.Revit.DB.Structure Namespace