Revit 2027 API
MEPNetworkSegmentData Class
 Represents the analysis data for one network segment.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPNetworkSegmentData : IDisposable
Public Class MEPNetworkSegmentData
	Implements IDisposable
public ref class MEPNetworkSegmentData : IDisposable
type MEPNetworkSegmentData =
    class
        interface IDisposable
    end
The MEPNetworkSegmentData type exposes the following members.
Constructors
Name | Description
MEPNetworkSegmentData() |  Creates a default segment data object.
MEPNetworkSegmentData(MEPNetworkSegmentData) |  Creates a new segment data object based on another object.
Top
Properties
Name | Description
Coefficient |  The calculated coefficient of this segment, dimensionless.
Flow |  The calculated flow of this segment, in ft^3/s. The positive value means the flow is from the start to the end node, the negative value means opposite direction.
FlowState |  The calculated flow state of this segment.
FrictionFactor |  The calculated friction factor of this segment, dimensionless.
IsCriticalPath |  Verifies if the segment is on the critical path.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PressureDrop |  The calculated pressure drop of this segment, in kg/(ft*s^2).
RelativeRoughness |  The relative roughness of this segment, dimensionless.
ReynoldsNumber |  The Reynolds number of this segment, dimensionless.
SectionNumber |  The section this segment belongs to.
Velocity |  The calculated velocity of this segment, in ft/s.
VelocityPressure |  The calculated velocity pressure of this segment, in kg/(ft*s^2).
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPNetworkSegmentData
GetDownstreamSegments |  Gets all downstream network segments.
GetUpstreamSegments |  Gets all upstream network segments.
IsValid |  Verified if this segment data has been assigned some valid values afer calculation.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace