Revit 2027 API
LinkOperations Methods
The LinkOperations type exposes the following members.
Methods
Name | Description
Dispose
SetOnLocalLinkSharedCoordinatesSavedCallback |  Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
Top
See Also
Reference
LinkOperations Class
Autodesk.Revit.DB Namespace