Revit 2027 API
RebarFreeFormCreationResult Class
 Class that encapsulates the result of the rebar free form creation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarFreeFormCreationResult
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarFreeFormCreationResult : IDisposable
Public Class RebarFreeFormCreationResult
	Implements IDisposable
public ref class RebarFreeFormCreationResult : IDisposable
type RebarFreeFormCreationResult =
    class
        interface IDisposable
    end
The RebarFreeFormCreationResult type exposes the following members.
Properties
Name | Description
Error |  Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Rebar |  Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a null Rebar.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarFreeFormCreationResult
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace