Revit 2027 API
TransactionAttribute Properties
The TransactionAttribute type exposes the following members.
Properties
Name | Description
Mode | Transaction mode.
Top
See Also
Reference
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace