Revit 2027 API
Part Properties
The Part type exposes the following members.
Properties
Name | Description
Excluded |  True if the part is excluded, false otherwise
OriginalCategoryId |  The category Id of the original element corresponding to this Part.
PartMaker |  The PartMaker that created this Part.
Top
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace