Revit 2027 API
CableTraySettings Properties
The CableTraySettings type exposes the following members.
Properties
Name | Description
ConnectorSeparator |  The cable tray connector separator string.
FittingAnnotationSize |  The value of fitting annotation size.
RiseDropAnnotationSize |  The rise drop annotation size.
SizeSeparator |  The cable tray size separator string.
SizeSuffix |  The cable tray size suffix string.
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
Top
See Also
Reference
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace