Revit 2027 API
ContourSetting Class
 Contour setting object that handles the contour information used to draw contours on elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ContourSetting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ContourSetting : IDisposable
Public Class ContourSetting
	Implements IDisposable
public ref class ContourSetting : IDisposable
type ContourSetting =
    class
        interface IDisposable
    end
The ContourSetting type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddContourRange |  Add a set of contours as a contour setting item to the current contour setting.
AddSingleContour |  Add a single contour as a contour setting item to the current contour setting.
DisableItem |  Disable a contour setting item of the current contour setting so that the item will not be used to draw contours.
Dispose | Releases all resources used by the ContourSetting
EnableItem |  Enable a contour setting item of the current contour setting so that the item will be used to draw contours.
GetContourSettingItems |  Get all contour setting items.
GetItemIndex |  Get the index of a contour setting item of the current contour setting
IsItemEnabled |  Check if a ContourSettingItem is enabled
RemoveItem |  Remove a contour setting item from the current contour setting.
Top
See Also
Reference
Autodesk.Revit.DB Namespace