Revit 2027 API
PrimarySizeCriterion Methods
The PrimarySizeCriterion type exposes the following members.
Methods
Name | Description
All |  Creates a criterion with a range of all sizes.
None |  Creates a criterion with a range of no sizes.
Top
See Also
Reference
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace