Revit 2027 API
AssetPropertyList Methods
The AssetPropertyList type exposes the following members.
Methods
Name | Description
AddNewAssetAsColor |  Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color.
AddNewAssetPropertyDouble |  Adds a new AssetPropertyDouble containing the input value to this list.
AddNewAssetPropertyInteger |  Adds a new AssetPropertyInteger containing the input value to this list.
GetValue |  Gets a collection of properties stored in this property list. These properties are copied.
InsertNewAssetAsColor |  Insert a new AssetPropertyDouble4 containing the input value to this list.
InsertNewAssetPropertyDouble |  Inserts a new AssetPropertyDouble containing the input value to this list.
InsertNewAssetPropertyInteger |  Insert a new AssetPropertyInteger containing the input value to this list.
IsValidValue |  Check that value is valid.
RemoveAssetProperty |  Remove the AssetProperty from the list.
SetValue |  Sets collection of properties stored in this property list.
Top
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace