Revit 2027 API
CurtainSystem Properties
The CurtainSystem type exposes the following members.
Properties
Name | Description
CurtainGrids | Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face.
CurtainSystemType | get or set the type of the CurtainSystem.
Top
See Also
Reference
CurtainSystem Class
Autodesk.Revit.DB Namespace