Revit 2027 API
Rectangle Methods
The Rectangle type exposes the following members.
Methods
Name | Description
Dispose
IsNormalized |  Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom.
Top
See Also
Reference
Rectangle Class
Autodesk.Revit.DB Namespace