Revit 2027 API
OrdinateDimensionSetting Methods
The OrdinateDimensionSetting type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace