Revit 2027 API
IPipeFittingAndAccessoryPressureDropServer Interface
 Interface class for external servers implementing pipe fitting and pipe accessory coefficient calculation.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IPipeFittingAndAccessoryPressureDropServer : IExternalServer
Public Interface IPipeFittingAndAccessoryPressureDropServer
	Inherits IExternalServer
public interface class IPipeFittingAndAccessoryPressureDropServer : IExternalServer
type IPipeFittingAndAccessoryPressureDropServer =
    interface
        interface IExternalServer
    end
The IPipeFittingAndAccessoryPressureDropServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the pipe fitting and pipe accessory coefficient.
GetDataSchema |  Obtains the schema of the ESEntity.
IsApplicable |  Check if the server is applicable for the pipe fitting or pipe accessory.
Top
Remarks
 A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service, see ExternalServiceRegistry.
Assign server to pipe fitting instance.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace