Revit 2027 API
FreeFormElement Class
 A Free Form Element that contains non-parametric geometry created from an input solid outline.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.FreeFormElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FreeFormElement : GenericForm
Public Class FreeFormElement
	Inherits GenericForm
public ref class FreeFormElement : public GenericForm
type FreeFormElement =
    class
        inherit GenericForm
    end
The FreeFormElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CanOffsetFace |  Determines if the input face of the FreeFormElement can be offset.
Create |  Creates a new FreeFormElement from a copy of the input geometry.
SetFaceOffset |  Offsets a planar face of the free form element a certain distance in the normal direction.
UpdateSolidGeometry |  Updates the geometry of the FreeForm element to the given shape preserving References to the existing geometry where possible (see remarks for rules).
Top
Remarks
 The element can participate in joins and void cuts with other combinable elements.
See Also
Reference
Autodesk.Revit.DB Namespace