Revit 2027 API
FamilyType Methods
The FamilyType type exposes the following members.
Methods
Name | Description
AsDouble | Provides access to the double precision number of the given family parameter.
AsElementId | Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter.
AsInteger | Provides access to the integer number of the given family parameter.
AsString | Provides access to the string contents of the given family parameter.
AsValueString | Provides access to value as a string with unit in the given family parameter.
HasValue | Indicates if this family parameter has an assigned value or not.
Top
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace