Revit 2027 API
CurveLoopIterator Class
 An iterator to a curve loop.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CurveLoopIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveLoopIterator : IEnumerator<Curve>
Public Class CurveLoopIterator
	Implements IEnumerator(Of Curve)
public ref class CurveLoopIterator : IEnumerator<Curve^>
type CurveLoopIterator =
    class
        interface IEnumerator<Curve>
    end
The CurveLoopIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CurveLoopIterator
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace