Revit 2027 API
AreaReinforcementCurve Class
An object that specifies the type of a floor in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.Structure.AreaReinforcementCurve
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaReinforcementCurve : CurveElement
Public Class AreaReinforcementCurve
	Inherits CurveElement
public ref class AreaReinforcementCurve : public CurveElement
type AreaReinforcementCurve =
    class
        inherit CurveElement
    end
The AreaReinforcementCurve type exposes the following members.
Properties
Name | Description
Curve | Returns the 3D curve forming part of the boundary of an Area Reinforcement element.
Top
Methods
Name | Description
Top
Remarks
The structural layers of the floor can be accessed via this object.
Example
public void GetInfo_AreaReinforcementCurve(AreaReinforcement areaReinforcement)
{
    string message = "Area Reinforcement Curves : ";
    // Get area reinforcement curves by iterating the Curves property
    IList<ElementId> curveIds = areaReinforcement.GetBoundaryCurveIds();
    foreach (ElementId ii in curveIds)
    {
        AreaReinforcementCurve areaReinforcementCurve = doc.GetElement(ii) as AreaReinforcementCurve;
        if (null == areaReinforcementCurve)
        {
            continue;
        }
        Autodesk.Revit.DB.Curve curve = areaReinforcementCurve.Curve;
        // Get curve start point
        message += "\nCurve start point:(" + curve.GetEndPoint(0).X + ", "
                       + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
        // Get curve end point
        message += "\nCurve end point:(" + curve.GetEndPoint(1).X + ", "
                       + curve.GetEndPoint(1).Y + ", " + curve.GetEndPoint(1).Z + ")";
    }
    TaskDialog.Show("Revit", message);
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace