Revit 2027 API
ExternallyTaggedBRep Methods
The ExternallyTaggedBRep type exposes the following members.
Methods
Name | Description
GetTaggedGeometry |  Returns the externally tagged geometry object.
Top
See Also
Reference
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace