Revit 2027 API
AreaBasedLoadType Class
 This class represents an area based load type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.AreaBasedLoadType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaBasedLoadType : Element
Public Class AreaBasedLoadType
	Inherits Element
public ref class AreaBasedLoadType : public Element
type AreaBasedLoadType =
    class
        inherit Element
    end
The AreaBasedLoadType type exposes the following members.
Properties
Name | Description
ApparentPowerDensity |  The apparent power density of area based load type.
LoadClassification |  The load classification of area based load type.
LoadDensity |  The load density of area based load type.
PowerFactor |  The power factor of area based load type.
PowerFactorState |  The power factor state of the area based load type.
Top
Methods
Name | Description
Create |  Creates an area based load type.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace