Revit 2027 API
StructuralConnectionSettings Methods
The StructuralConnectionSettings type exposes the following members.
Methods
Name | Description
GetStructuralConnectionSettings |  Obtains the StructuralConnectionSettings object for the specified project document.
Top
See Also
Reference
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace