Revit 2027 API
FilterDialog Methods
The FilterDialog type exposes the following members.
Methods
Name | Description
Dispose
Show |  Shows the FilterDialog editing dialog to the user.
Top
See Also
Reference
FilterDialog Class
Autodesk.Revit.UI Namespace