Revit 2027 API
ExclusionFilter Class
 A filter used to exclude a set of elements automatically.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ExclusionFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExclusionFilter : ElementQuickFilter
Public Class ExclusionFilter
	Inherits ElementQuickFilter
public ref class ExclusionFilter : public ElementQuickFilter
type ExclusionFilter =
    class
        inherit ElementQuickFilter
    end
The ExclusionFilter type exposes the following members.
Constructors
Name | Description
ExclusionFilter |  Constructs a new instance of a filter to exclude elements automatically.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetIdsToExclude |  Returns the ids to be excluded by this filter.
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
Example
// Use Exclusion filter to find exclude a set of elements in the document automatically
// Find all walls that are not currently selected,
// Get all element ids which are current selected by users, exclude these ids when filtering
ICollection<ElementId> selectedIds = uiDocument.Selection.GetElementIds();
// Use the selection to instantiate an exclusion filter
ExclusionFilter filter = new ExclusionFilter(selectedIds);
// For the sake of simplicity we do not test here whether the selection is empty or not,
// but in production code a proper validation would have to be done to avoid an argument
// exception from the filter's consructor.
// Apply the filter to the elements in the active document,
// Use shortcut method OfClass() to find Walls only
FilteredElementCollector collector = new FilteredElementCollector(uiDocument.Document);
IList<Element> walls = collector.WherePasses(filter).OfClass(typeof(Wall)).ToElements();
See Also
Reference
Autodesk.Revit.DB Namespace