Revit 2027 API
WaterLoopData Class
 Represents the data and parameters of analytical water loop.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.WaterLoopData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WaterLoopData : IDisposable
Public Class WaterLoopData
	Implements IDisposable
public ref class WaterLoopData : IDisposable
type WaterLoopData =
    class
        interface IDisposable
    end
The WaterLoopData type exposes the following members.
Properties
Name | Description
ChillerType |  The type of water chiller. Note this property change would reset the condenser water loop.
CondenserWaterLoopId |  The water loop element id for the water cooled chiller.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
WaterLoopType |  The type of water loop. Note this property change would reset other properties.
Top
Methods
Name | Description
Dispose | Releases all resources used by the WaterLoopData
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace