Revit 2027 API
StructuralSectionGeneralI Class
 Defines parameters for general Double T shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralI : StructuralSectionHotRolled
Public Class StructuralSectionGeneralI
	Inherits StructuralSectionHotRolled
public ref class StructuralSectionGeneralI : public StructuralSectionHotRolled
type StructuralSectionGeneralI =
    class
        inherit StructuralSectionHotRolled
    end
The StructuralSectionGeneralI type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralI |  Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
FlangeFillet |  Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet |  Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle |  Sloped flange angle. (rad)
WebToeOfFillet |  Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Top
Methods
Name | Description
GetFlangeThicknessInFlangeCenter |  Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInQuarterWidth |  Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm.
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace