Revit 2027 API
ExternalApplicationArrayIterator Properties
The ExternalApplicationArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
ExternalApplicationArrayIterator Class
Autodesk.Revit.UI Namespace