Revit 2027 API
RevolvedSurface Methods
The RevolvedSurface type exposes the following members.
Methods
Name | Description
Create(Frame, Curve) |  Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve.
Create(XYZ, XYZ, Curve) |  Creates a Surface object coincident with the surface of revolution defined by an axis and a profile curve.
Create(Frame, Curve, Double, Double) |  Creates a Surface object coincident with the surface of revolution defined by a coordinate frame, a profile curve, and start and end angles of revolution.
Create(XYZ, XYZ, Curve, Double, Double) |  Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve, and start and end angles of revolution.
GetProfileCurve |  Returns a copy of the profile curve expressed in the surface's coordinate system.
GetProfileCurveInWorldCoordinates |  Returns a copy of the profile curve expressed in the world coordinate system.
IsValidProfileCurve(Frame, Curve) |  Checks if the input profile curve is valid to create a surface of revolution in the given frame of reference.
IsValidProfileCurve(XYZ, XYZ, Curve) |  Checks if the input profile curve is valid to create a surface of revolution around the given axis.
Top
See Also
Reference
RevolvedSurface Class
Autodesk.Revit.DB Namespace