Revit 2027 API
RoutingPreferenceRule Class
 A class representing a rule set in MEP routing preferences.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingPreferenceRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoutingPreferenceRule : IDisposable
Public Class RoutingPreferenceRule
	Implements IDisposable
public ref class RoutingPreferenceRule : IDisposable
type RoutingPreferenceRule =
    class
        interface IDisposable
    end
The RoutingPreferenceRule type exposes the following members.
Constructors
Name | Description
RoutingPreferenceRule |  Constructs a RoutingPreferenceRule containing a segment or fitting Id (MEPPartId) and description.
Top
Properties
Name | Description
Description |  The description of the routing preference rule.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MEPPartId |  The referenced MEPPart (segment or fitting) type in this rule. It may be InvalidElementId if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
NumberOfCriteria |  Gets the number of routing criteria.
RoutingPreferenceManager |  Gets the routing preference manager that owns this rule.
Top
Methods
Name | Description
AddCriterion |  Adds a new routing criterion.
Dispose | Releases all resources used by the RoutingPreferenceRule
GetCriterion |  Gets the specified criteria.
RemoveCriteron |  Removes an existing criterion.
Top
See Also
Reference
Autodesk.Revit.DB Namespace