Revit 2027 API
CentralModelContentionException Methods
The CentralModelContentionException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace