Revit 2027 API
StructuralConnectionHandlerType Methods
The StructuralConnectionHandlerType type exposes the following members.
Methods
Name | Description
Create(Document, String, Guid, String) |  Creates a new StructuralConnectionHandlerType object.
Create(Document, String, Guid, String, ElementId) |  Creates a new StructuralConnectionHandlerType object.
Create(Document, String, Guid, String, ElementId, IList<ConnectionInputPointInfo>) |  Creates a new StructuralConnectionHandlerType object.
CreateDefaultStructuralConnectionHandlerType |  Creates a new StructuralConnectionHandlerType object with a default name.
FindGenericConnectionType |  Finds StructuralConnectionHandlerType which is Generic Connection type.
GetDefaultConnectionHandlerType |  Gets a default type id for Structural Connection.
IsCustom |  Checks if StructuralConnectionHandlerType is custom.
IsDetailed |  Checks if StructuralConnectionHandlerType is detailed.
IsGeneric |  Checks if StructuralConnectionHandlerType is generic.
IsTypeNameValidForCustomConnection |  Validates if the input name matches the criteria of StructuralConnectionHandlerType name. Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\/:*?";<>| or any of the non-printable characters.
UpdateCustomConnectionType |  Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler. Adds input elements or subelements. Removes input subelements.The subelements will be erased. Updates any geometrical, parametrical or location changes of existing subelements, regardless of whether elements or subelements are added or removed.
Top
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace