Revit 2027 API
PrintManager Class
The PrintManager object is used to configure the global print settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PrintManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrintManager : APIObject
Public Class PrintManager
	Inherits APIObject
public ref class PrintManager : public APIObject
type PrintManager =
    class
        inherit APIObject
    end
The PrintManager type exposes the following members.
Properties
Name | Description
Collate |  Indicates whether to collate of the current print.
CombinedFile |  Indicates whether to combine multiple selected views/sheets into a single file.
CopyNumber |  The copy number.
IsVirtual |  The virtual type in Autodesk Revit.
PaperSizes | Get all print sizes of current printer.
PaperSources | Get all print sources of current printer.
PrinterName |  The name of the current printer.
PrintOrderReverse |  Indicates whether to reverse the print order of the current print.
PrintRange |  The print range.
PrintSetup |  The PrintSetup which manages the print settings of current document.
PrintToFile |  Indicates whether to print to file.
PrintToFileName |  The file name when printing to file.
ViewSheetSetting |  The ViewSheetSetting which manages the view/sheet set information of current document, and you can change the default view/sheet set for current project.
Top
Methods
Name | Description
Apply |  Apply the local print settings to global for all documents.
SelectNewPrintDriver |  Select a new printer.
SubmitPrint() |  Print the views and sheets defined in the current local PrintManager settings.
SubmitPrint(View) |  Print a view with the current PrintManager settings.
Top
Remarks
 Global print settings include PrintToFile, CombinedFile, PrintToFileName, PrintRange, CopyNumber, PrintOrderReverse, Collate. Once PrintManager is acquired from a document, changes of its global print setting properties are not automatically applied toward the global print setting. Should the local setting be used, the user needs to call the Apply method. If the user calls SubmitPrint methods, not only that printing will use the current state of properties of the (local) print manager, but the setting will also be applied to the global settings.
Example
private void CreateAndPrintViewSet(Document document, ViewSet viewSet)
{
    PrintManager printManager = document.PrintManager;
    printManager.PrintRange = PrintRange.Select;
    ViewSheetSetting viewSheetSetting = printManager.ViewSheetSetting;
    viewSheetSetting.CurrentViewSheetSet.Views = viewSet;
    viewSheetSetting.SaveAs("MyViewSet");
    printManager.CombinedFile = true;
    printManager.SubmitPrint();
}
See Also
Reference
Autodesk.Revit.DB Namespace