Revit 2027 API
WireTypeSet Properties
The WireTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of wire types that are in the set.
Top
See Also
Reference
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace