Revit 2027 API
NotTransmittedModelException Methods
The NotTransmittedModelException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
NotTransmittedModelException Class
Autodesk.Revit.Exceptions Namespace