Revit 2027 API
TextNoteType Class
An object that represents a text note style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.TextElementType
 Autodesk.Revit.DB.TextNoteType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextNoteType : TextElementType
Public Class TextNoteType
	Inherits TextElementType
public ref class TextNoteType : public TextElementType
type TextNoteType =
    class
        inherit TextElementType
    end
The TextNoteType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace