Revit 2027 API
RevitEventArgs Class
 The class is used as base class for all event argument classes.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PostEventArgs
 Autodesk.Revit.DB.Events.PreEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitEventArgs : EventArgs
Public Class RevitEventArgs
	Inherits EventArgs
public ref class RevitEventArgs : public EventArgs
type RevitEventArgs =
    class
        inherit EventArgs
    end
The RevitEventArgs type exposes the following members.
Properties
Name | Description
Cancel |  Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace