Revit 2027 API
ElementBinding Properties
The ElementBinding type exposes the following members.
Properties
Name | Description
Categories | Retrieve or set the categories to which a parameter definition will be bound.
Top
See Also
Reference
ElementBinding Class
Autodesk.Revit.DB Namespace