Revit 2027 API
MEPCalculationServerInfo Methods
The MEPCalculationServerInfo type exposes the following members.
Methods
Name | Description
Dispose
GetMEPCalculationServerInfo |  Gets a MEPCalculationServerInfo by family instance.
Top
See Also
Reference
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace