Revit 2027 API
WallFoundation Class
 An object that represents a wall foundation element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.WallFoundation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WallFoundation : HostObject
Public Class WallFoundation
	Inherits HostObject
public ref class WallFoundation : public HostObject
type WallFoundation =
    class
        inherit HostObject
    end
The WallFoundation type exposes the following members.
Properties
Name | Description
WallId |  Returns the id of the host wall.
Top
Methods
Name | Description
Create |  Creates a new wall foundation within the project.
Top
Example
public void GetInfo_WallFoundation(WallFoundation wallFoundation)
{
    string message = "Wall Foundation : ";
    // Get Footing type name
    Document doc = wallFoundation.Document;
    message += "\nFoundation type name is : " + doc.GetElement(wallFoundation.GetTypeId()).Name;
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace