Revit 2027 API
SteelElementProperties Properties
The SteelElementProperties type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
UniqueID |  This method will return the fabrication id. This represents the link between the Revit and the Steel Core element.
Top
See Also
Reference
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace