Revit 2027 API
SpaceSetIterator Methods
The SpaceSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
SpaceSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace