Revit 2027 API
RebarShapeConstraintDiameter Class
 A diameter constraint associated with an arc in a RebarShapeDefinition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintDiameter : RebarShapeConstraint
Public Class RebarShapeConstraintDiameter
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintDiameter : public RebarShapeConstraint
type RebarShapeConstraintDiameter =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintDiameter type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintDiameter |  Create a diameter constraint.
Top
Properties
Name | Description
ArcReferenceType |  The choice of rule for measuring the diameter.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace