Revit 2027 API
BuildingOperatingDaySchedule Methods
The BuildingOperatingDaySchedule type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a BuildingOperatingDaySchedule.
GetValueForHour |  Gets the usage value for an hour.
SetValueForHour |  Sets the usage value for an hour.
Top
See Also
Reference
BuildingOperatingDaySchedule Class
Autodesk.Revit.DB.Analysis Namespace