Revit 2027 API
DoubleArrayIterator Class
An iterator to an array of doubles.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DoubleArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class DoubleArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class DoubleArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class DoubleArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type DoubleArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The DoubleArrayIterator type exposes the following members.
Constructors
Name | Description
DoubleArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace