Revit 2027 API
IFCHybridImportOptions Class
 A set of options to decide on extra AnyCAD processing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCHybridImportOptions
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCHybridImportOptions : IDisposable
Public Class IFCHybridImportOptions
	Implements IDisposable
public ref class IFCHybridImportOptions : IDisposable
type IFCHybridImportOptions =
    class
        interface IDisposable
    end
The IFCHybridImportOptions type exposes the following members.
Properties
Name | Description
HybridGrids |  True if we should use AnyCAD to process grids, false otherwise.
HybridLevels |  True if we should use AnyCAD to process levels, false otherwise.
HybridPropertySets |  True if we should use AnyCAD to process property sets, false otherwise.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Create |  Create a IFCHybridImportOptions from an options string, or null if it isn't hybrid mode.
Dispose | Releases all resources used by the IFCHybridImportOptions
ToString(IFCHybridImportOptions) |  Converts the IFCHybridImportOptions class to a revit.ini-compatible string.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace