Revit 2027 API
ColorSelectionDialog Methods
The ColorSelectionDialog type exposes the following members.
Methods
Name | Description
Dispose
Show |  Shows the Revit Color dialog as a modal dialog.
Top
See Also
Reference
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace