Revit 2027 API
UIMacroManager Methods
The UIMacroManager type exposes the following members.
Methods
Name | Description
AddModule |  Adds a MacroModule to the application.
Dispose
GetMacroManager |  Gets the UI Macro manager from the UI application.
RemoveModule |  Removes a MacroModule.
Top
See Also
Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace