Revit 2027 API
RevitLinkOperations Class
 This class is used to extend the IExternalResourceServer interface with methods to support operations specifically related to Revit links.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkOperations
 Autodesk.Revit.DB.RevitLinkOperations
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitLinkOperations : LinkOperations
Public Class RevitLinkOperations
	Inherits LinkOperations
public ref class RevitLinkOperations : public LinkOperations
type RevitLinkOperations =
    class
        inherit LinkOperations
    end
The RevitLinkOperations type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
SetGetLocalPathForOpenCallback |  Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
Top
Remarks
The class owns single-method interfaces which are used as callbacks to perform specific operations on Revit link external resources.
An empty RevitLinkOperations instance is passed to an IExternalResourceServer (inside an ExternalResourceServerExtensions object) via the GetTypeSpecificServerOperations method. The server provider can then add their own implemented interface objects to the RevitLinkOperations, thus making them available to Revit to use as callbacks.
Supporting these additional, type-specific operations is not absolutely required, but is strongly recommended in order for users to be able to perform all the same operations they would with locally-accessed Revit links.
See Also
Reference
Autodesk.Revit.DB Namespace