Revit 2027 API
UIView Class
 A class containing data about view windows in the Revit user interface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIView
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class UIView : IDisposable
Public Class UIView
	Implements IDisposable
public ref class UIView : IDisposable
type UIView =
    class
        interface IDisposable
    end
The UIView type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ViewId |  The id of the View associated with a UIView.
Top
Methods
Name | Description
Close |  Closes the view.
Dispose | Releases all resources used by the UIView
GetWindowRectangle |  Gets the rectangle containing the coordinates of the view's drawing area.
GetZoomCorners |  Gets the corners of the view's rectangle. The two points that define the corners of the view's rectangle in model coordinates.
Zoom |  Zoom the view.
ZoomAndCenterRectangle |  Zoom and center the view to a specified rectangle.
ZoomSheetSize |  Zoom to the sheet size.
ZoomToFit |  Zoom the view to fit its contents.
Top
See Also
Reference
Autodesk.Revit.UI Namespace