Revit 2027 API
ModuleSettings Class
 The module settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.ModuleSettings
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModuleSettings : IDisposable
Public Class ModuleSettings
	Implements IDisposable
public ref class ModuleSettings : IDisposable
type ModuleSettings =
    class
        interface IDisposable
    end
The ModuleSettings type exposes the following members.
Constructors
Name | Description
ModuleSettings |  Constructs a new module settings.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MacroLanguageType |  The Macro language type.
Name |  The module name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ModuleSettings
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace