Revit 2027 API
InitialIlluminanceIntensity Properties
The InitialIlluminanceIntensity type exposes the following members.
Properties
Name | Description
Distance |  The illuminance intensity distance value.
Illuminance |  The illuminance intensity value.
Top
See Also
Reference
InitialIlluminanceIntensity Class
Autodesk.Revit.DB.Lighting Namespace