Revit 2027 API
DuctType Class
 A duct type element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Mechanical.DuctType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctType : MEPCurveType
Public Class DuctType
	Inherits MEPCurveType
public ref class DuctType : public MEPCurveType
type DuctType =
    class
        inherit MEPCurveType
    end
The DuctType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace