Revit 2027 API
LoadCase Class
 An object that represents a load usage.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadCase
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LoadCase : Element
Public Class LoadCase
	Inherits Element
public ref class LoadCase : public Element
type LoadCase =
    class
        inherit Element
    end
The LoadCase type exposes the following members.
Properties
Name | Description
NatureId |  The nature ID of the load case.
Number |  Returns unique load case number.
SubcategoryId |  Build-in or user defined subcategory of Structural Load Cases (OST_LoadCases) category.
Top
Methods
Name | Description
Create(Document, String, ElementId, ElementId) |  Creates a new LoadCase.
Create(Document, String, ElementId, LoadCaseCategory) |  Creates a new LoadCase.
IsLoadCaseSubcategoryId |  Checks whether provided element ID refer to subcategory of Structural Load Cases (OST_LoadCases) category - one of built-in or user defined.
IsLoadNatureId |  Checks whether provided element ID refer to LoadNature element.
IsNumberUnique |  Checks that a given number is unique among all load cases.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace