Revit 2027 API
FormArray Properties
The FormArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a form at a specified index within the array.
Size | Returns the number of forms that are in the array.
Top
See Also
Reference
FormArray Class
Autodesk.Revit.DB Namespace