Revit 2027 API
SlabShapeCreaseArrayIterator Class
An iterator to an array of creases used for Slab Shape Editing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SlabShapeCreaseArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class SlabShapeCreaseArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class SlabShapeCreaseArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class SlabShapeCreaseArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type SlabShapeCreaseArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The SlabShapeCreaseArrayIterator type exposes the following members.
Constructors
Name | Description
SlabShapeCreaseArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace