Revit 2027 API
RebarShapeConstraintSegmentLength Class
 A constraint that controls the length of a segment.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintSegmentLength : RebarShapeConstraint
Public Class RebarShapeConstraintSegmentLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintSegmentLength : public RebarShapeConstraint
type RebarShapeConstraintSegmentLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintSegmentLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintSegmentLength |  Create a segment length constraint.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetSegmentEndReferenceType |  Choice of two possibilities for the start and end references of the length constraint.
Top
Remarks
 The constraint has two references, indexed by 0 and 1, that do not have to correspond to the start and end of the segment.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace