Revit 2027 API
FilteredWorksetIdIterator Methods
The FilteredWorksetIdIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  The current workset id found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next workset id passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace