Revit 2027 API
StructuralSectionGeneralCEx Properties
The StructuralSectionGeneralCEx type exposes the following members.
Properties
Name | Description
FoldLength |  Fold segment length.
LipLength |  Lip segment length.
Top
See Also
Reference
StructuralSectionGeneralCEx Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace