Revit 2027 API
MechanicalSystemType Class
 Base class for duct system types
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.MEPSystemType
 Autodesk.Revit.DB.Mechanical.MechanicalSystemType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalSystemType : MEPSystemType
Public Class MechanicalSystemType
	Inherits MEPSystemType
public ref class MechanicalSystemType : public MEPSystemType
type MechanicalSystemType =
    class
        inherit MEPSystemType
    end
The MechanicalSystemType type exposes the following members.
Properties
Name | Description
RiseDropSettings |  indicates the rise/drop symbol given the system type
Top
Methods
Name | Description
Create |  Creates a new instance of a mechanical system type and adds it to the document.
ValidateRiseDropSymbolType |  Confirms if the parameter is a valid HVAC rise/drop symbol type.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace