Revit 2027 API
ModificationOutsideTransactionException Methods
The ModificationOutsideTransactionException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ModificationOutsideTransactionException Class
Autodesk.Revit.Exceptions Namespace