Revit 2027 API
DistributionSysTypeSet Methods
The DistributionSysTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every DistributionSys type from the set, rendering it empty.
Contains | Tests for the existence of a DistributionSys type within the set.
Erase | Removes a specified DistributionSys type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified DistributionSys type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace