Revit 2027 API
IndexBuffer Methods
The IndexBuffer type exposes the following members.
Methods
Name | Description
Dispose
GetIndexStreamLine |  Gets a stream that can be used to write IndexLine segment primitives into the buffer.
GetIndexStreamPoint |  Gets a stream that can be used to write IndexPoint primitives into the buffer.
GetIndexStreamTriangle |  Gets a stream that can be used to write IndexTriangle primitives into the buffer.
GetMappedHandle |  Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
IsValid |  Tests whether the buffer is valid for rendering.
Map |  Maps a portion of the index buffer into memory, so that indices can be written into it. see IndexStream.
Unmap |  Unmaps the buffer so that it can be used for rendering.
Top
See Also
Reference
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace