Revit 2027 API
ParameterElement Class
 An Element that stores a user-defined parameter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ParameterElement
 Autodesk.Revit.DB.ExternalData.ExtendedParameterElement
 Autodesk.Revit.DB.GlobalParameter
 Autodesk.Revit.DB.SharedParameterElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ParameterElement : Element
Public Class ParameterElement
	Inherits Element
public ref class ParameterElement : public Element
type ParameterElement =
    class
        inherit Element
    end
The ParameterElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetDefinition |  Get the definition representing this parameter element.
Top
Remarks
 Revit supports both built-in and user-defined parameters. Built-in parameters ship with the application, and they are not stored in Revit documents. User-defined parameters are dynamically created, and they are stored in the documents that use them, wrapped in ParameterElement objects. Different subclasses of ParemeterElement represent different kinds of user-defined parameters.
See Also
Reference
Autodesk.Revit.DB Namespace