Revit 2027 API
PipeFittingAndAccessoryPressureDropUIData Methods
The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.
Methods
Name | Description
Dispose
GetUIDataItems |  Gets all UI data items stored in the UI data.
GetUnits |  Gets units.
Top
See Also
Reference
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace