Revit 2027 API
NumberingSequenceInfo Methods
The NumberingSequenceInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
NumberingSequenceInfo Class
Autodesk.Revit.DB Namespace