Revit 2027 API
FabricationPartBrowserChangedEventArgs Class
 The event arguments used by the FabricationPartBrowserChangedEventArgs event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationPartBrowserChangedEventArgs : RevitAPISingleEventArgs
Public Class FabricationPartBrowserChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class FabricationPartBrowserChangedEventArgs : public RevitAPISingleEventArgs
type FabricationPartBrowserChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The FabricationPartBrowserChangedEventArgs type exposes the following members.
Properties
Name | Description
NumberOfSolutions |  The number of active solutions in routing solution mode.
Operation |  The operation associated with this event
ServiceId |  The identifier for the fabrication service.
Top
Methods
Name | Description
GetAllSolutionsPartsTypeCounts |  Returns the total fabrication part type usage count in all routing solutions.
GetCurrentSolutionPartTypeIds |  Returns set of fabrication part types that are used in the currently selected solution.
GetFabricationPartTypeIds |  Returns set of fabrication part types in use in the routing solution mode.
GetFilteredSolutionsPartsTypeCounts |  Returns the active fabrication part type usage count in fitlered routing solutions.
GetRequiredFabricationPartTypeIds |  Returns set of required fabrication part types in use in routing solution mode.
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace