Revit 2027 API
Mullion Methods
The Mullion type exposes the following members.
Methods
Name | Description
BreakMullion |  This method is used to break the current Mullion at ends with its neighboring mullions.
JoinMullion |  This method is used to control the join condition the current Mullion with its neighboring mullions.
Top
See Also
Reference
Mullion Class
Autodesk.Revit.DB Namespace