Revit 2027 API
ThermalAsset Methods
The ThermalAsset type exposes the following members.
Methods
Name | Description
Copy |  Produces a copy of the asset.
Dispose
Equals(ThermalAsset) |  Determines whether this thermal asset is equal to another.
EqualsThermalOnly |  Determines whether this thermal asset is equal to another, but ignore data from base class.
Top
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace