Revit 2027 API
TextNode Methods
The TextNode type exposes the following members.
Methods
Name | Description
GetFormattedText |  Returns an FormattedText object that contains text and associated formatting of this TextNode.
Top
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace