Revit 2027 API
CylindricalSurface Methods
The CylindricalSurface type exposes the following members.
Methods
Name | Description
Create |  Construct a cylindrical surface defined by a local coordinate system and a radius.
GetFrameOfReference |  Returns frame of reference associated with this CylindricalSurface.
Top
See Also
Reference
CylindricalSurface Class
Autodesk.Revit.DB Namespace