Revit 2027 API
VertexStreamPositionNormalColored Class
 A stream that can be used to write vertices of type VertexPositionNormalColored into a buffer (see VertexBuffer).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexStream
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexStreamPositionNormalColored : VertexStream
Public Class VertexStreamPositionNormalColored
	Inherits VertexStream
public ref class VertexStreamPositionNormalColored : public VertexStream
type VertexStreamPositionNormalColored =
    class
        inherit VertexStream
    end
The VertexStreamPositionNormalColored type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPositionNormalColored into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPositionNormalColored instances into the stream and associated buffer.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace