Revit 2027 API
MEPAnalyticalSystem Properties
The MEPAnalyticalSystem type exposes the following members.
Properties
Name | Description
AnalyticalSystemDomain |  The type of analytical system.
Top
See Also
Reference
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace