Revit 2027 API
ExternalServiceId Class
 Unique identifier of an external service.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.ExternalService.ExternalServiceId
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalServiceId : GuidEnum
Public Class ExternalServiceId
	Inherits GuidEnum
public ref class ExternalServiceId : public GuidEnum
type ExternalServiceId =
    class
        inherit GuidEnum
    end
The ExternalServiceId type exposes the following members.
Constructors
Name | Description
ExternalServiceId | Creates a new ExternalServiceId instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Operators
Name | Description
Equality(ExternalServiceId, ExternalServiceId) | Compares two ExternalServiceId instances.
Inequality(ExternalServiceId, ExternalServiceId) | Compares two ExternalServiceId instances.
Top
Remarks
 Each external service must have a unique ExternalServiceId. The Id can be registered with Revit for servers to easily find it. Unique ExternalServiceId should be created using GUID generation tool. ExternalServiceId can later be used to access registered external services.
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace