Revit 2027 API
ReleaseConditions Methods
The ReleaseConditions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ReleaseConditions Class
Autodesk.Revit.DB.Structure Namespace