Revit 2027 API
InitialWattageIntensity Class
 This class encapsulates initial wattage intensity calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialWattageIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialWattageIntensity : InitialIntensity
Public Class InitialWattageIntensity
	Inherits InitialIntensity
public ref class InitialWattageIntensity : public InitialIntensity
type InitialWattageIntensity =
    class
        inherit InitialIntensity
    end
The InitialWattageIntensity type exposes the following members.
Constructors
Name | Description
InitialWattageIntensity(InitialWattageIntensity) |  Creates a copy of the given initial wattage intensity object
InitialWattageIntensity(Double, Double) |  Creates an initial wattage intensity object with the given values.
Top
Properties
Name | Description
Efficacy |  The efficacy value.
Wattage |  The wattage value.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace