Revit 2027 API
SlabShapeVertexArrayIterator Class
An iterator to an array of vertices used for Slab Shape Editing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SlabShapeVertexArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class SlabShapeVertexArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class SlabShapeVertexArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class SlabShapeVertexArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type SlabShapeVertexArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The SlabShapeVertexArrayIterator type exposes the following members.
Constructors
Name | Description
SlabShapeVertexArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace