Revit 2027 API
RevitServerModelAlreadyExistsException Methods
The RevitServerModelAlreadyExistsException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerModelAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace