Revit 2027 API
RebarInSystem Properties
The RebarInSystem type exposes the following members.
Properties
Name | Description
ArrayLength |  Identifies the distribution path length of rebar set.
BarsOnNormalSide |  Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal. For the current implementation of RebarInSystem, this property will always return true, but it is included in the RebarInSystem interface for consistency with the Rebar class.
LayoutRule |  Identifies the layout rule of rebar set.
Mass |  Identifies the mass of the rebar set. It is computed as the sum of the masses of all individual bars.
MaxSpacing |  Identifies the maximum spacing between rebar in rebar set.
Normal |  A unit-length vector normal to the plane of the rebar
NumberOfBarPositions |  The number of bar positions available in the rebar.
Quantity |  Identifies the number of bars in rebar set.
RebarShapeId |  The RebarShape element that defines the shape of the rebar.
ScheduleMark |  The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
SystemId |  The Id of an AreaReinforcement or PathReinforcement element that owns this element.
TotalLength |  The length of an individual bar multiplied by Quantity.
Volume |  The volume of an individual bar multiplied by Quantity.
Top
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace