Revit 2027 API
LinkConversionData Class
 This class contains the information necessary to re-create a Revit document from an external source.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkConversionData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkConversionData : IDisposable
Public Class LinkConversionData
	Implements IDisposable
public ref class LinkConversionData : IDisposable
type LinkConversionData =
    class
        interface IDisposable
    end
The LinkConversionData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Path |  The path to the source data used to generate the model.
ServerId |  The service responsible for converting the data into a Revit file.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LinkConversionData
GetOptions |  Extra information used during the creation of the Revit document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace