Revit 2027 API
CurveUV Class
 A class that encapsulates the notion of a curve in the 2D parameter space of a surface in 3D space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CurveUV
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveUV : IDisposable
Public Class CurveUV
	Implements IDisposable
public ref class CurveUV : IDisposable
type CurveUV =
    class
        interface IDisposable
    end
The CurveUV type exposes the following members.
Properties
Name | Description
IsBound |  Describes whether the parameter of the curve is restricted to a particular interval.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
As3DCurveInXYPlane |  Returns a 3D curve lying in the XY plane in XYZ coordinates, representing the 2D curve with its UV coordinates identified with XY coordinates.
ComputeDerivatives |  Computes the first derivative, the second derivative and the unit tangent vector at the specified parameter along the curve.
Create |  Create a CurveUV from a bounded 3D Curve lying in the XY plane.
Dispose | Releases all resources used by the CurveUV
Evaluate |  Evaluates and returns the point at the specified parameter along the curve.
GetEndParameter |  Gets the raw parameter value at the start or end of this curve.
Transform |  Transform this CurveUV by the given 2D affine transform if possible.
Top
Remarks
 Revit does not have a class to represent 2D curves explicitly.
See Also
Reference
Autodesk.Revit.DB Namespace