Revit 2027 API
View Methods
The View type exposes the following members.
Methods
Name | Description
AddFilter |  Adds a filter to the view.
AllowsAnalysisDisplay |  Identifies if this view allows display of Analysis results.
ApplyViewTemplateParameters |  Applies to this view the parameters of the input view that are not controlled by the current view template.
AreGraphicsOverridesAllowed |  Determines if Visibility/Graphics Overriddes can be applied to the view.
CanApplyColorFillScheme |  Checks if the id can be applied as the scheme id of specified category to this view.
CanCategoryBeHidden |  Checks whether the category can be hidden in the view.
CanCategoryBeHiddenTemporary |  Check if category can be temporarily hidden in the view.
CanEnableTemporaryViewPropertiesMode |  Indicates if Temporary View Properties mode can be applied for view in current state.
CanModifyDetailLevel |  Check if Detail Level can be modified.
CanModifyDisplayStyle |  Indicates if DisplayStyle can be modified.
CanModifyViewDiscipline |  Indicates if the View Discipline can be modified
CanUseDepthCueing |  Indicates if view can use Depth Cueing
CanUseTemporaryVisibilityModes |  Indicates if view can use temporary visibility modes
CanViewBeDuplicated |  Identifies if this view can be duplicated.
ConvertTemporaryHideIsolateToPermanent |  Convert all temporary hidden elements or categories to permanently hidden in view.
ConvertToIndependent |  Convert the dependent view to independent.
CreateViewTemplate |  Creates a new view template instance from this view instance.
DisableTemporaryViewMode |  Disables the specified temporary view mode.
Duplicate |  Duplicates this view.
EnableRevealHiddenMode |  Enables Reveal Hidden elements mode.
EnableTemporaryViewPropertiesMode |  Turns Temporary View Properties mode on or off. In this mode, any changes made to the view are temporary and will be discarded once the mode is disabled.
GetBackground |  Returns the current background set for the view.
GetCalloutParentId |  Gets ID of the callout parent view.
GetCategoryHidden |  Checks if elements of the given category are set to be invisible (hidden) in this view.
GetCategoryOverrides |  Gets graphic overrides for a category in view.
GetColorFillSchemeId |  Returns id of the color fill scheme element applied to the view.
GetCropRegionShapeManager |  Returns an object for managing view crop region shape.
GetCropRegionShapeManagerForReferenceCallout |  Returns an object for managing view crop region shape for reference callout.
GetDependentViewIds |  Get the ids of dependent views.
GetDepthCueing |  Returns the current depth cueing settings for the view.
GetDirectContext3DHandleOverrides |  Returns DirectContext3D handle overrides object for the view.
GetElementOverrides |  Gets graphic overrides for an element in the view.
GetFilterOverrides |  Gets graphic overrides that a filter applies to the view.
GetFilters |  Gets the filters applied to the view.
GetFilterVisibility |  Gets the visibility of the elements associated with a filter.
GetIsFilterEnabled |  Identifies if the filter is enabled in this view.
GetLinkOverrides |  Gets the graphic overrides of a RevitLinkType or RevitLinkInstance in view.
GetModelToProjectionTransforms |  Gets the transforms from the model space to the view projection space.
GetNonControlledTemplateParameterIds |  Returns a list of parameters that are not marked as included when this view is used as a template.
GetOrderedFilters |  Gets the filters applied to the view in the order they are applied.
GetPlacementOnSheetStatus |  Determines if this view placed on a sheet completely or partially.
GetPointCloudOverrides |  Returns point cloud overrides object for the view.
GetPrimaryViewId |  Get the id of the primary view.
GetReferenceCallouts |  Returns element ids of all reference callouts in the view.
GetReferenceElevations |  Returns element ids of all reference elevations in the view.
GetReferenceSections |  Returns element ids of all reference sections in the view.
GetSketchyLines |  Returns the current sketchy lines settings for the view.
GetTemplateParameterIds |  Returns a list of parameter ids that may be controlled when this view is assigned as a template.
GetTemporaryViewPropertiesId |  When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.
GetTemporaryViewPropertiesName |  When Temporary View Properties mode is in progress, name of applied template is returned. Outside Temporary View Properties mode, empty string will be returned.
GetViewDisplayModel |  Returns the current view display model settings for the view.
GetWorksetVisibility |  Returns the visibility settings of a workset for this particular view.
GetWorksharingDisplayMode |  Gets the current worksharing display mode for this view.
HasDetailLevel |  Check if the view has a Detail Level property
HasDisplayStyle |  Indicates if view has a DisplayStyle property
HasViewDiscipline |  Indicates if the view has a Discipline property
HasViewTransforms |  Returns true if the view reports model space to view projection space transforms.
HideActiveWorkPlane | Hide the active work plane of the view.
HideCategoriesTemporary |  Set multiple categories to be temporarily hidden in the view.
HideCategoryTemporary |  Set one category to be temporarily hidden in the view.
HideElements | Sets the elements to be hidden in the view.
HideElementsTemporary |  Set multiple elements to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input.
HideElementTemporary |  Set one element to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
IsCategoryOverridable |  Checks whether the category can have graphic overrides in this view.
IsElementVisibleInTemporaryViewMode |  Identifies if the input element is visible for the temporary view mode for this view.
IsFilterApplied |  Indicates if a filter is applied to the view.
IsInTemporaryViewMode |  Returns true if the view is in a particular temporary view mode.
IsolateCategoriesTemporary |  Set categories to be temporarily isolated in the view.
IsolateCategoryTemporary |  Set one category to be temporarily isolated in the view.
IsolateElementsTemporary |  Set multiple elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.
IsolateElementTemporary |  Set one element to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
IsTemporaryHideIsolateActive |  Indicates if the view is temporarily hiding or isolating elements or categories.
IsTemporaryViewPropertiesModeEnabled |  Returns true when Temporary View Properties mode is in progress, false otherwise.
IsValidViewScale |  This validator checks that the view scale is in the allowable range.
IsValidViewTemplate |  Verifies that the view represented by templateId can be set as the controlling view template for this view.
IsViewValidForTemplateCreation |  Verifies that the view is valid for template creation.
IsWorksetVisible |  Indicates whether the workset is visible in this view.
Print() | Print this view with the default view template and using the print setting of the current active document.
Print(Boolean) | Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document.
Print(View) | Print this view with the given view template and using the print setting of the current active document.
Print(View, Boolean) | Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document.
RemoveCalloutParent |  Replaces callout parent ID with InvalidElementId.
RemoveFilter |  Removes a filter from the view.
RemoveLinkOverrides |  Deletes the graphical link overrides in the current view.
RestoreCalloutParent |  Restores callout parent ID to the original view ID if that view is still available.
SetBackground |  Sets the background for the view. Background can only be set for 3d views and for Sections/Elevations.
SetCategoryHidden |  Sets if elements of the given category will be visible in this view.
SetCategoryOverrides |  Sets graphic overrides for a category in view.
SetColorFillSchemeId |  Applies color fill scheme to this view.
SetDepthCueing |  Sets the depth cueing settings for the view.
SetElementOverrides |  Sets graphic overrides for an element in the view.
SetFilterOverrides |  Sets the overrides associated with a filter.
SetFilterVisibility |  Sets the visibility of the elements associated with a filter.
SetIsFilterEnabled |  Sets the filter enabled flag.
SetLinkOverrides |  Sets the graphic overrides of a RevitLinkType or RevitLinkInstance in the view.
SetNonControlledTemplateParameterIds |  Sets the parameters that will not be included when this view is used as a template.
SetSketchyLines |  Sets the sketchy lines settings for the view.
SetViewDisplayModel |  Sets the view display model settings for the view.
SetWorksetVisibility |  Sets visibility for a workset in this view.
SetWorksharingDisplayMode |  Sets the worksharing display mode for this view.
ShowActiveWorkPlane | Show the active work plane of the view.
SupportedColorFillCategoryIds |  Returns collection of all category ids that correspond to elements that can potentially be colored in this view according to a color fill scheme. The set may be different depending on the view type.
SupportsRevealConstraints |  Checks that the view can have the Reveal Constraints mode activated.
SupportsWorksharingDisplayMode |  Checks whether this view supports the given worksharing display mode.
UnhideElements | Sets the elements to be shown in the given view if they are currently hidden.
Top
See Also
Reference
View Class
Autodesk.Revit.DB Namespace