Revit 2027 API
RebarContainerType Methods
The RebarContainerType type exposes the following members.
Methods
Name | Description
CreateDefaultRebarContainerType |  Creates a new RebarContainerType object with a default name.
GetOrCreateRebarContainerType |  Creates or returns a RebarContainerType object with a given name.
Top
See Also
Reference
RebarContainerType Class
Autodesk.Revit.DB.Structure Namespace