Revit 2027 API
IFCFileReadOptions Methods
The IFCFileReadOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace