Revit 2027 API
ReferenceArrayIterator Properties
The ReferenceArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
ReferenceArrayIterator Class
Autodesk.Revit.DB Namespace