Revit 2027 API
CurveLoop Methods
The CurveLoop type exposes the following members.
Methods
Name | Description
Append |  Append the curve to this loop.
Create |  Creates a new curve loop.
CreateViaCopy |  Creates a new curve loop as a copy of the input.
CreateViaOffset(CurveLoop, IList<Double>, XYZ) |  Creates a new curve loop that is an offset of the existing curve loop.
CreateViaOffset(CurveLoop, Double, XYZ) |  Creates a new curve loop that is an offset of the existing curve loop.
CreateViaThicken(Curve, Double, XYZ) |  Creates a new closed curve loop by thickening the input curve with respect to a given plane.
CreateViaThicken(CurveLoop, Double, XYZ) |  Creates a new closed curve loop by thickening the input open curve loop with respect to a given plane.
CreateViaTransform |  Creates a new curve loop as a transformed copy of the input curve loop.
Dispose
Flip |  Reverses the orientation of the curve loop.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetCurveLoopIterator |  Returns a curve that iterates through the curve loop.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetExactLength |  Returns the sum of exact lengths of all curves in the loop.
GetPlane |  Gets the plane of the curve loop, if it is planar.
GetRectangularHeight |  Returns the width of a curve loop if it is rectangular with respect to the projection plane.
GetRectangularWidth |  Returns the width of a curve loop if it is rectangular with respect to the projection plane.
HasPlane |  Identifies if the CurveLoop is planar.
IsCounterclockwise |  Determines if this CurveLoop is oriented counter-clockwise (CCW) or clockwise (CW) with respect to the specified 3D direction.
IsOpen |  Returns whether the curve loop is open or closed, as determined by an internal flag.
IsRectangular |  Identifies if the curve loop is rectangular with respect to a given projection plane.
NumberOfCurves |  Returns the number of curves in the curve loop.
Transform |  Transforms this curve loop and all of its component curves by the supplied transformation.
Top
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace