Revit 2027 API
ExternalApplicationException Methods
The ExternalApplicationException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ExternalApplicationException Class
Autodesk.Revit.Exceptions Namespace