Revit 2027 API
PipeSettings Class
 The pipe setting class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Plumbing.PipeSettings
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeSettings : Element
Public Class PipeSettings
	Inherits Element
public ref class PipeSettings : public Element
type PipeSettings =
    class
        inherit Element
    end
The PipeSettings type exposes the following members.
Properties
Name | Description
AnalysisForClosedLoopHydronicPipingNetworks |  Indicates whether to enable analysis for closed loop hydronic piping networks.
Centerline |  The abbreviation of the Centerline (=) string.
ConnectorSeparator |  The connector separator string.
ConnectorTolerance |  The connector tolerance value.
FittingAngleUsage |  Determine how to use fitting angle during pipe layout or modifying layout.
FittingAnnotationSize |  The value of fitting annotation size.
FlatOnBottom |  The abbreviation of the Flat On Bottom (FOB) string.
FlatOnTop |  The abbreviation of the Flat On Top (FOT) string.
SetDown |  The abbreviation of the Set Down (SD) string.
SetDownFromBottom |  The abbreviation of the Set Down from bottom of fitting (SDB) string.
SetUp |  The abbreviation of the Set Up (SU) string.
SetUpFromBottom |  The abbreviation of the Set Up from bottom of fitting(SUB) string.
SizePrefix |  The size prefix string.
SizeSuffix |  The size suffix string.
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
Top
Methods
Name | Description
AddPipeSlope |  Add a pipe slope value.
GetFlowConvertionServerInfo |  Get the MEPServerInfo of the current plumbing flow convertion server.
GetPipeSettings |  Get the pipe settings of the project.
GetPipeSlopes |  Get pipe slopes.
GetSpecificFittingAngles |  Gets the list of specific fitting angles.
GetSpecificFittingAngleStatus |  Gets the status of given specific angle.
IsAnalysisForClosedLoopHydronicPipingNetworksEnabled |  Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.
IsValidSpecificFittingAngle |  Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
SetFlowConvertionServerInfo |  Set the MEPServerInfo of the current plumbing flow convertion server.
SetPipeSlopes |  Set pipe slope values.
SetSpecificFittingAngleStatus |  Sets the status of given specific angle.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace