Revit 2027 API
CurveByPoints Class
A curve interpolating two or more points.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.CurveByPoints
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveByPoints : CurveElement
Public Class CurveByPoints
	Inherits CurveElement
public ref class CurveByPoints : public CurveElement
type CurveByPoints =
    class
        inherit CurveElement
    end
The CurveByPoints type exposes the following members.
Properties
Name | Description
IsReferenceLine
ReferenceType | Indicates the type of reference.
SketchPlane | Override the SketchPlane property of CurveElement.
(Overrides CurveElement.SketchPlane)
Subcategory | The subcategory, or graphics style, of the CurveByPoints.
Visible | Whether the point is visible when the family is loaded into a project.
Top
Methods
Name | Description
GetPoints | Get the sequence of points interpolated by this curve.
GetVisibility | Gets the visibility.
SetPoints | Change the sequence of points interpolated by this curve.
SetVisibility | Sets the visibility.
SortPoints | Order a set of ReferencePoints in the same way Revit does when creating a curve from points.
Top
Remarks
The points to be interpolated are represented as ReferencePoints, which must already exist in the document. In terms of appearance and graphics control, CurveByPoints behaves similarly to ModelCurve. The main difference being that a ModelCurve refers to a SketchPlane, while a CurveByPoints does not. For more methods capable of accessing data from CurveByPoints elements, see the static class CurveByPointsUtils.
See Also
Reference
Autodesk.Revit.DB Namespace