Revit 2027 API
MultiReferenceAnnotationOptions Class
 Options which control the creation of MultiReferenceAnnotations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MultiReferenceAnnotationOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MultiReferenceAnnotationOptions : IDisposable
Public Class MultiReferenceAnnotationOptions
	Implements IDisposable
public ref class MultiReferenceAnnotationOptions : IDisposable
type MultiReferenceAnnotationOptions =
    class
        interface IDisposable
    end
The MultiReferenceAnnotationOptions type exposes the following members.
Constructors
Name | Description
MultiReferenceAnnotationOptions |  Create an instance of Multi-Reference Annotation Options set with default values.
Top
Properties
Name | Description
DimensionLineDirection |  The direction vector of the dimension line.
DimensionLineOrigin |  The origin point for the dimension line.
DimensionPlaneNormal |  The normal vector to the dimension plane.
DimensionStyleType |  The dimension style type to be used by the new MultiReferenceAnnotation.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MultiReferenceAnnotationType |  The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
TagHasLeader |  When true the tag will be created with an attached leader. When false the tag will be created without a leader.
TagHeadPosition |  The position for the tag's head.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MultiReferenceAnnotationOptions
ElementsMatchReferenceCategory |  Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType.
GetAdditionalReferencesToDimension |  Gets the additional references which the dimension will witness.
GetElementsToDimension |  Gets the elements which the dimension will witness.
IsAllowedDimensionStyleType |  Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
ReferencesDontMatchReferenceCategory |  Verifies that all of the references belongs to elements which doesn't match the reference category required by the MultiReferenceAnnotationType.
SetAdditionalReferencesToDimension |  Sets the additional references which the dimension will witness.
SetElementsToDimension |  Sets the elements which the dimension will witness.
Top
Remarks
 MultiReferenceAnnotationOptions include the specification of the associated elements and options for the dimension and tag placement.
See Also
Reference
Autodesk.Revit.DB Namespace