Revit 2027 API
FieldBuilder Methods
The FieldBuilder type exposes the following members.
Methods
Name | Description
Dispose
NeedsSubSchemaGUID |  Checks whether the SubSchema GUID needs to be explicitly specified for this field type.
NeedsUnits |  Checks whether the field type requires explicit unit conversions.
Ready |  Checks whether the builder may be used.
SetDocumentation |  Sets the documentation string for the Field.
SetSpec |  Sets the spec describing the field's values.
SetSubSchemaGUID |  Sets the GUID of the Schema of the Entities that are intended to be stored in this field.
Top
See Also
Reference
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace