Revit 2027 API
ExternalApplicationArrayIterator Methods
The ExternalApplicationArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
ExternalApplicationArrayIterator Class
Autodesk.Revit.UI Namespace