Revit 2027 API
ViewDisplayDepthCueing Methods
The ViewDisplayDepthCueing type exposes the following members.
Methods
Name | Description
Dispose
SetStartEndPercentages |  Sets start and end percentages.
Top
See Also
Reference
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace