Revit 2027 API
MacroManagerIterator Class
 An iterator to a MacroManager.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.MacroManagerIterator
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MacroManagerIterator : IEnumerator<MacroModule>
Public Class MacroManagerIterator
	Implements IEnumerator(Of MacroModule)
public ref class MacroManagerIterator : IEnumerator<MacroModule^>
type MacroManagerIterator =
    class
        interface IEnumerator<MacroModule>
    end
The MacroManagerIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MacroManagerIterator
GetCurrent |  Returns the current Macro module.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace