Revit 2027 API
ArgumentException Class
The exception that is thrown when one of the arguments provided to a method is not valid.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 More
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ArgumentException : ApplicationException
<SerializableAttribute>
Public Class ArgumentException
	Inherits ApplicationException
[SerializableAttribute]
public ref class ArgumentException : public ApplicationException
[<SerializableAttribute>]
type ArgumentException =
    class
        inherit ApplicationException
    end
The ArgumentException type exposes the following members.
Properties
Name | Description
Message | Gets the error message and the parameter name, or only the error message if no parameter name is set.
(Overrides Exception.Message)
ParamName | Gets the name of the parameter that causes this exception.
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
Remarks
This is the base class for exceptions that are thrown while validating the arguments to a function.
See Also
Reference
Autodesk.Revit.Exceptions Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.ArgumentNullException
 Autodesk.Revit.Exceptions.ArgumentOutOfRangeException
 Autodesk.Revit.Exceptions.ArgumentsInconsistentException
 Autodesk.Revit.Exceptions.DirectoryNotEmptyException
 Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
 Autodesk.Revit.Exceptions.FileArgumentNotFoundException
 Autodesk.Revit.Exceptions.InvalidPathArgumentException