Revit 2027 API
AnalysisDisplayVectorSettings Class
 Contains vector settings for analysis display style element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayVectorSettings : IDisposable
Public Class AnalysisDisplayVectorSettings
	Implements IDisposable
public ref class AnalysisDisplayVectorSettings : IDisposable
type AnalysisDisplayVectorSettings =
    class
        interface IDisposable
    end
The AnalysisDisplayVectorSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayVectorSettings() |  Constructs a default instance of vector settings.
AnalysisDisplayVectorSettings(AnalysisDisplayVectorSettings) |  Constructs a new copy of the input AnalysisDisplayVectorSettings object.
Top
Properties
Name | Description
ArrowheadScale |  Type of arrow head scaling.
ArrowLineWeight |  Line weight assigned to arrow lines for vectors.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Rounding |  Increment to which numeric values of analysis results are rounded in vectors.
TextTypeId |  Element id of text associated with the settings.
VectorOrientation |  Vector orientation.
VectorPosition |  Vector position.
VectorTextType |  Type of vector text visualization.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisDisplayVectorSettings
IsEqual |  Compares two vector settings objects.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace