Revit 2027 API
BIMExportOptions Class
 The base class for options used to export using ATF.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BIMExportOptions
 Autodesk.Revit.DB.OBJExportOptions
 Autodesk.Revit.DB.STEPExportOptions
 Autodesk.Revit.DB.STLExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BIMExportOptions : IDisposable
Public Class BIMExportOptions
	Implements IDisposable
public ref class BIMExportOptions : IDisposable
type BIMExportOptions =
    class
        interface IDisposable
    end
The BIMExportOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ViewId |  The element id of the 3D view to export. InvalidElementId by default.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BIMExportOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace