Revit 2027 API
ViewFamilyType Methods
The ViewFamilyType type exposes the following members.
Methods
Name | Description
IsValidDefaultTemplate |  Verifies that the input can be used as a default template for this view type.
Top
See Also
Reference
ViewFamilyType Class
Autodesk.Revit.DB Namespace