Revit 2027 API
ComboBoxDropDownOpenedEventArgs Class
The event arguments used by ComboBox's DropDownOpened event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.UI.Events.RibbonItemEventArgs
 Autodesk.Revit.UI.Events.ComboBoxDropDownOpenedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComboBoxDropDownOpenedEventArgs : RibbonItemEventArgs
Public Class ComboBoxDropDownOpenedEventArgs
	Inherits RibbonItemEventArgs
public ref class ComboBoxDropDownOpenedEventArgs : public RibbonItemEventArgs
type ComboBoxDropDownOpenedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
The ComboBoxDropDownOpenedEventArgs type exposes the following members.
Constructors
Name | Description
ComboBoxDropDownOpenedEventArgs | Initializes a new instance of the ComboBoxDropDownOpenedEventArgs class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace