Revit 2027 API
ResourceNotFoundException Methods
The ResourceNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ResourceNotFoundException Class
Autodesk.Revit.Exceptions Namespace