Revit 2027 API
Material Class
 Represents a material element within an Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Material
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Material : Element
Public Class Material
	Inherits Element
public ref class Material : public Element
type Material =
    class
        inherit Element
    end
The Material type exposes the following members.
Properties
Name | Description
AppearanceAssetId |  The ElementId of the AppearanceAssetElement.
Color |  The color of the material.
CutBackgroundPatternColor |  The color of the material cut background pattern.
CutBackgroundPatternId |  The id of the FillPatternElement used as the background pattern of faces with this material in cut views.
CutForegroundPatternColor |  The color of the material cut foreground pattern.
CutForegroundPatternId |  The id of the FillPatternElement used as the foreground pattern of faces with this material in cut views.
EmbodiedCarbonAssetId |  The ElementId of the embodied carbon PropertySetElement.
MaterialCategory |  The name of the material category, e.g. 'Wood'
MaterialClass |  The name of the general material type, e.g. 'Wood.'
Shininess |  The shininess of the material.
Smoothness |  The smoothness of the material.
StructuralAssetId |  The ElementId of the structural PropertySetElement.
SurfaceBackgroundPatternColor |  The color of the material surface background pattern.
SurfaceBackgroundPatternId |  The id of the FillPatternElement used as the background pattern of faces with this material in normal views.
SurfaceForegroundPatternColor |  The color of the material surface foreground pattern.
SurfaceForegroundPatternId |  The id of the FillPatternElement used as the foreground pattern of faces with this material in normal views.
ThermalAssetId |  The ElementId of the thermal PropertySetElement.
Transparency |  The transparency of the material.
UseRenderAppearanceForShading |  True to use the render appearance settings for shaded view appearance; false to use the material's color and transparency value for shaded view appearance.
Top
Methods
Name | Description
ClearMaterialAspect |  Removes an aspect from the material.
Create |  Creates a new material.
Duplicate |  Duplicates the material
GetIdentityParameterIds |  Gets material identity parameter ids from the material.
IsMaterialOrValidDefault |  Validates whether the specified element id is a material element.
IsNameUnique |  Validates whether the material name is unique in document.
SetMaterialAspectByPropertySet |  Sets an aspect of the material to a shared property set.
Top
Example
private void GetMaterialInformation(Material material)
{
   StringBuilder message = new StringBuilder("Material : " + material.Name);
   //color of the material
   message.Append(string.Format("\nColor: Red[{0}]; Green[{1}]; Blue[{2}]",
                   material.Color.Red, material.Color.Green, material.Color.Blue));
   //foreground cut pattern and pattern color of the material
   FillPatternElement cutForegroundPattern = material.Document.GetElement(material.CutForegroundPatternId) as FillPatternElement;
   if (null != cutForegroundPattern)
   {
      message.Append("\nCut Foreground Pattern: " + cutForegroundPattern.Name);
      message.Append(string.Format("\nCut Foreground Pattern Color: Red[{0}]; Green[{1}]; Blue[{2}]",
                      material.CutForegroundPatternColor.Red, material.CutForegroundPatternColor.Green, material.CutForegroundPatternColor.Blue));
   }
   //foreground surface pattern and pattern color of the material
   FillPatternElement surfaceForegroundPattern = material.Document.GetElement(material.SurfaceForegroundPatternId) as FillPatternElement;
   if (null != surfaceForegroundPattern)
   {
      message.Append("\nSurface Foreground Pattern: " + surfaceForegroundPattern.Name);
      message.Append(string.Format("\nSurface Foreground Pattern Color: Red[{0}]; Green[{1}]; Blue[{2}]",
                      material.SurfaceForegroundPatternColor.Red, material.SurfaceForegroundPatternColor.Green, material.SurfaceForegroundPatternColor.Blue));
   }
   //background cut pattern and pattern color of the material
   FillPatternElement cutBackgroundPattern = material.Document.GetElement(material.CutBackgroundPatternId) as FillPatternElement;
   if (null != cutBackgroundPattern)
   {
      message.Append("\nCut Background Pattern: " + cutBackgroundPattern.Name);
      message.Append(string.Format("\nCut Background Pattern Color: Red[{0}]; Green[{1}]; Blue[{2}]",
                      material.CutBackgroundPatternColor.Red, material.CutBackgroundPatternColor.Green, material.CutBackgroundPatternColor.Blue));
   }
   //background surface pattern and pattern color of the material
   FillPatternElement surfaceBackgroundPattern = material.Document.GetElement(material.SurfaceBackgroundPatternId) as FillPatternElement;
   if (null != surfaceBackgroundPattern)
   {
      message.Append("\nSurface Background Pattern: " + surfaceBackgroundPattern.Name);
      message.Append(string.Format("\nSurface Background Pattern Color: Red[{0}]; Green[{1}]; Blue[{2}]",
                      material.SurfaceBackgroundPatternColor.Red, material.SurfaceBackgroundPatternColor.Green, material.SurfaceBackgroundPatternColor.Blue));
   }
   //some shading property of the material
   int shininess = material.Shininess;
   message.Append("\nShininess: " + shininess);
   int smoothness = material.Smoothness;
   message.Append("\nSmoothness: " + smoothness);
   int transparency = material.Transparency;
   message.Append("\nTransparency: " + transparency);
   TaskDialog.Show("Revit", message.ToString());
}
See Also
Reference
Autodesk.Revit.DB Namespace