Revit 2027 API
ConduitType Class
 This class represents a conduit type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Electrical.ConduitType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConduitType : MEPCurveType
Public Class ConduitType
	Inherits MEPCurveType
public ref class ConduitType : public MEPCurveType
type ConduitType =
    class
        inherit MEPCurveType
    end
The ConduitType type exposes the following members.
Properties
Name | Description
IsWithFitting |  Whether this conduit type is with fitting
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace