Revit 2027 API
Rebar Properties
The Rebar type exposes the following members.
Properties
Name | Description
CanHaveVaryingLengthBars |  Identifies if a set can have varying length bars or not.
FreeForm3DPathServerGuid |  Guid used for identifying the external IRebarUpdateServer for computing 3D Path Free Form Rebar.
FreeFormAlignedServerGuid |  Guid used for identifying the external IRebarUpdateServer for computing Aligned Free Form Rebar.
FreeFormMorphedServerGuid |  Guid used for identifying the external IRebarUpdateServer for computing Morphed Free Form Rebar.
FreeFormSurfaceServerGuid |  Guid used for identifying the external IRebarUpdateServer for computing Surface Free Form Rebar.
HasVariableLengthBars |  Identifies if a set has varying length bars or not.
IncludeFirstBar |  Identifies if the first bar in rebar set is shown.
IncludeLastBar |  Identifies if the last bar in rebar set is shown.
LayoutRule |  Identifies the layout rule of rebar set.
Mass |  Identifies the mass of the rebar set. It is computed as the sum of the masses of all individual bars.
MaxSpacing |  Identifies the maximum spacing between rebar in rebar set.
NumberOfBarPositions |  The number of potential bars in the set.
Quantity |  Identifies the number of bars in rebar set.
ReadOnlyParameters |  When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected.
ScheduleMark |  The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
TotalLength |  The length of an individual bar multiplied by Quantity.
Volume |  The volume of an individual bar multiplied by Quantity.
Top
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace