Revit 2027 API
MEPBuildingConstructionSetIterator Methods
The MEPBuildingConstructionSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
MEPBuildingConstructionSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace