Revit 2027 API
ElementIdSetFilter Methods
The ElementIdSetFilter type exposes the following members.
Methods
Name | Description
GetIdsToInclude |  Returns the ids of this filter.
Top
See Also
Reference
ElementIdSetFilter Class
Autodesk.Revit.DB Namespace