Revit 2027 API
ElectricalEquipment Methods
The ElectricalEquipment type exposes the following members.
Methods
Name | Description
GetCircuitNamingSchemeType |  Gets enumerated type of the circuit naming scheme used with Electrical Equipment.
IsValidCircuitNamingSchemeId |  Verifies that the circuit naming scheme id can be used with Electrical Equipment.
IsValidDistributionSystem |  Verifies that the Distribution System can be assigned to the Electrical Equipment.
SetCircuitNamingSchemeType |  Sets the circuit naming scheme for Electrical Equipment.
Top
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace