Revit 2027 API
StringParameterValue Class
 A class that holds a String value of a parameter element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.StringParameterValue
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StringParameterValue : ParameterValue
Public Class StringParameterValue
	Inherits ParameterValue
public ref class StringParameterValue : public ParameterValue
type StringParameterValue =
    class
        inherit ParameterValue
    end
The StringParameterValue type exposes the following members.
Constructors
Name | Description
StringParameterValue() |  Default constructor
StringParameterValue(String) |  Value constructor
Top
Properties
Name | Description
Value |  The stored value
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace