Revit 2027 API
DXFExportOptions Methods
The DXFExportOptions type exposes the following members.
Methods
Name | Description
GetPredefinedOptions |  Returns an instance DXFExportOptions containing settings from a predefined export setup.
Top
See Also
Reference
DXFExportOptions Class
Autodesk.Revit.DB Namespace