Revit 2027 API
MEPNetworkSegmentId Methods
The MEPNetworkSegmentId type exposes the following members.
Methods
Name | Description
Dispose
IsValid |  Verifies if this is a valid segment id.
Top
See Also
Reference
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace