Revit 2027 API
RevitServerCollaborationNotAvailableException Methods
The RevitServerCollaborationNotAvailableException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerCollaborationNotAvailableException Class
Autodesk.Revit.Exceptions Namespace