Revit 2027 API
CentralModelAlreadyExistsException Class
Exception is thrown when the central model already exists at the specified location.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CentralModelAlreadyExistsException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class CentralModelAlreadyExistsException : CentralModelException
<SerializableAttribute>
Public Class CentralModelAlreadyExistsException
	Inherits CentralModelException
[SerializableAttribute]
public ref class CentralModelAlreadyExistsException : public CentralModelException
[<SerializableAttribute>]
type CentralModelAlreadyExistsException =
    class
        inherit CentralModelException
    end
The CentralModelAlreadyExistsException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace