Revit 2027 API
TextEditorOptions Methods
The TextEditorOptions type exposes the following members.
Methods
Name | Description
Dispose
GetTextEditorOptions |  Returns the current Revit instance's TextEditorOptions.
Top
See Also
Reference
TextEditorOptions Class
Autodesk.Revit.UI Namespace