Revit 2027 API
EditorInteraction Class
 Wraps the EditorInteractionType for the Pane to allow for clients to override their type dynamically if need be.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.EditorInteraction
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EditorInteraction
Public Class EditorInteraction
public ref class EditorInteraction
type EditorInteraction = class end
The EditorInteraction type exposes the following members.
Constructors
Name | Description
EditorInteraction() |  Construct a default interaction.
EditorInteraction(EditorInteractionType) |  Construct the interaction with the specified type.
Top
Properties
Name | Description
InteractionType |  The type of interaction.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace