Revit 2027 API
ViewSheetSet Properties
The ViewSheetSet type exposes the following members.
Properties
Name | Description
IsAutomatic |  Automatic order or manual order.
Name | The view sheet set name.
(Overrides Element.Name)
OrderedViewList |  Ordered views.
SheetOrganizationId | ElementId to the BrowserOrganization for sheets.
ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views.
Views | The views.
Top
See Also
Reference
ViewSheetSet Class
Autodesk.Revit.DB Namespace