Revit 2027 API
FabricSheetType Properties
The FabricSheetType type exposes the following members.
Properties
Name | Description
MajorDirectionWireType |  The id of the FabricWireType to be used in the major direction.
MajorEndOverhang |  The distance from the edge of the sheet to the last wire (measured in the major direction).
MajorLapSpliceLength |  The lap splice length in the major direction.
MajorLayoutPattern |  The layout pattern in the major direction.
MajorNumberOfWires |  The number of wires used in the major direction (includes the first and last wires).
MajorReinforcementArea |  The area of fabric divided by the spacing of the wire in the major direction. This method does not apply to custom fabric sheet
MajorSpacing |  The spacing between the wires in the major direction (not including the overhangs).
MajorStartOverhang |  The distance from the edge of the sheet to the first wire (measured in the major direction).
Material |  The id of the material assigned to wires.
MinorDirectionWireType |  The id of the FabricWireType to be used in the minor direction.
MinorEndOverhang |  The distance from the edge of the sheet to the last wire (measured in the minor direction).
MinorLapSpliceLength |  The lap splice length in the minor direction.
MinorLayoutPattern |  The layout pattern in the minor direction.
MinorNumberOfWires |  The number of wires used in the minor direction (includes the 1st and last wires).
MinorReinforcementArea |  The area of fabric divided by the spacing of the wire in the minor direction. This method does not apply to custom fabric sheet
MinorSpacing |  The spacing between the wires in the minor direction (not including the overhangs).
MinorStartOverhang |  The distance from the edge of the sheet to the first wire (measured in the minor direction).
OverallLength |  The length of the wire sheet (including overhangs) in the major direction.
OverallWidth |  The length of the wire sheet (including overhangs) in the minor direction.
SheetMass |  The sheet mass.
SheetMassUnit |  The sheet mass per area unit.
Top
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace