Revit 2027 API
StructuralSectionGeneralT Class
 Defines parameters for Tees shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralT : StructuralSectionHotRolled
Public Class StructuralSectionGeneralT
	Inherits StructuralSectionHotRolled
public ref class StructuralSectionGeneralT : public StructuralSectionHotRolled
type StructuralSectionGeneralT =
    class
        inherit StructuralSectionHotRolled
    end
The StructuralSectionGeneralT type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralT |  Creates a new instance of Tees shape.
Top
Properties
Name | Description
FlangeFillet |  Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet |  Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle |  Sloped flange angle. (rad)
SlopedWebAngle |  Sloped web angle. (rad)
TopWebFillet |  Top Web Fillet - fillet radius at the top of web.
WebToeOfFillet |  Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Top
Methods
Name | Description
GetFlangeThicknessInFlangeCenter |  Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInQuarterWidth |  Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm.
GetWebThicknessInHeightCenter |  Returns thickness of web measured in the 0.5 * height,
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace