Revit 2027 API
FamilyContextException Methods
The FamilyContextException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
FamilyContextException Class
Autodesk.Revit.Exceptions Namespace