Revit 2027 API
WireTypeSetIterator Methods
The WireTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
WireTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace