Revit 2027 API
IOException Class
The exception that is thrown when an I/O error occurs.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.IOException
 Autodesk.Revit.Exceptions.DirectoryNotFoundException
 Autodesk.Revit.Exceptions.FileAccessException
 Autodesk.Revit.Exceptions.FileNotFoundException
 Autodesk.Revit.Exceptions.InvalidDataStreamException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class IOException : ApplicationException
<SerializableAttribute>
Public Class IOException
	Inherits ApplicationException
[SerializableAttribute]
public ref class IOException : public ApplicationException
[<SerializableAttribute>]
type IOException =
    class
        inherit ApplicationException
    end
The IOException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace