Revit 2027 API
DuplicateTypeNamesHandlerArgs Methods
The DuplicateTypeNamesHandlerArgs type exposes the following members.
Methods
Name | Description
Dispose
GetTypeIds |  Returns ids of the types with duplicate names.
Top
See Also
Reference
DuplicateTypeNamesHandlerArgs Class
Autodesk.Revit.DB Namespace