Revit 2027 API
PrintSetting Properties
The PrintSetting type exposes the following members.
Properties
Name | Description
Name | Returns the Name of Print Setup.
(Overrides Element.Name)
PrintParameters | Returns the Parameters of Print Setup.
Top
See Also
Reference
PrintSetting Class
Autodesk.Revit.DB Namespace