Revit 2027 API
AssetPropertyInteger Methods
The AssetPropertyInteger type exposes the following members.
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
AssetPropertyInteger Class
Autodesk.Revit.DB.Visual Namespace