Revit 2027 API
AdvancedLossFactor Class
 This class encapsulates advanced lighting loss factor calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LossFactor
 Autodesk.Revit.DB.Lighting.AdvancedLossFactor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AdvancedLossFactor : LossFactor
Public Class AdvancedLossFactor
	Inherits LossFactor
public ref class AdvancedLossFactor : public LossFactor
type AdvancedLossFactor =
    class
        inherit LossFactor
    end
The AdvancedLossFactor type exposes the following members.
Constructors
Name | Description
AdvancedLossFactor() |  Creates an advanced loss factor object with values set to no loss.
AdvancedLossFactor(AdvancedLossFactor) |  Creates a copy of the given advanced loss factor object
AdvancedLossFactor(Double, Double, Double, Double, Double, Double, Double) |  Creates an advanced loss factor object with the given values.
Top
Properties
Name | Description
BallastLossFactor |  The ballast loss factor.
LampLumenDepreciation |  The lamp lumen depreciation loss factor.
LampTiltLossFactor |  The lamp tilt loss factor.
LuminaireDirtDepreciation |  The luminaire dirt depreciation loss factor.
SurfaceDepreciationLossFactor |  The surface depreciation loss factor.
TemperatureLossFactor |  The temperature loss factor.
VoltageLossFactor |  The voltage loss factor.
Top
Methods
Name | Description
Top
Remarks
 Advanced lighting loss factor is a combination of several different factors. Each factor has a value of 0.0 (total loss) to 1.0 (no loss).
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace