Revit 2027 API
FilteredWorksetCollector Class
 This class is used to search, filter and iterate through a set of worksets.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredWorksetCollector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilteredWorksetCollector : IEnumerable<Workset>,
	IDisposable
Public Class FilteredWorksetCollector
	Implements IEnumerable(Of Workset), IDisposable
public ref class FilteredWorksetCollector : IEnumerable<Workset^>,
	IDisposable
type FilteredWorksetCollector =
    class
        interface IEnumerable<Workset>
        interface IDisposable
    end
The FilteredWorksetCollector type exposes the following members.
Constructors
Name | Description
FilteredWorksetCollector |  Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilteredWorksetCollector
FirstWorkset |  Returns the first workset to pass the filter(s).
FirstWorksetId |  Returns the id of the first workset to pass the filter(s).
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetWorksetIdIterator |  Returns a FilteredWorksetIdIterator to the worksets passing the current filter.
GetWorksetIterator |  Returns a FilteredWorksetIterator to the worksets passing the current filter.
OfKind |  Applies a WorksetKindFilter to the collector.
ToWorksetIds |  Returns the complete set of workset ids that pass the filter(s).
ToWorksets |  Returns the complete set of worksets that pass the filter(s).
WherePasses |  Applies a workset filter to the collector.
Top
Remarks
Developers can assign a condition to filter the worksets that are returned. If no condition is applied, it attempts to access all the worksets in the document.
The collector will reset if you call another method to extract worksets. Thus, if you have previously obtained an iterator, it will be stopped and traverse no more worksets if you call another method to extract worksets.
See Also
Reference
Autodesk.Revit.DB Namespace