Revit 2027 API
ViewPlan Properties
The ViewPlan type exposes the following members.
Properties
Name | Description
AreaScheme | The area scheme.
Top
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace