Revit 2027 API
FabricationSaveJobOptions Methods
The FabricationSaveJobOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace