Revit 2027 API
InitialIntensity Methods
The InitialIntensity type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the InitialIntensity derived object.
Dispose
Top
See Also
Reference
InitialIntensity Class
Autodesk.Revit.DB.Lighting Namespace