Revit 2027 API
DuctFittingAndAccessoryPressureDropData Methods
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
GetDuctFittingAndAccessoryData |  Returns the fitting and accessory information.
GetPresureDropItems |  Returns the pressure drop items.
SetDefaultEntity |  Stores the default entity in the data.
Top
See Also
Reference
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace