Revit 2027 API
AddInId Class
 Identifies an AddIn registered with Revit
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AddInId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AddInId : IDisposable
Public Class AddInId
	Implements IDisposable
public ref class AddInId : IDisposable
type AddInId =
    class
        interface IDisposable
    end
The AddInId type exposes the following members.
Constructors
Name | Description
AddInId |  creates an AddInId object with a given GUID
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AddInId
GetAddInName |  name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns
GetAddInNameFromDocument |  name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
GetGUID |  value of the AddInId as a GUID
Top
See Also
Reference
Autodesk.Revit.DB Namespace