Revit 2027 API
TilePatterns Methods
The TilePatterns type exposes the following members.
Methods
Name | Description
GetTilePattern |  Retrieve a TilePattern object from a built-in type.
Top
See Also
Reference
TilePatterns Class
Autodesk.Revit.DB Namespace