Revit 2027 API
View3D Properties
The View3D type exposes the following members.
Properties
Name | Description
IsLocked |  Indicates if the view is locked.
IsPerspective |  Identifies whether this is a perspective view.
IsSectionBoxActive |  Identifies whether or not the section box is active in this 3D view.
ProjectGridsOnSectionBox |  This option projects all grids from the current 3d view on the bottom face of the section box. Only grids that are inside or intersects the section box
Top
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace