Revit 2027 API
AnalyticalTransformerData Properties
The AnalyticalTransformerData type exposes the following members.
Properties
Name | Description
ApparentPowerRating |  The apparent power rating value of the analytical transformer.
SecondaryDistributionSystem |  The secondary distribution system of the analytical transformer.
Top
See Also
Reference
AnalyticalTransformerData Class
Autodesk.Revit.DB.Electrical Namespace