Revit 2027 API
BasePoint Properties
The BasePoint type exposes the following members.
Properties
Name | Description
Clipped |  Clipped state of the survey point (shared BasePoint). Change its state to clipped or unclipped, depending on how you want to move the survey point. To move the survey coordinate system in relation to the model, move the clipped survey point. To change the survey point to another location in the survey coordinate system, move the unclipped survey point. For project base point (non-shared BasePoint), this property will always return false. Trying to set the property will get an InvalidOperationException.
IsShared |  Indicates whether the BasePoint is shared. The project's survey point is a BasePoint which is shared.
Position |  Position of the BasePoint.
SharedPosition |  Shared position of the BasePoint based on the active ProjectLocation of its belonging Document. To get the shared position under other ProjectLocations, please use ProjectLocation.GetProjectPosition(BasePoint.Position).
Top
See Also
Reference
BasePoint Class
Autodesk.Revit.DB Namespace