Revit 2027 API
ElementTypeDuplicatedEventArgs Properties
The ElementTypeDuplicatedEventArgs type exposes the following members.
Properties
Name | Description
NewElementTypeId |  The id of the newly duplicated ElementType.
NewName |  The name of the newly duplicated ElementType.
OriginalElementTypeId |  The id of the element type that is duplicated.
Top
See Also
Reference
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace