Revit 2027 API
MacroModuleIterator Class
 An iterator to the Macros in a MacroModule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.MacroModuleIterator
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MacroModuleIterator : IEnumerator<Macro>
Public Class MacroModuleIterator
	Implements IEnumerator(Of Macro)
public ref class MacroModuleIterator : IEnumerator<Macro^>
type MacroModuleIterator =
    class
        interface IEnumerator<Macro>
    end
The MacroModuleIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MacroModuleIterator
GetCurrent |  Returns the current Macro.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace