Revit 2027 API
FamilyLoadingIntoDocumentEventArgs Properties
The FamilyLoadingIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
FamilyName |  The file name of the family that is being loaded into the document.
FamilyPath |  The file path of the family that is being loaded into the document.
Top
See Also
Reference
FamilyLoadingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace