Revit 2027 API
HostObjectSubcomponentInfo Class
 A class that contains roof or floor slab information, calculated by ExporterIFCUtils.ComputeSubcomponents().
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HostObjectSubcomponentInfo : IDisposable
Public Class HostObjectSubcomponentInfo
	Implements IDisposable
public ref class HostObjectSubcomponentInfo : IDisposable
type HostObjectSubcomponentInfo =
    class
        interface IDisposable
    end
The HostObjectSubcomponentInfo type exposes the following members.
Properties
Name | Description
AreaOfCurveLoop |  The area of the CurveLoop of the roof or floor slab.
Depth |  The depth of the roof or floor slab.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LoopFace |  The face of the loops of the roof or floor slab.
Top
Methods
Name | Description
Dispose | Releases all resources used by the HostObjectSubcomponentInfo
GetCurveLoop |  Gets the CurveLoop representing the base profile curve loop of the roof or floor slab
GetPlane |  Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.
Top
Remarks
 A slab is an extrusion with one outer and no inner base profile curve loops, created by extruding the base profile loop in the direction Plane.Normal a distance given by the Depth value.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace