Revit 2027 API
PhaseFilter Class
 Represents an phase filter within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.PhaseFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PhaseFilter : Element
Public Class PhaseFilter
	Inherits Element
public ref class PhaseFilter : public Element
type PhaseFilter =
    class
        inherit Element
    end
The PhaseFilter type exposes the following members.
Properties
Name | Description
IsDefault |  Indicates whether this filter is the default one.
Top
Methods
Name | Description
Create |  Creates a new phase filter with default status presentation.
GetPhaseStatusPresentation |  Gets the phase status presentation.
SetPhaseStatusPresentation |  Sets the phase status presentation.
Top
See Also
Reference
Autodesk.Revit.DB Namespace