Revit 2027 API
TemporaryGraphicsManager Methods
The TemporaryGraphicsManager type exposes the following members.
Methods
Name | Description
AddControl |  Creates an in-canvas control.
Clear |  Clear all temporary graphics objects managed by this manager.
Dispose
GetAll |  Returns all temporary graphics object indexes managed by this manager.
GetTemporaryGraphicsManager |  Gets a TemporaryGraphicsManager reference of the document.
RemoveControl |  Deletes the existing control identified by the unique index.
SetTooltip |  Sets the tooltip for the temporary graphics object.
SetVisibility |  Changes the visibility of temporary graphics object.
UpdateControl |  Updates the in-canvas control identified by the unique index.
Top
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace