Revit 2027 API
AnalyticalPowerSourceData Properties
The AnalyticalPowerSourceData type exposes the following members.
Properties
Name | Description
ApparentPowerRating |  The apparent power rating value of the analytical power source.
TotalConnectedCurrent |  The total connected current of the analytical power source.
Top
See Also
Reference
AnalyticalPowerSourceData Class
Autodesk.Revit.DB.Electrical Namespace