Revit 2027 API
ComboBoxData Class
This class contains information necessary to construct a combo box in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ComboBoxData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComboBoxData : RibbonItemData
Public Class ComboBoxData
	Inherits RibbonItemData
public ref class ComboBoxData : public RibbonItemData
type ComboBoxData =
    class
        inherit RibbonItemData
    end
The ComboBoxData type exposes the following members.
Constructors
Name | Description
ComboBoxData | Constructs a new instance of ComboBoxData.
Top
Properties
Name | Description
Image | The image shown on the ComboBox.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace