Revit 2027 API
VertexBuffer Class
 A buffer that stores vertex data for rendering.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexBuffer
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexBuffer : IDisposable
Public Class VertexBuffer
	Implements IDisposable
public ref class VertexBuffer : IDisposable
type VertexBuffer =
    class
        interface IDisposable
    end
The VertexBuffer type exposes the following members.
Constructors
Name | Description
VertexBuffer |  Constructs the vertex buffer with the given capacity, measured in floats.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the VertexBuffer
GetMappedHandle |  Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
GetVertexStreamPosition |  Gets a stream that can be used to write vertices of type VertexPosition into the buffer.
GetVertexStreamPositionColored |  Gets a stream that can be used to write vertices of type VertexPositionColored into the buffer.
GetVertexStreamPositionNormal |  Gets a stream that can be used to write vertices of type VertexPositionNormal into the buffer.
GetVertexStreamPositionNormalColored |  Gets a stream that can be used to write vertices of type VertexPositionNormalColored into the buffer.
IsValid |  Tests whether the buffer is valid for rendering.
Map |  Maps a portion of the buffer into memory, so that vertex data can be written into it. (see VertexStream).
Unmap |  Unmaps the buffer, so that it can be used for rendering.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace