Revit 2027 API
PlanTopology Class
An object that represents a Plan Topology within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PlanTopology
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PlanTopology : APIObject
Public Class PlanTopology
	Inherits APIObject
public ref class PlanTopology : public APIObject
type PlanTopology =
    class
        inherit APIObject
    end
The PlanTopology type exposes the following members.
Properties
Name | Description
Circuits | The Circuits of the PlanTopology.
Level | The Level of the PlanTopology.
Phase | The phase of the PlanTopology.
Top
Methods
Name | Description
GetRoomIds | Retrieves room ElementIds of the PlanTopology in the last phase.
Top
Remarks
This object derived from the APIObject base object. It can be used access the properties of a Plan Topology.
See Also
Reference
Autodesk.Revit.DB Namespace