Revit 2027 API
ConductorMaterial Methods
The ConductorMaterial type exposes the following members.
Methods
Name | Description
Create |  Creates a Conductor Material.
Dispose
GetConductorMaterial |  Gets the Conductor Material data by given Conductor Material id.
GetConductorMaterialIdByName |  Gets the Conductor Material id by given Conductor Material name.
GetConductorMaterialIds |  Gets all the Conductor Material ids in the given document, sorted by name.
Top
See Also
Reference
ConductorMaterial Class
Autodesk.Revit.DB.Electrical Namespace