Revit 2027 API
FailureDefinitionRegistry Methods
The FailureDefinitionRegistry type exposes the following members.
Methods
Name | Description
Dispose
FindFailureDefinition |  Finds a specific FailureDefinition by a given FailureDefinitionId.
ListAllFailureDefinitions |  Retrieves all the registered FailureDefinitions.
Top
See Also
Reference
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace