Revit 2027 API
PostPattern Class
 Post pattern class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.PostPattern
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PostPattern : IDisposable
Public Class PostPattern
	Implements IDisposable
public ref class PostPattern : IDisposable
type PostPattern =
    class
        interface IDisposable
    end
The PostPattern type exposes the following members.
Properties
Name | Description
CornerPost |  Accesses the object containing properties related to the corner post.
CornerPostAngle |  The angle between neighboring railing segments which conditions inserting post along a railing path.
CornerPostCondition |  The condition which controls the insertion of corner posts.
EndPost |  Accesses the object containing properties related to the end post.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StartPost |  Accesses the object containing properties related to the start post.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PostPattern
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace