Revit 2027 API
EdgeEndPoint Class
 Represents the start or the end point of an Edge.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EdgeEndPoint
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EdgeEndPoint : IDisposable
Public Class EdgeEndPoint
	Implements IDisposable
public ref class EdgeEndPoint : IDisposable
type EdgeEndPoint =
    class
        interface IDisposable
    end
The EdgeEndPoint type exposes the following members.
Constructors
Name | Description
EdgeEndPoint |  Constructs an instance of EdgeEndPoint.
Top
Properties
Name | Description
Edge |  The Edge.
Index |  The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the EdgeEndPoint
Equals(EdgeEndPoint) |  Determines whether this EdgeEndPoint is equal to another.
Evaluate |  Evaluate the end point of the edge in 3d coordinates.
Top
See Also
Reference
Autodesk.Revit.DB Namespace