Revit 2027 API
UIApplication Methods
The UIApplication type exposes the following members.
Methods
Name | Description
CanPostCommand |  Identifies if the given command can be posted, using PostCommand(RevitCommandId).
CreateAddInCommandBinding | Creates a new AddInCommandBinding.
CreateRibbonPanel(String) |  Create a new RibbonPanel on the Add-Ins tab.
CreateRibbonPanel(String, String) |  Create a new RibbonPanel on the specified tab.
CreateRibbonPanel(Tab, String) |  Create a new RibbonPanel on the designated standard Revit tab.
CreateRibbonTab |  Creates a new tab on the Revit user interface.
Dispose
DoDragDrop(ICollection<String>) | Initiates a drag and drop operation of a collection of file names on the Revit user interface.
DoDragDrop(Object, IDropHandler) | Initiates a drag and drop operation with a custom drop implementation.
GetDockablePane | Gets a DockablePane object by its ID.
GetRibbonPanels() |  Get all the custom Panels on Add-Ins tab of Revit.
GetRibbonPanels(String) |  Get all the custom Panels on a designated Revit tab.
GetRibbonPanels(Tab) |  Get all the custom Panels on a designated standard Revit tab.
LoadAddIn | Loads add-ins from the given manifest file.
LoadPackageContents | Loads add-ins from the given packageContents.xml file.
OpenAndActivateDocument(String) |  Opens and activates a Revit document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean) |  Opens and activates a Revit document, include both local document or cloud document.
OpenAndActivateDocument(ModelPath, OpenOptions, Boolean, IOpenFromCloudCallback) |  Opens and activates a Revit document, include both local document or cloud document.
PostCommand |  Posts the command to the Revit message queue to be invoked when control returns from the current API context.
RegisterContextMenu | Adds a new context menu creator.
RegisterDockablePane | Adds a new dockable pane to the Revit user interface.
RemoveAddInCommandBinding | Removes an AddInCommandBinding.
Top
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace