Revit 2027 API
DirectoryNotEmptyException Methods
The DirectoryNotEmptyException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
DirectoryNotEmptyException Class
Autodesk.Revit.Exceptions Namespace