Revit 2027 API
BalusterPlacement Class
 A class which contains information regarding baluster and post placement for a given railing type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.BalusterPlacement
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BalusterPlacement : IDisposable
Public Class BalusterPlacement
	Implements IDisposable
public ref class BalusterPlacement : IDisposable
type BalusterPlacement =
    class
        interface IDisposable
    end
The BalusterPlacement type exposes the following members.
Properties
Name | Description
BalusterPattern |  Accesses the object containing properties related to the baluster pattern.
BalusterPerTreadFamilyId |  The id of baluster per tread family.
BalusterPerTreadNumber |  The number of balusters per tread.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PostPattern |  Accesses the object containing properties related to the post pattern.
UseBalusterPerTreadOnStairs |  If true, one or more balusters will be included on each tread of an associated stair. If false, this is not guaranteed to happen.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BalusterPlacement
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace