Revit 2027 API
SlabEdge Methods
The SlabEdge type exposes the following members.
Methods
Name | Description
AddSegment | Add segments to the slab edge.
(Overrides HostedSweep.AddSegment(Reference))
Top
See Also
Reference
SlabEdge Class
Autodesk.Revit.DB Namespace