Revit 2027 API
PointNode Methods
The PointNode type exposes the following members.
Methods
Name | Description
GetPoint |  Returns the point object corresponding to the node.
Top
See Also
Reference
PointNode Class
Autodesk.Revit.DB Namespace