Revit 2027 API
FileExportingEventArgs Class
 The event arguments used by the FileExporting event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.FileExportingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FileExportingEventArgs : RevitAPIPreDocEventArgs
Public Class FileExportingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class FileExportingEventArgs : public RevitAPIPreDocEventArgs
type FileExportingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The FileExportingEventArgs type exposes the following members.
Properties
Name | Description
BackgroundOperation |  Identifies whether the event belongs to a background export operation.
Format |  Identifies the export format, e.g. DWG or image.
Path |  The target path for the export.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace