Revit 2027 API
HVACLoadType Properties
The HVACLoadType type exposes the following members.
Properties
Name | Description
AirChangesPerHour |  The air changes per hour.
AreaPerPerson |  The area per person.
CoolingSetPoint |  The cooling temperature set point in unit Kelvin (K).
DehumidificationSetPoint |  The dehumidification set point as a number between 0 and 1.
HeatingSetPoint |  The heating temperature set point in unit Kelvin (K).
HumidificationSetPoint |  The humidification set point as a number between 0 and 1.
LatentHeatGainPerPerson |  The latent heat gain per person.
LightingLoadDensity |  The lighting load density.
OutdoorAirFlowStandard |  The outdoor airflow standard.
OutdoorAirPerArea |  The outdoor air per area.
OutdoorAirPerPerson |  The outdoor air per person.
PlenumLighting |  The percentage of plenum lighting contribution.
PowerLoadDensity |  The power load density.
SensibleHeatGainPerPerson |  The sensible heat gain per person.
Top
See Also
Reference
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace