Revit 2027 API
MEPBuildingConstruction Class
Construction definition for Project Information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPBuildingConstruction : ElementType
Public Class MEPBuildingConstruction
	Inherits ElementType
public ref class MEPBuildingConstruction : public ElementType
type MEPBuildingConstruction =
    class
        inherit ElementType
    end
The MEPBuildingConstruction type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetBuildingConstruction | Gets the current Building Construction from the project information.
GetBuildingConstructionOverride | Gets the Building Construction override for a ConstructionType.
GetConstructions | Gets all the Building Constructions corresponding to the specific Construction type.
SetBuildingConstruction | Sets the Building Construction of the Project Information.
SetBuildingConstructionOverride | Sets the Building Construction override for a ConstructionType.
Top
Remarks
This is used to define the information in Constructions.xml.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace