Revit 2027 API
ElementStructuralTypeFilter Properties
The ElementStructuralTypeFilter type exposes the following members.
Properties
Name | Description
StructuralType |  The structural type.
Top
See Also
Reference
ElementStructuralTypeFilter Class
Autodesk.Revit.DB Namespace