Revit 2027 API
AssetPropertyReference Class
 Represents a connected property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyReference
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyReference : AssetProperty
Public Class AssetPropertyReference
	Inherits AssetProperty
public ref class AssetPropertyReference : public AssetProperty
type AssetPropertyReference =
    class
        inherit AssetProperty
    end
The AssetPropertyReference type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace