Revit 2027 API
AppearanceAssetElement Class
 An element that contains a rendering asset used as a portion of a material definition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.AppearanceAssetElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AppearanceAssetElement : Element
Public Class AppearanceAssetElement
	Inherits Element
public ref class AppearanceAssetElement : public Element
type AppearanceAssetElement =
    class
        inherit Element
    end
The AppearanceAssetElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new AppearanceAssetElement from an existing rendering asset.
Duplicate |  Duplicates the appearance asset element.
GetAppearanceAssetElementByName |  Gets an AppearanceAssetElement by name.
GetRenderingAsset |  Gets the rendering asset for the appearance asset element.
SetRenderingAsset |  Sets the rendering asset for the appearance asset element.
Top
See Also
Reference
Autodesk.Revit.DB Namespace