Revit 2027 API
TransferredProjectStandardsEventArgs Methods
The TransferredProjectStandardsEventArgs type exposes the following members.
Methods
Name | Description
GetSelectedExternalItems |  Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog.
Top
See Also
Reference
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace