Revit 2027 API
DoubleParameterValue Properties
The DoubleParameterValue type exposes the following members.
Properties
Name | Description
Value |  The stored value
Top
See Also
Reference
DoubleParameterValue Class
Autodesk.Revit.DB Namespace