Revit 2027 API
BuildingPadType Class
 Represents a specific type of Building Pad.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.BuildingPadType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BuildingPadType : HostObjAttributes
Public Class BuildingPadType
	Inherits HostObjAttributes
public ref class BuildingPadType : public HostObjAttributes
type BuildingPadType =
    class
        inherit HostObjAttributes
    end
The BuildingPadType type exposes the following members.
Properties
Name | Description
ThermalProperties |  The calculated and settable thermal properties of the BuildingPadType
Top
Methods
Name | Description
CreateDefault |  Creates a BuildingPadType element and adds it to the document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace