Revit 2027 API
WireSetIterator Properties
The WireSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
WireSetIterator Class
Autodesk.Revit.DB.Electrical Namespace