Revit 2027 API
RoomFilter Class
 A filter used to match rooms.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Architecture.RoomFilter
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoomFilter : ElementSlowFilter
Public Class RoomFilter
	Inherits ElementSlowFilter
public ref class RoomFilter : public ElementSlowFilter
type RoomFilter =
    class
        inherit ElementSlowFilter
    end
The RoomFilter type exposes the following members.
Constructors
Name | Description
RoomFilter |  Constructs a filter which matches only rooms.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
Example
// Use a RoomFilter to find all room elements in the document. It is necessary to use the RoomFilter,
// and not an ElementClassFilter or the shortcut method OfClass() because the Room class is not
// supported by those methods.
RoomFilter filter = new RoomFilter();
// Apply the filter to the elements in the active document
FilteredElementCollector collector = new FilteredElementCollector(document);
IList<Element> rooms = collector.WherePasses(filter).ToElements();
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace