Revit 2027 API
RoomTag Class
Provides access to the room tag in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementTag
 Autodesk.Revit.DB.Architecture.RoomTag
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoomTag : SpatialElementTag
Public Class RoomTag
	Inherits SpatialElementTag
public ref class RoomTag : public SpatialElementTag
type RoomTag =
    class
        inherit SpatialElementTag
    end
The RoomTag type exposes the following members.
Properties
Name | Description
IsInRoom | Identifies if the tag is located in a room.
Room | The room that the tag is associated with.
RoomTagType | The tag type.
TaggedLocalRoomId | The ElementId of the tagged room.
TaggedRoomId | The LinkElementId of the tagged room.
Top
Methods
Name | Description
Top
Example
private void Getinfo_RoomTag(RoomTag roomTag)
{
    string message = "Room Tag : ";
    //get the location of the roomtag
    LocationPoint location = roomTag.Location as LocationPoint;
    XYZ point = location.Point;
    message += "\nRoomTag location: (" + point.X + ", " +
                   point.Y + ", " + point.Z + ")";
    //get the name of the roomTag
    message += "\nName: " + roomTag.Name;
    //get the room that the tag is associated with
    Room room = roomTag.Room;
    message += "\nThe number of the room is : " + room.Number;
    //get the view in which the tag is placed
    Autodesk.Revit.DB.View view = roomTag.View;
    if (null != view)
    {
        message += "\nView Name: " + view.Name;
    }
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace