Revit 2027 API
ReinforcementRoundingManager Class
 A base class providing access to reinforcement rounding overrides for structural elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
 Autodesk.Revit.DB.Structure.FabricRoundingManager
 Autodesk.Revit.DB.Structure.RebarRoundingManager
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReinforcementRoundingManager : IDisposable
Public Class ReinforcementRoundingManager
	Implements IDisposable
public ref class ReinforcementRoundingManager : IDisposable
type ReinforcementRoundingManager =
    class
        interface IDisposable
    end
The ReinforcementRoundingManager type exposes the following members.
Properties
Name | Description
Element |  The owner of the reinforcement rounding overrides.
IsActiveOnElement |  Defines whether reinforcement rounding is activated for the particular element.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReinforcementRoundingManager
GetLengthUnitTypeId |  Gets the identifier of the length unit quantifying the reinforcement rounding values.
Top
Remarks
 Subclasses of this class are used to access the override settings for Rebar elements and types or Fabric elements and types.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace