Revit 2027 API
SweptProfile Class
 Represents an extruded profile swept along a driving curve.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SweptProfile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SweptProfile : IDisposable
Public Class SweptProfile
	Implements IDisposable
public ref class SweptProfile : IDisposable
type SweptProfile =
    class
        interface IDisposable
    end
The SweptProfile type exposes the following members.
Properties
Name | Description
EndSetBack |  The distance from the end of the driving curve to the point where the sweep actually ends.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StartSetBack |  The distance from the start of the driving curve to the point where the sweep actually begins.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SweptProfile
GetDrivingCurve |  Provides access to the curve that dictates the path of the swept profile.
GetSweptProfile |  Returns an object that describes the profile that is swept along the driving curve.
Top
Remarks
 Elements such as beams may be formed from a profile that has been swept along a curve. This class represents such a form and is used to access the cross section and the underlying curve that make up the Element.
See Also
Reference
Autodesk.Revit.DB Namespace