Revit 2027 API
GuidEnum Class
 Base class of all GUID-based enum classes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GuidEnum
Public Class GuidEnum
public ref class GuidEnum
type GuidEnum = class end
The GuidEnum type exposes the following members.
Constructors
Name | Description
GuidEnum |  Creates an Guid-based enum instance with the supplied name and GUID. GUID-based enum instance can be compared by this guid value.
Top
Properties
Name | Description
Guid |  The Guid of GUID-based enum object.
Top
Methods
Name | Description
Equals |  Compares two Guid-based enum object based on their concrete class and GUID value.
(Overrides Object.Equals(Object))
GetHashCode |  Generates a hash code for this Guid-based enum object.
(Overrides Object.GetHashCode())
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType
 Autodesk.Revit.DB.ExternalResourceType
 Autodesk.Revit.DB.ExternalService.ExternalServiceId
 Autodesk.Revit.DB.FailureDefinitionId
 Autodesk.Revit.DB.NumberingSchemaType
 Autodesk.Revit.DB.PerformanceAdviserRuleId
 Autodesk.Revit.UI.DockablePaneId
 Autodesk.Revit.UI.ExternalDataManagerCommandId