Revit 2027 API
ParameterValue Class
 A class that holds a value of a parameter element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ParameterValue : IDisposable
Public Class ParameterValue
	Implements IDisposable
public ref class ParameterValue : IDisposable
type ParameterValue =
    class
        interface IDisposable
    end
The ParameterValue type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Copy |  Makes an identical copy of the given parameter value.
Dispose | Releases all resources used by the ParameterValue
IsEqual |  Tests equality with another instance of the same class.
IsSameType |  Tests another instance is of the same value type.
Top
Remarks
 This is a non-instantiable base class. Classes that actually store a value of a certain type are all derived from this base class, once class per each value type.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.DoubleParameterValue
 Autodesk.Revit.DB.ElementIdParameterValue
 Autodesk.Revit.DB.IntegerParameterValue
 Autodesk.Revit.DB.NullParameterValue
 Autodesk.Revit.DB.StringParameterValue