Revit 2027 API
ComboBoxMember Class
This class represents an item in the drop-down list of a ComboBox.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.ComboBoxMember
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComboBoxMember : RibbonItem
Public Class ComboBoxMember
	Inherits RibbonItem
public ref class ComboBoxMember : public RibbonItem
type ComboBoxMember =
    class
        inherit RibbonItem
    end
The ComboBoxMember type exposes the following members.
Properties
Name | Description
GroupName | The group to which the ComboBoxMember is assigned.
Image | The image shown on the ComboBoxMember.
Top
Methods
Name | Description
Top
Remarks
Note that a ComboBoxMember will not show an individual tool tip. Use of this class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace