Revit 2027 API
IndexPoint Properties
The IndexPoint type exposes the following members.
Properties
Name | Description
Index |  The index of the point's vertex.
Top
See Also
Reference
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace