Revit 2027 API
DisabledDisciplineException Class
The exception that is thrown when the function cannot execute because a discipline is disabled. The exception specifies which discipline(s) would let the operation succeed.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.DisabledDisciplineException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class DisabledDisciplineException : InvalidOperationException
<SerializableAttribute>
Public Class DisabledDisciplineException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class DisabledDisciplineException : public InvalidOperationException
[<SerializableAttribute>]
type DisabledDisciplineException =
    class
        inherit InvalidOperationException
    end
The DisabledDisciplineException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace