Revit 2027 API
TextBoxData Class
This class contains information necessary to construct a text box in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.TextBoxData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextBoxData : RibbonItemData
Public Class TextBoxData
	Inherits RibbonItemData
public ref class TextBoxData : public RibbonItemData
type TextBoxData =
    class
        inherit RibbonItemData
    end
The TextBoxData type exposes the following members.
Constructors
Name | Description
TextBoxData | Constructs a new instance of TextBoxData.
Top
Properties
Name | Description
Image | The image of the TextBox.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace