Revit 2027 API
MEPHiddenLineSettings Class
 Represents the settings contained in the document associated to the MEP hidden line display.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPHiddenLineSettings : Element
Public Class MEPHiddenLineSettings
	Inherits Element
public ref class MEPHiddenLineSettings : public Element
type MEPHiddenLineSettings =
    class
        inherit Element
    end
The MEPHiddenLineSettings type exposes the following members.
Properties
Name | Description
DrawHiddenLine |  Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines.
InsideGap |  The gap for the lines that appear within a crossing segment.
LineStyle |  The line style that determines how the lines of a hidden segment display at the point where the segments cross.
OutsideGap |  The gap for the lines that appear external to the crossing segments.
SingleLineGap |  The gap for the single hidden lines where segments cross.
Top
Methods
Name | Description
GetMEPHiddenLineSettings |  Gets the MEP hidden line settings in the document.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace