Revit 2027 API
DimensionSegment Class
 A segment of a dimension within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DimensionSegment
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DimensionSegment : APIObject
Public Class DimensionSegment
	Inherits APIObject
public ref class DimensionSegment : public APIObject
type DimensionSegment =
    class
        inherit APIObject
    end
The DimensionSegment type exposes the following members.
Properties
Name | Description
Above | The text shown above the segment's value.
Below | The text shown below the segment's value.
IsLocked |  Indicates if this segment is locked.
LeaderEndPosition | The position of the dimension leader end point.
Origin |  The segment origin.
Prefix | The text shown before the segment's value.
Suffix | The text shown after the segment's value.
TextPosition | The position of the dimension text's drag point.
Value |  The length of the segment.
ValueOverride | The text that replaces the segment's value.
ValueString |  The displayed value shown for the dimension segment.
Top
Methods
Name | Description
IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
ResetTextPosition | Resets the text position of the segment to the initial position determined by its type and parameters.
Top
See Also
Reference
Autodesk.Revit.DB Namespace