Revit 2027 API
ViewPosition Methods
The ViewPosition type exposes the following members.
Methods
Name | Description
Create |  Creates a new view position element.
GetPlacedViewportIdsForViewPosition |  Gets the placed viewport ids for the view position.
Top
See Also
Reference
ViewPosition Class
Autodesk.Revit.DB Namespace