Revit 2027 API
SymbolicCurveArrayIterator Class
An iterator to a model curve array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SymbolicCurveArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class SymbolicCurveArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class SymbolicCurveArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class SymbolicCurveArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type SymbolicCurveArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The SymbolicCurveArrayIterator type exposes the following members.
Constructors
Name | Description
SymbolicCurveArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace