Revit 2027 API
RebarSpliceByRulesResult Methods
The RebarSpliceByRulesResult type exposes the following members.
Methods
Name | Description
Dispose
GetSpliceGeometries |  Gets the RebarSpliceGeometry collection which is the result of the splice by rules operation.
Top
See Also
Reference
RebarSpliceByRulesResult Class
Autodesk.Revit.DB.Structure Namespace