Revit 2027 API
StructuralSectionConcreteCross Properties
The StructuralSectionConcreteCross type exposes the following members.
Properties
Name | Description
CantileverHeight |  Flange cantilever thickness.
CantileverLength |  Flange cantilever length.
Top
See Also
Reference
StructuralSectionConcreteCross Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace