Revit 2027 API
ViewPosition Class
 This class represents the view position element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ViewPosition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewPosition : Element
Public Class ViewPosition
	Inherits Element
public ref class ViewPosition : public Element
type ViewPosition =
    class
        inherit Element
    end
The ViewPosition type exposes the following members.
Properties
Name | Description
Position |  Specifies view's position.
ViewAnchor |  Specifies the method by which the view will be positioned on the sheet. Default is set to ViewAnchor.ViewOrigin.
Top
Methods
Name | Description
Create |  Creates a new view position element.
GetPlacedViewportIdsForViewPosition |  Gets the placed viewport ids for the view position.
Top
See Also
Reference
Autodesk.Revit.DB Namespace