Revit 2027 API
StructuralSectionISlopedFlange Class
 Defines parameters for I-shape Sloped Flange structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionISlopedFlange : StructuralSectionGeneralI
Public Class StructuralSectionISlopedFlange
	Inherits StructuralSectionGeneralI
public ref class StructuralSectionISlopedFlange : public StructuralSectionGeneralI
type StructuralSectionISlopedFlange =
    class
        inherit StructuralSectionGeneralI
    end
The StructuralSectionISlopedFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionISlopedFlange |  Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace