Revit 2027 API
CompoundStructure Methods
The CompoundStructure type exposes the following members.
Methods
Name | Description
AddWallSweep |  Adds a new wall sweep or reveal to the compound structure.
AssociateRegionWithLayer |  Associates a region with a layer.
CanLayerBeStructuralMaterial |  Identifies if the input layer can be designated as defining the structural material for this structure.
CanLayerBeVariable |  Identifies if the input layer can be designated as a variable thickness layer.
CanLayerWidthBeNonZero |  Identifies if changing the width of an existing layer from zero to a positive value will create a rectangular region.
CanSplitAndMergeRegionsBeUsed |  Checks whether split and merge regions operations can be used for this compound structure.
ChangeRegionWidth |  Adjust the width of an existing simple region.
ClearWallSweeps |  Removes all sweeps or reveals from the compound structure.
CreateSimpleCompoundStructure |  Creates a non-vertically compound structure comprised of parallel layers.
CreateSingleLayerCompoundStructure(MaterialFunctionAssignment, Double, ElementId) |  Creates a CompoundStructure containing a single layer.
CreateSingleLayerCompoundStructure(Double, MaterialFunctionAssignment, Double, ElementId) |  Creates a vertically compound CompoundStructure with one layer.
DeleteLayer |  Deletes the specified layer from this CompoundStructure.
Dispose
FindEnclosingRegionAndSegments |  Given a pair of grid coordinates, and a direction for splitting, returns the enclosing region and the two segments intersected by a line through the grid point.
GetAdjacentRegions |  Gets the ids of region bound to a specified segment.
GetCoreBoundaryLayerIndex |  Returns the index of the layer just below the core boundary.
GetDeckEmbeddingType |  Retrieves the deck embedding type used for the specified structural deck.
GetDeckProfileId |  Retrieves the profile loop used for the specified structural deck.
GetExtendableRegionIds |  Gets the extendable region ids for the compound structure.
GetFirstCoreLayerIndex |  Gets the index of the first core layer.
GetLastCoreLayerIndex |  Gets the index of the last core layer.
GetLayerAssociatedToRegion |  Gets the layer associated to a particular region.
GetLayerFunction |  Retrieves the function of the specified layer.
GetLayerPriority |  Retrieves the priority of the specified layer. Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
GetLayers |  A copy of the layers which define this compound structure.
GetLayerWidth |  Retrieves the width of a specified layer.
GetMaterialId |  Retrieves the material element id of a specified layer.
GetMinimumLayerThickness |  Get the minimum allowable layer thickness.
GetNumberOfShellLayers |  Retrieves the number of interior or exterior shell layers.
GetOffsetForLocationLine |  Returns the offset from the center of the compound structure to the given location line value.
GetPreviousNonZeroLayerIndex |  Returns the index of the nearest non-zero width layer before this layer.
GetRegionEnvelope |  Gets the envelope that a specified region spans.
GetRegionIds |  Gets the region ids of this compound structure.
GetRegionsAlongLevel |  Returns the ids of the regions encountered as the vertically compound structure is traversed at a constant height above the bottom a wall to which this structure is applied.
GetRegionsAssociatedToLayer |  Gets the set of region ids associated to a particular layer.
GetSegmentCoordinate |  Gets the coordinate of a segment.
GetSegmentEndPoints |  Gets the end points of a segment.
GetSegmentIds |  Gets the segment ids of this compound structure.
GetSegmentOrientation |  Gets the orientation of a segment.
GetSimpleCompoundStructure |  Takes a horizontal slice through a sample wall to which this CompoundStructure is applied and returns a simple compound structure which describes that slice, i.e. a series of parallel layers.
GetWallSweepsInfo |  Obtains a list of the intrinsic wall sweeps or reveals in this CompoundStructure.
GetWidth() |  The width implied by this compound structure.
GetWidth(Int32) |  Computes the width of the envelope (2d bounding box) of the specified region.
IsCoreLayer |  Checks if the specified layer is a core layer.
IsEqual |  Checks whether this CompoundStructure is the same as another CompoundStructure.
IsLayerValid |  Verifies that the data in this layer is internally consistent.
IsRectangularRegion |  Determines whether the specified region is rectangular.
IsSimpleRegion |  Determines whether the region is a simple region in this CompoundStructure.
IsStructuralDeck |  Determines whether a specified layer is a structural deck.
IsValid |  Checks for errors or inconsistencies in the data in this CompoundStructure.
IsValidLayerPriority |  Checks if the layer priority is valid to match the function.
IsValidRegionId |  Determines whether the specified integer is actually the id of a region in this CompoundStructure.
IsValidSampleHeight |  Is the specified height a valid sample height for this compound structure?
IsValidSegmentId |  Determines whether the specified integer is actually the id of a segment in this CompoundStructure.
IsVerticallyHomogeneous |  Indicates whether this CompoundStructure represents a single set of parallel layers.
MergeRegionsAdjacentToSegment |  Merges the two regions which share the specified segment.
ParticipatesInWrapping |  Identifies if a layer is included in wrapping at inserts and ends.
RemoveWallSweep |  Removes a single sweep or reveal from the compound structure.
ResetAllLayersPriorities |  Resets all the priorities of all layers to the default priorities defined by their functions.
ResetLayerPriority |  Resets the priority of the specific layer to the default priority defined by its function.
SetDeckEmbeddingType |  Sets the deck embedding type to use for the specified structural deck.
SetDeckProfileId |  Sets the profile loop to use for the specified structural deck.
SetExtendableRegionIds |  Sets the extendable region ids for the compound structure.
SetLayer |  Sets a single layer for this CompoundStructure.
SetLayerFunction |  Sets the function of the specified layer.
SetLayerPriority |  Sets the priority of the specific layer.
SetLayers |  Completely resets this CompoundStructure and applies a new set of layers.
SetLayerWidth |  Sets the width of a specified layer.
SetMaterialId |  Sets a material element for a specified layer.
SetNumberOfShellLayers |  Sets the number of interior or exterior shell layers.
SetParticipatesInWrapping |  Assigns if a layer is included in wrapping at inserts and ends.
SplitRegion(UV, RectangularGridSegmentOrientation) |  Splits the region which contains the specified grid point by a line with the specified direction.
SplitRegion(UV, RectangularGridSegmentOrientation, Int32) |  Splits the region which contains the specified grid point by a line with the specified direction.
Top
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace