Revit 2027 API
Color Class
Represents a color in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Color
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Color : APIObject
Public Class Color
	Inherits APIObject
public ref class Color : public APIObject
type Color =
    class
        inherit APIObject
    end
The Color type exposes the following members.
Constructors
Name | Description
Color | Constructor that takes the red, green and blue channels of the color.
Top
Properties
Name | Description
Blue | Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Green | Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
InvalidColorValue |  Get the invalid Color whose IntegerValue is -1.
IsValid | Identifies if the color represents a valid color, or an uninitialized/invalid value.
Red | Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Top
Methods
Name | Description
Top
Remarks
Colors obtained from some API methods may represent an uninitialized/invalid color. You can identify these using the IsValid property.
See Also
Reference
Autodesk.Revit.DB Namespace