Revit 2027 API
Mullion Properties
The Mullion type exposes the following members.
Properties
Name | Description
LocationCurve |  This method get the curve location of the current Mullion.
Lock | Get - to get whether the Mullion line is locked. Set - Lock/unlock the Mullion.
Lockable | Get - to get whether the Mullion can be lock or unlock.
MullionType |  The MullionType style of this Mullion. Get - to access type of mullion Set - change type of mullion. If the mullion is locked, InvalidOperationException exception will be thrown.
Top
See Also
Reference
Mullion Class
Autodesk.Revit.DB Namespace