Revit 2027 API
DisplacementPath Properties
The DisplacementPath type exposes the following members.
Properties
Name | Description
AncestorIdx |  Specifies the end point of the path.
PathStyle |  Specifies the style of the path.
Top
See Also
Reference
DisplacementPath Class
Autodesk.Revit.DB Namespace