Revit 2027 API
CurtainGridSetIterator Properties
The CurtainGridSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
CurtainGridSetIterator Class
Autodesk.Revit.DB Namespace