Revit 2027 API
RelinquishedItems Methods
The RelinquishedItems type exposes the following members.
Methods
Name | Description
Dispose
GetRelinquishedElements |  The elements that were relinquished by the current user.
GetRelinquishedWorksets |  The elements that were relinquished by the current user.
Top
See Also
Reference
RelinquishedItems Class
Autodesk.Revit.DB Namespace