Revit 2027 API
DefinitionBindingMap Properties
The DefinitionBindingMap type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the map is empty.
Item
Size | Returns the number of bindings that are in the map.
Top
See Also
Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace