Revit 2027 API
BoundingBoxIntersectsFilter Methods
The BoundingBoxIntersectsFilter type exposes the following members.
Methods
Name | Description
GetBoundingBox |  Gets the outline being used for this filter.
Top
See Also
Reference
BoundingBoxIntersectsFilter Class
Autodesk.Revit.DB Namespace