Revit 2027 API
IFCBuiltInCategoryKey Methods
The IFCBuiltInCategoryKey type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCBuiltInCategoryKey Class
Autodesk.Revit.DB Namespace