Revit 2027 API
CurveByPoints Methods
The CurveByPoints type exposes the following members.
Methods
Name | Description
GetPoints | Get the sequence of points interpolated by this curve.
GetVisibility | Gets the visibility.
SetPoints | Change the sequence of points interpolated by this curve.
SetVisibility | Sets the visibility.
SortPoints | Order a set of ReferencePoints in the same way Revit does when creating a curve from points.
Top
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace