Revit 2027 API
ImageBackgroundSettings Properties
The ImageBackgroundSettings type exposes the following members.
Properties
Name | Description
BackgroundImageFit |  The background image fit type.
FilePath |  File path of the image for the rendering background.
OffsetHeight |  The vertical offset of the rendering image to the rendering region.
OffsetWidth |  The horizontal offset of the rendering image to the rendering region.
Top
See Also
Reference
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace