Revit 2027 API
LightingDevice Class
Provides access to the Lighting Device in Autodesk Revit MEP.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.MEPModel
 Autodesk.Revit.DB.Electrical.LightingDevice
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LightingDevice : MEPModel
Public Class LightingDevice
	Inherits MEPModel
public ref class LightingDevice : public MEPModel
type LightingDevice =
    class
        inherit MEPModel
    end
The LightingDevice type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
The Lighting Device object can only be queried in Autodesk Revit MEP.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace