Revit 2027 API
SymbolGeometryId Class
 This class is used to identify a piece of geometry managed by a symbol element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SymbolGeometryId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SymbolGeometryId : IDisposable
Public Class SymbolGeometryId
	Implements IDisposable
public ref class SymbolGeometryId : IDisposable
type SymbolGeometryId =
    class
        interface IDisposable
    end
The SymbolGeometryId type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SymbolId |  The id of the symbol which contains the shared geometry.
Top
Methods
Name | Description
AsUniqueIdentifier |  Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
Dispose | Releases all resources used by the SymbolGeometryId
Top
Remarks
 This class can be used to compare if two instances points to the same piece of geometry managed by a symbol element. The string returned by AsIdentifier can be used to achieve this.
See Also
Reference
Autodesk.Revit.DB Namespace