Revit 2027 API
MEPCurve Class
A curve object for duct or pipe blend elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPCurve : HostObject
Public Class MEPCurve
	Inherits HostObject
public ref class MEPCurve : public HostObject
type MEPCurve =
    class
        inherit HostObject
    end
The MEPCurve type exposes the following members.
Properties
Name | Description
ConnectorManager | The connector manager of this MEP curve.
Diameter | The diameter of the MEP curve.
Height | The height of the MEP curve.
LevelOffset | The offset of the MEP curve.
MEPSystem | The system of the MEP curve.
ReferenceLevel | The reference level of the MEP curve.
Width | The width of the MEP curve.
Top
Methods
Name | Description
Top
Remarks
The curve object is only available in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Electrical.CableTrayConduitBase
 Autodesk.Revit.DB.Electrical.Wire
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Mechanical.Duct
 Autodesk.Revit.DB.Mechanical.FlexDuct
 Autodesk.Revit.DB.MEPAnalyticalConnection
 Autodesk.Revit.DB.Plumbing.FlexPipe
 Autodesk.Revit.DB.Plumbing.Pipe