Revit 2027 API
FlexDuct Properties
The FlexDuct type exposes the following members.
Properties
Name | Description
EndTangent |  Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
FlexDuctType |  The flex duct type of this flex duct.
Points | The points of the flex duct.
StartTangent |  Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Top
See Also
Reference
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace