Revit 2027 API
SpotDimension Properties
The SpotDimension type exposes the following members.
Properties
Name | Description
LeaderHasShoulder |  True is dimension has leader with shoulder, false otherwise.
LeaderShoulderPosition |  Position of spot dimension's leader shoulder point.
SpotDimensionType |  The dimension style of this dimension.
Top
See Also
Reference
SpotDimension Class
Autodesk.Revit.DB Namespace