Revit 2027 API
ParameterSetIterator Class
An iterator to a parameter set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ParameterSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ParameterSetIterator : APIObject,
	IEnumerator
Public MustInherit Class ParameterSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ParameterSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ParameterSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ParameterSetIterator type exposes the following members.
Constructors
Name | Description
ParameterSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace