Revit 2027 API
BoundaryValidation Methods
The BoundaryValidation type exposes the following members.
Methods
Name | Description
Dispose
IsValidBoundaryOnSketchPlane |  Indicates if the given curve loops compose a valid boundary on the sketch plane.
IsValidBoundaryOnView |  Indicates if the given curve loops compose a valid boundary on the view's detail sketch plane.
IsValidHorizontalBoundary |  Identifies whether the given curve loops compose a valid horizontal boundary.
Top
See Also
Reference
BoundaryValidation Class
Autodesk.Revit.DB Namespace