Revit 2027 API
LightNode Class
 This class represents a Light element in a model-exporting process.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.LightNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LightNode : ContentNode
Public Class LightNode
	Inherits ContentNode
public ref class LightNode : public ContentNode
type LightNode =
    class
        inherit ContentNode
    end
The LightNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 See also: OnLight(LightNode).
See Also
Reference
Autodesk.Revit.DB Namespace