Revit 2027 API
LightDistribution Class
 This class is the base class for specifying light distribution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution
 Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
 Autodesk.Revit.DB.Lighting.SphericalLightDistribution
 Autodesk.Revit.DB.Lighting.SpotLightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LightDistribution : IDisposable
Public Class LightDistribution
	Implements IDisposable
public ref class LightDistribution : IDisposable
type LightDistribution =
    class
        interface IDisposable
    end
The LightDistribution type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Clone |  Creates a copy of the LightDistribution derived object.
Dispose | Releases all resources used by the LightDistribution
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace