Revit 2027 API
ViewActivatingEventArgs Properties
The ViewActivatingEventArgs type exposes the following members.
Properties
Name | Description
CurrentActiveView |  The view that is currently active.
NewActiveView |  The view that is going to become active.
Top
See Also
Reference
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace