Revit 2027 API
LabelUtils Class
 Used to obtain user-visible names for enums.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LabelUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LabelUtils : IDisposable
Public Class LabelUtils
	Implements IDisposable
public ref class LabelUtils : IDisposable
type LabelUtils =
    class
        interface IDisposable
    end
The LabelUtils type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LabelUtils
GetFailureSeverityName |  Gets the user-visible name for the Severity of a Warning
GetLabelFor(BuiltInCategory) |  Gets the user-visible name for a BuiltInCategory.
GetLabelFor(BuiltInParameter) |  Gets the user-visible name for a BuiltInParameter.
GetLabelFor(BuiltInParameter, LanguageType) |  Gets the user-visible name for a BuiltInParameter in a specific LanguageType.
GetLabelFor(DuctLossMethodType, Document) |  Gets the user-visible name for a DuctLossMethodType.
GetLabelFor(gbXMLBuildingType, Document) |  Gets the user-visible name for a gbXMLBuildingType.
GetLabelFor(PipeFlowState, Document) |  Gets the user-visible name for a PipeFlowState.
GetLabelFor(PipeLossMethodType, Document) |  Gets the user-visible name for a PipeLossMethodType.
GetLabelForBuiltInParameter(ForgeTypeId) |  Gets the user-visible name for a built-in parameter.
GetLabelForBuiltInParameter(ForgeTypeId, LanguageType) |  Gets the user-visible name for a built-in parameter in a specific LanguageType.
GetLabelForDiscipline |  Gets the user-visible name for a discipline.
GetLabelForGroup |  Gets the user-visible name for a built-in parameter group. To get the name of parameter group "Other", pass an empty, default-constructed ForgeTypeId.
GetLabelForSpec |  Gets the user-visible name for a spec.
GetLabelForSymbol |  Gets the user-visible name for a symbol.
GetLabelForUnit |  Gets the user-visible name for a unit.
GetStructuralSectionShapeName |  Gets the user-visible name for a StructuralSectionShape.
Top
See Also
Reference
Autodesk.Revit.DB Namespace