Revit 2027 API
FaceNode Methods
The FaceNode type exposes the following members.
Methods
Name | Description
GetFace |  Returns the Face object corresponding to the node.
Top
See Also
Reference
FaceNode Class
Autodesk.Revit.DB Namespace