Revit 2027 API
FlexDuct Class
 A flex duct in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Mechanical.FlexDuct
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FlexDuct : MEPCurve
Public Class FlexDuct
	Inherits MEPCurve
public ref class FlexDuct : public MEPCurve
type FlexDuct =
    class
        inherit MEPCurve
    end
The FlexDuct type exposes the following members.
Properties
Name | Description
EndTangent |  Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
FlexDuctType |  The flex duct type of this flex duct.
Points | The points of the flex duct.
StartTangent |  Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Top
Methods
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>) |  Creates a new flexible duct into the document, using a point array and flexible duct type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>) |  Creates a new flexible duct into the document, using a point array and flexible duct type.
IsFlexDuctTypeId |  Checks if given type is valid flexible duct type.
IsHVACSystemTypeId |  Checks if given type is valid HVAC system type.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace