Revit 2027 API
ColorBackgroundSettings Properties
The ColorBackgroundSettings type exposes the following members.
Properties
Name | Description
Color |  The color of the rendering background.
Top
See Also
Reference
ColorBackgroundSettings Class
Autodesk.Revit.DB Namespace