Revit 2027 API
Ellipse Properties
The Ellipse type exposes the following members.
Properties
Name | Description
Center | Returns the center of the ellipse.
Normal | Returns the normal to the plane in which the ellipse is defined.
RadiusX | Returns the X vector radius of the ellipse.
RadiusY | Returns the Y vector radius of the ellipse.
XDirection | The X direction.
YDirection | The Y direction.
Top
See Also
Reference
Ellipse Class
Autodesk.Revit.DB Namespace