Revit 2027 API
GeometryElement Properties
The GeometryElement type exposes the following members.
Properties
Name | Description
MaterialElement | Element describing the material from which this element is composed.
Top
See Also
Reference
GeometryElement Class
Autodesk.Revit.DB Namespace