Revit 2027 API
StructuralSectionLProfileWithLips Class
 Defines parameters for L Profile with lips structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionLProfileWithLips : StructuralSectionGeneralLA
Public Class StructuralSectionLProfileWithLips
	Inherits StructuralSectionGeneralLA
public ref class StructuralSectionLProfileWithLips : public StructuralSectionGeneralLA
type StructuralSectionLProfileWithLips =
    class
        inherit StructuralSectionGeneralLA
    end
The StructuralSectionLProfileWithLips type exposes the following members.
Constructors
Name | Description
StructuralSectionLProfileWithLips |  Creates a new instance of Structural Section L Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace