Revit 2027 API
VoltageTypeSetIterator Properties
The VoltageTypeSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
VoltageTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace