Revit 2027 API
ModelText Class
A model text element in an Autodesk Revit family document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ModelText
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelText : Element
Public Class ModelText
	Inherits Element
public ref class ModelText : public Element
type ModelText =
    class
        inherit Element
    end
The ModelText type exposes the following members.
Properties
Name | Description
Depth | The depth of the model text.
HorizontalAlignment | The horizontal alignment.
Location | This property is used to find the physical location of an instance within project.
(Overrides Element.Location)
ModelTextType | The type for the model text.
Subcategory | The subcategory.
Text | The text string in the model text.
Top
Methods
Name | Description
GetVisibility | Gets the visibility for the model text in a family document.
SetVisibility | Sets the visibility for the model text in a family document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace