Revit 2027 API
PhaseFilter Properties
The PhaseFilter type exposes the following members.
Properties
Name | Description
IsDefault |  Indicates whether this filter is the default one.
Top
See Also
Reference
PhaseFilter Class
Autodesk.Revit.DB Namespace