Revit 2027 API
WireTypeSetIterator Class
An iterator to a wire type set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireTypeSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class WireTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class WireTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class WireTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type WireTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The WireTypeSetIterator type exposes the following members.
Constructors
Name | Description
WireTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace