Revit 2027 API
IFCAggregateIterator Class
 A class used to iterate individual objects in an IFCAggregate.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCAggregateIterator
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCAggregateIterator : IEnumerator<IFCData>
Public Class IFCAggregateIterator
	Implements IEnumerator(Of IFCData)
public ref class IFCAggregateIterator : IEnumerator<IFCData^>
type IFCAggregateIterator =
    class
        interface IEnumerator<IFCData>
    end
The IFCAggregateIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCAggregateIterator
MoveNext |  Increments the iterator to the next object in the IFCAggregate.
Reset |  Resets the iterator to the beginning of the aggregate.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace