Revit 2027 API
PanelType Class
An object that represents a curtain panel type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.PanelType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PanelType : FamilySymbol
Public Class PanelType
	Inherits FamilySymbol
public ref class PanelType : public FamilySymbol
type PanelType =
    class
        inherit FamilySymbol
    end
The PanelType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace