Revit 2027 API
DirectContext3DHandleOverrides Methods
The DirectContext3DHandleOverrides type exposes the following members.
Methods
Name | Description
Assign |  Assigns values of the source overrides to this object.
Dispose
GetDirectContext3DHandleSettings |  Gets override settings associated with a DirectContext3D handle instance or type.
IsEqual |  Check if the contents of two overrides are equal.
SetDirectContext3DHandleSettings |  Assigns override settings associated with a DirectContext3D handle instance or type.
Top
See Also
Reference
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace