Revit 2027 API
ColorFillLegend Properties
The ColorFillLegend type exposes the following members.
Properties
Name | Description
ColorFillCategoryId |  Returns the id of color fill category that this legend is created for.
Height |  The height of the legend.
Origin |  The top left corner of the color fill legend.
Top
See Also
Reference
ColorFillLegend Class
Autodesk.Revit.DB Namespace