Revit 2027 API
IFCExtrusionCalculatorOptions Class
 This class contains the options used to calculate extrusions from Revit geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCExtrusionCalculatorOptions : IDisposable
Public Class IFCExtrusionCalculatorOptions
	Implements IDisposable
public ref class IFCExtrusionCalculatorOptions : IDisposable
type IFCExtrusionCalculatorOptions =
    class
        interface IDisposable
    end
The IFCExtrusionCalculatorOptions type exposes the following members.
Constructors
Name | Description
IFCExtrusionCalculatorOptions |  Constructs a new instance of a class used to calculate extrusions from Revit geometry.
Top
Properties
Name | Description
CustomAxis |  The custom axis to try (if extrusionAxes includes an option for a custom direction).
ExtrusionAxes |  The extrusion axes to try when doing the calculation.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Scale |  The scaling factor for length measurements from the default Revit units to the export units.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCExtrusionCalculatorOptions
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace