Revit 2027 API
AreaVolumeSettings Methods
The AreaVolumeSettings type exposes the following members.
Methods
Name | Description
GetAreaVolumeSettings |  Get the area and volume settings of the project.
GetSpatialElementBoundaryLocation |  Gets the spatial element boundary location based on spatial element type.
SetSpatialElementBoundaryLocation |  Sets the spatial element boundary location of a spatial element type.
Top
See Also
Reference
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace