Revit 2027 API
RebarCoverType Methods
The RebarCoverType type exposes the following members.
Methods
Name | Description
Create |  Creates a new CoverType in the document.
Top
See Also
Reference
RebarCoverType Class
Autodesk.Revit.DB.Structure Namespace