Revit 2027 API
PointOnEdgeFaceIntersection Class
Define a ReferencePoint at the intersection of a referenceable edge or curve and a referenceable face.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointElementReference
 Autodesk.Revit.DB.PointOnEdgeFaceIntersection
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointOnEdgeFaceIntersection : PointElementReference
Public Class PointOnEdgeFaceIntersection
	Inherits PointElementReference
public ref class PointOnEdgeFaceIntersection : public PointElementReference
type PointOnEdgeFaceIntersection =
    class
        inherit PointElementReference
    end
The PointOnEdgeFaceIntersection type exposes the following members.
Properties
Name | Description
OrientWithEdge | Whether to orient the ReferencePoint to the edge or the face.
Top
Methods
Name | Description
GetEdgeReference | Get a copy of the edge or curve reference.
GetFaceReference | Get a copy of the face reference.
SetEdgeReference | Change the edge or curve reference.
SetFaceReference | Change the face reference.
Top
Remarks
The ReferencePoint's orientation is partially constrained either to the edge (in the manner of PointOnEdge) or to the face (in the manner of PointOnFace).
See Also
Reference
Autodesk.Revit.DB Namespace