Revit 2027 API
DuctLiningType Properties
The DuctLiningType type exposes the following members.
Properties
Name | Description
Roughness |  The roughness of Duct Lining.
Top
See Also
Reference
DuctLiningType Class
Autodesk.Revit.DB.Mechanical Namespace