Revit 2027 API
UISaveAsOptions Class
 This class contains UI options available for saving a document to disk with a new filename.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UISaveAsOptions
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class UISaveAsOptions : IDisposable
Public Class UISaveAsOptions
	Implements IDisposable
public ref class UISaveAsOptions : IDisposable
type UISaveAsOptions =
    class
        interface IDisposable
    end
The UISaveAsOptions type exposes the following members.
Constructors
Name | Description
UISaveAsOptions |  Default constructor.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowOverwriteWarning |  Identifies if UI should show an overwrite warning dialog.
Top
Methods
Name | Description
Dispose | Releases all resources used by the UISaveAsOptions
Top
See Also
Reference
Autodesk.Revit.UI Namespace