Revit 2027 API
SaveAsOptions Methods
The SaveAsOptions type exposes the following members.
Methods
Name | Description
Dispose
GetWorksharingOptions |  Gets Worksharing options for SaveAs.
SetWorksharingOptions |  Sets Worksharing options for SaveAs.
Top
See Also
Reference
SaveAsOptions Class
Autodesk.Revit.DB Namespace