Revit 2027 API
ClosestPointsPairBetweenTwoCurves Class
 This class captures results of computation of closest points between two generic curves.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ClosestPointsPairBetweenTwoCurves : IDisposable
Public Class ClosestPointsPairBetweenTwoCurves
	Implements IDisposable
public ref class ClosestPointsPairBetweenTwoCurves : IDisposable
type ClosestPointsPairBetweenTwoCurves =
    class
        interface IDisposable
    end
The ClosestPointsPairBetweenTwoCurves type exposes the following members.
Constructors
Name | Description
ClosestPointsPairBetweenTwoCurves() |  Obtain a new instance of ClosestPointsPairBetweenTwoCurves class.
ClosestPointsPairBetweenTwoCurves(ClosestPointsPairBetweenTwoCurves) |  Creates a copy of the ClosestPointsPairBetweenTwoCurves.
Top
Properties
Name | Description
Distance |  Distance from point on first curve to the point on second curve.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParameterOnFirstCurve |  1d raw (not normalized) parameter of the point on the first curve.
ParameterOnSecondCurve |  1d raw (not normalized) parameter of the point on the second curve.
XYZPointOnFirstCurve |  Point on the first curve in 3d coordinates.
XYZPointOnSecondCurve |  Point on the second curve in 3d coordinates.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ClosestPointsPairBetweenTwoCurves
Top
See Also
Reference
Autodesk.Revit.DB Namespace