Revit 2027 API
AreaCreationData Class
 A class which wraps the arguments of Area for batch creation
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Creation.AreaCreationData
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaCreationData
Public Class AreaCreationData
public ref class AreaCreationData
type AreaCreationData = class end
The AreaCreationData type exposes the following members.
Constructors
Name | Description
AreaCreationData(Object) | Initializes a new instance of the AreaCreationData class
AreaCreationData(ViewPlan, UV) | The data needed to create a new area
Top
Properties
Name | Description
TagPoint |  Specify the location of the area tag.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.Creation Namespace