Revit 2027 API
ViewActivatingEventArgs Class
 The event arguments used by the ViewActivating event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.UI.Events.ViewActivatingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewActivatingEventArgs : RevitAPIPreDocEventArgs
Public Class ViewActivatingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ViewActivatingEventArgs : public RevitAPIPreDocEventArgs
type ViewActivatingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ViewActivatingEventArgs type exposes the following members.
Properties
Name | Description
CurrentActiveView |  The view that is currently active.
NewActiveView |  The view that is going to become active.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace