Revit 2027 API
BackgroundSettings Methods
The BackgroundSettings type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
BackgroundSettings Class
Autodesk.Revit.DB Namespace