Revit 2027 API
GenericForm Properties
The GenericForm type exposes the following members.
Properties
Name | Description
IsSolid | Identifies if the GenericForm is a solid or a void element.
Name | Get and Set the Name property
(Overrides Element.Name)
Subcategory | The subcategory.
Visible | The visibility of the GenericForm.
Top
See Also
Reference
GenericForm Class
Autodesk.Revit.DB Namespace