Revit 2027 API
MultiReferenceAnnotationType Methods
The MultiReferenceAnnotationType type exposes the following members.
Methods
Name | Description
CreateDefault |  Creates the first MultiReferenceAnnotationType element and adds it to the document.
GetAllowedTagCategory |  Returns the category ID for the tag types which can be used by this multi-reference annotation type.
IsAllowedDimensionStyle |  Checks if the dimension style can be used with multi-reference annotations.
IsAllowedReferenceCategory |  Checks if the reference category can be used with multi-reference annotations.
IsAllowedTagCategory |  Returns true if tag types belonging to this category can be used with multi-reference annotation types.
IsAllowedTagType |  Checks if the tag type can be assigned to this multi-reference annotation type.
Top
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace