Revit 2027 API
ElementLogicalFilter Class
 A filter used to logically combine two or more filters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementLogicalFilter
 Autodesk.Revit.DB.LogicalAndFilter
 Autodesk.Revit.DB.LogicalOrFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementLogicalFilter : ElementFilter
Public Class ElementLogicalFilter
	Inherits ElementFilter
public ref class ElementLogicalFilter : public ElementFilter
type ElementLogicalFilter =
    class
        inherit ElementFilter
    end
The ElementLogicalFilter type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetFilters |  Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
SetFilters |  Replaces current filters in the logical filter with any number of input filters.
Top
Remarks
 The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.
See Also
Reference
Autodesk.Revit.DB Namespace