Revit 2027 API
PathReinforcementType Class
 An object that specifies the type of a Structural Path Reinforcement element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.PathReinforcementType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PathReinforcementType : ElementType
Public Class PathReinforcementType
	Inherits ElementType
public ref class PathReinforcementType : public ElementType
type PathReinforcementType =
    class
        inherit ElementType
    end
The PathReinforcementType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CreateDefaultPathReinforcementType |  Creates a new PathReinforcementType object with a default name.
Top
Remarks
 The clear cover settings can be accessed via this object.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace