Revit 2027 API
WireConduitType Class
 Represents a specific conduit type of wire type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireConduitType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WireConduitType : APIObject
Public Class WireConduitType
	Inherits APIObject
public ref class WireConduitType : public APIObject
type WireConduitType =
    class
        inherit APIObject
    end
The WireConduitType type exposes the following members.
Properties
Name | Description
Name
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace