Revit 2027 API
WorksetDefaultVisibilitySettings Methods
The WorksetDefaultVisibilitySettings type exposes the following members.
Methods
Name | Description
GetWorksetDefaultVisibilitySettings |  Get the WorksetDefaultVisibilitySettings of the document.
IsWorksetVisible |  Indicates whether the workset is visible by default.
SetWorksetVisibility |  Set the default visibility of a workset.
Top
See Also
Reference
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace