Revit 2027 API
AnalyticalPowerDistributableNodeData Properties
The AnalyticalPowerDistributableNodeData type exposes the following members.
Properties
Name | Description
AssignedPhasesNumber |  The number of electrical phases assigned through the distribution system of the power distributable node.
AssignedVoltage |  The voltage assigned through the distribution system of the power distributable node.
DistributionSystem |  The distribution system of the power distributable node.
Top
See Also
Reference
AnalyticalPowerDistributableNodeData Class
Autodesk.Revit.DB.Electrical Namespace