Revit 2027 API
ViewActivatedEventArgs Class
 The event arguments used by the ViewActivated event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.UI.Events.ViewActivatedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewActivatedEventArgs : RevitAPIPostDocEventArgs
Public Class ViewActivatedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ViewActivatedEventArgs : public RevitAPIPostDocEventArgs
type ViewActivatedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ViewActivatedEventArgs type exposes the following members.
Properties
Name | Description
CurrentActiveView |  The view that has just become active.
PreviousActiveView |  The previously active view.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace