Revit 2027 API
TransientElementCreationException Methods
The TransientElementCreationException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
TransientElementCreationException Class
Autodesk.Revit.Exceptions Namespace