Revit 2027 API
RebarHookType Class
 A Rebar Hook type object that is used in the generation of Rebar.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarHookType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarHookType : ElementType
Public Class RebarHookType
	Inherits ElementType
public ref class RebarHookType : public ElementType
type RebarHookType =
    class
        inherit ElementType
    end
The RebarHookType type exposes the following members.
Properties
Name | Description
HookAngle |  The hook angle, measured in radians. Must be greater than 0.0174532925 (1 degree) and no more than PI (180 degree).
StraightLineMultiplier |  Multiplier of bar diameter. Used to compute a default hook length. The default hook length can be overridden by the RebarBarType class.
Style |  The hook may only be applied to shapes of the specified style.
Top
Methods
Name | Description
Create |  Creates a new RebarHookType in a document.
CreateDefaultRebarHookType |  Creates a new RebarHookType object with a default name.
GetDefaultHookExtension |  Computes the default hook length, which is equal to barDiameter * multiplier.
GetHookExtensionLength |  Computes the hook extension length based on current hook length
IsOffsetLengthRequired |  Check whether hook offset length is required. remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful. returns: True if hook offset length is required, otherwise false.
Top
Remarks
 This object contains the definition of the hooks that may be created at the ends of the rebar. The specifics of these hooks are angle (range 0-PI) between first/last segment of rebar and the straight segment of the hook, rebar shape style and a multiplier used to compute the length of the straight segment of the hook. The default length is computed as the bar diameter * the multiplier. Length can be overridden by settings in the RebarBarType class.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace