Revit 2027 API
PanelTypeSet Class
A set that contains panel types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PanelTypeSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PanelTypeSet : APIObject,
	IEnumerable
Public Class PanelTypeSet
	Inherits APIObject
	Implements IEnumerable
public ref class PanelTypeSet : public APIObject,
	IEnumerable
type PanelTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The PanelTypeSet type exposes the following members.
Constructors
Name | Description
PanelTypeSet | Initializes a new instance of the PanelTypeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of panel types that are in the set.
Top
Methods
Name | Description
Clear | Removes every panel type from the set, rendering it empty.
Contains | Tests for the existence of a panel type within the set.
Erase | Removes a specified panel type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified panel type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace