Revit 2027 API
AssetPropertyString Methods
The AssetPropertyString type exposes the following members.
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace