Revit 2027 API
ExportLineweightKey Methods
The ExportLineweightKey type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExportLineweightKey Class
Autodesk.Revit.DB Namespace