Revit 2027 API
VertexStreamPositionColored Methods
The VertexStreamPositionColored type exposes the following members.
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPositionColored into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPositionColored instances into the stream and associated buffer.
Top
See Also
Reference
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace