Revit 2027 API
Ceiling Properties
The Ceiling type exposes the following members.
Properties
Name | Description
SketchId |  Returns id of the sketch.
Top
See Also
Reference
Ceiling Class
Autodesk.Revit.DB Namespace