Revit 2027 API
ExecutedEventArgs Methods
The ExecutedEventArgs type exposes the following members.
Methods
Name | Description
GetJournalData |  Gets the journal data associated to this command (on journal playback).
SetJournalData |  Sets the journal data associated to this command (on journal playback).
Top
See Also
Reference
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace