Revit 2027 API
FilteredWorksetIdIterator Class
 An iterator to a set of workset ids filtered by the settings of a FilteredWorksetCollector.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredWorksetIdIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilteredWorksetIdIterator : IEnumerator<WorksetId>
Public Class FilteredWorksetIdIterator
	Implements IEnumerator(Of WorksetId)
public ref class FilteredWorksetIdIterator : IEnumerator<WorksetId^>
type FilteredWorksetIdIterator =
    class
        interface IEnumerator<WorksetId>
    end
The FilteredWorksetIdIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilteredWorksetIdIterator
GetCurrent |  The current workset id found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next workset id passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
Autodesk.Revit.DB Namespace