Revit 2027 API
VoltageTypeSet Class
A set that contains voltage types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.VoltageTypeSet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VoltageTypeSet : APIObject,
	IEnumerable
Public Class VoltageTypeSet
	Inherits APIObject
	Implements IEnumerable
public ref class VoltageTypeSet : public APIObject,
	IEnumerable
type VoltageTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The VoltageTypeSet type exposes the following members.
Constructors
Name | Description
VoltageTypeSet | Initializes a new instance of the VoltageTypeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of voltage types that are in the set.
Top
Methods
Name | Description
Clear | Removes every voltage type from the set, rendering it empty.
Contains | Tests for the existence of a voltage type within the set.
Erase | Removes a specified voltage type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified voltage type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace