Revit 2027 API
SolidOrShellTessellationControls Methods
The SolidOrShellTessellationControls type exposes the following members.
Methods
Name | Description
DisableLevelOfDetail |  Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
Dispose
UseLevelOfDetail |  Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
Top
See Also
Reference
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace