Revit 2027 API
BuildingEnvelopeAnalyzerOptions Methods
The BuildingEnvelopeAnalyzerOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
BuildingEnvelopeAnalyzerOptions Class
Autodesk.Revit.DB.Analysis Namespace