Revit 2027 API
CeilingType Properties
The CeilingType type exposes the following members.
Properties
Name | Description
ThermalProperties |  The calculated and settable thermal properties of the CeilingType
Top
See Also
Reference
CeilingType Class
Autodesk.Revit.DB Namespace