Revit 2027 API
IFCFileReadOptions Class
 This class contains options to read an IFC file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCFileReadOptions
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCFileReadOptions : IDisposable
Public Class IFCFileReadOptions
	Implements IDisposable
public ref class IFCFileReadOptions : IDisposable
type IFCFileReadOptions =
    class
        interface IDisposable
    end
The IFCFileReadOptions type exposes the following members.
Constructors
Name | Description
IFCFileReadOptions |  Creates a default IFCFileReadOptions.
Top
Properties
Name | Description
FileName |  The full file name of the IFC file to be read.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
XMLConfigFileName |  The XML configuration file name. It is used only for reading IFC-XML format file.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCFileReadOptions
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace