Revit 2027 API
ExportLinetypeTable Methods
The ExportLinetypeTable type exposes the following members.
Methods
Name | Description
Add |  Inserts a (key, info) pair into Export line type table.
Clear |  Removes all contents stored in Export line type table.
ContainsKey |  Checks whether a pattern key exists in the table.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetExportLinetypeInfo |  Gets a copy of the ExportLinetypeInfo corresponding to the given ExportLinetypeKey.
GetKeys |  Gets all the keys stored in the map.
GetLinetypeTableIterator | Returns a ExportLinetypeTableIterator that iterates through the collection.
GetValues |  Returns all the values stored in the map.
Remove |  Removes the pair (key, info) corresponding to the given ExportLinetypeKey.
Top
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace