Revit 2027 API
NumericRevisionSettings Class
 Contains settings that apply to Revisions with the Numeric RevisionNumberType.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumericRevisionSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NumericRevisionSettings : IDisposable
Public Class NumericRevisionSettings
	Implements IDisposable
public ref class NumericRevisionSettings : IDisposable
type NumericRevisionSettings =
    class
        interface IDisposable
    end
The NumericRevisionSettings type exposes the following members.
Constructors
Name | Description
NumericRevisionSettings() |  Constructs a NumericRevisionSettings with a simple, default numbering sequence.
NumericRevisionSettings(NumericRevisionSettings) |  Constructs a new copy of the input NumericRevisionSettings object.
NumericRevisionSettings(Int32, String, String) |  Constructs a NumericRevisionSettings object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MinimumDigits |  Controls the minimum number of digits for a revision number.
Prefix |  The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType.
StartNumber |  The start number for the sequence.
Suffix |  The suffix string that will be appended to the number of each revision with Numeric RevisionNumberingType.
Top
Methods
Name | Description
Dispose | Releases all resources used by the NumericRevisionSettings
IsEqual |  Determines whether a specified NumericRevisionSettings is the same as 'this'.
IsValid |  Determines whether the NumericRevisionSettings object is in a valid state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace