Revit 2027 API
IFCParameterTemplate Properties
The IFCParameterTemplate type exposes the following members.
Properties
Name | Description
ExportIFCBaseQuantities |  The option to export IFC base quantities for exported Revit elements. If true, then all IFC base quantities not excluded will be exported. If false, then no IFC base quantities will be exported.
ExportIFCCommonPropertySets |  The option to export IFC common property sets for exported Revit elements. If true, then all IFC Common Property Sets not excluded will be exported. If false, then no IFC Common Property Sets will be exported.
ExportRevitElementParameters |  The option to export Revit element parameters to IFC. If true, then all Revit element parameters not excluded will be exported. If false, then no Revit element parameters will be exported.
ExportRevitMaterialParameters |  The option to export Revit material parameters to IFC. If true, then all Revit material parameters not excluded will be exported. If false, then no Revit material parameters will be exported.
ExportRevitSchedules |  The option to export Revit schedules to IFC. If true, then all Revit schedules not excluded will be exported. If false, then no Revit schedules will be exported.
ExportUserDefinedPropertySets |  The option to export user-defined property sets. If true, then all user-defined property sets not excluded will be exported. If false, then no user-defined property sets will be exported.
IsValidParameterMappingFile |  Whether or not the parameter mapping file is valid.
Top
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace