Revit 2027 API
ExportDGNSettings Class
 This element contains DGN export settings which are saved in a Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ExportDGNSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportDGNSettings : Element
Public Class ExportDGNSettings
	Inherits Element
public ref class ExportDGNSettings : public Element
type ExportDGNSettings =
    class
        inherit Element
    end
The ExportDGNSettings type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create(Document, String) |  Create a DGN export settings with default values.
Create(Document, String, DGNExportOptions) |  Create DGN export settings with specified values in DGNExportOptions.
FindByName |  Returns the pre-defined non-in-session exporting settings for DGN in the given document with the specified name.
GetActivePredefinedSettings |  Returns the active pre-defined non-in-session exporting settings for DGN in the given document.
GetDGNExportOptions |  Gets the options stored in the these settings.
ListNames |  Returns a list of names of dgn export settings.
SetDGNExportOptions |  Sets the options stored in these settings.
Top
See Also
Reference
Autodesk.Revit.DB Namespace