Revit 2027 API
UpdaterId Methods
The UpdaterId type exposes the following members.
Methods
Name | Description
Dispose
GetAddInId |  AddInId of the UpdaterId
GetGUID |  GUID value of the UpdaterId
Top
See Also
Reference
UpdaterId Class
Autodesk.Revit.DB Namespace