Revit 2027 API
SketchEditScope Methods
The SketchEditScope type exposes the following members.
Methods
Name | Description
IsElementWithoutSketch |  Validates if an element can have a sketch but currently does not.
IsSketchEditingSupported |  Checks whether sketch can be edited.
IsSketchEditingSupportedForSketchBasedElement |  Checks whether the element supports sketch editing.
Start |  Starts a sketch edit mode.
StartWithNewSketch |  Starts a sketch edit mode for an element which, at this moment, doesn't have a sketch.
Top
See Also
Reference
SketchEditScope Class
Autodesk.Revit.DB Namespace