Revit 2027 API
CentralModelAccessDeniedException Class
The exceptions thrown when a central model can be reached but access is denied due to a lack of access privileges.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CentralModelAccessDeniedException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class CentralModelAccessDeniedException : CentralModelException
<SerializableAttribute>
Public Class CentralModelAccessDeniedException
	Inherits CentralModelException
[SerializableAttribute]
public ref class CentralModelAccessDeniedException : public CentralModelException
[<SerializableAttribute>]
type CentralModelAccessDeniedException =
    class
        inherit CentralModelException
    end
The CentralModelAccessDeniedException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace