Revit 2027 API
AlphanumericRevisionSettings Methods
The AlphanumericRevisionSettings type exposes the following members.
Methods
Name | Description
Dispose
GetSequence |  Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType.
IsEqual |  Determines whether a specified AlphanumericRevisionSettings is the same as 'this'.
IsValid |  Determines whether the AlphanumericRevisionSettings object is in a valid state.
SetSequence |  Sets the sequence of strings to be used as numbers for revisions with the Alphanumeric RevisionNumberType.
Top
See Also
Reference
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace