Revit 2027 API
DWGExportOptions Class
 The export options used by exporting DWG format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DWGExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DWGExportOptions : ACADExportOptions
Public Class DWGExportOptions
	Inherits ACADExportOptions
public ref class DWGExportOptions : public ACADExportOptions
type DWGExportOptions =
    class
        inherit ACADExportOptions
    end
The DWGExportOptions type exposes the following members.
Constructors
Name | Description
DWGExportOptions() |  Constructs a new instance of DWGExportOptions with default values of all properties.
DWGExportOptions(DWGExportOptions) |  Constructs a new instance of DWGExportOptions as a copy of the export options.
Top
Properties
Name | Description
MergedViews |  Whether to merge all views in one file (via XRefs). Default value is false for mergedViews.
Top
Methods
Name | Description
GetPredefinedOptions |  Returns an instance DWGExportOptions containing settings from a predefined export setup.
Top
See Also
Reference
Autodesk.Revit.DB Namespace