Revit 2027 API
ExportPatternTable Class
 A table supporting a mapping of FillPatterns in Revit to pattern names that will be set in the target export format.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportPatternTable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportPatternTable : IEnumerable<KeyValuePair<ExportPatternKey, ExportPatternInfo>>,
	IDisposable
Public Class ExportPatternTable
	Implements IEnumerable(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo)),
	IDisposable
public ref class ExportPatternTable : IEnumerable<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>,
	IDisposable
type ExportPatternTable =
    class
        interface IEnumerable<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
        interface IDisposable
    end
The ExportPatternTable type exposes the following members.
Constructors
Name | Description
ExportPatternTable |  Constructs a new ExportPatternTable with default values.
Top
Properties
Name | Description
Count |  Count of the items contained in the collection.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Item |  A copy of the ExportPatternInfo for the pattern's ExportPatternKey.
Top
Methods
Name | Description
Add |  Inserts a (key,info) pair into Export pattern table.
Clear |  Removes all contents stored in the table.
ContainsKey |  Checks whether a pattern key exists in the table.
Dispose | Releases all resources used by the ExportPatternTable
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetExportPatternInfo |  Gets a copy of the pattern info associated to the input pattern key.
GetKeys |  Gets all the keys stored in the map.
GetPatternTableIterator | Returns a PatternTableIterator that iterates through the collection.
GetValues |  Returns all the values stored in the map.
Remove |  Removes the pair (key, info) by pattern key.
Top
Remarks
This table is structured as a mapping from ExportPatternKey to ExportPatternInfo members. The ExportPatternKey contains the identification information for the pattern table: the Revit fill pattern type and name. The ExportPatternInfo contains the pattern name to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys obtained from GetKeys(), or via specific lookup of a key constructed externally. In all cases, the ExportPatternInfo returned will be a copy of the ExportPatternInfo from the table. In order to make changes to the ExportPatternInfo and use those settings during export, set the modified ExportPatternInfo back into the table using the same key.
See Also
Reference
Autodesk.Revit.DB Namespace