Revit 2027 API
PointCollection Class
 A class that represents a set of points created and returned by Revit in response to a query.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCollection
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointCollection : IEnumerable<CloudPoint>,
	IDisposable
Public Class PointCollection
	Implements IEnumerable(Of CloudPoint), IDisposable
public ref class PointCollection : IEnumerable<CloudPoint>,
	IDisposable
type PointCollection =
    class
        interface IEnumerable<CloudPoint>
        interface IDisposable
    end
The PointCollection type exposes the following members.
Properties
Name | Description
Count |  The number of points in this collection.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PointCollection
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetPointBufferPointer |  Returns an unsafe pointer to the buffer in which this collection stores the points.
GetPointIterator |  Creates and returns an iterator for the points contained in this collection.
Top
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace