Revit 2027 API
ExportFontTableIterator Class
 An iterator to a set of font table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportFontTableIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
Public Class ExportFontTableIterator
	Implements IEnumerator(Of KeyValuePair(Of ExportFontKey, ExportFontInfo))
public ref class ExportFontTableIterator : IEnumerator<KeyValuePair<ExportFontKey^, ExportFontInfo^>>
type ExportFontTableIterator =
    class
        interface IEnumerator<KeyValuePair<ExportFontKey, ExportFontInfo>>
    end
The ExportFontTableIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportFontTableIterator
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace