Revit 2027 API
CanExecuteEventArgs Properties
The CanExecuteEventArgs type exposes the following members.
Properties
Name | Description
CanExecute | The value that indicates whether the Command associated with this event can be executed.
IsChecked | The value that indicates whether the UI associated with the Command associated with this event is in a checked state.
Top
See Also
Reference
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace