Revit 2027 API
CurveNode Methods
The CurveNode type exposes the following members.
Methods
Name | Description
GetCurve |  Returns the geometric curve object corresponding to the node.
Top
See Also
Reference
CurveNode Class
Autodesk.Revit.DB Namespace