Revit 2027 API
VertexPair Class
 Indices of a pair of vertices in two CurveLoops(one vertex in each loop).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.VertexPair
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexPair : IDisposable
Public Class VertexPair
	Implements IDisposable
public ref class VertexPair : IDisposable
type VertexPair =
    class
        interface IDisposable
    end
The VertexPair type exposes the following members.
Constructors
Name | Description
VertexPair |  Constructs a new VertexPair from a pair of indices in the curve loops.
Top
Properties
Name | Description
First |  Identifies the first index of VertexPair.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Second |  Identifies the second index of VertexPair.
Top
Methods
Name | Description
Dispose | Releases all resources used by the VertexPair
Top
Remarks
 A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.
See Also
Reference
Autodesk.Revit.DB Namespace