Revit 2027 API
LinkLoadContent Methods
The LinkLoadContent type exposes the following members.
Methods
Name | Description
GetLinkDataPath |  Returns the Link data path owned by this LinkLoadContent object.
GetLinkLoadResult |  Retrieves the LinkLoadResult of the attempt to load or reload a Revit link.
SetLinkDataPath |  Sets the Link data path owned by this LinkLoadContent object.
Top
See Also
Reference
LinkLoadContent Class
Autodesk.Revit.DB Namespace