Revit 2027 API
InvalidPathArgumentException Class
The exception that is thrown when a method received a pathname as an argument, but the pathname is illegal: too long, invalid characters, etc.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.InvalidPathArgumentException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InvalidPathArgumentException : ArgumentException
<SerializableAttribute>
Public Class InvalidPathArgumentException
	Inherits ArgumentException
[SerializableAttribute]
public ref class InvalidPathArgumentException : public ArgumentException
[<SerializableAttribute>]
type InvalidPathArgumentException =
    class
        inherit ArgumentException
    end
The InvalidPathArgumentException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace