Revit 2027 API
Fascia Methods
The Fascia type exposes the following members.
Methods
Name | Description
AddSegment | Add segments to the fascia.
(Overrides HostedSweep.AddSegment(Reference))
Top
See Also
Reference
Fascia Class
Autodesk.Revit.DB.Architecture Namespace