Revit 2027 API
EnergyAnalysisOpening Properties
The EnergyAnalysisOpening type exposes the following members.
Properties
Name | Description
CADLinkUniqueId |  The unique id of the originating CAD object's link (linked document) associated with this opening.
CADObjectUniqueId |  The unique id of the originating CAD object (model element) associated with this opening.
Corner |  The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Height |  The height of the analytical rectangular geometry.
OpeningId |  The unique identifier for the opening.
OpeningName |  The unique name identifier for the opening.
OpeningType |  The analytical opening type.
OriginatingElementDescription |  The description for the originating Revit element.
OriginatingElementId |  The element id for the originating Revit element.
OriginatingElementName |  The name for the originating Revit element.
Type |  The gbXML opening type attribute.
Width |  The width of the analytical rectangular geometry.
Top
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace