Revit 2027 API
PlanCircuitSetIterator Methods
The PlanCircuitSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
PlanCircuitSetIterator Class
Autodesk.Revit.DB Namespace