Revit 2027 API
ConstraintToRebarEdgeProperties Class
 This class is used to access properties for a constraint to a rebar's edge.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConstraintToRebarEdgeProperties : IDisposable
Public Class ConstraintToRebarEdgeProperties
	Implements IDisposable
public ref class ConstraintToRebarEdgeProperties : IDisposable
type ConstraintToRebarEdgeProperties =
    class
        interface IDisposable
    end
The ConstraintToRebarEdgeProperties type exposes the following members.
Constructors
Name | Description
ConstraintToRebarEdgeProperties(TargetRebarEdge) |  Constructs a new instance of ConstraintToRebarEdgeProperties.
ConstraintToRebarEdgeProperties(Rebar, Int32) |  Constructs a new instance of ConstraintToRebarEdgeProperties.
Top
Properties
Name | Description
DistanceToTargetRebar |  The distance to the target rebar's edge. The default value is 0.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
UsePositiveDirectionForZeroOffset |  If true, when offset is zero, the child bar is placed in the default positive direction to avoid the clash, false otherwise. The default value is true.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConstraintToRebarEdgeProperties
GetTargetRebarEdge |  Gets the target rebar edge.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace