Revit 2027 API
PointLoad Class
 An object that represents a force/moment applied to a single point. Data members
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadBase
 Autodesk.Revit.DB.Structure.PointLoad
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointLoad : LoadBase
Public Class PointLoad
	Inherits LoadBase
public ref class PointLoad : public LoadBase
type PointLoad =
    class
        inherit LoadBase
    end
The PointLoad type exposes the following members.
Properties
Name | Description
ForceVector |  The force vector applied to the point load, oriented according to OrientTo setting.
MomentVector |  The moment vector applied to the point load, oriented according to OrientTo setting.
Point |  Returns the position of point load, measured in decimal feet.
Top
Methods
Name | Description
Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) |  Creates a new hosted point load within the project.
Create(Document, ElementId, XYZ, XYZ, XYZ, PointLoadType) |  Creates a new custom hosted point load within the project using data at point.
IsPointInsideHostBoundaries |  Indicates if the point is inside panel's boundaries or if the point is on the member's curve..
IsValidHostId |  Indicates if the provided host id can host point loads.
Top
Example
private void Getinfo_PointLoad(PointLoad pointLoad)
{
    string message = "Point Load :";
    // Get the load case name
    message += "\nLoad case for load: " + pointLoad.LoadCaseName;
    //get the three dimensional force applied to the point load
    message += "\nForce: (" + pointLoad.ForceVector.X + ", " +
             pointLoad.ForceVector.Y + ", " + pointLoad.ForceVector.Z + ")";
    //get the three dimensional moment application to the point load
    message += "\nMoment: (" + pointLoad.MomentVector.X + ", " +
             pointLoad.MomentVector.Y + ", " + pointLoad.MomentVector.Z + ")";
    //get the three dimensional coordinates of point load
    message += "\nPoint load location: (" + pointLoad.Point.X + ", " +
             pointLoad.Point.Y + ", " + pointLoad.Point.Z + ")";
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace