Revit 2027 API
RevitLinkOptions Class
 This class contains the options in use when creating or loading a Revit link.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RevitLinkOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitLinkOptions : IDisposable
Public Class RevitLinkOptions
	Implements IDisposable
public ref class RevitLinkOptions : IDisposable
type RevitLinkOptions =
    class
        interface IDisposable
    end
The RevitLinkOptions type exposes the following members.
Constructors
Name | Description
RevitLinkOptions(Boolean) |  Creates a RevitLinkOptions object, specifying relative or absolute path type. If the link is workshared, all worksets will be opened.
RevitLinkOptions(RevitLinkOptions) |  Constructs a new copy of the input RevitLinkOptions object.
RevitLinkOptions(Boolean, WorksetConfiguration) |  Creates a RevitLinkOptions object, specifying relative or absolute path type, and the desired workset configuration.
Top
Properties
Name | Description
IsRelative |  The type of path to use when creating the link. If true, Revit will store a relative path for the link. If false, Revit will store an absolute path. If the link is to a Revit Server location, isRelative must be false.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RevitLinkOptions
GetWorksetConfiguration |  Gets the set of worksets to open when creating the link.
SetWorksetConfiguration |  Sets the set of worksets to open when creating the link.
Top
See Also
Reference
Autodesk.Revit.DB Namespace