Revit 2027 API
MacroModule Methods
The MacroModule type exposes the following members.
Methods
Name | Description
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetMacro |  Gets the macro with the give name.
GetMacroModuleIterator |  Returns a Macro module iterator that iterates through the collection.
Top
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace