Revit 2027 API
FamilyStructuralMaterialTypeFilter Properties
The FamilyStructuralMaterialTypeFilter type exposes the following members.
Properties
Name | Description
StructuralMaterialType |  The family structural material type.
Top
See Also
Reference
FamilyStructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace