Revit 2027 API
FaceArrayIterator Properties
The FaceArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
FaceArrayIterator Class
Autodesk.Revit.DB Namespace