Revit 2027 API
ModelText Methods
The ModelText type exposes the following members.
Methods
Name | Description
GetVisibility | Gets the visibility for the model text in a family document.
SetVisibility | Sets the visibility for the model text in a family document.
Top
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace