Revit 2027 API
RenderingQualitySettings Class
 Represents the quality settings of rendering.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderingQualitySettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RenderingQualitySettings : IDisposable
Public Class RenderingQualitySettings
	Implements IDisposable
public ref class RenderingQualitySettings : IDisposable
type RenderingQualitySettings =
    class
        interface IDisposable
    end
The RenderingQualitySettings type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LightAndMaterialAccuracyMode |  A value that controls light and material accuracy mode.
RenderDuration |  A value that controls render duration.
RenderingQuality |  The quality applied for rendering.
RenderLevel |  The render target level as a numerical value between 1 and 40.
RenderTime |  The render target time as a numerical value between 1 and 32768.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RenderingQualitySettings
IsCustomQuality |  Checks if the current rendering quality is custom or not.
IsValidRenderLevel |  Validate the render level is between 1 and 40
IsValidRenderTime |  Validate the render time is between 1 and 32768.
Top
Remarks
 The other properties in this class can only be modified if the RenderingQuality property is currently set to Custom.
See Also
Reference
Autodesk.Revit.DB Namespace