Revit 2027 API
Curve Class
A parametric curve.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Curve : GeometryObject
Public Class Curve
	Inherits GeometryObject
public ref class Curve : public GeometryObject
type Curve =
    class
        inherit GeometryObject
    end
The Curve type exposes the following members.
Properties
Name | Description
ApproximateLength | The approximate length of the curve.
IsBound | Describes whether the parameter of the curve is restricted to a particular interval.
IsClosed | Describes whether the curve is closed.
IsCyclic | The boolean value that indicates whether this curve is cyclic.
Length | The exact length of the curve.
Period | The period of this curve.
Reference | Returns a stable reference to the curve.
Top
Methods
Name | Description
Clone | Returns a copy of this curve.
ComputeClosestPoints |  Find the closest points between two curves. Closest points mean closest pairs of points, each pair consisting of a point on this, say P1, and a point on other curve, say P2. P1 and P2 are closest locally. Each pairs of closest points will be represented by the corresponding parameter values with respect to the two curves and the 3d points. A closest pair is also known as a pair of critical points of the distance function between points of the two curves. If the input parameter returnAllCriticalPoints is set to false, then the function will return only pairs with minimum distance.
ComputeDerivatives |  Returns the vectors describing the curve at the specified parameter.
ComputeNormalizedParameter | Computes the normalized curve parameter from the raw parameter.
ComputeRawParameter | Computes the raw parameter from the normalized parameter.
CreateOffset |  Creates a new curve that is an offset of the existing curve.
CreateReversed |  Creates a new curve with the opposite orientation of the existing curve.
CreateTransformed |  Crates a new instance of a curve as a transformation of this curve.
Distance | Returns the shortest distance from the specified point to this curve.
Evaluate |  Evaluates and returns the point that matches a parameter along the curve.
GetEndParameter |  Returns the raw parameter value at the start or end of this curve.
GetEndPoint |  Returns the 3D point at the start or end of this curve.
GetEndPointReference | Returns a stable reference to the start point or the end point of the curve.
Intersect | Calculates the intersection of this curve with the specified curve.
IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds.
IsInside(Double, Int32) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index.
MakeBound | Changes the bounds of this curve to the specified values.
MakeUnbound | Makes this curve unbound.
Project | Projects the specified point on this curve.
SetGraphicsStyleId | Sets the graphics style id for this curve.
Tessellate | Valid only if the curve is bound. Returns a polyline approximation to the curve.
Top
Remarks
The concrete curves are defined by parametric equations. If the curve is bound, it is only defined for an interval in parameterization. Otherwise, it is defined for all values of the parameter.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.Arc
 Autodesk.Revit.DB.CylindricalHelix
 Autodesk.Revit.DB.Ellipse
 Autodesk.Revit.DB.HermiteSpline
 Autodesk.Revit.DB.Line
 Autodesk.Revit.DB.NurbSpline