Revit 2027 API
FaceSecondDerivatives Methods
The FaceSecondDerivatives type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace