Revit 2027 API
ViewPrintingEventArgs Methods
The ViewPrintingEventArgs type exposes the following members.
Methods
Name | Description
GetSettings |  Get the print settings of the active printing session.
Top
See Also
Reference
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace