Revit 2027 API
ElementIntersectsElementFilter Class
 A filter to find elements that intersect the solid geometry of a given element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.ElementIntersectsFilter
 Autodesk.Revit.DB.ElementIntersectsElementFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementIntersectsElementFilter : ElementIntersectsFilter
Public Class ElementIntersectsElementFilter
	Inherits ElementIntersectsFilter
public ref class ElementIntersectsElementFilter : public ElementIntersectsFilter
type ElementIntersectsElementFilter =
    class
        inherit ElementIntersectsFilter
    end
The ElementIntersectsElementFilter type exposes the following members.
Constructors
Name | Description
ElementIntersectsElementFilter(Element) |  Constructs a filter to match elements which intersect the given element.
ElementIntersectsElementFilter(Element, Boolean) |  Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetElement |  Gets the target element.
Top
Remarks
The target object is another element. The intersection is determined with the same logic used by Revit to determine if an interference exists during generation of an Interference Report. (This means that some combinations of elements will never be detected as intersecting by this filter, such as concrete members which are automatically joined at their intersections). Also, elements which have no solid geometry, such as Rebar, will never be detected as intersecting by this filter.
This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB Namespace