Revit 2027 API
ViewFamilyType Properties
The ViewFamilyType type exposes the following members.
Properties
Name | Description
DefaultTemplateId |  The default template id assigned to this view type.
PlanViewDirection |  The PlanViewDirection of this view.
ViewFamily |  The ViewFamily for this view type.
Top
See Also
Reference
ViewFamilyType Class
Autodesk.Revit.DB Namespace