Revit 2027 API
RevitAPIPostEventArgs Properties
The RevitAPIPostEventArgs type exposes the following members.
Properties
Name | Description
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
Top
See Also
Reference
RevitAPIPostEventArgs Class
Autodesk.Revit.DB.Events Namespace