Revit 2027 API
SingleServerService Methods
The SingleServerService type exposes the following members.
Methods
Name | Description
GetActiveServerId() |  Returns the Id of the currently active application-level server of the service.
GetActiveServerId(Document) |  Returns the Id of the server currently associated with the given document for the service.
SetActiveServer(Guid) |  Set an active server applicable application-wide for the service.
SetActiveServer(Guid, Document) |  Change the active server for a specific document.
UnsetActiveServer |  Unset the active server for the particular document.
Top
See Also
Reference
SingleServerService Class
Autodesk.Revit.DB.ExternalService Namespace