Revit 2027 API
RebarSystemSpanSymbol Methods
The RebarSystemSpanSymbol type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of RebarSystemSpanSymbol in the project.
Top
See Also
Reference
RebarSystemSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace