Revit 2027 API
ArgumentNullException Methods
The ArgumentNullException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ArgumentNullException Class
Autodesk.Revit.Exceptions Namespace