Revit 2027 API
Macro Methods
The Macro type exposes the following members.
Methods
Name | Description
Dispose
Execute |  Executes the macro.
Top
See Also
Reference
Macro Class
Autodesk.Revit.DB.Macros Namespace