Revit 2027 API
AnalyticalLink Properties
The AnalyticalLink type exposes the following members.
Properties
Name | Description
End |  The point at the end of the AnalyticalLink.
EndHubId |  Hub ID at end of AnalyticalLink.
OwnerId |  ElementId of Analytical Element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API
Start |  The point at the start of the AnalyticalLink.
StartHubId |  Hub ID at start of AnalyticalLink.
Top
See Also
Reference
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace