Revit 2027 API
ElementDesignOptionFilter Properties
The ElementDesignOptionFilter type exposes the following members.
Properties
Name | Description
DesignOptionId |  The design option id.
Top
See Also
Reference
ElementDesignOptionFilter Class
Autodesk.Revit.DB Namespace