Revit 2027 API
ContextualHelp Class
Contains the details for how Revit should allow invocation of contextual help for an item added by an application.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ContextualHelp
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ContextualHelp
Public Class ContextualHelp
public ref class ContextualHelp
type ContextualHelp = class end
The ContextualHelp type exposes the following members.
Constructors
Name | Description
ContextualHelp | Constructs a contextual help object.
Top
Properties
Name | Description
HelpPath | The context id, help URL, or help file path.
HelpTopicUrl | The help topic URL.
HelpType | The contextual help type.
Top
Methods
Name | Description
Launch | Launches and displays the help topic specified by the contents of this ContextualHelp object.
Top
Remarks
An instance of this class may be used to assign a contextual help location to any RibbonItem (through the RibbonItem.SetContextualHelp() method). It is also possible to use an instance of this class to launch the help path and topic at any time (this permits association of help topics with user interface components inside dialogs created by the add-in application).
See Also
Reference
Autodesk.Revit.UI Namespace