Revit 2027 API
LoadBase Class
 The LoadBase object is the base class for all load objects within the Autodesk Revit API. Data members
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadBase
 Autodesk.Revit.DB.Structure.AreaLoad
 Autodesk.Revit.DB.Structure.LineLoad
 Autodesk.Revit.DB.Structure.PointLoad
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LoadBase : Element
Public Class LoadBase
	Inherits Element
public ref class LoadBase : public Element
type LoadBase =
    class
        inherit Element
    end
The LoadBase type exposes the following members.
Properties
Name | Description
HostElementId |  The host element ID for the load.
IsConstrainedOnHost |  The load is constrained to host or not.
IsHosted |  Indicates if the Load is hosted or non-hosted.
IsReaction |  The load is reaction option.
LoadCase |  The load case for the load.
LoadCaseId |  The load case ID for the load.
LoadCaseName |  The name of the load case to which this load belongs.
LoadCategoryName |  The name of the category to which this load belongs.
LoadNatureName |  A string representing the nature of the load.
OrientTo |  The load orientation option.
WorkPlaneId |  Id of the work plane which may determine the orientation of the load.
Top
Methods
Name | Description
IsOrientToPermitted |  Indicates if the provided orientation is permitted for this load.
IsValidReference |  Indicates if the provided reference can host a load.
RemoveHostConstraint |  Removes constraint from host for this load.
Top
Remarks
 Load objects are only available in Autodesk Revit Structure. This object contains methods that are common to all other load objects.
Example
private void LoadBaseInformation(LoadBase loadBase)
{
    string message = "LoadBase data for line load: ";
    //Get the name of the load case to which this load belongs
    message += "\nLoad case name: " + loadBase.LoadCaseName;
    //Get the name of the category to which this load belongs
    message += "\nLoad category name: " + loadBase.LoadCategoryName;
    //A string representing the nature of the load
    message += "\nLoad nature name: " + loadBase.LoadNatureName;
    //show the load base information in the messagebox
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace