Revit 2027 API
StructuralSectionConcreteRectangle Class
 Defines parameters for parameterized concrete rectangle structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangle
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcreteRectangle : StructuralSectionRectangular
Public Class StructuralSectionConcreteRectangle
	Inherits StructuralSectionRectangular
public ref class StructuralSectionConcreteRectangle : public StructuralSectionRectangular
type StructuralSectionConcreteRectangle =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionConcreteRectangle type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteRectangle |  Creates a new instance of Structural Section Concrete Rectangle shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace