Revit 2027 API
IFCOpeningData Methods
The IFCOpeningData type exposes the following members.
Methods
Name | Description
Dispose
GetExtrusionData |  Gets extrusion data.
GetOpeningSolids |  Gets opening solids.
Top
See Also
Reference
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace