Revit 2027 API
ChangeType Methods
The ChangeType type exposes the following members.
Methods
Name | Description
ConcatenateChangeTypes |  Creates a ChangeType that is a union of the two input ChangeTypes
Contains |  Checks whether this ChangeType contains the input ChangeType
Dispose
IsIdentical |  Compares if two ChangeTypes are identical
Top
See Also
Reference
ChangeType Class
Autodesk.Revit.DB Namespace