Revit 2027 API
DataConversionMonitorScope Methods
The DataConversionMonitorScope type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace