Revit 2027 API
FormArrayIterator Class
An iterator to a form array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FormArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class FormArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class FormArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class FormArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type FormArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The FormArrayIterator type exposes the following members.
Constructors
Name | Description
FormArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace