Revit 2027 API
RebarShapeConstraintFixedSegmentDir Class
 A constraint that can be applied to a RebarShapeSegment and fixes the direction of the segment in UV-space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintFixedSegmentDir : RebarShapeConstraint
Public Class RebarShapeConstraintFixedSegmentDir
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintFixedSegmentDir : public RebarShapeConstraint
type RebarShapeConstraintFixedSegmentDir =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintFixedSegmentDir type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintFixedSegmentDir |  Create a fixed segment direction constraint.
Top
Properties
Name | Description
Direction |  The direction of the RebarShapeSegment in UV-space.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace