Revit 2027 API
ExternalCommandsData Class
 Base class used to contain external command information necessary to construct PushButtonData and MenuItem.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalCommandsData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalCommandsData : IDisposable
Public Class ExternalCommandsData
	Implements IDisposable
public ref class ExternalCommandsData : IDisposable
type ExternalCommandsData =
    class
        interface IDisposable
    end
The ExternalCommandsData type exposes the following members.
Properties
Name | Description
AssemblyName |  The assembly path of the menu item.
AvailabilityClassName |  The full class name for the class providing the entry point to decide availability of this menu item.
ClassName |  The name of the class containing the implementation for the command.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalCommandsData
Top
See Also
Reference
Autodesk.Revit.UI Namespace