Revit 2027 API
DialogBoxData Class
 An object that is passed to your application when a dialog is displayed in Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.UI.Events.DialogBoxData
 Autodesk.Revit.UI.Events.MessageBoxData
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DialogBoxData : APIObject
Public Class DialogBoxData
	Inherits APIObject
public ref class DialogBoxData : public APIObject
type DialogBoxData =
    class
        inherit APIObject
    end
The DialogBoxData type exposes the following members.
Properties
Name | Description
HelpId |  An ID that represents the dialog that has been displayed.
Top
Methods
Name | Description
OverrideResult |  Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Top
Remarks
 When the application receives this object, a dialog has been displayed in Revit that requires user interaction. The OverrideResult function can be used to cause the dialog to be dismissed and return a desired result code.
See Also
Reference
Autodesk.Revit.UI.Events Namespace