Revit 2027 API
ScheduleDefinition Class
 Settings that define the contents of a schedule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ScheduleDefinition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ScheduleDefinition : IDisposable
Public Class ScheduleDefinition
	Implements IDisposable
public ref class ScheduleDefinition : IDisposable
type ScheduleDefinition =
    class
        interface IDisposable
    end
The ScheduleDefinition type exposes the following members.
Properties
Name | Description
AreaSchemeId |  In an area schedule, the ID of the area scheme to display.
CategoryId |  The category ID of elements appearing in the schedule.
EmbeddedDefinition |  The embedded ScheduleDefinition.
FamilyId |  In a note block schedule, the ID of the Generic Annotation family displayed by the schedule.
GrandTotalTitle |  The title name is used to display at the grand total row. The name is "Grand total", expressed in the Revit session language, by default.
HasEmbeddedSchedule |  Indicates if this ScheduleDefinition has an embedded ScheduleDefinition.
IncludeLinkedFiles |  Indicates if the schedule includes elements from linked files.
IsEmbedded |  Indicates if this is an embedded ScheduleDefinition.
IsFilteredBySheet |  Indicates if the schedule is set to filter by sheet.
IsItemized |  Indicates if the schedule displays each element on a separate row or combines multiple grouped elements onto the same row.
IsKeySchedule |  Indicates if the schedule is a key schedule.
IsMaterialTakeoff |  Indicates if the schedule is a material takeoff.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowGrandTotal |  Indicates if a grand total row should be displayed at the bottom of the schedule.
ShowGrandTotalCount |  Indicates if the grand total row should display a count of elements in the schedule.
ShowGrandTotalTitle |  Indicates if the grand total row should display a title.
ShowGridLines |  Indicates if the schedule grid lines will be visible on a sheet.
ShowHeaders |  Indicates if the headers will be displayed in the schedule.
ShowTitle |  Indicates if the title will be displayed in the schedule.
Top
Methods
Name | Description
AddEmbeddedSchedule |  Adds an embedded ScheduleDefinition.
AddField(SchedulableField) |  Adds a regular field at the end of the list.
AddField(ScheduleFieldType) |  Adds a regular field at the end of the list.
AddField(ScheduleFieldType, ElementId) |  Adds a regular field at the end of the list.
AddFilter |  Adds a new filter at the end of the list.
AddSortGroupField |  Adds a new sorting/grouping field at the end of the list.
CanFilter |  Checks whether filters can be added to this ScheduleDefinition.
CanFilterByGlobalParameters |  Checks whether a field can be used with a global parameter-based filter.
CanFilterByParameterExistence |  Checks whether a field can be used with a HasParameter filter.
CanFilterBySubstring |  Checks whether a field can be used with a substring-based filter.
CanFilterByValue |  Checks whether a field can be used with a value-based filter.
CanFilterByValuePresence |  Checks whether a field can be used with a value presence-based filter.
CanHaveEmbeddedSchedule |  Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition added.
CanIncludeLinkedFiles |  Checks whether the schedule is a type that supports including elements from linked files.
CanSortByField |  Checks whether a field can be used for sorting/grouping.
ClearFields |  Removes all fields.
ClearFilters |  Removes all filters.
ClearSortGroupFields |  Removes all sorting/grouping fields.
Dispose | Releases all resources used by the ScheduleDefinition
GetField(Int32) |  Gets a field.
GetField(ScheduleFieldId) |  Gets a field.
GetFieldCount |  Gets the number of fields in this ScheduleDefinition.
GetFieldId |  Converts a field index to the corresponding field ID.
GetFieldIndex |  Converts a field ID to the corresponding field index.
GetFieldOrder |  Gets the IDs of the current list of fields in order.
GetFilter |  Gets a filter.
GetFilterCount |  Gets the number of filters in this ScheduleDefinition.
GetFilters |  Gets all filters in this ScheduleDefinition.
GetSchedulableFields |  Gets a list of all non-calculated/non-combined fields that are eligible to be included in this schedule.
GetSortGroupField |  Gets a sorting/grouping field.
GetSortGroupFieldCount |  Gets the number of sorting/grouping fields in this ScheduleDefinition.
GetSortGroupFields |  Gets all sorting/grouping fields in this ScheduleDefinition.
GetValidCategoriesForEmbeddedSchedule |  Get all categories that can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
InsertCombinedParameterField |  Adds a combined parameter field at the specified position in the list.
InsertField(SchedulableField, Int32) |  Adds a regular field at the specified position in the list.
InsertField(ScheduleFieldType, Int32) |  Adds a regular field at the specified position in the list.
InsertField(ScheduleFieldType, ElementId, Int32) |  Adds a regular field at the specified position in the list.
InsertFilter |  Adds a new filter at the specified position in the list.
InsertSortGroupField |  Adds a new sorting/grouping field at the specified position in the list.
IsSchedulableField |  Checks whether a non-calculated/non-combined field is eligible to be included in this schedule.
IsValidCategoryForEmbeddedSchedule |  Indicates if a category can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
IsValidCategoryForFilterBySheet |  Checks whether a schedule can be filtered by sheet.
IsValidCombinedParameters |  Checks if data is valid for combined parameters
IsValidFieldId |  Checks whether a ScheduleFieldId is the ID of a field in this ScheduleDefinition.
IsValidFieldIndex |  Checks whether an integer is a valid zero-based field index in this ScheduleDefinition.
RemoveEmbeddedSchedule |  Removes the embedded ScheduleDefinition.
RemoveField(Int32) |  Removes a field.
RemoveField(ScheduleFieldId) |  Removes a field.
RemoveFilter |  Removes a filter.
RemoveSortGroupField |  Removes a sorting/grouping field.
SetFieldOrder |  Reorders the fields in the schedule.
SetFilter |  Replaces a filter.
SetFilters |  Replaces all filters in this ScheduleDefinition.
SetSortGroupField |  Replaces a sorting/grouping field.
SetSortGroupFields |  Replaces all sorting/grouping fields in this ScheduleDefinition.
Top
Remarks
The ScheduleDefinition class contains various settings that define the contents of a schedule view, including:
The schedule's category and other basic properties that determine the type of schedule.
A set of fields that become the columns of the schedule.
Filters that restrict the set of elements visible in the schedule.
Sorting and grouping criteria.
Most schedules contain a single ScheduleDefinition. In Revit MEP, schedules of certain categories can contain an "embedded schedule" containing elements associated with the elements in the primary schedule, for example a room schedule showing the elements inside each room or a duct system schedule showing the elements associated with each system. An embedded schedule has its own category, fields, filters, etc. Those settings are stored in a second ScheduleDefinition object.
See Also
Reference
Autodesk.Revit.DB Namespace