Revit 2027 API
SpatialElementFromToCalculationPoints Methods
The SpatialElementFromToCalculationPoints type exposes the following members.
Methods
Name | Description
Flip |  flip the direction of the "from" and "to" points
IsAcceptableFromPosition |  Checks whether a given "from" position is valid.
IsAcceptableToPosition |  Checks whether a given "to" position is valid.
MakeFromPositionAcceptable |  This function takes a potential "from" point and converts it to be a similar point on the opposite side of the family's host from the "to" point if necessary.
MakeToPositionAcceptable |  This function takes a potential "to" point and converts it to be a similar point on the opposite side of the family's host from the "from" point if necessary.
Top
See Also
Reference
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace