Revit 2027 API
AssetPropertyDouble Methods
The AssetPropertyDouble type exposes the following members.
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace