Revit 2027 API
DetailCurveArray Properties
The DetailCurveArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an item at a specified index within the array.
Size | Returns the number of objects that are in the array.
Top
See Also
Reference
DetailCurveArray Class
Autodesk.Revit.DB Namespace