Revit 2027 API
Point Methods
The Point type exposes the following members.
Methods
Name | Description
Create(XYZ) |  Creates a point at the given coordinates.
Create(XYZ, ElementId) |  Creates a point at the given coordinates and assigns it the specified GraphicsStyle.
Top
See Also
Reference
Point Class
Autodesk.Revit.DB Namespace