Revit 2027 API
ReferencePointArrayIterator Class
An iterator to a reference array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferencePointArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ReferencePointArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class ReferencePointArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ReferencePointArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ReferencePointArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ReferencePointArrayIterator type exposes the following members.
Constructors
Name | Description
ReferencePointArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace