Revit 2027 API
ConduitSize Class
 Stores the basic size information for a conduit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConduitSize
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConduitSize : IDisposable
Public Class ConduitSize
	Implements IDisposable
public ref class ConduitSize : IDisposable
type ConduitSize =
    class
        interface IDisposable
    end
The ConduitSize type exposes the following members.
Constructors
Name | Description
ConduitSize |  Constructs an object that stores the basic size information for conduit.
Top
Properties
Name | Description
BendRadius |  Minimum bend radius
InnerDiameter |  Inner diameter
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NominalDiameter |  Nominal diameter
OuterDiameter |  Outer diameter
UsedInSizeLists |  Whether it is used in size lists.
UsedInSizing |  Whether is used in sizing.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConduitSize
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace