Revit 2027 API
GenericZone Methods
The GenericZone type exposes the following members.
Methods
Name | Description
AddSpaces |  Adds spaces to the zone.
ConvertSpaceBasedToSketchBased |  Converts a space-based generic zone to a sketch-based generic zone.
CreateSketchBased |  Creates a new instance of a sketch-based generic zone and adds it to the document.
CreateSpaceBased |  Creates a new instance of a generic zone using a set of spaces and adds it to the document.
GetBoundaries |  Gets the boundaries for the generic zone.
GetDomainData |  Gets the domain data for the generic zone.
GetSketchId |  Gets the sketch id for the generic zone.
GetSpaceIds |  Gets a list of ElementIds of the associated spaces for the zone.
RemoveSpaces |  Removes spaces from the zone.
Top
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace