Revit 2027 API
RevisionSettings Methods
The RevisionSettings type exposes the following members.
Methods
Name | Description
GetRevisionSettings |  Returns the RevisionSettings for the given project document.
IsAcceptableRevisionCloudSpacing |  Rounds the given raw value and checks whether it is an acceptable cloud spacing value after it is rounded.
RoundRevisionCloudSpacing |  Rounds the given revision cloud spacing value according to the document's settings.
Top
See Also
Reference
RevisionSettings Class
Autodesk.Revit.DB Namespace