Revit 2027 API
ExtrusionAnalyzer Methods
The ExtrusionAnalyzer type exposes the following members.
Methods
Name | Description
CalculateFaceAlignment |  Calculates the alignment status of each face of the solid.
Create |  Creates an ExtrusionAnalyzer and computes and stores the Solid's shadow.
Dispose
GetExtrusionBase |  Obtains the face that represents the base contour of the extrusion analysis.
Top
See Also
Reference
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace