Revit 2027 API
ElementTypeDuplicatingEventArgs Properties
The ElementTypeDuplicatingEventArgs type exposes the following members.
Properties
Name | Description
ElementTypeId |  The id of the ElementType to be duplicated.
Top
See Also
Reference
ElementTypeDuplicatingEventArgs Class
Autodesk.Revit.DB.Events Namespace