Revit 2027 API
ViewPrintedEventArgs Properties
The ViewPrintedEventArgs type exposes the following members.
Properties
Name | Description
Index |  The index of the view being printed out of the set of all views being printed.
TotalViews |  The number of all views being printed.
View |  The view that was printed.
Top
See Also
Reference
ViewPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace