Revit 2027 API
LightType Class
 This class encapsulates light information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightType
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LightType : IDisposable
Public Class LightType
	Implements IDisposable
public ref class LightType : IDisposable
type LightType =
    class
        interface IDisposable
    end
The LightType type exposes the following members.
Properties
Name | Description
ColorFilter |  The light filter color.
DimmingColor |  The dimming temperature value in Kelvins.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LightType
GetInitialColor |  Return a copy of an object derived from InitialColor
GetInitialIntensity |  Return a copy of an object derived from InitialIntensity
GetLightDistribution |  Return a copy of an object derived from LightDistribution
GetLightShape |  Return a copy of an object derived from LightShape
GetLightType |  Creates a light type object from the given document and family type ID
GetLightTypeFromInstance |  Creates a light type object from the given document and element ID
GetLossFactor |  Return a copy of an object derived from LossFactor
SetInitialColor |  Replace the current initial color object with the given object
SetInitialIntensity |  Replace the current initial intensity object with the given object
SetLightDistribution |  Replace the current LightDistribution object with the given object
SetLightShape |  Replace the current LightShape object with the given object
SetLossFactor |  Replace the current loss factor object with the given object
Top
Example
public void GetLightData(Document document)
{
    // This code demonstrates how to get light information from project and family document
    LightType lightData = null;
    if (document.IsFamilyDocument)
    {
        // In family document, get LightType via LightFamily.GetLightType(int) method.
        LightFamily lightFamily = LightFamily.GetLightFamily(document);
        for (int index = 0; index < lightFamily.GetNumberOfLightTypes(); index++)
        {
            lightData = lightFamily.GetLightType(index);
        }
    }
    else
    {
        // In family document, get LightType via GetLightTypeFromInstance or GetLightType method.
        // In order to get the light information, please get a light fixture instance first
        FilteredElementCollector collector = new FilteredElementCollector(document);
        collector.OfClass(typeof(FamilyInstance)).OfCategory(BuiltInCategory.OST_LightingFixtures);
        FamilyInstance lightFixture = collector.Cast<FamilyInstance>().First<FamilyInstance>();
        if (lightFixture == null)    // check null reference
            return;
        // Get the LightType for given light fixture
        lightData = LightType.GetLightTypeFromInstance(document, lightFixture.Id);
    }
    // Get the light data via LightType
    Color filterColor = lightData.ColorFilter;  // get the ColorFilter property
    LossFactor lossFactor = lightData.GetLossFactor();  // get the loss factor
    if (lossFactor is AdvancedLossFactor)
    {
        AdvancedLossFactor advancedFactor = lossFactor as AdvancedLossFactor;
        double luminaireValue = advancedFactor.LuminaireDirtDepreciation;
    }
}
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace