Revit 2027 API
PlanTopology Properties
The PlanTopology type exposes the following members.
Properties
Name | Description
Circuits | The Circuits of the PlanTopology.
Level | The Level of the PlanTopology.
Phase | The phase of the PlanTopology.
Top
See Also
Reference
PlanTopology Class
Autodesk.Revit.DB Namespace