Revit 2027 API
IFCFileModelOptions Methods
The IFCFileModelOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace