Revit 2027 API
FileOpenDialog Properties
The FileOpenDialog type exposes the following members.
Properties
Name | Description
ShowPreview |  Identifies if the dialog should include a region showing a preview of the selected file.
Top
See Also
Reference
FileOpenDialog Class
Autodesk.Revit.UI Namespace