Revit 2027 API
IFCUserDefinedProperty Class
 Represents the IFC property stored in the property set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFCUserDefinedProperty
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCUserDefinedProperty : IDisposable
Public Class IFCUserDefinedProperty
	Implements IDisposable
public ref class IFCUserDefinedProperty : IDisposable
type IFCUserDefinedProperty =
    class
        interface IDisposable
    end
The IFCUserDefinedProperty type exposes the following members.
Constructors
Name | Description
IFCUserDefinedProperty() |  Constructs a new IFCUserDefinedProperty with default values.
IFCUserDefinedProperty(String, ElementId, String, String, IFCUserDefinedPropertyType, String) |  Constructs a new IFCUserDefinedProperty with input values. The property name. The Revit property id. The Revit property name. The data type of the property. The type of the property. The defined value data type of the table property.
Top
Properties
Name | Description
DataType |  The data type of the property.
DataTypeDefined |  The defined value data type of the table property.
IFCPropertyName |  The IFC property name.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PropertyType |  The type of the property.
RevitPropertyId |  The Revit property id.
RevitPropertyName |  The Revit property name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCUserDefinedProperty
Top
See Also
Reference
Autodesk.Revit.DB Namespace