Revit 2027 API
HomeCamera Class
 A structure that contains information about the camera and view for the Home view orientation stored in the model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.HomeCamera
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HomeCamera : IDisposable
Public Class HomeCamera
	Implements IDisposable
public ref class HomeCamera : IDisposable
type HomeCamera =
    class
        interface IDisposable
    end
The HomeCamera type exposes the following members.
Constructors
Name | Description
HomeCamera |  Constructs a new copy of the input HomeCamera object.
Top
Properties
Name | Description
BottomAngleOfFieldOfView |  The bottom angle of the field of view.
Center |  The zoom or orbit center.
EyePosition |  The eye position point.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LeftAngleOfFieldOfView |  The left angle of the field of view.
OrthogonalProjectionHeight |  The height of orthogonal projection view volume.
OrthogonalProjectionWidth |  The width of orthogonal projection view volume.
Pivot |  The pivot point.
RightAngleOfFieldOfView |  The right angle of the field of view.
TopAngleOfFieldOfView |  The top angle of the field of view.
UpDirection |  The up direction vector.
ViewId |  The id of the view which is associated to this document's Home view orientation.
Top
Methods
Name | Description
Dispose | Releases all resources used by the HomeCamera
Top
See Also
Reference
Autodesk.Revit.DB Namespace