Revit 2027 API
ReferenceArray Methods
The ReferenceArray type exposes the following members.
Methods
Name | Description
Append | Add the reference to the end of the array.
Clear | Removes every reference from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified reference into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
ReferenceArray Class
Autodesk.Revit.DB Namespace