Revit 2027 API
LoadComponent Methods
The LoadComponent type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace