Revit 2027 API
StructuralWallUsageFilter Class
 A filter used to match walls that have the given structural wall usage.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Structure.StructuralWallUsageFilter
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralWallUsageFilter : ElementSlowFilter
Public Class StructuralWallUsageFilter
	Inherits ElementSlowFilter
public ref class StructuralWallUsageFilter : public ElementSlowFilter
type StructuralWallUsageFilter =
    class
        inherit ElementSlowFilter
    end
The StructuralWallUsageFilter type exposes the following members.
Constructors
Name | Description
StructuralWallUsageFilter(StructuralWallUsage) |  Constructs a new instance of a filter to match walls that have the given structural wall usage.
StructuralWallUsageFilter(StructuralWallUsage, Boolean) |  Constructs a new instance of a filter to match walls that have the given structural wall usage, with the option to match all walls which are not of the given structural wall usage.
Top
Properties
Name | Description
StructuralWallUsage |  The wall structural usage.
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace