Revit 2027 API
RevisionCloud Class
 A RevisionCloud is a graphical "cloud" that can be displayed on a view or sheet to indicate where revisions in the model have occurred.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.RevisionCloud
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevisionCloud : Element
Public Class RevisionCloud
	Inherits Element
public ref class RevisionCloud : public Element
type RevisionCloud =
    class
        inherit Element
    end
The RevisionCloud type exposes the following members.
Properties
Name | Description
RevisionId |  The Revision associated with this RevisionCloud.
Top
Methods
Name | Description
Create |  Creates a new RevisionCloud in the model.
GetSheetIds |  Returns the ids of the ViewSheets where this RevisionCloud may appear and contribute to the sheet's revision schedule.
GetSketchCurves |  Returns copies of the Curves that form this RevisionCloud.
IsRevisionIssued |  Indicates whether the Revision associated with this RevisionCloud has been issued.
Top
Remarks
 RevisionClouds are view specific and can be created in most graphical views, except 3D. Unlike most Elements, RevisionClouds may be added directly to a ViewSheet. Each RevisionCloud is associated with one Revision.
When a RevisionCloud is visible on a ViewSheet (either because it is directly placed on that ViewSheet or because it is visible in a View placed on the ViewSheet), any revision schedules displayed on the ViewSheet will automatically include the Revision associated with the RevisionCloud.
Note also that when a RevisionCloud is created in a ViewLegend, it is treated as a legend representation of what a RevisionCloud looks like rather than as an actual indication of a change to the model. As a result, RevisionClouds in ViewLegends will not affect the contents of revision schedules.
RevisionClouds are created from a collection of sketched curves. Each curve will have a series of "cloud bumps" drawn along it to form the appearance of a cloud. There is no requirement that the curves form closed loops.
See Also
Reference
Autodesk.Revit.DB Namespace