Revit 2027 API
FilterStringGreaterOrEqual Class
 Tests whether string values from the document would sort after or match a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringGreaterOrEqual
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringGreaterOrEqual : FilterStringRuleEvaluator
Public Class FilterStringGreaterOrEqual
	Inherits FilterStringRuleEvaluator
public ref class FilterStringGreaterOrEqual : public FilterStringRuleEvaluator
type FilterStringGreaterOrEqual =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringGreaterOrEqual type exposes the following members.
Constructors
Name | Description
FilterStringGreaterOrEqual |  Constructs an instance of FilterStringGreaterOrEqual.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace