Revit 2027 API
DocumentCreatingEventArgs Class
 The event arguments used by the DocumentCreating event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentCreatingEventArgs : RevitAPIPreEventArgs
Public Class DocumentCreatingEventArgs
	Inherits RevitAPIPreEventArgs
public ref class DocumentCreatingEventArgs : public RevitAPIPreEventArgs
type DocumentCreatingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The DocumentCreatingEventArgs type exposes the following members.
Properties
Name | Description
DocumentType |  Type of the document which is about to be created, e.g. Project or Template.
Template |  The template file path to be used for creating the new document.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace