Revit 2027 API
LightShape Methods
The LightShape type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the LightShape derived object.
Dispose
Top
See Also
Reference
LightShape Class
Autodesk.Revit.DB.Lighting Namespace