Revit 2027 API
ElectricalAnalyticalLoadSet Properties
The ElectricalAnalyticalLoadSet type exposes the following members.
Properties
Name | Description
QuantityOnStandBy |  The number of Equipment Loads that are not operational at any time.
TotalQuantity |  The total count of the Equipment Loads in the LoadSet.
Top
See Also
Reference
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace