Revit 2027 API
ExtendedParameterElement Class
 An element that stores the definition of an extended property created by an extended properties link.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ParameterElement
 Autodesk.Revit.DB.ExternalData.ExtendedParameterElement
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtendedParameterElement : ParameterElement
Public Class ExtendedParameterElement
	Inherits ParameterElement
public ref class ExtendedParameterElement : public ParameterElement
type ExtendedParameterElement =
    class
        inherit ParameterElement
    end
The ExtendedParameterElement type exposes the following members.
Properties
Name | Description
LinkId |  The ID of the [!:Autodesk::Revit::DB::ExternalData::ExtendedPropertiesLink] to which this extended property belongs.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace