Revit 2027 API
FamilySizeTable Methods
The FamilySizeTable type exposes the following members.
Methods
Name | Description
AsValueString |  Gets the table cell value as a string.
Dispose
GetColumnHeader |  Gets a column of the table at at given index.
IsValidColumnIndex |  Checks if the column index is valid.
Top
See Also
Reference
FamilySizeTable Class
Autodesk.Revit.DB Namespace