Revit 2027 API
CableTraySettings Methods
The CableTraySettings type exposes the following members.
Methods
Name | Description
GetCableTraySettings |  Gets the cable tray settings of the project.
Top
See Also
Reference
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace