Revit 2027 API
EnergyAnalysisSpace Properties
The EnergyAnalysisSpace type exposes the following members.
Properties
Name | Description
Area |  The area for this space.
CADObjectUniqueId |  The unique id of the originating Element associated with this EnergyAnalysisSpace at the time of EAM creation.
ComposedName |  The composed name for this space.
Description |  The description.
Number |  The number to identify the space.
SpaceName |  The name.
Volume |  The volume for this space.
Top
See Also
Reference
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace