Revit 2027 API
Face Methods
The Face type exposes the following members.
Methods
Name | Description
ComputeDerivatives | Returns the first partial derivatives of the underlying surface at the specified point.
ComputeNormal | Returns the normal vector for the face at the given point.
ComputeSecondDerivatives | Returns the second partial derivatives of the face at the specified point.
Evaluate | Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.
GetBoundingBox | Returns the UV bounding box of the face.
GetEdgesAsCurveLoops | Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
GetRegions | Gets the face regions (created, for example, by the Split Face command) of the face.
GetSurface | Returns a copy of this face's surface.
Intersect(Curve) | Calculates the intersection of the specified curve with this face.
Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results.
Intersect(Curve, IntersectionResultArray) | Calculates the intersection of the specified curve with this face and returns the intersection results.
Intersect(Face, Curve) | Calculates the intersection of the specified face with this face and returns the intersection results.
IsInside(UV) | Indicates whether the specified point is within this face.
IsInside(UV, IntersectionResult) | Indicates whether the specified point is within this face and outputs additional information about the point location.
Project | Projects the specified point on the face.
Triangulate() | Returns a triangular mesh approximation to the face.
Triangulate(Double) | Returns a triangular mesh approximation to the face.
Top
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace