Revit 2027 API
Area Class
Provides access to the area topology in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElement
 Autodesk.Revit.DB.Area
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Area : SpatialElement
Public Class Area
	Inherits SpatialElement
public ref class Area : public SpatialElement
type Area =
    class
        inherit SpatialElement
    end
The Area type exposes the following members.
Properties
Name | Description
AreaScheme | The area scheme.
IsGrossInterior | The boolean value that indicates whether the area is gross interior.
Top
Methods
Name | Description
Top
Remarks
The area object can be queried for its boundary for use in space planning tools.
See Also
Reference
Autodesk.Revit.DB Namespace