Revit 2027 API
SiteLocation Methods
The SiteLocation type exposes the following members.
Methods
Name | Description
ConvertFromProjectTime | Converts project time to UTC time.
ConvertToProjectTime | Converts local time or UTC time to project time.
IsCompatibleWith |  Checks whether the geographic coordinate system of this site is compatible with the given site . True if he geographic coordinate system of this site is compatible with the given site, false otherwise.
SetGeoCoordinateSystem |  Set the geographic coordinate system for this site. Similar to acquire coordinate system from a link in the UI.
Top
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace