Revit 2027 API
DuctLiningType Class
 This class represents a duct lining type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Mechanical.DuctLiningType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctLiningType : ElementType
Public Class DuctLiningType
	Inherits ElementType
public ref class DuctLiningType : public ElementType
type DuctLiningType =
    class
        inherit ElementType
    end
The DuctLiningType type exposes the following members.
Properties
Name | Description
Roughness |  The roughness of Duct Lining.
Top
Methods
Name | Description
IsValidRoughness |  Identifies if the input roughness is valid.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace