Revit 2027 API
Units Methods
The Units type exposes the following members.
Methods
Name | Description
Dispose
GetFormatOptions |  Gets the default FormatOptions for a spec.
GetModifiableSpecs |  Gets all specs for which the default FormatOptions can be modified.
IsModifiableSpec |  Checks whether the default FormatOptions can be modified for a given spec.
SetFormatOptions |  Sets the default FormatOptions for a spec.
Top
See Also
Reference
Units Class
Autodesk.Revit.DB Namespace