Revit 2027 API
AssetProperties Class
 Represents a set of asset property(s).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetProperties
 Autodesk.Revit.DB.Visual.Asset
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetProperties : AssetProperty
Public Class AssetProperties
	Inherits AssetProperty
public ref class AssetProperties : public AssetProperty
type AssetProperties =
    class
        inherit AssetProperty
    end
The AssetProperties type exposes the following members.
Properties
Name | Description
Item
Size |  The number of the AssetProperty(s) in the object.
Top
Methods
Name | Description
FindByName |  Gets the property with the given name.
Get |  Gets the property at the given index.
IsValidIndex |  Returns true if the provided index is valid.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace