Revit 2027 API
Path3d Class
Provides access to the Generic 3D path object in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SketchBase
 Autodesk.Revit.DB.Path3d
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Path3d : SketchBase
Public Class Path3d
	Inherits SketchBase
public ref class Path3d : public SketchBase
type Path3d =
    class
        inherit SketchBase
    end
The Path3d type exposes the following members.
Properties
Name | Description
AllCurveLoops | Get all the Curve Loops of Path3d.
CurveLoop | Get the Curve Loop of Path3d via index.
NumCurveLoops | Get the Number of Curve Loops of Path3d.
Top
Methods
Name | Description
Top
Remarks
This object represents a 3D path sketch of Sweep.
See Also
Reference
Autodesk.Revit.DB Namespace