Revit 2027 API
FilterNumericRuleEvaluator Methods
The FilterNumericRuleEvaluator type exposes the following members.
Methods
Name | Description
Dispose
Evaluate(Int64, Int64) |  Derived classes should override this method to implement the desired test.
Evaluate(Double, Double, Double) |  Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not.
Top
See Also
Reference
FilterNumericRuleEvaluator Class
Autodesk.Revit.DB Namespace