Revit 2027 API
Stairs Class
 Represents a stairs element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.Stairs
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Stairs : Element
Public Class Stairs
	Inherits Element
public ref class Stairs : public Element
type Stairs =
    class
        inherit Element
    end
The Stairs type exposes the following members.
Properties
Name | Description
ActualRiserHeight |  The actual height of the stairs risers in the stairs.
ActualRisersNumber |  The total number of actually created risers in model.
ActualTreadDepth |  The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
ActualTreadsNumber |  The number of treads actually created in the stairs.
BaseElevation |  The base elevation of the stairs.
DesiredRisersNumber |  The number of risers is calculated based on the height between levels.
Height |  The height of the stair between the base and top levels.
MultistoryStairsId |  The id of the MultistoryStairs element to which this element belongs. If this stairs element is not a member of a MultistoryStairs element, this will be InvalidElementId.
NumberOfStories |  The number of stories of a multi-story stair, or 1 for a single-story stair.
TopElevation |  The top elevation of the stairs.
Top
Methods
Name | Description
GetAssociatedRailings |  Gets a list of the Railing elements which are associated to the boundaries of the stairs.
GetStairsLandings |  Returns all the stairs landing components in the stairs.
GetStairsRuns |  Returns all the stairs run components in the stairs.
GetStairsSupports |  Returns all the stairs support components in the stairs.
IsByComponent |  Indicates if the stairs is created by stairs components(runs, landings and supports).
IsInEditMode |  Indicates whether the stairs is in edit mode or not.
Top
Remarks
 This element may represent a standalone Stairs element, or a member of a MultistoryStairs element. Use MultistoryStairsId to identify if this Stairs element is a part of a MultistoryStairs.
Example
private Stairs GetStairInfo(Document document)
{
    Stairs stairs = null;
    FilteredElementCollector collector = new FilteredElementCollector(document);
    ICollection<ElementId> stairsIds = collector.WhereElementIsNotElementType().OfCategory(BuiltInCategory.OST_Stairs).ToElementIds();
    foreach (ElementId stairId in stairsIds)
    {
        if (Stairs.IsByComponent(document, stairId) == true)
        {
            stairs = document.GetElement(stairId) as Stairs;
            // Format the information
            String info = "\nNumber of stories:  " + stairs.NumberOfStories;
            info += "\nHeight of stairs:  " + stairs.Height;
            info += "\nNumber of treads:  " + stairs.ActualTreadsNumber;
            info += "\nTread depth:  " + stairs.ActualTreadDepth;
            // Show the information to the user.
            TaskDialog.Show("Revit", info);
        }
    }
    return stairs;
}
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace