Revit 2027 API
ElementNode Class
 A render node that represents an element, including the host document containing the element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ElementNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementNode : RenderNode
Public Class ElementNode
	Inherits RenderNode
public ref class ElementNode : public RenderNode
type ElementNode =
    class
        inherit RenderNode
    end
The ElementNode type exposes the following members.
Properties
Name | Description
Document |  Gets the document associated with the element.
ElementId |  The Id of the element.
LinkInstanceId |  The Id of the link instance for the element.
Top
Methods
Name | Description
Top
Remarks
 See also: OnElementBegin2D(ElementNode). See also: OnElementEnd2D(ElementNode).
See Also
Reference
Autodesk.Revit.DB Namespace