Revit 2027 API
ViewExportingEventArgs Class
 The event arguments used by the ViewExporting event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ViewExportingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewExportingEventArgs : RevitAPIPreDocEventArgs
Public Class ViewExportingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ViewExportingEventArgs : public RevitAPIPreDocEventArgs
type ViewExportingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ViewExportingEventArgs type exposes the following members.
Properties
Name | Description
ViewId |  Identifies the view about to be exported.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace