Revit 2027 API
SystemZoneData Properties
The SystemZoneData type exposes the following members.
Properties
Name | Description
ZoneEquipmentId |  The id of the zone equipment related to the zone.
Top
See Also
Reference
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace