Revit 2027 API
AccessDeniedException Methods
The AccessDeniedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
AccessDeniedException Class
Autodesk.Revit.Exceptions Namespace