Revit 2027 API
UIControlledApplication Class
Represents the Autodesk Revit user interface, providing access to UI customization methods and events.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIControlledApplication
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class UIControlledApplication
Public Class UIControlledApplication
public ref class UIControlledApplication
type UIControlledApplication = class end
The UIControlledApplication type exposes the following members.
Properties
Name | Description
ActiveAddInId |  Get current active external application or external command id.
ControlledApplication | Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
IsLateAddinLoading |  Indicates whether this add-in is loaded on the fly or not. If it is loaded when Revit is starting up, it is false, otherwise it should be true.
IsViewerModeActive |  Determines if Revit session is in Viewer mode.
LoadedApplications |  Returns an array of successfully loaded external applications.
MainWindowHandle | Get the handle of the Revit main window.
ProductIsRS |  Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
Top
Methods
Name | Description
CreateAddInCommandBinding | Creates a new AddInCommandBinding.
CreateRibbonPanel(String) |  Create a new RibbonPanel on the Add-Ins tab.
CreateRibbonPanel(String, String) |  Create a new RibbonPanel on the specified tab.
CreateRibbonPanel(Tab, String) |  Create a new RibbonPanel on the designated standard Revit tab.
CreateRibbonTab |  Creates a new tab on the Revit user interface.
GetDockablePane | Gets a DockablePane object by its ID.
GetRibbonPanels() |  Get all the custom Panels on Add-Ins tab of Revit.
GetRibbonPanels(String) |  Get all the custom Panels on a designated Revit tab.
GetRibbonPanels(Tab) |  Get all the custom Panels on a designated standard Revit tab.
LoadAddIn | Loads add-ins from the given manifest file.
LoadPackageContents | Loads add-ins from the given packageContents.xml file.
RegisterContextMenu | Adds a new context menu creator.
RegisterDockablePane | Adds a new dockable pane to the Revit user interface.
RemoveAddInCommandBinding | Removes an AddInCommandBinding.
Top
Events
Name | Description
ApplicationClosing |  Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
DialogBoxShowing |  Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box.
DisplayingOptionsDialog |  Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
DockableFrameFocusChanged |  Subscribe to this event to be notified when a Revit GenericDockableFrame has gained focus or lost focus in the Revit user interface. This event is called only for API-created GenericDockableFrames.
DockableFrameVisibilityChanged |  Subscribe to this event to be notified when a Revit GenericDockableFrame has been shown or hidden in the Revit user interface. This event is called only for API-created GenericDockableFrames.
FabricationPartBrowserChanged |  Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
FormulaEditing |  Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.
Idling |  Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction.
SelectionChanged |  Subscribe to the SelectionChanged event to be notified after the selection was changed.
ThemeChanged |  Subscribe to the ThemeChanged event to be notified after the theme was changed.
TransferredProjectStandards |  Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized.
TransferringProjectStandards |  Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.
ViewActivated |  Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document.
ViewActivating |  Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document.
Top
Remarks
This class does not provide access to documents because it is provided to you through the ExternalApplication OnStartup()/OnShutdown() methods, and those methods are when it is not possible to work with Revit documents. You can work with documents by getting them from the UIApplication class; that class is obtained from events and ExternalCommand callbacks.
See Also
Reference
Autodesk.Revit.UI Namespace