Revit 2027 API
ContinuousRail Properties
The ContinuousRail type exposes the following members.
Properties
Name | Description
HostRailingId |  The id of the host Railing that contains this rail.
Length |  The length of the rail.
Top
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace