Revit 2027 API
ExternalCommandData Properties
The ExternalCommandData type exposes the following members.
Properties
Name | Description
Application |  Retrieves an object that represents the current Application for external command.
JournalData | A data map that can be used to read and write data to the Autodesk Revit journal file.
View |  Retrieves an object that represents the View external command work on.
Top
See Also
Reference
ExternalCommandData Class
Autodesk.Revit.UI Namespace