Revit 2027 API
RebarHookType Properties
The RebarHookType type exposes the following members.
Properties
Name | Description
HookAngle |  The hook angle, measured in radians. Must be greater than 0.0174532925 (1 degree) and no more than PI (180 degree).
StraightLineMultiplier |  Multiplier of bar diameter. Used to compute a default hook length. The default hook length can be overridden by the RebarBarType class.
Style |  The hook may only be applied to shapes of the specified style.
Top
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace