Revit 2027 API
FilterElementIdRule Class
 A filter rule that operates on ElementId values in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterElementIdRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterElementIdRule : FilterNumericValueRule
Public Class FilterElementIdRule
	Inherits FilterNumericValueRule
public ref class FilterElementIdRule : public FilterNumericValueRule
type FilterElementIdRule =
    class
        inherit FilterNumericValueRule
    end
The FilterElementIdRule type exposes the following members.
Constructors
Name | Description
FilterElementIdRule |  Constructs an instance of FilterElementIdRule.
Top
Properties
Name | Description
RuleValue |  The user-supplied value against which values from a Revit document will be tested.
Top
Methods
Name | Description
UsesLevelFiltering |  This function checks if a parameter uses level filtering.
Top
Remarks
 When GetRuleParameter() returns a parameter that UsesLevelFiltering(Document, ElementId), then the comparisons will first compare the values of the levels' elevations, then compare the levels' names, and finally the levels' element ids to rank and sort the levels.
See Also
Reference
Autodesk.Revit.DB Namespace