Revit 2027 API
RebarBarType Class
 A Rebar type object that is used in the generation of Rebar
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarBarType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarBarType : ElementType
Public Class RebarBarType
	Inherits ElementType
public ref class RebarBarType : public ElementType
type RebarBarType =
    class
        inherit ElementType
    end
The RebarBarType type exposes the following members.
Properties
Name | Description
BarMassPerUnitLength |  Defines bar mass per unit length of rebar.
BarModelDiameter |  Defines bar model diameter of rebar
BarNominalDiameter |  Defines bar nominal diameter of rebar
DeformationType |  Defines bar deformation type.
MaximumBendRadius |  Defines maximum bend radius of rebar
StandardBendDiameter |  Defines bar bend diameter for rebar whose style is standard
StandardHookBendDiameter |  Defines hook bend diameter for rebar whose style is standard
StirrupTieBendDiameter |  Defines bar and hook bend diameter for rebar whose style is stirrup/tie
Top
Methods
Name | Description
CanCrankParametersBeComputedUsingCrankAngledLength |  Identifies if the all crank parameters can be computed for the specified crank angled length and Rebar Crank Type.
CanCrankParametersBeComputedUsingCrankOffsetLength |  Identifies if the all crank parameters can be computed for the specified crank offset length and Rebar Crank Type.
CanCrankParametersBeComputedUsingCrankRatio |  Identifies if the all crank parameters can be computed for the specified crank ratio and Rebar Crank Type.
CanCrankParametersBeComputedUsingCrankStraightLength |  Identifies if the all crank parameters can be computed for the specified crank straight length and Rebar Crank Type.
Create |  Creates a new RebarBarType object
CreateDefaultRebarBarType |  Creates a new RebarBarType object with a default name.
GetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
GetAutoCalculatedCrank |  Identifies if the crank dimensions are auto calculated for the specified Rebar Crank Type.
GetAutoCalculatedLapLength |  Identifies if the lap length is auto calculated for the specified Rebar Splice Type.
GetAutoCalculatedStaggerLength |  Identifies if the stagger length is auto calculated for the specified Rebar Splice Type.
GetCrankAngledLength |  Gets the crank angled length taking into account the specified Rebar Crank Type.
GetCrankLength |  Gets the crank length taking into account the specified Rebar Crank Type.
GetCrankOffsetLength |  Gets the crank offset taking into account the specified Rebar Crank Type.
GetCrankRatio |  Gets the crank ratio taking into account the specified Rebar Crank Type.
GetCrankStraightLength |  Gets the crank straigth length taking into account the specified Rebar Crank Type.
GetHookLength |  Identifies the hook length for a hook type
GetHookOffsetLength |  Identifies the hook offset length for a hook type
GetHookPermission |  Identifies if a hook type is permitted for this bar type
GetHookTangentLength |  Identifies the hook tangent length for a hook type
GetLapLength |  Gets the lap length taking into account the specified Rebar Splice Type.
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetStaggerLength |  Gets the stagger length taking into account the specified Rebar Splice Type.
SetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
SetAutoCalculatedCrank |  Sets if the crank dimensions are auto calculated or not for the specified Rebar Crank Type.
SetAutoCalculatedLapLength |  Sets if the lap length is auto calculated or not for the specified Rebar Splice Type.
SetAutoCalculatedStaggerLength |  Sets if the stagger length is auto calculated or not for the specified Rebar Splice Type.
SetBarTypeDiameters |  Sets all input diameters from diametersOptions in current RebarBarType.
SetCrankAngledLength |  Sets the crank angled length for the specified Rebar Crank Type.
SetCrankLength |  Sets the crank length for the specified Rebar Crank Type.
SetCrankOffsetLength |  Sets the crank offset length for the specified Rebar Crank Type.
SetCrankRatio |  Sets the crank ratio for the specified Rebar Crank Type.
SetCrankStraightLength |  Sets the crank straigh length for the specified Rebar Crank Type.
SetHookLength |  Identifies the hook length for a hook type
SetHookOffsetLength |  Identifies the hook offset length for a hook type
SetHookPermission |  Identifies if a hook type is permitted for this bar type
SetHookTangentLength |  Identifies the hook tangent length for a hook type
SetLapLength |  Sets the lap length for the specified Rebar Splice Type.
SetStaggerLength |  Sets the stagger length for the specified Rebar Splice Type.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace