Revit 2027 API
MEPNetworkIterator Methods
The MEPNetworkIterator type exposes the following members.
Methods
Name | Description
Dispose
End |  Checks if the network iteration has completed.
GetAnalyticalModelData |  Gets the analytical model data at the current iteration step.
GetAnalyticalNode |  Gets the analytical node at the current iteration step.
GetAnalyticalSegment |  Gets the analytical segment at the current iteration step.
GetOtherAnalyticalNode |  Gets the other analytical node at the current iteration step.
Next |  Moves this iterator to the next step of network iteration.
Start |  Gets the first step of network iteration.
Top
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace