Revit 2027 API
PointOnEdgeFaceIntersection Methods
The PointOnEdgeFaceIntersection type exposes the following members.
Methods
Name | Description
GetEdgeReference | Get a copy of the edge or curve reference.
GetFaceReference | Get a copy of the face reference.
SetEdgeReference | Change the edge or curve reference.
SetFaceReference | Change the face reference.
Top
See Also
Reference
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace