Revit 2027 API
SunAndShadowSettings Properties
The SunAndShadowSettings type exposes the following members.
Properties
Name | Description
ActiveFrame |  Identifies the active animation frame for a single-day or multi-day study, starting at 1.0 for the first frame and incrementing in intervals of 1.0.
ActiveFrameTime |  Identifies the date and time of the SunAndShadowSettings element for the active frame.
Altitude |  Altitude setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
Azimuth |  Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
EndDateAndTime |  Identifies the end date and time.
GroundPlaneHeight |  Identifies the ground plane height.
GroundPlaneLevelId |  Identifies the element id of the Ground Plane level for the SunAndShadowSettings element.
Latitude |  Identifies the current latitude used by the SunAndShadowSettings element.
Longitude |  Identifies the current longitude used by the SunAndShadowSettings element.
NumberOfFrames |  Identifies the total number of animation frames for a single-day or multi-day study.
ProjectLocationId |  Identifies the ProjectLocation element used by the SunAndShadowSettings element.
ProjectLocationName |  Identifies the name of the project location used by the SunAndShadowSettings element.
RelativeToView |  Identifies whether the SunAndShadowSettings element is relative to the view direction. This is only relevant for lighting mode.
SharesSettings |  Identifies whether settings are shared globally.
StartDateAndTime |  Identifies the start or current date and time.
SunAndShadowType |  Identifies the type of the SunAndShadowSettings element.
SunriseToSunset |  Identifies whether the current single day sun study is set to run from sunrise to sunset.
TimeInterval |  Identifies the time interval between animation frames.
TimeZone |  Identifies the time zone.
UsesDST |  Identifies whether the SunAndShadowSettings element is using daylight savings time.
UsesGroundPlane |  Identifies whether the SunAndShadowSettings element uses a ground plane.
Visible |  Visibility in current view for a per-view SunAndShadowSettings element.
Top
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace