Revit 2027 API
IntersectionResultArray Class
An array that can contain any type of object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.IntersectionResultArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IntersectionResultArray : APIObject,
	IEnumerable
Public Class IntersectionResultArray
	Inherits APIObject
	Implements IEnumerable
public ref class IntersectionResultArray : public APIObject,
	IEnumerable
type IntersectionResultArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The IntersectionResultArray type exposes the following members.
Constructors
Name | Description
IntersectionResultArray | Initializes a new instance of the IntersectionResultArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an item at a specified index within the array.
Size | Returns the number of objects that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every item from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace