Revit 2027 API
CableTraySizeIterator Class
 An iterator to a set of MEP cable tray sizes from CableTraySizes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.CableTraySizeIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTraySizeIterator : IEnumerator<MEPSize>
Public Class CableTraySizeIterator
	Implements IEnumerator(Of MEPSize)
public ref class CableTraySizeIterator : IEnumerator<MEPSize^>
type CableTraySizeIterator =
    class
        interface IEnumerator<MEPSize>
    end
The CableTraySizeIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CableTraySizeIterator
GetCurrent |  Returns the current MEPSize.
HasCurrent |  Identifies if the iterator has a current item.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace