Revit 2027 API
MEPSize Class
 Stores the basic size information for an MEP duct, pipe, cable tray, or conduit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPSize
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPSize : IDisposable
Public Class MEPSize
	Implements IDisposable
public ref class MEPSize : IDisposable
type MEPSize =
    class
        interface IDisposable
    end
The MEPSize type exposes the following members.
Constructors
Name | Description
MEPSize |  Constructs an object that stores the basic size information for MEP duct, pipe, cable tray and conduit.
Top
Properties
Name | Description
InnerDiameter |  Inner diameter
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NominalDiameter |  Nominal diameter
OuterDiameter |  Outer diameter
UsedInSizeLists |  Whether it is used in size lists.
UsedInSizing |  Whether is used in sizing.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPSize
Top
See Also
Reference
Autodesk.Revit.DB Namespace