Revit 2027 API
GeomCombinationSetIterator Properties
The GeomCombinationSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
GeomCombinationSetIterator Class
Autodesk.Revit.DB Namespace