Revit 2027 API
BasicFileInfo Class
 Encapsulates basic information about a Revit file, including worksharing status, Revit version, username and central path.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BasicFileInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BasicFileInfo : IDisposable
Public Class BasicFileInfo
	Implements IDisposable
public ref class BasicFileInfo : IDisposable
type BasicFileInfo =
    class
        interface IDisposable
    end
The BasicFileInfo type exposes the following members.
Properties
Name | Description
AllLocalChangesSavedToCentral |  Are all local changes saved to the central file?
CentralPath |  Returns the central model path.
Format |  The file format indicator (currently, the major release version such as "2019") used for saving the file.
IsCentral |  Checks if the file is workshared and Central.
IsCreatedLocal |  Checks if the file is local and created by RevitServerTool.exe.
IsInProgress |  Checks if the file is workshared and is in process of becoming Central.
IsLocal |  Checks if the file is workshared and Local.
IsSavedInCurrentVersion |  Checks if the file is saved in the current version.
IsSavedInLaterVersion |  Checks if the file is saved in a later version of Revit than the running Revit.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
IsWorkshared |  Checks if the file is workshared.
LanguageWhenSaved |  Return the language active for the last save
LatestCentralEpisodeGUID |  This is the central model's episode GUID corresponding to the last reload latest done for this model.
LatestCentralVersion |  This is the central model's version number corresponding to the last reload latest done for this model.
Username |  Returns the username.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BasicFileInfo
Extract |  Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
GetDocumentVersion |  Gets the DocumentVersion for the file.
Top
Remarks
 This class provides a fast access to get basic information without fully opening a Revit file. The Extract method can initialize a new instance of this class by providing a full path for Revit file, including project (.rvt) and family (.rfa) files. This class can extract information from files of older formats. If the structure of the BasicFileInfo storage has not changed, it can also extract information from files of newer formats (making the method IsSavedInLaterVersion relevant). However, if the structure of the storage has changed in a newer file format, Extract will not be able to extract the information.
See Also
Reference
Autodesk.Revit.DB Namespace