Revit 2027 API
Category Methods
The Category type exposes the following members.
Methods
Name | Description
GetBuiltInCategory |  Gets the BuiltInCategory value corresponding to the given built-in category identifier.
GetBuiltInCategoryDisciplines |  Get the ForgeTypeId identifier for each discipline for the given built-in category.
GetBuiltInCategoryTypeId |  Gets the ForgeTypeId identifying the given built-in category.
GetCategory(Document, BuiltInCategory) | Retrieves a category object corresponding to a BuiltInCategory id.
GetCategory(Document, ElementId) |  Retrieves a category object corresponding to the category id.
GetGraphicsStyle | Gets the graphics style associated with this category for the given graphics style type.
GetHashCode
(Overrides Object.GetHashCode())
GetLinePatternId | Gets the line pattern id associated with this category for the given graphics style type.
GetLineWeight | Retrieves the line weight assigned to the category for the given graphics style type.
IsBuiltInCategory |  Checks whether a ForgeTypeId identifies a built-in category.
IsBuiltInCategoryValid |  Checks if a Category exists for a given BuiltInCategory.
SetLinePatternId | Sets the line pattern id associated with this category for the given graphics style type.
SetLineWeight | Sets the line weight for the given graphics style type.
Top
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace