Revit 2027 API
ReferencePointArray Class
An array that contains reference objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferencePointArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReferencePointArray : APIObject,
	IEnumerable
Public Class ReferencePointArray
	Inherits APIObject
	Implements IEnumerable
public ref class ReferencePointArray : public APIObject,
	IEnumerable
type ReferencePointArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The ReferencePointArray type exposes the following members.
Constructors
Name | Description
ReferencePointArray | Initializes a new instance of the ReferencePointArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a reference at a specified index within the array.
Size | Returns the number of references that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every reference from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace