Revit 2027 API
Grid Class
 Represents a single grid line within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DatumPlane
 Autodesk.Revit.DB.Grid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Grid : DatumPlane
Public Class Grid
	Inherits DatumPlane
public ref class Grid : public DatumPlane
type Grid =
    class
        inherit DatumPlane
    end
The Grid type exposes the following members.
Properties
Name | Description
Curve | Retrieves an object that represents the geometry of the grid line.
IsCurved |  Identifies if the grid line is curved or straight.
Top
Methods
Name | Description
Create(Document, Arc) |  Creates a new radial grid line.
Create(Document, Line) |  Creates a new grid line.
GetExtents |  Gets the extents of the grid in the model.
SetVerticalExtents |  Adjusts the grid to extend through only the vertical range between bottom and top.
Top
Remarks
 A Grid is a DatumPlane, so it is actually a three dimensional surface. It can be either a plane parallel to the project z-axis, or else a cylinder whose axis is parallel to the project z-xis. [!:Autodesk::Revit::DatumPlane]
Example
public void GetInfo_Grid(Grid grid)
{
    string message = "Grid : ";
    // Show IsCurved property
    message += "\nIf grid is Arc : " + grid.IsCurved;
    // Show Curve information
    Autodesk.Revit.DB.Curve curve = grid.Curve;
    if (grid.IsCurved)
    {
        // if the curve is an arc, give center and radius information
        Autodesk.Revit.DB.Arc arc = curve as Autodesk.Revit.DB.Arc;
        message += "\nArc's radius: " + arc.Radius;
        message += "\nArc's center:  (" + XYZToString(arc.Center);
    }
    else
    {
        // if the curve is a line, give length information
        Autodesk.Revit.DB.Line line = curve as Autodesk.Revit.DB.Line;
        message += "\nLine's Length: " + line.Length;
    }
    // Get curve start point
    message += "\nStart point: " + XYZToString(curve.GetEndPoint(0));
    // Get curve end point
    message += "; End point: " + XYZToString(curve.GetEndPoint(0));
    TaskDialog.Show("Revit",message);
}
// output the point's three coordinates
string XYZToString(XYZ point)
{
    return "(" + point.X + ", " + point.Y + ", " + point.Z + ")";
}
See Also
Reference
Autodesk.Revit.DB Namespace