Revit 2027 API
DialogBoxData Properties
The DialogBoxData type exposes the following members.
Properties
Name | Description
HelpId |  An ID that represents the dialog that has been displayed.
Top
See Also
Reference
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace