Revit 2027 API
DimensionSegment Methods
The DimensionSegment type exposes the following members.
Methods
Name | Description
IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
ResetTextPosition | Resets the text position of the segment to the initial position determined by its type and parameters.
Top
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace