Revit 2027 API
IFCPropertySetMappingInfo Class
 Represents the IFC property set mapping information stored in the template.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFCPropertySetMappingInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCPropertySetMappingInfo : IDisposable
Public Class IFCPropertySetMappingInfo
	Implements IDisposable
public ref class IFCPropertySetMappingInfo : IDisposable
type IFCPropertySetMappingInfo =
    class
        interface IDisposable
    end
The IFCPropertySetMappingInfo type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCPropertySetMappingInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace