Revit 2027 API
ViewSet Class
A set that contains views.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ViewSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewSet : APIObject, IEnumerable
Public Class ViewSet
	Inherits APIObject
	Implements IEnumerable
public ref class ViewSet : public APIObject,
	IEnumerable
type ViewSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The ViewSet type exposes the following members.
Constructors
Name | Description
ViewSet | Initializes a new instance of the ViewSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of views that are in the set.
Top
Methods
Name | Description
Clear | Removes every view from the set, rendering it empty.
Contains | Tests for the existence of a view within the set.
Erase | Removes a specified view from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified view into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace