Revit 2027 API
SlabEdge Properties
The SlabEdge type exposes the following members.
Properties
Name | Description
SlabEdgeType | Retrieves/set an object that represents the type of the SlabEdge.
Top
See Also
Reference
SlabEdge Class
Autodesk.Revit.DB Namespace