Revit 2027 API
SolidCurveIntersection Methods
The SolidCurveIntersection type exposes the following members.
Methods
Name | Description
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetCurveSegment |  Gets the curve segment generated by intersection.
GetCurveSegmentExtents |  Gets the extents for the given curve segment generated by intersection.
GetEnumerator | Returns an enumerator that iterates through a collection.
Top
See Also
Reference
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace