Revit 2027 API
CentralModelVersionArchivedException Methods
The CentralModelVersionArchivedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CentralModelVersionArchivedException Class
Autodesk.Revit.Exceptions Namespace