Revit 2027 API
PointCloudOverrideSettings Class
 The graphic override settings for one PointCloudInstance element or one of its scans.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointCloudOverrideSettings : IDisposable
Public Class PointCloudOverrideSettings
	Implements IDisposable
public ref class PointCloudOverrideSettings : IDisposable
type PointCloudOverrideSettings =
    class
        interface IDisposable
    end
The PointCloudOverrideSettings type exposes the following members.
Constructors
Name | Description
PointCloudOverrideSettings() |  Constructs a settings object with default values.
PointCloudOverrideSettings(PointCloudOverrideSettings) |  Constructs a copy of source object.
Top
Properties
Name | Description
ColorMode |  The current color mode for the PointCloudInstance element or its scan.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Visible |  Visibility flag for point cloud scans.
Top
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose | Releases all resources used by the PointCloudOverrideSettings
GetModeOverride |  Lookup color settings for the given color mode.
IsEqual |  Checks if the contents of two settings are equal.
SetModeOverride |  Sets color settings for the given color mode.
Top
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace