Revit 2027 API
PreEventArgs Class
 The class is used as a base class for the arguments for any pre-event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PreEventArgs
 Autodesk.Revit.DB.Events.PreDocEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PreEventArgs : RevitEventArgs
Public Class PreEventArgs
	Inherits RevitEventArgs
public ref class PreEventArgs : public RevitEventArgs
type PreEventArgs =
    class
        inherit RevitEventArgs
    end
The PreEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace