Revit 2027 API
PlanCircuit Properties
The PlanCircuit type exposes the following members.
Properties
Name | Description
Area | The enclosed area of the circuit.
IsRoomLocated | Reports whether there is a room located in this circuit.
SideNum | The number of sides in the circuit.
Top
See Also
Reference
PlanCircuit Class
Autodesk.Revit.DB Namespace