Revit 2027 API
DimensionSegmentArrayIterator Class
An iterator to an array of DimensionSegment objects..
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DimensionSegmentArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class DimensionSegmentArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class DimensionSegmentArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class DimensionSegmentArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type DimensionSegmentArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The DimensionSegmentArrayIterator type exposes the following members.
Constructors
Name | Description
DimensionSegmentArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace