Revit 2027 API
AssemblyMemberDifference Methods
The AssemblyMemberDifference type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
AssemblyMemberDifference Class
Autodesk.Revit.DB Namespace