Revit 2027 API
MEPAnalyticalConnectionType Properties
The MEPAnalyticalConnectionType type exposes the following members.
Properties
Name | Description
PressureLoss |  The pressure loss of this analytical connection type.
Top
See Also
Reference
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace