Revit 2027 API
CurtainSystem Class
Provides access to the CurtainSystem object in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CurtainSystemBase
 Autodesk.Revit.DB.CurtainSystem
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurtainSystem : CurtainSystemBase
Public Class CurtainSystem
	Inherits CurtainSystemBase
public ref class CurtainSystem : public CurtainSystemBase
type CurtainSystem =
    class
        inherit CurtainSystemBase
    end
The CurtainSystem type exposes the following members.
Properties
Name | Description
CurtainGrids | Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face.
CurtainSystemType | get or set the type of the CurtainSystem.
Top
Methods
Name | Description
AddCurtainGrid | Add CurtainGrid on the specified face for the CurtainSystem.
RemoveCurtainGrid | Remove CurtainGrid from the specified face for the CurtainSystem.
Top
Remarks
The user can create CurtainSystem object and change the internal properties.
See Also
Reference
Autodesk.Revit.DB Namespace