Revit 2027 API
StructuralSettings Methods
The StructuralSettings type exposes the following members.
Methods
Name | Description
GetLoadForceVectorReprLine |  Returns the representative line of the load force vector according to loads display scaling.
GetStructuralSettings |  Obtains the StructuralSettings object for the specified project document.
SetValuesForLoadsDisplayScaling |  Sets values for loads display scaling by providing two load forces and their corresponding length of the representative lines in internal units.
Top
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace