Revit 2027 API
Transform2D Class
 An affine transform of 2D Euclidean space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Transform2D
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Transform2D : IDisposable
Public Class Transform2D
	Implements IDisposable
public ref class Transform2D : IDisposable
type Transform2D =
    class
        interface IDisposable
    end
The Transform2D type exposes the following members.
Constructors
Name | Description
Transform2D(Transform2D) |  The copy constructor.
Transform2D(UV, UV, UV) |  Constructs the transformation by specifying the vectors and the origin.
Top
Properties
Name | Description
BasisU |  The image of (1, 0) under OfVector(UV).
BasisV |  The image of (0, 1) under OfVector(UV).
Determinant |  The determinant of this transformation.
HasReflection |  The boolean value that indicates whether this transformation produces reflection (i.e., is orientation-reversing).
IsConformal |  The boolean value that indicates whether this transformation is conformal.
IsIdentity |  The boolean value that indicates whether this transformation is an identity.
IsTranslation |  The boolean value that indicates whether this transformation is a translation.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Origin |  The image of (0, 0) under OfPoint(UV). This defines the translational part of the transform.
Scale |  The real number that represents the scale of the conformal transformation.
Top
Methods
Name | Description
AlmostEqual |  Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Assign |  Assigns values from the input transformation to this transformation.
CreateIdentity |  Creates the identity transformation.
Dispose | Releases all resources used by the Transform2D
GetInverse |  Gets the inverse transformation of this transformation.
Multiply |  Multiplies this transformation by the specified transformation and returns the result.
OfPoint |  Applies the transformation to the point and returns the result.
OfVector |  Applies the transformation to the vector and returns the result.
PostScale |  Scales both the linear and translational parts of this transformation and returns the result.
PreScale |  Scales the linear part of this transformation and returns the result.
SetToIdentity |  Set this TrfUV to the identity transform.
TransformUVDomainIfPossible |  Transforms an envelope (BoundingBoxUV) for one surface to an envelope for a coincident but differently parameterized surface.
Top
Remarks
 An affine transform is a linear transform plus a translation (which may be zero). Some functions only accept certain kinds of transform (e.g., rigid motion, conformal, non-singular, etc.).
See Also
Reference
Autodesk.Revit.DB Namespace