Revit 2027 API
FieldDomainPointsByUV Methods
The FieldDomainPointsByUV type exposes the following members.
Methods
Name | Description
SetGridCoordinates |  Set u and v coordinates that specify a grid on the surface. The display of the grid is controlled by AnalysisDisplayColoredSurfaceSettings::getShowGridLines(). If AnalysisDisplayColoredSurfaceSettings::getShowGridLines() returns true and both sets are empty then a grid will be displayed using a default spacing; if only one of the sets is non-empty, then only the corresponding set of grid lines will be displayed, i.e. the grid will consist solely of parallel lines at the specified coordinates.
Top
See Also
Reference
FieldDomainPointsByUV Class
Autodesk.Revit.DB.Analysis Namespace