Revit 2027 API
MacroManager Class
 Manager object for the Macro modules of the application.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.MacroManager
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MacroManager : IEnumerable<MacroModule>,
	IDisposable
Public Class MacroManager
	Implements IEnumerable(Of MacroModule), IDisposable
public ref class MacroManager : IEnumerable<MacroModule^>,
	IDisposable
type MacroManager =
    class
        interface IEnumerable<MacroModule>
        interface IDisposable
    end
The MacroManager type exposes the following members.
Properties
Name | Description
Count |  The count.
Folder |  The modules folder.
IsEnabled |  Indicates if macros stored in this MacroManager are enabled.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddModule |  Adds a MacroModule to the application.
Contains |  Indicates the given module is a member of this collection.
Dispose | Releases all resources used by the MacroManager
GetApplicationMacroSecurityOptions |  Gets the application macro security options.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetMacroManager |  Gets the Macro manager from the application.
GetMacroManagerIterator |  Returns a Macro manager iterator that iterates through the collection.
RemoveModule |  Removes a MacroModule.
SetApplicationMacroSecurityOptions |  Sets the application macro security options.
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace