Revit 2027 API
Form Class
An object that represents a Form within the Autodesk Revit Massing Family.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Form
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Form : GenericForm
Public Class Form
	Inherits GenericForm
public ref class Form : public GenericForm
type Form =
    class
        inherit GenericForm
    end
The Form type exposes the following members.
Properties
Name | Description
AreProfilesConstrained | Get/set if the form's profiles are constrained.
BaseOffset | Retrieve/set the base offset of the form object. It is only valid for locked form.
CurveLoopReferencesOnProfile | The curve references in certain curve loop, specified by profile index and curve loop index.
HasOneOrMoreReferenceProfiles | Tell if the form has any reference profile.
HasOpenGeometry | Tell if the form has an open geometry.
IsInXRayMode | Get/set if the form is in X-Ray mode.
PathCurveCount | The number of curves in the form path.
PathCurveReference | The curve reference in the path, specified by curve index.
ProfileCount | The number of profiles in the form.
ProfileCurveLoopCount | The number of curve loops in certain profile, specified by profile index.
TopOffset | Retrieve/set the top offset of the form object. It is only valid for locked form.
Top
Methods
Name | Description
AddEdge(Reference, Reference) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified points.
AddEdge(Reference, XYZ) | Add an edge to the form, connecting two edges on different profiles, by a specified face of the form and a point on face.
AddEdge(Reference, Double, Reference, Double) | Add an edge to the form, connecting two edges on same/different profile, by a pair of specified edge/param.
AddProfile | Add a profile into the form, by a specified edge/param.
CanManipulateProfile | Tell if a profile can be deleted/moved/rotated.
CanManipulateSubElement | Tell if a sub element can be deleted/moved/rotated/scaled.
ConstrainProfiles | Constrain form profiles using the specified profile as primary. This is an advanced version of property "AreProfilesConstrained", allowing specify the primary profile.
DeleteProfile | Delete a profile of the form.
DeleteSubElement | Delete a face/edge/curve/vertex of the form, specified by a reference.
GetControlPoints | Given an edge or a curve or a face, return all control points lying on it (in form of geometry references).
GetCurvesAndEdgesReference | Given a point, return all edges and curves that it is lying on.
GetPathCurveIndexByCurveReference | Given a reference to certain curve in the path, return its index.
GetProfileAndCurveLoopIndexFromReference | Given a reference to certain curve or edge, get the index of its profile and curve loop respectively.
IsAutoCreaseEdge | Tell if an edge is an auto-crease on a top/bottom cap face.
IsBeginningFace | Given a face, tell if it is a beginning cap face.
IsConnectingEdge | Tell if an edge is a connecting edge on a side face. Connecting edges connect vertices on different profiles.
IsCurveReference | Tell if the pick is the reference to a curve of the form.
IsEdgeReference | Tell if the pick is the reference to an edge of the form.
IsEndFace | Given a face, tell if it is an end cap face.
IsFaceReference | Tell if the pick is the reference to a face of the form.
IsProfileEdge | Tell if an edge or curve is generated from a profile.
IsReferenceOnlyProfile | Tell if the profile is made by referencing existing geometry in the Revit model.
IsSideFace | Given a face, tell if it is a side face.
IsVertexReference | Tell if the pick is the reference to a vertex of the form.
MoveProfile | Move a profile of the form, specified by a reference, and an offset vector.
MoveSubElement | Move a face/edge/curve/vertex of the form, specified by a reference, and an offset vector.
Rehost(Reference, XYZ) | Rehost Form to edge, face or curve.
Rehost(SketchPlane, XYZ) | Rehost Form to sketch plane
RotateProfile | Rotate a profile of the form, by a specified angle around a given axis.
RotateSubElement | Rotate a face/edge/curve/vertex of the form, by a specified angle around a given axis.
ScaleProfile | Scale a profile of the form, by a specified origin and scale factor.
ScaleSubElement | Scale a face/edge/curve/vertex of the form, by a specified origin and scale factor.
Top
Remarks
For any reference returned from a Form method, its GeometryObject will become invalid after a form modification method, e.g. MoveSubElement. Call the method on the Form object to retrieve the new reference if it is needed after the modification.
See Also
Reference
Autodesk.Revit.DB Namespace