Revit 2027 API
IFCLegacyStairOrRamp Methods
The IFCLegacyStairOrRamp type exposes the following members.
Methods
Name | Description
Dispose
GetBoundaryLines |  Gets boundary lines.
GetLandingGeometries |  Gets the geometries of landings.
GetNumberOfRisers |  Gets the number of risers.
GetNumberOfTreads |  Gets the number of treads.
GetRunGeometries |  Gets the geometries of runs.
GetStringerGeometries |  Gets the geometries of stringers.
GetTreadsLength |  Gets the length of treads.
GetWalkLines |  Gets walk lines.
Top
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace