Revit 2027 API
ComputationDataFor3DPathSet Class
 This class encapsulates data needed to compute a 3D path set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComputationDataFor3DPathSet : IDisposable
Public Class ComputationDataFor3DPathSet
	Implements IDisposable
public ref class ComputationDataFor3DPathSet : IDisposable
type ComputationDataFor3DPathSet =
    class
        interface IDisposable
    end
The ComputationDataFor3DPathSet type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TerminationOrientationAtEnd
Identifies the orientation of the termination's (e.g. hook, crank) plane at the end of the bar with respect to the orientation of the last curve and the termination plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
The default value is Left.
TerminationOrientationAtStart
Identifies the orientation of the termination's (e.g. hook, crank) plane at the start of the bar with respect to the orientation of the first curve and the termination plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
The default value is Left.
TerminationRotationAngleAtEnd
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of bar.
The default value is 0.
TerminationRotationAngleAtStart
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the start of bar.
The default value is 0.
Top
Methods
Name | Description
CreateFromCurves |  Creates a new instance of the ComputationDataFor3DPathSet class from the provided curves.
CreateFromRebar |  Creates a new instance of the ComputationDataFor3DPathSet class from the provided Rebar element.
Dispose | Releases all resources used by the ComputationDataFor3DPathSet
GetCurves |  Gets the curves that define the 3D path set.
GetTerminationPlaneNormal |  Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
SetTerminationPlaneNormal |  Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace