Revit 2027 API
CableTrayConduitRunBase Properties
The CableTrayConduitRunBase type exposes the following members.
Properties
Name | Description
Length |  The length of the whole (cable tray or conduit) run default 0.0
Top
See Also
Reference
CableTrayConduitRunBase Class
Autodesk.Revit.DB.Electrical Namespace