Revit 2027 API
GeometryObject Methods
The GeometryObject type exposes the following members.
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the integer value of the geometry object as hash code
(Overrides Object.GetHashCode())
Top
See Also
Reference
GeometryObject Class
Autodesk.Revit.DB Namespace