Revit 2027 API
AirSystemData Class
 Represents the data and parameter of analytical air system.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.AirSystemData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AirSystemData : IDisposable
Public Class AirSystemData
	Implements IDisposable
public ref class AirSystemData : IDisposable
type AirSystemData =
    class
        interface IDisposable
    end
The AirSystemData type exposes the following members.
Properties
Name | Description
AirFanType |  The fan type.
ChilledWaterLoopId |  The chilled water loop used for the chilled water option of cooling coil.
CoolingCoilType |  The cooling coil type. Note this property change would reset the chilled water loop.
HeatExchangerType |  The type of heat exchanger.
HeatingCoilType |  The heating coil type. Note this property change would reset the heating water loop.
HeatingHotWaterLoopId |  The water loop element id for the hot-water heating coil.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PreheatCoilType |  The preheat coil type. Note this property change would reset the preheat water loop.
PreheatHotWaterLoopId |  The water loop element id for the hot-water preheat coil.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AirSystemData
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace