Revit 2027 API
DGNExportOptions Properties
The DGNExportOptions type exposes the following members.
Properties
Name | Description
FileVersion |  The DGN file version. Default value of fileVersion is DGNFileFormat.Default.
MergedViews |  Whether to merge all views in one file (via XRefs). Default value of mergedViews is false.
SeedName |  The name of the DGN seed. Default value of seedName is empty.
WorkingUnits |  If true, Main Units will be used. If false, Sub Units will be used. Default value of WorkingUnits is true.
Top
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace