Revit 2027 API
BoundingBoxIsInsideFilter Methods
The BoundingBoxIsInsideFilter type exposes the following members.
Methods
Name | Description
GetBoundingBox |  Gets the outline being used for this filter.
Top
See Also
Reference
BoundingBoxIsInsideFilter Class
Autodesk.Revit.DB Namespace