Revit 2027 API
FilteredElementIdIterator Methods
The FilteredElementIdIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  The current element id found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next element id passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
FilteredElementIdIterator Class
Autodesk.Revit.DB Namespace