Revit 2027 API
BasicFileInfo Methods
The BasicFileInfo type exposes the following members.
Methods
Name | Description
Dispose
Extract |  Returns an instance of BasicFileInfo filled with basic information about a Revit file located at the given file-path
GetDocumentVersion |  Gets the DocumentVersion for the file.
Top
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace