Revit 2027 API
BasicLossFactor Class
 This class encapsulates basic lighting loss factor calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LossFactor
 Autodesk.Revit.DB.Lighting.BasicLossFactor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BasicLossFactor : LossFactor
Public Class BasicLossFactor
	Inherits LossFactor
public ref class BasicLossFactor : public LossFactor
type BasicLossFactor =
    class
        inherit LossFactor
    end
The BasicLossFactor type exposes the following members.
Constructors
Name | Description
BasicLossFactor() |  Creates a basic loss factor object with no loss.
BasicLossFactor(BasicLossFactor) |  Creates a copy of the given basic loss factor object
BasicLossFactor(Double) |  Creates a basic loss factor object with the given value.
Top
Properties
Name | Description
LossFactor |  The loss factor.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace