Revit 2027 API
FilePath Class
 This class represents a path on a disk or network location, but not a path to a Revit server location.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ModelPath
 Autodesk.Revit.DB.FilePath
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilePath : ModelPath
Public Class FilePath
	Inherits ModelPath
public ref class FilePath : public ModelPath
type FilePath =
    class
        inherit ModelPath
    end
The FilePath type exposes the following members.
Constructors
Name | Description
FilePath |  Constructs a FilePath
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace