Revit 2027 API
RebarConstrainedHandle Methods
The RebarConstrainedHandle type exposes the following members.
Methods
Name | Description
AllowsConstraintToCustomTarget |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget] type.
AllowsConstraintToHostEdge |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] type.
AllowsConstraintToHostEdgeCover |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type.
AllowsConstraintToHostFaceOrToCover |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::FixedDistanceToHostFace] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCover] type.
AllowsConstraintToOtherRebarEdge |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToOtherRebar] type, where target is [!:Autodesk::Revit::DB::Structure::RebarConstraintType::TargetRebarConstraintType::Edge].
AllowsConstraintToSurface |  Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToSurface] type.
AllowsDistanceToHostEdgeOrHostEdgeCover |  Checks if the RebarConstrainedHandle allows distance for a constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdge] or [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToHostEdgeCover] type.
CanSetBehavior |  Checks if the input behavior can be set for this RebarConstrainedHandle.
Dispose
GetCustomHandleTag |  Returns the tag of the handle. The type of the handle should be 'CustomHandle'.
GetEdgeNumber |  If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle.
GetHandleName |  Gets the name of the handle.
GetHandlePosition |  Gets the position of this handle as it is while editing constraints.
GetHandleSurface |  Gets the surface of this handle.
GetHandleType |  Returns the RebarHandleType of a RebarConstrainedHandle.
GetPossibleHandleBehaviors |  Gets a list of possible handle behaviors for the current handle.
GetRebarConstraintsManager |  Gets the RebarConstraintsManager that is associated with this handle.
IsCustomHandle |  Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'.
IsDraggable |  Checks that the RebarConstrainedHandle can be draggable in canvas (it has drag controls while editing constraints).
IsEdgeHandle |  Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.
IsEqual |  Checks if the specified RebarConstrainedHandle is the same as 'this'.
IsValid |  Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid.
Move |  Moves the handle with the specified vector.
Top
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace