Revit 2027 API
FlexPipe Class
 A flex pipe in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Plumbing.FlexPipe
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FlexPipe : MEPCurve
Public Class FlexPipe
	Inherits MEPCurve
public ref class FlexPipe : public MEPCurve
type FlexPipe =
    class
        inherit MEPCurve
    end
The FlexPipe type exposes the following members.
Properties
Name | Description
EndTangent |  Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
FlexPipeType |  The flex pipe type of this flex pipe.
FlowState | The flow state of the pipe.
Points | The points of the flex pipe.
StartTangent |  Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Top
Methods
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>) |  Creates a new flexible pipe into the document, using a point array and flex pipe type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>) |  Creates a new flexible pipe into the document, using a point array and flex pipe type.
IsFlexPipeTypeId |  Checks if given type is valid flexible pipe type.
IsPipingSystemTypeId |  Checks if given type is valid piping system type.
Top
Remarks
 The flex pipe is only available in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace