Revit 2027 API
TessellatedFace Methods
The TessellatedFace type exposes the following members.
Methods
Name | Description
Dispose
GetBoundaryLoops |  Get loops bounding the face.
Top
See Also
Reference
TessellatedFace Class
Autodesk.Revit.DB Namespace