Revit 2027 API
SystemZoneElementType Properties
The SystemZoneElementType type exposes the following members.
Properties
Name | Description
AirChangesPerHour |  The air changes per hour.
CoolingAirTemperature |  The cooling air temperature in unit Kelvin (K).
CoolingSetPoint |  The cooling temperature set point in unit Kelvin (K).
DehumidificationSetPoint |  The humidification set point as a number between 0 and 1.
GeometricDefinition |  The geometric definition for this element type.
HeatingAirTemperature |  The heating air temperature in unit Kelvin (K).
HeatingSetPoint |  The heating temperature set point in unit Kelvin (K).
HumidificationSetPoint |  The humidification set point as a number between 0 and 1.
OutdoorAirPerArea |  The outdoor air per area in unit feet per second.
OutdoorAirPerPerson |  The outdoor air in unit cubic feet per second per person.
UseDehumidificationSetPoint |  Use the dehumidification set point.
UseHumidificationSetPoint |  Use the humidification set point.
Top
See Also
Reference
SystemZoneElementType Class
Autodesk.Revit.DB.Mechanical Namespace