Revit 2027 API
BendingDetailCustomFieldProperties Methods
The BendingDetailCustomFieldProperties type exposes the following members.
Methods
Name | Description
AreEqualTo |  Identifies if the custom field properties are equal or not.
Dispose
Top
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace