Revit 2027 API
ElementOwnerViewFilter Properties
The ElementOwnerViewFilter type exposes the following members.
Properties
Name | Description
ViewId |  The view id.
Top
See Also
Reference
ElementOwnerViewFilter Class
Autodesk.Revit.DB Namespace