Revit 2027 API
MechanicalSystemType Properties
The MechanicalSystemType type exposes the following members.
Properties
Name | Description
RiseDropSettings |  indicates the rise/drop symbol given the system type
Top
See Also
Reference
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace