Revit 2027 API
DuctFittingAndAccessoryData Methods
The DuctFittingAndAccessoryData type exposes the following members.
Methods
Name | Description
Dispose
GetAllConnectorData |  Gets the connector data of the pipe fitting or pipe accessory.
GetEntity |  Returns an Entity of the Schema of the serverGUID. or an invalid entity otherwise.
GetFamilyInstanceId |  Gets the Id of the fiting or accessory instance
Top
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace