Revit 2027 API
APIObject Methods
The APIObject type exposes the following members.
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
Top
See Also
Reference
APIObject Class
Autodesk.Revit.DB Namespace