Revit 2027 API
VertexStreamPositionNormalColored Methods
The VertexStreamPositionNormalColored type exposes the following members.
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPositionNormalColored into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPositionNormalColored instances into the stream and associated buffer.
Top
See Also
Reference
VertexStreamPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace