Revit 2027 API
RebarShapeVertex Methods
The RebarShapeVertex type exposes the following members.
Methods
Name | Description
Dispose
GetConstraints |  Retrieve the list of constraints associated with this vertex.
SetConstraints |  Assign a new list of constraints to this vertex.
Top
See Also
Reference
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace