Revit 2027 API
StructuralSectionGeneralU Methods
The StructuralSectionGeneralU type exposes the following members.
Methods
Name | Description
GetFlangeThicknessInFlangeCenter |  Returns thickness of flange measured in the 0.5 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInWidthCenter |  Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm.
Top
See Also
Reference
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace