Revit 2027 API
ConceptualSurfaceType Methods
The ConceptualSurfaceType type exposes the following members.
Methods
Name | Description
GetAllMassSubCategoryIds |  Get all the mass subcategory ids for which there are ConceptualSurfaceType's.
GetByMassSubCategoryId |  Get the ConceptualSurfaceType by its mass subcategory id.
GetConstructionTypeIds |  The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.
Top
See Also
Reference
ConceptualSurfaceType Class
Autodesk.Revit.DB.Analysis Namespace