Revit 2027 API
WireTypeSet Class
A set that contains wire types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireTypeSet
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WireTypeSet : APIObject,
	IEnumerable
Public Class WireTypeSet
	Inherits APIObject
	Implements IEnumerable
public ref class WireTypeSet : public APIObject,
	IEnumerable
type WireTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The WireTypeSet type exposes the following members.
Constructors
Name | Description
WireTypeSet | Initializes a new instance of the WireTypeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of wire types that are in the set.
Top
Methods
Name | Description
Clear | Removes every wire type from the set, rendering it empty.
Contains | Tests for the existence of a wire type within the set.
Erase | Removes a specified wire type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified wire type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace