Revit 2027 API
BindingMap Class
The parameters BindingMap contains all the parameter bindings that exist in the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DefinitionBindingMap
 Autodesk.Revit.DB.BindingMap
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BindingMap : DefinitionBindingMap
Public Class BindingMap
	Inherits DefinitionBindingMap
public ref class BindingMap : public DefinitionBindingMap
type BindingMap =
    class
        inherit DefinitionBindingMap
    end
The BindingMap type exposes the following members.
Properties
Name | Description
Item |  The get_Item method will get the binding item related to the input key.
(Overrides DefinitionBindingMap.Item[Definition])
Top
Methods
Name | Description
Clear | This method is used to remove all the items in the map.
(Overrides DefinitionBindingMap.Clear())
Contains |  The Contains method is used to check if the parameter binding exists for one definition.
(Overrides DefinitionBindingMap.Contains(Definition))
Erase | This method is used to erase one item in the map.
(Overrides DefinitionBindingMap.Erase(Definition))
Insert(Definition, Binding) | Creates a new parameter binding between a parameter and a set of categories.
(Overrides DefinitionBindingMap.Insert(Definition, Binding))
Insert(Definition, Binding, ForgeTypeId) |  Creates a new parameter binding between a parameter and a set of categories in a specified group.
ReInsert(Definition, Binding) | Removes an existing parameter and creates a new binding for a given parameter.
ReInsert(Definition, Binding, ForgeTypeId) | Removes an existing parameter and creates a new binding for a given parameter in a specified group.
Remove |  The Remove method is used to remove a parameter binding.
Top
Remarks
The ParameterBindingsMap is available from the Document.ParameterBindings property. A parameter binding is the way that a parameter definition is bound to elements within one or more categories. This map can be used to interrogate existing bindings, but it can also be used to generate new parameter bindings by using the Insert method.
See Also
Reference
Autodesk.Revit.DB Namespace