Revit 2027 API
DirectShape Properties
The DirectShape type exposes the following members.
Properties
Name | Description
ApplicationDataId |  A text string that identifies the data to the creating application.
ApplicationId |  A text string that identifies the creating application.
TypeId |  Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace