Revit 2027 API
TrussMemberInfo Class
Provides access to the information of a truss member in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.TrussMemberInfo
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TrussMemberInfo
Public Class TrussMemberInfo
public ref class TrussMemberInfo
type TrussMemberInfo = class end
The TrussMemberInfo type exposes the following members.
Constructors
Name | Description
TrussMemberInfo | For Internal Use Only.
Top
Properties
Name | Description
hostTrussId | The host truss' ElementId of the member.
lockedToTruss | Whether the member is locked to the host truss.
memberTypeKey | Kind of the member in the truss.
Top
Methods
Name | Description
Top
Remarks
A struct TrussMemberInfo that contains an element's host truss, whether to lock to the truss, usage type, etc.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace