Revit 2027 API
InternalException Methods
The InternalException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
InternalException Class
Autodesk.Revit.Exceptions Namespace