Revit 2027 API
PrintSetting Class
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.PrintSetting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrintSetting : Element,
	IPrintSetting
Public Class PrintSetting
	Inherits Element
	Implements IPrintSetting
public ref class PrintSetting : public Element,
	IPrintSetting
type PrintSetting =
    class
        inherit Element
        interface IPrintSetting
    end
The PrintSetting type exposes the following members.
Properties
Name | Description
Name | Returns the Name of Print Setup.
(Overrides Element.Name)
PrintParameters | Returns the Parameters of Print Setup.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace