Revit 2027 API
StructuralSectionConcreteI Properties
The StructuralSectionConcreteI type exposes the following members.
Properties
Name | Description
BottomFlangeThickness |  Bottom Flange Thickness.
BottomFlangeWidth |  Bottom Flange Width.
TopFlangeThickness |  Top Flange Thickness.
TopFlangeWidth |  Top Flange Width.
WebThickness |  Web Thickness.
Top
See Also
Reference
StructuralSectionConcreteI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace