Revit 2027 API
InSessionPrintSetting Class
Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.InSessionPrintSetting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InSessionPrintSetting : IPrintSetting,
	IDisposable
Public Class InSessionPrintSetting
	Implements IPrintSetting, IDisposable
public ref class InSessionPrintSetting : IPrintSetting,
	IDisposable
type InSessionPrintSetting =
    class
        interface IPrintSetting
        interface IDisposable
    end
The InSessionPrintSetting type exposes the following members.
Properties
Name | Description
PrintParameters | Returns the Parameters of Print Setup.
Top
Methods
Name | Description
Dispose | Releases all resources used by the InSessionPrintSetting
Top
Remarks
The in-session PrintSetting can't be stored in document.
See Also
Reference
Autodesk.Revit.DB Namespace