Revit 2027 API
FamilyType Properties
The FamilyType type exposes the following members.
Properties
Name | Description
Name | The name of the family type.
Top
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace