Revit 2027 API
LinkedResourceOpenedEventArgs Class
 The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpened].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkedResourceOpenedEventArgs : RevitAPIPostDocEventArgs
Public Class LinkedResourceOpenedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class LinkedResourceOpenedEventArgs : public RevitAPIPostDocEventArgs
type LinkedResourceOpenedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The LinkedResourceOpenedEventArgs type exposes the following members.
Properties
Name | Description
LinkedResourcePathName |  Path of the linked resource.
ResourceType |  The desired linked resource type.
ResourceTypeId |  Element id of the linked resource.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace