Revit 2027 API
AssetPropertyEnum Methods
The AssetPropertyEnum type exposes the following members.
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace