Revit 2027 API
FabricAreaType Methods
The FabricAreaType type exposes the following members.
Methods
Name | Description
CreateDefaultFabricAreaType |  Creates a new FabricAreaType object with a default name.
Top
See Also
Reference
FabricAreaType Class
Autodesk.Revit.DB.Structure Namespace