Revit 2027 API
SpatialFieldManager Methods
The SpatialFieldManager type exposes the following members.
Methods
Name | Description
AddSpatialFieldPrimitive() |  Creates empty analysis results primitive not associated with any geometry element
AddSpatialFieldPrimitive(Reference) |  Creates an empty analysis results primitive associated with a reference.
AddSpatialFieldPrimitive(Curve, Transform) |  Creates empty analysis results primitive associated with a curve and a transform.
AddSpatialFieldPrimitive(Face, Transform) |  Creates empty analysis results primitive associated with a face and a transform.
AddSpatialFieldPrimitive(Reference, SpatialFieldPrimitiveHideMode) |  Creates an empty analysis results primitive associated with a reference, with the option to control how the reference element is hidden.
Clear |  Clear all analysis results managed by this manager object
CreateSpatialFieldManager |  Factory method - creates manager object for the given view
GetLegend |  Returns legend element or NULL
GetMaximum |  Calculates the maximum value for all primitives
GetMinimum |  Calculates the minimum value for all primitives
GetRegisteredResults |  Returns an array of indices of all registered results
GetResultSchema |  Returns result schema by index
GetSpatialFieldManager |  Retrieves manager object for the given view or returns NULL
IsResultSchemaNameUnique |  Verify the uniqueness of the name among all registered result schemas.
IsTextTypeIdValid |  Verify if text type id is valid.
RegisterResult |  Registers result and assigns it a unique result index
RemoveSpatialFieldPrimitive |  Removes analysis results primitive identified by the unique index
SetMeasurementDescriptions |  Sets Descriptions for all measurements
SetMeasurementNames |  Sets Names for all measurements
SetResultSchema |  Sets a new value for an existing result schema in the result registry
UpdateSpatialFieldPrimitive |  Populates analysis results data (or replaces the existing data) in the existing primitive identified by the unique index
Top
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace