Revit 2027 API
StructuralSectionGeneralU Class
 Defines parameters for general Channel shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralU : StructuralSectionHotRolled
Public Class StructuralSectionGeneralU
	Inherits StructuralSectionHotRolled
public ref class StructuralSectionGeneralU : public StructuralSectionHotRolled
type StructuralSectionGeneralU =
    class
        inherit StructuralSectionHotRolled
    end
The StructuralSectionGeneralU type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralU |  Creates a new instance of general Channel shape.
Top
Properties
Name | Description
FlangeFillet |  Flange Fillet - fillet radius at the flange end.
FlangeToeOfFillet |  Detailing distance from center of web to flange toe of fillet, in. (mm)
SlopedFlangeAngle |  Sloped flange angle. (rad)
WebToeOfFillet |  Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Top
Methods
Name | Description
GetFlangeThicknessInFlangeCenter |  Returns thickness of flange measured in the 0.5 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInWidthCenter |  Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm.
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace