Revit 2027 API
VertexPositionNormalColored Properties
The VertexPositionNormalColored type exposes the following members.
Properties
Name | Description
Normal |  The vertex's normal vector.
Position |  The vertex's position.
Top
See Also
Reference
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace