Revit 2027 API
Surface Methods
The Surface type exposes the following members.
Methods
Name | Description
Dispose
GetBoundingBoxUV |  Gets the UV bounding box of the surface.
IsCoincidentWith |  Determine if two surfaces are coincident (ignoring Envelopes). For an affirmative answer, the surfaces must have the same type (e.g., two planes).
Project |  Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
ProjectWithGuessPoint |  Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
Top
See Also
Reference
Surface Class
Autodesk.Revit.DB Namespace