Revit 2027 API
AssemblyInstance Class
 Combines multiple elements for tagging, filtering, scheduling and creating isolated assembly views.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.AssemblyInstance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyInstance : Element
Public Class AssemblyInstance
	Inherits Element
public ref class AssemblyInstance : public Element
type AssemblyInstance =
    class
        inherit Element
    end
The AssemblyInstance type exposes the following members.
Properties
Name | Description
AssemblyTypeName |  The name for the assembly type. All matching assembly instances share this name. Unique assembly instances are named automatically based on their naming category.
Location | This property is used to find the physical location of the assembly instance within project.
(Overrides Element.Location)
NamingCategoryId |  Id of the category that drives the default naming scheme for the assembly instance.
Top
Methods
Name | Description
AddMemberIds |  Adds member element ids for the assembly instance.
AllowsAssemblyViewCreation |  Returns true if assembly views can be created for this Assembly Instance.
AreElementsValidForAssembly |  Identifies if provided assembly members are valid.
CanRemoveElementsFromAssembly |  Identifies if provided assembly members can be removed from the assembly instance.
CompareAssemblyInstances |  Compares two assembly instances and returns a result with details about the differences
Create |  Creates a new assembly instance.
Disassemble |  Removes the assembly instance and releases the member elements.
GetCenter |  Returns the center of the bounding box for the assembly instance. This is the default position for placed assembly instances.
GetMemberIds |  Gets member element ids for the assembly instance.
GetTransform |  Gets the origin of the assembly instance.
IsMember |  Determines whether the given ElementId is a member of this assembly
IsValidNamingCategory |  Identifies if the naming category is valid for an assembly instance.
PlaceInstance |  Places an assembly instance of a given assembly type at the specified location.
RemoveMemberIds |  Removes member element ids from the assembly instance.
SetMemberIds |  Sets member element ids for the assembly instance. All existing members are cleared.
SetTransform |  Sets the origin of the assembly instance.
Top
Example
// Create assembly instance, name the assembly, and create views of the assembly
AssemblyInstance CreateAssemblyAndViews(Autodesk.Revit.DB.Document doc, ICollection<ElementId> elementIds)
{
    AssemblyInstance assemblyInstance = null;
    using (Transaction transaction = new Transaction(doc))
    {
        ElementId categoryId = doc.GetElement(elementIds.First()).Category.Id; // use category of one of the assembly elements
        if (AssemblyInstance.IsValidNamingCategory(doc, categoryId, elementIds))
        {
            transaction.Start("Create Assembly Instance");
            assemblyInstance = AssemblyInstance.Create(doc, elementIds, categoryId);
            transaction.Commit(); // commit the transaction that creates the assembly instance before modifying the instance's name
            if (transaction.GetStatus() == TransactionStatus.Committed)
            {
                transaction.Start("Set Assembly Name");
                assemblyInstance.AssemblyTypeName = "My Assembly Name";
                transaction.Commit();
            }
            if (assemblyInstance.AllowsAssemblyViewCreation()) // create assembly views for this assembly instance
            {
                if (transaction.GetStatus() == TransactionStatus.Committed)
                {
                    transaction.Start("View Creation");
                    View3D view3d = AssemblyViewUtils.Create3DOrthographic(doc, assemblyInstance.Id);
                    ViewSchedule partList = AssemblyViewUtils.CreatePartList(doc, assemblyInstance.Id);
                    transaction.Commit();
                }
            }
        }
    }
    return assemblyInstance;
}
See Also
Reference
Autodesk.Revit.DB Namespace