Revit 2027 API
SpaceTag Properties
The SpaceTag type exposes the following members.
Properties
Name | Description
Space | The space that the tag is associated with.
SpaceTagType | The tag type.
Top
See Also
Reference
SpaceTag Class
Autodesk.Revit.DB.Mechanical Namespace