Revit 2027 API
StairsRunType Properties
The StairsRunType type exposes the following members.
Properties
Name | Description
HasRisers |  True if the stairs run will include risers on steps, false otherwise.
HasTreads |  True if the stairs run will include treads on steps, false otherwise.
IsMonolithic |  True if the stairs run is monolithic, false otherwise.
IsSlanted |  True if risers will be slanted, false if they will be straight.
MaterialId |  The material of the stairs run, only available for monolithic stairs run.
NosingLength |  The amount of the tread depth that overhangs the next tread.
NosingProfile |  The id of the nosing profile of the treads.
RiserProfile |  The id of the profile of the risers.
RiserThickness |  The thickness of the risers.
RiserToTreadConnect |  The connection of the riser to tread in relation to each other.
StructuralDepth |  The structural depth of the stairs run, only available for monolithic stairs run.
TotalDepth |  The total depth of the stairs run, only available for monolithic stairs run.
TreadNosingPosition |  Represents on which edges of the nosing to apply the nosing profile.
TreadProfile |  The id of the profile of the treads.
TreadThickness |  The thickness of the treads.
UndersideSurfaceStyle |  The underside surface style of the stairs run, only available for monolithic stairs run.
Top
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace