Revit 2027 API
ElectricalSystem Methods
The ElectricalSystem type exposes the following members.
Methods
Name | Description
AddToCircuit | Add a set of exist components to the Electrical System.
Create(Connector, ElectricalSystemType) |  Creates a new MEP Electrical System element from an unused Connector.
Create(Document, IList<ElementId>, ElectricalSystemType) |  Creates a new MEP Electrical System element from a set of electrical components.
DisconnectPanel |  Disconnect the panel for the Electrical System.
GetCircuitPath |  Gets the list of the electrical system circuit path node position.
IsCircuitPathValid |  Checks whether the list of the electrical system circuit path node position is valid.
NewWires |  Create a bunch of wires for the electrical system.
RemoveFromCircuit | remove a set of exist components from the Electrical System.
SelectPanel |  Set the panel for the Electrical System.
SetCircuitPath |  Sets the electrical system circuit path by the list of node position.
Top
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace