Revit 2027 API
DuctSettings Methods
The DuctSettings type exposes the following members.
Methods
Name | Description
GetDuctSettings |  Get the duct settings of the project.
GetPressLossCalculationServerInfo |  Get the MEPServerInfo of the current pipe pressure loss calculation server.
GetSpecificFittingAngles |  Gets the list of specific fitting angles.
GetSpecificFittingAngleStatus |  Gets the status of given specific angle.
IsNetworkBasedCalculationsEnabled |  Indicates whether network based calculations for duct networks is enabled in the specified document.
IsValidSpecificFittingAngle |  Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
SetPressLossCalculationServerInfo |  Set the MEPServerInfo of the current pipe pressure loss calculation server.
SetSpecificFittingAngleStatus |  Sets the status of given specific angle.
Top
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace