Revit 2027 API
ResourceNotFoundException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ResourceNotFoundException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ResourceNotFoundException : ApplicationException
<SerializableAttribute>
Public Class ResourceNotFoundException
	Inherits ApplicationException
[SerializableAttribute]
public ref class ResourceNotFoundException : public ApplicationException
[<SerializableAttribute>]
type ResourceNotFoundException =
    class
        inherit ApplicationException
    end
The ResourceNotFoundException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace