Revit 2027 API
ServerModelCorruptedException Class
The exception thrown when the model is corrupted.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.ServerModelCorruptedException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ServerModelCorruptedException : CentralModelException
<SerializableAttribute>
Public Class ServerModelCorruptedException
	Inherits CentralModelException
[SerializableAttribute]
public ref class ServerModelCorruptedException : public CentralModelException
[<SerializableAttribute>]
type ServerModelCorruptedException =
    class
        inherit CentralModelException
    end
The ServerModelCorruptedException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace