Revit 2027 API
InitialWattageIntensity Properties
The InitialWattageIntensity type exposes the following members.
Properties
Name | Description
Efficacy |  The efficacy value.
Wattage |  The wattage value.
Top
See Also
Reference
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace