Revit 2027 API
AreaReinforcementType Methods
The AreaReinforcementType type exposes the following members.
Methods
Name | Description
CreateDefaultAreaReinforcementType |  Creates a new AreaReinforcementType object with a default name.
Top
See Also
Reference
AreaReinforcementType Class
Autodesk.Revit.DB.Structure Namespace