Revit 2027 API
WireTypeSet Methods
The WireTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every wire type from the set, rendering it empty.
Contains | Tests for the existence of a wire type within the set.
Erase | Removes a specified wire type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified wire type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace