Revit 2027 API
InstanceNode Class
 An output node that represents an instance of a geometry. It can be an instance of FamilyInstance, or it can be and instance of a part of symbol's geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.InstanceNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InstanceNode : GroupNode
Public Class InstanceNode
	Inherits GroupNode
public ref class InstanceNode : public GroupNode
type InstanceNode =
    class
        inherit GroupNode
    end
The InstanceNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetSymbolGeometryId |  Gets the SymbolGeometryId associated with the node.
Top
Remarks
 See also: OnInstanceBegin(InstanceNode). The SymbolGeometryId. contains the data for comparing if two InstanceNode points to the same geometry.
See Also
Reference
Autodesk.Revit.DB Namespace