Revit 2027 API
AnalyticalMember Properties
The AnalyticalMember type exposes the following members.
Properties
Name | Description
CrossSectionRotation |  This represents the cross-section rotation, in radians.
SectionTypeId |  The id of the type from the structural Family assigned to the Analytical Member.
StructuralSectionShape |  The structural section shape of the Analytical Member.
Top
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace