Revit 2027 API
TextBox Properties
The TextBox type exposes the following members.
Properties
Name | Description
Image | The image of the TextBox.
PromptText | The prompt text for the text box.
SelectTextOnFocus |  A value that indicates if the text is selected when the text box gains focus.
ShowImageAsButton | Gets or sets a value that indicates if the Image set in the text box should be displayed as a clickable button.
Value | The object that supplies the text value.
Width | Gets or sets the width of the TextBox.
Top
See Also
Reference
TextBox Class
Autodesk.Revit.UI Namespace