Revit 2027 API
ZoneElementDomainData Class
 A base class for specific domain requirements for a zone.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.ZoneElementDomainData
 Autodesk.Revit.DB.Electrical.AreaBasedLoadData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ZoneElementDomainData : IDisposable
Public Class ZoneElementDomainData
	Implements IDisposable
public ref class ZoneElementDomainData : IDisposable
type ZoneElementDomainData =
    class
        interface IDisposable
    end
The ZoneElementDomainData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ZoneElementDomainData
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace