Revit 2027 API
BrowserOrganization Class
 The organization settings for grouping, sorting, and filtering of items in the project browser.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.BrowserOrganization
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BrowserOrganization : ElementType
Public Class BrowserOrganization
	Inherits ElementType
public ref class BrowserOrganization : public ElementType
type BrowserOrganization =
    class
        inherit ElementType
    end
The BrowserOrganization type exposes the following members.
Properties
Name | Description
SortingOrder |  The sorting order if sorting of items is applicable in the browser.
SortingParameterId | Obsolete.
 The Id of the parameter used to determine the sorting order of items in the browser.
Type |  Get BrowserOrganizationType.
Top
Methods
Name | Description
AreFiltersSatisfied |  Determines if the given element satisfies the filters defined by the browser organization.
GetCurrentBrowserOrganizationForPanelSchedules |  Gets the BrowserOrganization that applies to the Panel Schedules section of the project browser.
GetCurrentBrowserOrganizationForSchedules |  Gets the BrowserOrganization that applies to the Schedules section of the project browser.
GetCurrentBrowserOrganizationForSheets |  Gets the BrowserOrganization that applies to the Sheets section of the project browser.
GetCurrentBrowserOrganizationForViews |  Gets the BrowserOrganization that applies to the Views section of the project browser.
GetFolderItems |  Returns a collection of leaf FolderItemInfo objects each containing the given element Id.
GetSortingParameterIdPath |  The parameter Id path used to determine the sorting order of items in the browser.
Top
See Also
Reference
Autodesk.Revit.DB Namespace