Revit 2027 API
RebarRoundingManager Properties
The RebarRoundingManager type exposes the following members.
Properties
Name | Description
ApplicableReinforcementRoundingSource |  Identifies the source of the rounding settings for this element.
ApplicableSegmentLengthRounding |  The applicable rounding for shared parameters used by rebar.
ApplicableSegmentLengthRoundingMethod |  The applicable rounding method for shared parameters used by rebar.
ApplicableTotalLengthRounding |  The applicable rounding for Bar Length and Total Bar Length parameters.
ApplicableTotalLengthRoundingMethod |  The applicable rounding method for Bar Length and Total Bar Length parameters.
SegmentLengthRounding |  The rounding for shared parameters used by rebar.
SegmentLengthRoundingMethod |  Identifies the segment length rounding method
TotalLengthRounding |  The rounding for Bar Length and Total Bar Length parameters.
TotalLengthRoundingMethod |  Identifies the total length rounding method
Top
See Also
Reference
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace