Revit 2027 API
PushButtonData Properties
The PushButtonData type exposes the following members.
Properties
Name | Description
AssemblyName | The assembly path of the button.
AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button.
ClassName | The name of the class containing the implementation for the command.
Top
See Also
Reference
PushButtonData Class
Autodesk.Revit.UI Namespace