Revit 2027 API
ColorFillSchemeEntry Methods
The ColorFillSchemeEntry type exposes the following members.
Methods
Name | Description
CanSetValue(Double) |  Checks whether StorageType of entry is Double and the value is no less than 0.0.
CanSetValue(ElementId) |  Checks whether StorageType of entry is ElementId.
CanSetValue(Int32) |  Checks whether StorageType of entry is Integer.
Dispose
GetDoubleValue |  Gets the Double value stored within the entry.
GetElementIdValue |  Gets the ElementId value stored within the entry.
GetIntegerValue |  Gets the Integer value stored within the entry.
GetStringValue |  Gets the String value stored within the entry.
SetDoubleValue |  Sets new Double value of entry.
SetElementIdValue |  Sets new ElementId value of entry.
SetIntegerValue |  Sets new Integer value of entry.
SetStringValue |  Sets new String value of entry.
Top
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace