Revit 2027 API
PreviewControl Class
 Presents a preview control to browse the Revit model.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Autodesk.Revit.UI.PreviewControl
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PreviewControl : UserControl,
	IDisposable
Public Class PreviewControl
	Inherits UserControl
	Implements IDisposable
public ref class PreviewControl : public UserControl,
	IDisposable
type PreviewControl =
    class
        inherit UserControl
        interface IDisposable
    end
The PreviewControl type exposes the following members.
Constructors
Name | Description
PreviewControl | Constructs a preview control.
Top
Properties
Name | Description
ScrollbarVisibility |  The visibility of the preview view scrollbars.
UIView | The UI view representing the preview view.
ViewId | The view Id.
Top
Methods
Name | Description
Dispose |  This method is called if the user explicitly disposes of the object (by calling the Dispose method in other managed languages, or the destructor in C++).
Top
Events
Name | Description
Top
Remarks
 The dialog or form or window host this preview control must be modal. The view can be any graphical view but not a non-graphical view. And only one can be active. The view can be manipulated by embedded view cube and the visibility and graphical settings set on the view will be evident in the preview control.
See Also
Reference
Autodesk.Revit.UI Namespace