Revit 2027 API
HVACLoadBuildingType Properties
The HVACLoadBuildingType type exposes the following members.
Properties
Name | Description
BuildingTypeName |  The building type name.
ClosingTime |  The closing time of the building type.
OpeningTime |  The opening time of the building type.
UnoccupiedCoolingSetPoint |  The unoccupied cooling set point of the building type with unit kelvin (K).
Top
See Also
Reference
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace