Revit 2027 API
Opening Properties
The Opening type exposes the following members.
Properties
Name | Description
BoundaryCurves |  The geometry information for non-rectangular openings in project documents, or for all openings in family documents.
BoundaryRect | Retrieves the geometry information if the opening boundary is a rect.
Host | Retrieves the host element of this opening.
IsRectBoundary | Retrieves the information whether the opening has a rectangular boundary.
IsTransparentIn3D | Indicates if the opening is transparent in 3D view when loaded into the project.
IsTransparentInElevation | Indicates if the opening is transparent in elevation view when loaded into the project.
SketchId |  Returns id of the Sketch or invalidElementId if element deon't own the Sketch.
Top
See Also
Reference
Opening Class
Autodesk.Revit.DB Namespace