Revit 2027 API
WireConduitTypeSet Properties
The WireConduitTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of conduit types that are in the set.
Top
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace