Revit 2027 API
FilterableValueProvider Class
 Defines the interface for classes that extract values from elements in a Revit project for testing against filter rules.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterableValueProvider
 Autodesk.Revit.DB.ParameterValueProvider
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterableValueProvider : IDisposable
Public Class FilterableValueProvider
	Implements IDisposable
public ref class FilterableValueProvider : IDisposable
type FilterableValueProvider =
    class
        interface IDisposable
    end
The FilterableValueProvider type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilterableValueProvider
GetAssociatedGlobalParameterValue |  Gets a global parameter value associated with a parameter from the given element.
GetDoubleValue |  Gets a double-precision numeric value from the given element.
GetElementIdValue |  Gets an ElementId value from the given element.
GetIntegerValue |  Gets an integer value from the given element.
GetStringValue |  Gets a string value from the given element.
IsDoubleValueSupported |  Determines whether the provide can provide a double-precision numeric value for the given element.
IsElementIdValueSupported |  Determines whether the provide can provide an ElementId value for the given element.
IsIntegerValueSupported |  Determines whether the provide can provide an integer value for the given element.
IsStringValueSupported |  Determines whether the provide can provide a string value for the given element.
Top
See Also
Reference
Autodesk.Revit.DB Namespace