Revit 2027 API
WorksetPreview Class
 Represents an accessor for workset data which can be obtained from an unopened document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetPreview
 Autodesk.Revit.DB.Workset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksetPreview : IDisposable
Public Class WorksetPreview
	Implements IDisposable
public ref class WorksetPreview : IDisposable
type WorksetPreview =
    class
        interface IDisposable
    end
The WorksetPreview type exposes the following members.
Properties
Name | Description
Id |  Id of the workset.
IsDefaultWorkset |  Whether the workset is the default one.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  Name of the workset.
Owner |  User name of the workset.
UniqueId |  UniqueId of the workset.
Top
Methods
Name | Description
Dispose | Releases all resources used by the WorksetPreview
Top
Remarks
 As a base class of Workset, this class has limited access to data. WorksetPreviews are obtained from WorksharingUtils.GetUserWorksetInfo() from an unopened document.
See Also
Reference
Autodesk.Revit.DB Namespace