Revit 2027 API
RelinquishedItems Class
 List of elements and worksets that were relinquished by the current user.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RelinquishedItems
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RelinquishedItems : IDisposable
Public Class RelinquishedItems
	Implements IDisposable
public ref class RelinquishedItems : IDisposable
type RelinquishedItems =
    class
        interface IDisposable
    end
The RelinquishedItems type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RelinquishedItems
GetRelinquishedElements |  The elements that were relinquished by the current user.
GetRelinquishedWorksets |  The elements that were relinquished by the current user.
Top
See Also
Reference
Autodesk.Revit.DB Namespace