Revit 2027 API
EdgeArrayIterator Class
An iterator to an edge array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.EdgeArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class EdgeArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class EdgeArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class EdgeArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type EdgeArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The EdgeArrayIterator type exposes the following members.
Constructors
Name | Description
EdgeArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace