Revit 2027 API
SharedParameterElement Properties
The SharedParameterElement type exposes the following members.
Properties
Name | Description
GuidValue |  The Guid that identifies this shared parameter.
Top
See Also
Reference
SharedParameterElement Class
Autodesk.Revit.DB Namespace