Revit 2027 API
DefaultValueException Methods
The DefaultValueException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
DefaultValueException Class
Autodesk.Revit.Exceptions Namespace