Revit 2027 API
StructuralSectionGeneralH Class
 Defines parameters for Rectangular Pipe structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralH : StructuralSectionRectangular
Public Class StructuralSectionGeneralH
	Inherits StructuralSectionRectangular
public ref class StructuralSectionGeneralH : public StructuralSectionRectangular
type StructuralSectionGeneralH =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionGeneralH type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralH |  Creates a new instance of Rectangular Pipe shape.
Top
Properties
Name | Description
InnerFillet |  Inner Fillet - Corner fillet inner radius.
OuterFillet |  Outer Fillet - Corner fillet outer radius.
WallDesignThickness |  Represents wall design thickness of rectangle.
WallNominalThickness |  Represents wall nominal thickness of rectangle.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace