Revit 2027 API
CanExecuteEventArgs Methods
The CanExecuteEventArgs type exposes the following members.
Methods
Name | Description
GetSelectedCategoryIds | Gets the category ids of selected elements.
Top
See Also
Reference
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace