Revit 2027 API
ElementType Methods
The ElementType type exposes the following members.
Methods
Name | Description
Duplicate |  Duplicates an existing element type and assigns it a new name.
GetPreviewImage | Get the preview image of an element. This image is similar to what is seen in the Revit UI when selecting the type of an element.
GetSimilarTypes |  Obtains a set of types that are similar to this type.
IsSimilarType |  Checks if given type is similar to this type.
IsValidDefaultFamilyType |  Identifies if this type is a valid default family type for the given family category id.
Top
See Also
Reference
ElementType Class
Autodesk.Revit.DB Namespace