Revit 2027 API
WireframeBuilder Methods
The WireframeBuilder type exposes the following members.
Methods
Name | Description
AddCurve |  Add a curve to the shape representation stored in this WireframeBuilder.
AddPoint |  Add a point to the shape representation stored in this WireframeBuilder.
Reset |  Clears the accumulated geometry.
ValidateCurve |  Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input. This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve().
ValidatePoint |  Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input.
Top
See Also
Reference
WireframeBuilder Class
Autodesk.Revit.DB Namespace