Revit 2027 API
DetailEllipse Class
Represents a DetailEllipse within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.DetailEllipse
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DetailEllipse : DetailCurve
Public Class DetailEllipse
	Inherits DetailCurve
public ref class DetailEllipse : public DetailCurve
type DetailEllipse =
    class
        inherit DetailCurve
    end
The DetailEllipse type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.
See Also
Reference
Autodesk.Revit.DB Namespace