Revit 2027 API
ViewPlan Methods
The ViewPlan type exposes the following members.
Methods
Name | Description
CheckPlanViewRangeValidity |  Checks if the plan view range is valid.
Create |  Creates a new ViewPlan.
CreateAreaPlan |  Creates a new area plan ViewPlan.
GetUnderlayBaseLevel |  Returns the element id of the level that defines the bottom of the underlay range.
GetUnderlayOrientation |  Returns the underlay orientation of this view.
GetUnderlayTopLevel |  Returns the element id of the level that defines the top of the underlay range.
GetViewRange |  Gets the view range.
SetUnderlayBaseLevel |  Sets the level whose elevation will determine the bottom of the underlay range. The elevation of the next highest level will be used to determine the top of the underlay range.
SetUnderlayOrientation |  Sets the underlay orientation for this view.
SetUnderlayRange |  Sets the underlay base and underlay top to the specified levels.
SetViewRange |  Sets the view range.
Top
See Also
Reference
ViewPlan Class
Autodesk.Revit.DB Namespace