Revit 2027 API
SteelElementProperties Methods
The SteelElementProperties type exposes the following members.
Methods
Name | Description
AddFabricationInformationForRevitElements |  This method adds fabrication information to the given elements.
GetFabricationUniqueID |  This method will return the fabrication id for the given reference.
GetReference |  This method will return the reference for the given fabrication id.
GetSteelElementProperties |  Get SteelElementProperties for the input element if they exist.
Top
See Also
Reference
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace