Revit 2027 API
ExtrusionRoof Properties
The ExtrusionRoof type exposes the following members.
Properties
Name | Description
CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof.
Top
See Also
Reference
ExtrusionRoof Class
Autodesk.Revit.DB Namespace