Revit 2027 API
AssemblyDifference Class
 Class that describes difference between two assemblies.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyDifference : IDisposable
Public Class AssemblyDifference
	Implements IDisposable
public ref class AssemblyDifference : IDisposable
type AssemblyDifference =
    class
        interface IDisposable
    end
The AssemblyDifference type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AssemblyDifference
Top
Remarks
 The assembly comparison function returns a sub-class of this class. Different sub-classes represent different kinds of differences and contain additional data for each particular kind of difference.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 Autodesk.Revit.DB.AssemblyDifferenceConfiguration
 Autodesk.Revit.DB.AssemblyDifferenceMemberCount
 Autodesk.Revit.DB.AssemblyDifferenceMemberDifference
 Autodesk.Revit.DB.AssemblyDifferenceNamingCategory
 Autodesk.Revit.DB.AssemblyDifferenceNone