Revit 2027 API
DuctSizes Class
 Class RbsDuctSizes being used to store the duct sizes
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctSizes
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctSizes : IEnumerable<MEPSize>,
	IDisposable
Public Class DuctSizes
	Implements IEnumerable(Of MEPSize), IDisposable
public ref class DuctSizes : IEnumerable<MEPSize^>,
	IDisposable
type DuctSizes =
    class
        interface IEnumerable<MEPSize>
        interface IDisposable
    end
The DuctSizes type exposes the following members.
Properties
Name | Description
Count |  Count of the items contained in the collection.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Contains |  Checks whether a duct size with the nominal diameter exists.
Dispose | Releases all resources used by the DuctSizes
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetDuctSizeIterator | Returns a DuctSizeIterator that iterates through the collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace