Revit 2027 API
GeomCombinationSet Methods
The GeomCombinationSet type exposes the following members.
Methods
Name | Description
Clear | Removes every item GeomCombination the set, rendering it empty.
Contains | Tests for the existence of an GeomCombination within the set.
Erase | Removes a specified GeomCombination from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified element into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
GeomCombinationSet Class
Autodesk.Revit.DB Namespace