Revit 2027 API
MEPSystemType Properties
The MEPSystemType type exposes the following members.
Properties
Name | Description
Abbreviation |  Identifies the abbreviation, the short name, for the system type
CalculationLevel |  Identifies the calculation level for the system type.
FillColor |  Indicates the color that should override the fill color for all components in the system.
FillPatternId |  Indicates the fill pattern id that should override the fill pattern id for all components in the system.
FillVisible |  Indicates the visibility of the fill pattern for all components in the system.
LineColor |  Indicates the color that should override the line color for all components in the system.
LinePatternId |  Indicates the line pattern id that should override the line pattern id for all components in the system.
LineWeight |  Indicates the weight that should override the line weight for all components in the system.
MaterialId |  Indicates the material id that should override the material for all components in the system.
SystemClassification |  Identifies the classification for the system type
Top
See Also
Reference
MEPSystemType Class
Autodesk.Revit.DB Namespace