Revit 2027 API
BindingMap Properties
The BindingMap type exposes the following members.
Properties
Name | Description
Item |  The get_Item method will get the binding item related to the input key.
(Overrides DefinitionBindingMap.Item[Definition])
Top
See Also
Reference
BindingMap Class
Autodesk.Revit.DB Namespace