Revit 2027 API
AreaBasedLoadBoundaryLineData Class
 Wrapper class used to access area based load boundary line related data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaBasedLoadBoundaryLineData : IDisposable
Public Class AreaBasedLoadBoundaryLineData
	Implements IDisposable
public ref class AreaBasedLoadBoundaryLineData : IDisposable
type AreaBasedLoadBoundaryLineData =
    class
        interface IDisposable
    end
The AreaBasedLoadBoundaryLineData type exposes the following members.
Properties
Name | Description
BottomLevelId |  The bottom level id of the area based load boundary line.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TopLevelId |  The top level id of the area based load boundary line.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AreaBasedLoadBoundaryLineData
GetLevelIdsInRange |  Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line.
IsElevationWithinRange |  Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line.
IsLevelWithinRange |  Checks whether the given level is between the bottom level and the top level (including the bottom level and the top level) of the area based load boundary line.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace