Revit 2027 API
ModelLine Class
Represents a ModelLine within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.ModelCurve
 Autodesk.Revit.DB.ModelLine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelLine : ModelCurve
Public Class ModelLine
	Inherits ModelCurve
public ref class ModelLine : public ModelCurve
type ModelLine =
    class
        inherit ModelCurve
    end
The ModelLine type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Geometry-related functionality is provided by the geometry curve object from the ModelCurve::geometryCurve property.
See Also
Reference
Autodesk.Revit.DB Namespace