Revit 2027 API
RevisionNumberingSequence Class
 Defines the sequences by which numbers are assigned to Revisions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.RevisionNumberingSequence
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevisionNumberingSequence : Element
Public Class RevisionNumberingSequence
	Inherits Element
public ref class RevisionNumberingSequence : public Element
type RevisionNumberingSequence =
    class
        inherit Element
    end
The RevisionNumberingSequence type exposes the following members.
Properties
Name | Description
NumberType |  Indicates the revision number type of the revision numbering sequence.
SequenceName |  The name of this revision numbering sequence.
Top
Methods
Name | Description
CreateAlphanumericSequence |  Creates a new alphanumeric revision numbering sequence in the document.
CreateNumericSequence |  Creates a new numeric revision numbering sequence in the document.
GetAllRevisionNumberingSequences |  Gets all of the revision numbering sequences from the document.
GetAlphanumericRevisionSettings |  Returns a copy of the AlphanumericRevisionSettings owned by this revision numbering sequence.
GetNumericRevisionSettings |  Returns a copy of the NumericRevisionSettings owned by this revision numbering sequence.
HasValidAlphanumericRevisionSettings |  Checks whether the revision numbering sequence owns a valid alphanumeric revision settings.
HasValidNumericRevisionSettings |  Checks whether the revision numbering sequence owns a valid numeric revision settings.
HasValidRevisionSettingsForNumberType |  Checks whether the revision numbering sequence owns a valid revision settings for number type.
SetAlphanumericRevisionSettings |  Replaces the current alphanumeric revision numbering settings with the provided settings.
SetNumericRevisionSettings |  Replaces the current numeric revision numbering settings with the provided settings.
Top
Remarks
 Revision numbering is numeric or alphanumeric. Revision numbering is assigned to Revisions to control the numbering scheme of that Revision.
See Also
Reference
Autodesk.Revit.DB Namespace