Revit 2027 API
NestedFamilyTypeReference Properties
The NestedFamilyTypeReference type exposes the following members.
Properties
Name | Description
CategoryId |  Category Id of the referenced family
FamilyName |  Name of the referenced family
TypeName |  Type of the referenced family
Top
See Also
Reference
NestedFamilyTypeReference Class
Autodesk.Revit.DB Namespace