Revit 2027 API
TriangulationInterface Class
 This abstract class provides an interface for querying a triangulation structure (vertices and triangles).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TriangulationInterface
 Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent
 Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TriangulationInterface : IDisposable
Public Class TriangulationInterface
	Implements IDisposable
public ref class TriangulationInterface : IDisposable
type TriangulationInterface =
    class
        interface IDisposable
    end
The TriangulationInterface type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TriangulationInterface
Top
See Also
Reference
Autodesk.Revit.DB Namespace