Revit 2027 API
SplitButton Class
The SplitButton object represents a button with a clickable button appearing above a pulldown.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.PulldownButton
 Autodesk.Revit.UI.SplitButton
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SplitButton : PulldownButton
Public Class SplitButton
	Inherits PulldownButton
public ref class SplitButton : public PulldownButton
type SplitButton =
    class
        inherit PulldownButton
    end
The SplitButton type exposes the following members.
Properties
Name | Description
CurrentButton | Gets or sets the current PushButton of the SplitButton.
IsSynchronizedWithCurrentItem |  Indicates whether the top PushButton on the SplitButton changes based on the CurrentButton property.
Top
Methods
Name | Description
Top
Remarks
Use of this class is not supported in Revit Macros.
Example
private void AddSplitButton(RibbonPanel panel)
{
    string assembly = @"D:\Sample\HelloWorld\bin\Debug\HelloWorld.dll";
    // create push buttons for split button drop down
    PushButtonData bOne = new PushButtonData("ButtonNameA", "Option One",
        assembly, "Hello.HelloOne");
    bOne.LargeImage =
        new BitmapImage(new Uri(@"D:\Sample\HelloWorld\bin\Debug\One.bmp"));
    PushButtonData bTwo = new PushButtonData("ButtonNameB", "Option Two",
        assembly, "Hello.HelloTwo");
    bTwo.LargeImage =
        new BitmapImage(new Uri(@"D:\Sample\HelloWorld\bin\Debug\Two.bmp"));
    PushButtonData bThree = new PushButtonData("ButtonNameC", "Option Three",
        assembly, "Hello.HelloThree");
    bThree.LargeImage =
        new BitmapImage(new Uri(@"D:\Sample\HelloWorld\bin\Debug\Three.bmp"));
    SplitButtonData sb1 = new SplitButtonData("splitButton1", "Split");
    SplitButton sb = panel.AddItem(sb1) as SplitButton;
    sb.AddPushButton(bOne);
    sb.AddPushButton(bTwo);
    sb.AddPushButton(bThree);
}
See Also
Reference
Autodesk.Revit.UI Namespace