Revit 2027 API
ExportPatternInfo Methods
The ExportPatternInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExportPatternInfo Class
Autodesk.Revit.DB Namespace