Revit 2027 API
ModificationForbiddenException Class
The exception that is thrown by the undo transaction framework when a modification operation is not allowed.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.ModificationForbiddenException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ModificationForbiddenException : InvalidOperationException
<SerializableAttribute>
Public Class ModificationForbiddenException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class ModificationForbiddenException : public InvalidOperationException
[<SerializableAttribute>]
type ModificationForbiddenException =
    class
        inherit InvalidOperationException
    end
The ModificationForbiddenException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
Remarks
 See also: [!:Autodesk::Revit::DB::Element::IsModifiable] and [!:Autodesk::Revit::DB::Document::IsModifiable].
See Also
Reference
Autodesk.Revit.Exceptions Namespace