Revit 2027 API
FilterNumericLessOrEqual Class
 Tests whether numeric values from the document are less than or equal to a certain value
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterNumericRuleEvaluator
 Autodesk.Revit.DB.FilterNumericLessOrEqual
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterNumericLessOrEqual : FilterNumericRuleEvaluator
Public Class FilterNumericLessOrEqual
	Inherits FilterNumericRuleEvaluator
public ref class FilterNumericLessOrEqual : public FilterNumericRuleEvaluator
type FilterNumericLessOrEqual =
    class
        inherit FilterNumericRuleEvaluator
    end
The FilterNumericLessOrEqual type exposes the following members.
Constructors
Name | Description
FilterNumericLessOrEqual |  Constructs an instance of FilterNumericLessOrEqual.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace