Revit 2027 API
OperationCanceledException Methods
The OperationCanceledException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
OperationCanceledException Class
Autodesk.Revit.Exceptions Namespace