Revit 2027 API
ExternalApplicationArray Class
An array that can contain any number of IExternalApplication objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.UI.ExternalApplicationArray
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalApplicationArray : APIObject,
	IEnumerable
Public Class ExternalApplicationArray
	Inherits APIObject
	Implements IEnumerable
public ref class ExternalApplicationArray : public APIObject,
	IEnumerable
type ExternalApplicationArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The ExternalApplicationArray type exposes the following members.
Constructors
Name | Description
ExternalApplicationArray | Initializes a new instance of the ExternalApplicationArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an item at a specified index within the array.
Size | Returns the number of objects that are in the array.
Top
Methods
Name | Description
Append | Add the item to the end of the array.
Clear | Removes every item from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified item into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.UI Namespace