Revit 2027 API
RebarSpliceOptions Methods
The RebarSpliceOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
RebarSpliceOptions Class
Autodesk.Revit.DB.Structure Namespace