Revit 2027 API
ConstraintToRebarEdgeProperties Methods
The ConstraintToRebarEdgeProperties type exposes the following members.
Methods
Name | Description
Dispose
GetTargetRebarEdge |  Gets the target rebar edge.
Top
See Also
Reference
ConstraintToRebarEdgeProperties Class
Autodesk.Revit.DB.Structure Namespace