Revit 2027 API
MEPAnalyticalConnectionType Methods
The MEPAnalyticalConnectionType type exposes the following members.
Methods
Name | Description
Create |  Creates an analytical connection type element.
FindTypeByName |  Finds the analytical connection type by its name.
IsNameUnused |  Checks if this is an unused name.
Top
See Also
Reference
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace