Revit 2027 API
DuctFittingAndAccessoryPressureDropData Class
 The input and output data used by external servers for calculation of the duct fitting and duct accessory pressure drop.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctFittingAndAccessoryPressureDropData : IDisposable
Public Class DuctFittingAndAccessoryPressureDropData
	Implements IDisposable
public ref class DuctFittingAndAccessoryPressureDropData : IDisposable
type DuctFittingAndAccessoryPressureDropData =
    class
        interface IDisposable
    end
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
Properties
Name | Description
CalculationType |  The calculation type, a bitmask of FittingAndAccessoryCalculationType.
IsCurrentEntityValid |  True if the current settings stored in the entity is valid.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctFittingAndAccessoryPressureDropData
GetDuctFittingAndAccessoryData |  Returns the fitting and accessory information.
GetPresureDropItems |  Returns the pressure drop items.
SetDefaultEntity |  Stores the default entity in the data.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace