Revit 2027 API
ImageBackgroundSettings Class
 Represents the rendering image background settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundSettings
 Autodesk.Revit.DB.ImageBackgroundSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ImageBackgroundSettings : BackgroundSettings
Public Class ImageBackgroundSettings
	Inherits BackgroundSettings
public ref class ImageBackgroundSettings : public BackgroundSettings
type ImageBackgroundSettings =
    class
        inherit BackgroundSettings
    end
The ImageBackgroundSettings type exposes the following members.
Properties
Name | Description
BackgroundImageFit |  The background image fit type.
FilePath |  File path of the image for the rendering background.
OffsetHeight |  The vertical offset of the rendering image to the rendering region.
OffsetWidth |  The horizontal offset of the rendering image to the rendering region.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace