Revit 2027 API
PreDocEventArgs Properties
The PreDocEventArgs type exposes the following members.
Properties
Name | Description
Document |  The document associated with the event.
Top
See Also
Reference
PreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace