Revit 2027 API
ModelTextType Class
A model text type symbol in the Autodesk Revit Family document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.ModelTextType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelTextType : ElementType
Public Class ModelTextType
	Inherits ElementType
public ref class ModelTextType : public ElementType
type ModelTextType =
    class
        inherit ElementType
    end
The ModelTextType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace