Revit 2027 API
PointLightShape Class
 This class encapsulates a point light shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightShape
 Autodesk.Revit.DB.Lighting.PointLightShape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointLightShape : LightShape
Public Class PointLightShape
	Inherits LightShape
public ref class PointLightShape : public LightShape
type PointLightShape =
    class
        inherit LightShape
    end
The PointLightShape type exposes the following members.
Constructors
Name | Description
PointLightShape() |  Creates a point light shape object.
PointLightShape(PointLightShape) |  Creates a copy of the given point light shape
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace