Revit 2027 API
GBXMLExportOptions Methods
The GBXMLExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace