Revit 2027 API
DefinitionBindingMapIterator Class
An iterator to a parameter definition to parameter bindings map.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DefinitionBindingMapIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class DefinitionBindingMapIterator : APIObject,
	IEnumerator
Public MustInherit Class DefinitionBindingMapIterator
	Inherits APIObject
	Implements IEnumerator
public ref class DefinitionBindingMapIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type DefinitionBindingMapIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The DefinitionBindingMapIterator type exposes the following members.
Constructors
Name | Description
DefinitionBindingMapIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the binding that is the current focus of the iterator.
Key | Retrieves the definition that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the map.
Top
See Also
Reference
Autodesk.Revit.DB Namespace