Revit 2027 API
InvalidDataStreamException Class
The exception that is thrown when the reading or saving operation failed due to parsing error.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.IOException
 Autodesk.Revit.Exceptions.InvalidDataStreamException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InvalidDataStreamException : IOException
<SerializableAttribute>
Public Class InvalidDataStreamException
	Inherits IOException
[SerializableAttribute]
public ref class InvalidDataStreamException : public IOException
[<SerializableAttribute>]
type InvalidDataStreamException =
    class
        inherit IOException
    end
The InvalidDataStreamException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace