Revit 2027 API
ThemeChangedEventArgs Class
 The event arguments used by the ThemeChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.ThemeChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ThemeChangedEventArgs : RevitAPISingleEventArgs
Public Class ThemeChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class ThemeChangedEventArgs : public RevitAPISingleEventArgs
type ThemeChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The ThemeChangedEventArgs type exposes the following members.
Properties
Name | Description
ThemeChangedType |  Get the application frame theme Type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace