Revit 2027 API
KeyBasedTreeEntries Class
 A collection of KeyBasedTreeEntry objects that make up the key-based tree.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntries
 Autodesk.Revit.DB.ClassificationEntries
 Autodesk.Revit.DB.KeynoteEntries
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntries : IEnumerable<KeyBasedTreeEntry>,
	IDisposable
Public Class KeyBasedTreeEntries
	Implements IEnumerable(Of KeyBasedTreeEntry), IDisposable
public ref class KeyBasedTreeEntries : IEnumerable<KeyBasedTreeEntry^>,
	IDisposable
type KeyBasedTreeEntries =
    class
        interface IEnumerable<KeyBasedTreeEntry>
        interface IDisposable
    end
The KeyBasedTreeEntries type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the KeyBasedTreeEntries
FindEntry |  Finds the KeyBasedTreeEntry associated with the given key value.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetKeyBasedTreeEntriesIterator |  Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
Top
See Also
Reference
Autodesk.Revit.DB Namespace