Revit 2027 API
ViewSheetSet Class
Represents ViewSheetSets stored in a document. ViewSheetSets can be stored so that the same printing task can be executed multiple times.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ViewSheetSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewSheetSet : Element,
	IViewSheetSet
Public Class ViewSheetSet
	Inherits Element
	Implements IViewSheetSet
public ref class ViewSheetSet : public Element,
	IViewSheetSet
type ViewSheetSet =
    class
        inherit Element
        interface IViewSheetSet
    end
The ViewSheetSet type exposes the following members.
Properties
Name | Description
IsAutomatic |  Automatic order or manual order.
Name | The view sheet set name.
(Overrides Element.Name)
OrderedViewList |  Ordered views.
SheetOrganizationId | ElementId to the BrowserOrganization for sheets.
ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views.
Views | The views.
Top
Methods
Name | Description
Top
Remarks
 For the in-session ViewSheetSet, see the class InSessionViewSheetSet. Changes of ViewSheetSet would be effiective after [!:Autodesk::Revit::DB::ViewSheetSetting::Save]
See Also
Reference
Autodesk.Revit.DB Namespace