Revit 2027 API
MEPAnalyticalConnection Class
 Represents an analytical element that connects mechanical equipment to piping network.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.MEPAnalyticalConnection
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPAnalyticalConnection : MEPCurve
Public Class MEPAnalyticalConnection
	Inherits MEPCurve
public ref class MEPAnalyticalConnection : public MEPCurve
type MEPAnalyticalConnection =
    class
        inherit MEPCurve
    end
The MEPAnalyticalConnection type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CanSupportAnalyticalConnection |  Checks if the connector can support the analytical connection.
Create |  Creates a new analytical connection between two open connectors.
CreateMultipleConnections |  Creates new analytical connections between the equipment connector and the nearest point on the curves.
GetFlow |  Gets the flow value of this analytical connection.
Top
Remarks
 The analytical connection takes mechanical equipment into account of network flow/pressure analysis. The connection remains the same even if the mechanical equipment moves and rotates. It enables a fast establishment of piping network to analyze the flow and pressure, especially at the early stage of the design process.
See Also
Reference
Autodesk.Revit.DB Namespace