Revit 2027 API
Pipe Methods
The Pipe type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector) |  Creates a new pipe that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ) |  Creates a new pipe that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) |  Creates a new pipe from two points.
CreatePlaceholder |  Creates a new placeholder pipe.
IsPipeTypeId |  Checks if given type is valid pipe type.
IsPipingConnector |  Checks if the given connector is a valid piping connector.
IsPipingSystemTypeId |  Checks if given type is valid piping system type.
SetSystemType |  Updates the associated system type for the pipe.
Top
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace