Revit 2027 API
MechanicalSystem Methods
The MechanicalSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId) |  Creates a new instance of a mechanical system and adds it to the document.
Create(Document, ElementId, String) |  Creates a new instance of a mechanical system and adds it to the document.
GetFlow |  Gets the flow of this mechanical system.
GetStaticPressure |  Gets the static pressure of this mechanical system.
IsPressureDropServerMissing |  Indicates if any pressure drop server which was used in the mechanical system is not available.
Top
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace