Revit 2027 API
CurveByPointsArrayIterator Properties
The CurveByPointsArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
CurveByPointsArrayIterator Class
Autodesk.Revit.DB Namespace