Revit 2027 API
InitialIntensity Class
 This class is the base class for calculating lighting initial intensity.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialFluxIntensity
 Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
 Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
 Autodesk.Revit.DB.Lighting.InitialWattageIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialIntensity : IDisposable
Public Class InitialIntensity
	Implements IDisposable
public ref class InitialIntensity : IDisposable
type InitialIntensity =
    class
        interface IDisposable
    end
The InitialIntensity type exposes the following members.
Properties
Name | Description
InitialIntensityValue |  The calculated initial intensity value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Clone |  Creates a copy of the InitialIntensity derived object.
Dispose | Releases all resources used by the InitialIntensity
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace