Revit 2027 API
ButtonData Class
Base class used to contain information necessary to construct a button in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PulldownButtonData
 Autodesk.Revit.UI.PushButtonData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ButtonData : RibbonItemData
Public Class ButtonData
	Inherits RibbonItemData
public ref class ButtonData : public RibbonItemData
type ButtonData =
    class
        inherit RibbonItemData
    end
The ButtonData type exposes the following members.
Properties
Name | Description
Image | The image of the button.
LargeImage | The large image of the button.
Text | The user-visible text of the button.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace