Revit 2027 API
FabricationAncillaryUsage Class
 Structure that holds information about the usage of a fabrication ancillary
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationAncillaryUsage
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationAncillaryUsage : IDisposable
Public Class FabricationAncillaryUsage
	Implements IDisposable
public ref class FabricationAncillaryUsage : IDisposable
type FabricationAncillaryUsage =
    class
        interface IDisposable
    end
The FabricationAncillaryUsage type exposes the following members.
Properties
Name | Description
AncillaryDepth |  Depth of required ancillary if it isn't round.
AncillaryId |  Fabrication ancillary database identifier.
AncillaryWidthOrDiameter |  Width or diameter of required ancillary.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Length |  Length of required ancillaries.
ProductCode |  A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it.
Quantity |  Quantity of required ancillaries.
Type |  Fabrication ancillary type.
UsageType |  Fabrication ancillary usage type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationAncillaryUsage
Top
See Also
Reference
Autodesk.Revit.DB Namespace