Revit 2027 API
FaceSilhouetteNode Methods
The FaceSilhouetteNode type exposes the following members.
Methods
Name | Description
GetFace |  Returns the Face object corresponding to the node.
Top
See Also
Reference
FaceSilhouetteNode Class
Autodesk.Revit.DB Namespace