Revit 2027 API
PointRelativeToPoint Methods
The PointRelativeToPoint type exposes the following members.
Methods
Name | Description
GetHostPointReference | Get a copy of the host point reference.
SetHostPointReference | Change the host point reference.
Top
See Also
Reference
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace