Revit 2027 API
DocumentReloadedLatestEventArgs Properties
The DocumentReloadedLatestEventArgs type exposes the following members.
Properties
Name | Description
Location |  Full path of the central model which is to be operated.
Top
See Also
Reference
DocumentReloadedLatestEventArgs Class
Autodesk.Revit.DB.Events Namespace