Revit 2027 API
Camera Methods
The Camera type exposes the following members.
Methods
Name | Description
Dispose
Transform |  Transforms the camera
Top
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace