Revit 2027 API
DuctLining Class
 Represents Lining applied to the inside of a given duct, fitting or accessory.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Mechanical.DuctLining
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctLining : InsulationLiningBase
Public Class DuctLining
	Inherits InsulationLiningBase
public ref class DuctLining : public InsulationLiningBase
type DuctLining =
    class
        inherit InsulationLiningBase
    end
The DuctLining type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of duct lining.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace