Revit 2027 API
HermiteSurface Class
 A Hermite Surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.HermiteSurface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HermiteSurface : Surface
Public Class HermiteSurface
	Inherits Surface
public ref class HermiteSurface : public Surface
type HermiteSurface =
    class
        inherit Surface
    end
The HermiteSurface type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create(Int32, Int32, IList<XYZ>) |  Create a non-periodic Hermite surface using a net of 3D points as input.
Create(Int32, Int32, IList<XYZ>, Boolean, Boolean) |  Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction.
IsValid |  Checks whether this HermiteSurface object is valid.
Top
See Also
Reference
Autodesk.Revit.DB Namespace