Revit 2027 API
DoubleParameterValue Class
 A class that holds a Double value of a parameter element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.DoubleParameterValue
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DoubleParameterValue : ParameterValue
Public Class DoubleParameterValue
	Inherits ParameterValue
public ref class DoubleParameterValue : public ParameterValue
type DoubleParameterValue =
    class
        inherit ParameterValue
    end
The DoubleParameterValue type exposes the following members.
Constructors
Name | Description
DoubleParameterValue() |  Default constructor
DoubleParameterValue(Double) |  Value constructor
Top
Properties
Name | Description
Value |  The stored value
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace