Revit 2027 API
ElectricalAnalyticalNode Class
 Represents an electrical analytical node under the Analytical Power Distribution in the System Browser.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalAnalyticalNode : Element
Public Class ElectricalAnalyticalNode
	Inherits Element
public ref class ElectricalAnalyticalNode : public Element
type ElectricalAnalyticalNode =
    class
        inherit Element
    end
The ElectricalAnalyticalNode type exposes the following members.
Properties
Name | Description
NodeType |  The type of electrical analytical node.
TotalLoad |  The Total Connected Load.
Top
Methods
Name | Description
CanConnectToUpstreamNode |  Verifies that the current node can connect to the upstream node.
CanDisconnectFromUpstreamNode |  Verifies that the current node can disconnect from the upstream node.
ConnectToUpstreamNode |  Connects to upstream node.
Create |  Creates an electrical analytical node.
DisconnectFromUpstreamNode |  Disconnects from upstream node.
GetAllDownstreamLoadIds |  Get all the descendant Electrical Analytical Load ids of the node.
GetAnalyticalPropertyData |  Gets the electrical analytical node property data, null if not available.
GetDownstreamNodeIds |  Gets the downstream node ids.
GetUpstreamNodeIds |  Gets upstream node ids.
Top
Remarks
 This represents one of any number of types, as specified by the ElectricalAnalyticalNodeType. Some of those types will have AnalyticalDistributionNodePropertyData while others will not, and if they do have data they can be downcast to a specific subclass of data to be used.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace