Revit 2027 API
IFCPropertySetMappingInfo Methods
The IFCPropertySetMappingInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCPropertySetMappingInfo Class
Autodesk.Revit.DB Namespace