Revit 2027 API
HostObject Class
 A base class that provides support for all objects that can host other objects, such as walls roofs, and floors.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HostObject : Element
Public Class HostObject
	Inherits Element
public ref class HostObject : public Element
type HostObject =
    class
        inherit Element
    end
The HostObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
FindInserts |  Gets the ids of the instances inserted into this host object.
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.CurtainGridLine
 Autodesk.Revit.DB.CurtainSystemBase
 Autodesk.Revit.DB.FaceToposolid
 Autodesk.Revit.DB.FaceWall
 Autodesk.Revit.DB.HostedSweep
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.RoofBase
 Autodesk.Revit.DB.Wall
 Autodesk.Revit.DB.WallFoundation
 Autodesk.Revit.DB.WallSweep