Revit 2027 API
BuildingOperatingYearSchedule Methods
The BuildingOperatingYearSchedule type exposes the following members.
Methods
Name | Description
Create |  Creates a valid BuildingOperatingYearSchedule with the given name, where every day has the schedule daySchedule.
GetScheduleForDay |  Gets the BuildingOperatingDaySchedule for this day of the year.
SetScheduleForDay |  Sets the BuildingOperatingDaySchedule for this day of the year.
Top
See Also
Reference
BuildingOperatingYearSchedule Class
Autodesk.Revit.DB.Analysis Namespace