Revit 2027 API
IndependentTag Methods
The IndependentTag type exposes the following members.
Methods
Name | Description
AddReferences |  Adds the provided list of references to the tag's list of references.
CanLeaderEndConditionBeAssigned |  Checks whether the LeaderEndCondition can be changed.
CanLeaderStartConditionBeAssigned |  Checks whether the LeaderStartCondition can be changed.
Create(Document, ElementId, ElementId, Reference, Boolean, TagOrientation, XYZ) |  Places a tag on an element or subelement.
Create(Document, ElementId, Reference, Boolean, TagMode, TagOrientation, XYZ) |  Places a tag on an element or subelement.
GetLeaderElbow |  Returns the position of the elbow of the tag's leader that points to specified reference. Position of leader's elbow.
GetLeaderEnd |  Gets the free end point for the leader to the specified reference.
GetLeaderStart |  Gets the free leader start point for the leader to the specified reference.
GetTaggedElementIds |  Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each subelement that is being referenced by the tag.
GetTaggedLocalElementIds |  Returns a set of IDs for all tagged local elements, if any. A local element ID will be provided for each subelement that is being referenced by the tag. Set of all the element ids in the local file. For each subelement a local element id will be provided.
GetTaggedLocalElements |  Get the tagged local elements, if any. An Element will be provided for each subelement that is being referenced by the tag.
GetTaggedReferences |  Get the host references of the tag. An array of all the tagged references.
HasLeaderElbow |  Whether the tag's leader that points to the reference has an elbow point or not.
HasTagBehavior |  Checks if the IndependentTag has a tag behavior.
HasTagText |  Checks if the IndependentTag has a valid tag text.
IsLeaderVisible |  Returns if leader that points to specified reference is visible or not.
IsTaggedOnSubelement |  Returns true if the any of the tagged references is a subelement.
RemoveReferences |  Removes the provided list of references from the tag's list of references.
SetIsLeaderVisible |  Set tag's leader that points to specified reference to be visible or not. This option can be set only if the LeadersPresentationMode is ShowSpecificLeaders.
SetLeaderElbow |  Set the position of the elbow of the tag's leader that points to specified reference. If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.
SetLeaderEnd |  Sets the free end point for the leader to the specified reference.
SetLeaderStart |  Sets the free leader start point for the leader to the specified reference.
Top
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace