Revit 2027 API
AssetPropertyEnum Class
 Represents a property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyEnum
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyEnum : AssetProperty
Public Class AssetPropertyEnum
	Inherits AssetProperty
public ref class AssetPropertyEnum : public AssetProperty
type AssetPropertyEnum =
    class
        inherit AssetProperty
    end
The AssetPropertyEnum type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace