Revit 2027 API
CancellationListener Methods
The CancellationListener type exposes the following members.
Methods
Name | Description
Dispose
IsCancelled |  Returns true if the operation associated with this instance has been cancelled.
Top
See Also
Reference
CancellationListener Class
Autodesk.Revit.DB Namespace