Revit 2027 API
AnalysisDisplayVectorSettings Methods
The AnalysisDisplayVectorSettings type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Compares two vector settings objects.
Top
See Also
Reference
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace