Revit 2027 API
PointOnPlane Methods
The PointOnPlane type exposes the following members.
Methods
Name | Description
GetPlaneReference | The geometric plane reference.
IsValidPlaneReference | Check whether a geometry reference corresponds to a referenceable plane.
NewPointOnPlane | Construct a PointOnPlane given a reference and a location in space.
SetPlaneReference | Change the geometric plane reference.
Top
See Also
Reference
PointOnPlane Class
Autodesk.Revit.DB Namespace