Revit 2027 API
ViewNavigationToolSettings Methods
The ViewNavigationToolSettings type exposes the following members.
Methods
Name | Description
GetHomeCamera |  Gets a copy of the structure containing information about the store Home view orientation.
GetViewNavigationToolSettings |  Gets the instance of the settings for the given document.
IsHomeCameraSet |  Checks if the home view is set in the settings.
Top
See Also
Reference
ViewNavigationToolSettings Class
Autodesk.Revit.DB Namespace