Revit 2027 API
SpatialElementGeometryResults Methods
The SpatialElementGeometryResults type exposes the following members.
Methods
Name | Description
Dispose
GetBoundaryFaceInfo |  Query the spatial element boundary face information with the given face.
GetGeometry |  The solid from the spatial element.
Top
See Also
Reference
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace