Revit 2027 API
GutterType Class
An object that represents the gutter type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.HostedSweepType
 Autodesk.Revit.DB.Architecture.GutterType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GutterType : HostedSweepType
Public Class GutterType
	Inherits HostedSweepType
public ref class GutterType : public HostedSweepType
type GutterType =
    class
        inherit HostedSweepType
    end
The GutterType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace