Revit 2027 API
SlabShapeEditor Methods
The SlabShapeEditor type exposes the following members.
Methods
Name | Description
AddPoint |  Add a point to the element.
AddPoints |  Add an array of points to the element.
AddSplitLine |  Add a split line to the element.
CreateCreasesFromFoldingLines |  Convert selected folding lines to split lines
DeletePoint |  Delete a SlabShapeVertex from the element.
Dispose
Enable | Enables the slab shape editing functionality.
ModifySubElement(SlabShapeCrease, Double) | Manipulates the crease on the corresponding slab, roof or floor.
ModifySubElement(SlabShapeVertex, Double) | Manipulates the vertex on the corresponding slab, roof or floor.
PickSupport | Picks an element to support the slab. This method will define split lines and create constant bearing lines for the slab.
ResetSlabShape | Removes the modifications made during editing and resets the element geometry back to the unmodified state.
Top
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace