Revit 2027 API
ContentNode Class
 This class represents a generic content node in a model-exporting process.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.LightNode
 Autodesk.Revit.DB.RPCNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ContentNode : RenderNode
Public Class ContentNode
	Inherits RenderNode
public ref class ContentNode : public RenderNode
type ContentNode =
    class
        inherit RenderNode
    end
The ContentNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetAsset |  Returns an an instance of an Asset object, which contains definitions of the content node.
GetTransform |  A transformation matrix associated with the node.
Top
Remarks
 Members of this class implement properties and methods common to all content classes, such as RPC and Light nodes. Attributes of a content note can be accessed via an Asset object.
See Also
Reference
Autodesk.Revit.DB Namespace