Revit 2027 API
FamilyInstancePlacingArgs Class
 The class is used to access necessary data during the placement of a FamilyInstance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.FamilyInstancePlacingArgs
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyInstancePlacingArgs : IDisposable
Public Class FamilyInstancePlacingArgs
	Implements IDisposable
public ref class FamilyInstancePlacingArgs : IDisposable
type FamilyInstancePlacingArgs =
    class
        interface IDisposable
    end
The FamilyInstancePlacingArgs type exposes the following members.
Properties
Name | Description
ActiveView |  The active view
IsBanned |  Indicates if the cursor is banned or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StatusMessage |  The message to be shown on the status bar
TooltipMessage |  The message to be shown via tooltip
Top
Methods
Name | Description
Dispose | Releases all resources used by the FamilyInstancePlacingArgs
Top
See Also
Reference
Autodesk.Revit.UI Namespace