Revit 2027 API
LayoutRuleFixedNumber Properties
The LayoutRuleFixedNumber type exposes the following members.
Properties
Name | Description
NumberOfLines | Get or set the number of the beams in a beam system.
Top
See Also
Reference
LayoutRuleFixedNumber Class
Autodesk.Revit.DB Namespace