Revit 2027 API
ParameterAccess Methods
The ParameterAccess type exposes the following members.
Methods
Name | Description
Dispose
GetParameter(ElementId, ElementId) |  Retrieves the parameter value for the parameter on the given element.
GetParameter(LinkElementId, Document, ElementId) |  Retrieves the parameter value for the parameter belonging to the parameter document on the given element.
ListParameters(ElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
ListParameters(LinkElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
Top
See Also
Reference
ParameterAccess Class
Autodesk.Revit.DB Namespace