Revit 2027 API
AnalyticalMember Class
 Represents a linear element in the structural analytical model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalElement
 Autodesk.Revit.DB.Structure.AnalyticalMember
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalMember : AnalyticalElement
Public Class AnalyticalMember
	Inherits AnalyticalElement
public ref class AnalyticalMember : public AnalyticalElement
type AnalyticalMember =
    class
        inherit AnalyticalElement
    end
The AnalyticalMember type exposes the following members.
Properties
Name | Description
CrossSectionRotation |  This represents the cross-section rotation, in radians.
SectionTypeId |  The id of the type from the structural Family assigned to the Analytical Member.
StructuralSectionShape |  The structural section shape of the Analytical Member.
Top
Methods
Name | Description
CanSplit |  Identifies whether a particular analytical member can be split at a point on it's defining curve (by Split(Double) ).
Create |  Creates a new instance of an Analytical Member within the project.
FlipCurve |  Flip the Analytical Member
GetMemberForces |  Gets the member forces associated with this Analytical Member.
GetReleaseConditions |  Gets the release conditions associated with this Analytical Member.
GetReleaseType |  Gets the release type.
IsValidCurve |  Verifies if the curve is valid for an Analytical Member.
IsValidSectionTypeId |  Checks whether the family symbol id is allowed for Analytical Member as Section Type property.
SetCurve |  Sets the curve for the Analytical Member.
SetMemberForces(MemberForces) |  Sets Member Forces to Analytical Member.
SetMemberForces(Boolean, XYZ, XYZ) |  Sets Member Forces to Analytical Member.
SetReleaseConditions |  Sets Release Conditions to Analytical Member.
SetReleaseType |  Sets the release type.
Split |  Splits the analytical member at a point on its defining curve.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace