Revit 2027 API
AnalysisDisplayDiagramSettings Class
 Contains diagram settings for analysis display style element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayDiagramSettings : IDisposable
Public Class AnalysisDisplayDiagramSettings
	Implements IDisposable
public ref class AnalysisDisplayDiagramSettings : IDisposable
type AnalysisDisplayDiagramSettings =
    class
        interface IDisposable
    end
The AnalysisDisplayDiagramSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayDiagramSettings() |  Constructs a default instance of diagram settings.
AnalysisDisplayDiagramSettings(AnalysisDisplayDiagramSettings) |  Constructs a new copy of the input AnalysisDisplayDiagramSettings object.
Top
Properties
Name | Description
FenceType |  Type of diagram fence visualization.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OutlineColor |  Color of outline and fence lines in the diagram.
OutlineLineWeight |  Line weight of outline and fence lines in the diagram.
Rounding |  Increment to which numeric values of analysis results are rounded in diagram.
TextLabelType |  Type of diagram text label visualization.
TextTypeId |  Element id of text associated with the settings.
Transparency |  Transparency percentage of diagram color fill
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisDisplayDiagramSettings
IsEqual |  Compares two diagram settings objects.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace