Revit 2027 API
AssetPropertyInteger Properties
The AssetPropertyInteger type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
See Also
Reference
AssetPropertyInteger Class
Autodesk.Revit.DB.Visual Namespace