Revit 2027 API
EmbodiedCarbonAsset Class
 Represents the properties of a material pertinent to embodied carbon calculations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EmbodiedCarbonAsset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EmbodiedCarbonAsset : IDisposable
Public Class EmbodiedCarbonAsset
	Implements IDisposable
public ref class EmbodiedCarbonAsset : IDisposable
type EmbodiedCarbonAsset =
    class
        interface IDisposable
    end
The EmbodiedCarbonAsset type exposes the following members.
Constructors
Name | Description
EmbodiedCarbonAsset |  Constructs an instance of EmbodiedCarbonAsset.
Top
Properties
Name | Description
CarbonCoefficient |  Used by Insight, unit is kgCO₂e per length, area, etc., e.g 200.234 kgCO₂e/m
CarbonCoefficientUnitType |  The unit type of Embodied Carbon coefficient (e.g. kgCO₂e/m, kgCO₂e/kg,...)
CategoryId |  Internal identifier of category. List of available categories can be retrieved from Sustainability API.
CategoryName |  User visible name of category. List of available categories can be retrieved from Sustainability API.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the EmbodiedCarbon asset.
ProviderId |  Internal identifier of provider, which provide embodied carbon data. List of available providers can be retrieved from Sustainability API.
ProviderName |  User visible name of provider. List of available providers can be retrieved from Sustainability API.
Top
Methods
Name | Description
Dispose | Releases all resources used by the EmbodiedCarbonAsset
EqualsEmbodiedCarbonOnly |  Determines whether this embodied carbon asset is equal to another, but ignore data from base class.
Top
See Also
Reference
Autodesk.Revit.DB Namespace