Revit 2027 API
SpaceSetIterator Class
An iterator to a set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Mechanical.SpaceSetIterator
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class SpaceSetIterator : APIObject,
	IEnumerator
Public MustInherit Class SpaceSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class SpaceSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type SpaceSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The SpaceSetIterator type exposes the following members.
Constructors
Name | Description
SpaceSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace