Revit 2027 API
HostedSweep Methods
The HostedSweep type exposes the following members.
Methods
Name | Description
AddSegment | Add segments to the hosted sweep object.
GetEndPointParameter | Retrieve segment's start point or end point parameter.
HorizontalFlip | Flip the hosted sweep object along horizontal line.
RemoveSegment | Remove segments from the hosted sweep object.
SetEndPointParameter | Set segment's start point or end point parameter.
VerticalFlip | Flip the hosted sweep object along vertical line.
Top
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace