Revit 2027 API
Grid Properties
The Grid type exposes the following members.
Properties
Name | Description
Curve | Retrieves an object that represents the geometry of the grid line.
IsCurved |  Identifies if the grid line is curved or straight.
Top
See Also
Reference
Grid Class
Autodesk.Revit.DB Namespace