Revit 2027 API
ExternallyTaggedBRep Class
 An ExternallyTaggedSolid can hold any shape created by BRepBuilder.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternallyTaggedGeometryObject
 Autodesk.Revit.DB.ExternallyTaggedBRep
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternallyTaggedBRep : ExternallyTaggedGeometryObject
Public Class ExternallyTaggedBRep
	Inherits ExternallyTaggedGeometryObject
public ref class ExternallyTaggedBRep : public ExternallyTaggedGeometryObject
type ExternallyTaggedBRep =
    class
        inherit ExternallyTaggedGeometryObject
    end
The ExternallyTaggedBRep type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetTaggedGeometry |  Returns the externally tagged geometry object.
Top
See Also
Reference
Autodesk.Revit.DB Namespace