Revit 2027 API
BoundaryConditions Class
 An object that represents a force applied across an area. Data members Create methods Properties
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.BoundaryConditions
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BoundaryConditions : Element
Public Class BoundaryConditions
	Inherits Element
public ref class BoundaryConditions : public Element
type BoundaryConditions =
    class
        inherit Element
    end
The BoundaryConditions type exposes the following members.
Properties
Name | Description
AssociatedLoadId |  The Id of the internal load element associated with a boundary conditions.
HostElementId |  The host element Id for the boundary conditions.
IsConstrainedOnHost |  The boundary conditions is constrained to host or not.
Point |  The position of point boundary conditions.
Preset |  The boundary conditions preset.
SketchId |  Sketch associated to this Revit element.
Top
Methods
Name | Description
AreCurveLoopsValid |  Checks if curve loops are valid for creating an area boundary conditions.
CanCreateAreaBoundaryConditions |  Checks if the provided host can host an area boundary conditions.
CanCreateLineBoundaryConditions |  Checks if the provided host can host a line boundary conditions.
CanCreatePointBoundaryConditions |  Checks if the provided host can host a point boundary conditions.
CreateAreaBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted area boundary conditions within the project.
CreateAreaBoundaryConditions(Document, ElementId, IList<CurveLoop>, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom area boundary conditions within the project.
CreateLineBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted line boundary conditions within the project.
CreateLineBoundaryConditions(Document, ElementId, Curve, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom line boundary conditions within the project.
CreatePointBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted point boundary conditions within the project.
CreatePointBoundaryConditions(Document, ElementId, XYZ, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom point boundary conditions within the project.
GetBoundaryConditionsType |  Returns the boundary conditions type.
GetCurve |  Returns curve that define geometry of the line boundary conditions.
GetDegreesOfFreedomCoordinateSystem |  Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
GetLoops |  Returns curve loops that define geometry of the area boundary conditions.
GetOrientTo |  Returns the boundary conditions orientation option.
IsValidHostId |  Checks if the provided host id can host a boundary conditions of the provided type.
IsValidPreset |  Checks whether the value set for boundary conditions preset is valid.
IsValidReference |  Checks if the provided reference can host a boundary conditions.
RemoveHostConstraint |  Removes constraint from host for this boundary conditions.
SetCurve |  Sets the curve that defines geometry of the line boundary conditions.
SetLoops |  Sets the curve loops that define geometry of the area boundary conditions.
SetOrientTo |  Sets the boundary condition orientation option.
Top
Example
public void GetInfo_BoundaryConditions(BoundaryConditions boundaryConditions)
{
    string message = "BoundaryConditions : ";
    boundaryConditions.GetBoundaryConditionsType();
    switch (boundaryConditions.GetBoundaryConditionsType())
    {
        case BoundaryConditionsType.Point:
            XYZ point = boundaryConditions.Point;
            message += "\nThis BoundaryConditions is a Point Boundary Conditions.";
            message += "\nLocation point: (" + point.X + ", "
                        + point.Y + ", " + point.Z + ")";
            break;
        case BoundaryConditionsType.Line:
            message += "\nThis BoundaryConditions is a Line Boundary Conditions.";
            Curve curve = boundaryConditions.GetCurve();
            // Get curve start point
            message += "\nLocation Line: start point: (" + curve.GetEndPoint(0).X + ", "
                    + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
            // Get curve end point
            message += ";  end point:(" + curve.GetEndPoint(1).X + ", "
                    + curve.GetEndPoint(1).Y + ", " + curve.GetEndPoint(1).Z + ")";
            break;
        case BoundaryConditionsType.Area:
            message += "\nThis BoundaryConditions is an Area Boundary Conditions.";
            IList<CurveLoop> loops = boundaryConditions.GetLoops();
            foreach (CurveLoop curveLoop in loops)
            {
                foreach (Curve areaCurve in curveLoop)
                {
                    // Get curve start point
                    message += "\nCurve start point:(" + areaCurve.GetEndPoint(0).X + ", "
                            + areaCurve.GetEndPoint(0).Y + ", " + areaCurve.GetEndPoint(0).Z + ")";
                    // Get curve end point
                    message += "; Curve end point:(" + areaCurve.GetEndPoint(1).X + ", "
                            + areaCurve.GetEndPoint(1).Y + ", " + areaCurve.GetEndPoint(1).Z + ")";
                }
            }
            break;
        default:
            break;
    }
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace