Revit 2027 API
SpatialElementFromToCalculationPoints Properties
The SpatialElementFromToCalculationPoints type exposes the following members.
Properties
Name | Description
FromPosition |  The "from" position of spatial element connecting calculation point.
ToPosition |  The "to" position of spatial element connecting calculation point.
Top
See Also
Reference
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace