Revit 2027 API
FabricationPartRouteEnd Class
 Class to hold fabrication part routing start or end information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationPartRouteEnd : IDisposable
Public Class FabricationPartRouteEnd
	Implements IDisposable
public ref class FabricationPartRouteEnd : IDisposable
type FabricationPartRouteEnd =
    class
        interface IDisposable
    end
The FabricationPartRouteEnd type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
CreateFromCenterline |  Create fabrication routing end from centerline point on straight element.
CreateFromConnector |  Create fabrication routing end from connector end point.
Dispose | Releases all resources used by the FabricationPartRouteEnd
Top
Remarks
 To create a new instance, use CreateFromConnector(Connector) to specify a connector, or CreateFromCenterline(Element, XYZ) to specify the centerline of a straight element, for the fabrication routing end point.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace