Revit 2027 API
DetailCurveArrayIterator Properties
The DetailCurveArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
DetailCurveArrayIterator Class
Autodesk.Revit.DB Namespace