Revit 2027 API
Transform Class
A transformation of the affine 3-space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Transform
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Transform : APIObject
Public Class Transform
	Inherits APIObject
public ref class Transform : public APIObject
type Transform =
    class
        inherit APIObject
    end
The Transform type exposes the following members.
Constructors
Name | Description
Transform | The copy constructor.
Top
Properties
Name | Description
Basis | Defines the basis of the old coordinate system in the new coordinate system.
BasisX | The basis of the X axis of this transformation.
BasisY | The basis of the Y axis of this transformation.
BasisZ | The basis of the Z axis of this transformation.
Determinant | The determinant of this transformation.
HasReflection | The boolean value that indicates whether this transformation produces reflection.
Identity | The identity transformation.
Inverse | The inverse transformation of this transformation.
IsConformal | The boolean value that indicates whether this transformation is conformal.
IsIdentity | The boolean value that indicates whether this transformation is an identity.
IsTranslation | The boolean value that indicates whether this transformation is a translation.
Origin | Defines the origin of the old coordinate system in the new coordinate system.
Scale | The real number that represents the scale of the transformation.
Top
Methods
Name | Description
AlmostEqual | Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
CreateReflection |  Creates a transform that represents a reflection across the given plane.
CreateRotation |  Creates a transform that represents a rotation about the given axis at (0, 0, 0).
CreateRotationAtPoint |  Creates a transform that represents a rotation about the given axis at the specified point.
CreateTranslation |  Creates a transform that represents a translation via the specified vector.
Multiply | Multiplies this transformation by the specified transformation and returns the result.
OfPoint | Applies the transformation to the point and returns the result.
OfVector | Applies the transform to the vector
ScaleBasis | Scales the basis vectors of this transformation and returns the result.
ScaleBasisAndOrigin | Scales the basis vectors and the origin of this transformation and returns the result.
Top
Operators
Name | Description
Multiply(Transform, Transform) | Multiplies the two specified transforms.
Top
Example
public static XYZ TransformPoint(XYZ point, Transform transform)
{
    double x = point.X;
    double y = point.Y;
    double z = point.Z;
    //transform basis of the old coordinate system in the new coordinate // system
    XYZ b0 = transform.get_Basis(0);
    XYZ b1 = transform.get_Basis(1);
    XYZ b2 = transform.get_Basis(2);
    XYZ origin = transform.Origin;
    //transform the origin of the old coordinate system in the new
    //coordinate system
    double xTemp = x * b0.X + y * b1.X + z * b2.X + origin.X;
    double yTemp = x * b0.Y + y * b1.Y + z * b2.Y + origin.Y;
    double zTemp = x * b0.Z + y * b1.Z + z * b2.Z + origin.Z;
    return new XYZ(xTemp, yTemp, zTemp);
}
See Also
Reference
Autodesk.Revit.DB Namespace