Revit 2027 API
CustomExporter Methods
The CustomExporter type exposes the following members.
Methods
Name | Description
Dispose
Export(IList<ElementId>) |  Exports a collection of 3D or 2D views
Export(View) |  Exports one 3D or 2D view
IsRenderingSupported |  Checks if view rendering is currently supported in the running instance of Revit.
Top
See Also
Reference
CustomExporter Class
Autodesk.Revit.DB Namespace