Revit 2027 API
DocumentReloadLatestProgressChangedEventArgs Properties
The DocumentReloadLatestProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
IsMerging |  Indicates if it is merging downloaded data.
ReloadLatestFinished |  Indicates if current 'reload latest' progress is finished.
RetryTimes |  The number of times Revit has tried to Reload Latest. Its value is '0' at the first time.
Top
See Also
Reference
DocumentReloadLatestProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace