Revit 2027 API
OptionalFunctionalityNotAvailableException Methods
The OptionalFunctionalityNotAvailableException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
OptionalFunctionalityNotAvailableException Class
Autodesk.Revit.Exceptions Namespace