Revit 2027 API
UISaveAsOptions Methods
The UISaveAsOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
UISaveAsOptions Class
Autodesk.Revit.UI Namespace