Revit 2027 API
FamilySizeTableErrorInfo Class
 Error information generated from the CSV file import of a FamilySizeTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilySizeTableErrorInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilySizeTableErrorInfo : IDisposable
Public Class FamilySizeTableErrorInfo
	Implements IDisposable
public ref class FamilySizeTableErrorInfo : IDisposable
type FamilySizeTableErrorInfo =
    class
        interface IDisposable
    end
The FamilySizeTableErrorInfo type exposes the following members.
Constructors
Name | Description
FamilySizeTableErrorInfo |  Constructs a new FamilySizeTableErrorInfo with default settings.
Top
Properties
Name | Description
FamilySizeTableErrorType |  The error type.
FilePath |  The path of the imported CSV file.
InvalidColumnIndex |  The index of the invalid column.
InvalidHeaderText |  The invalid header text.
InvalidRowIndex |  The index of the invalid row.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FamilySizeTableErrorInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace