Revit 2027 API
ExternalDataManagerCommandId Class
 Unique identifier of an external data manager command.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.UI.ExternalDataManagerCommandId
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalDataManagerCommandId : GuidEnum
Public Class ExternalDataManagerCommandId
	Inherits GuidEnum
public ref class ExternalDataManagerCommandId : public GuidEnum
type ExternalDataManagerCommandId =
    class
        inherit GuidEnum
    end
The ExternalDataManagerCommandId type exposes the following members.
Constructors
Name | Description
ExternalDataManagerCommandId | Creates a new ExternalDataManagerCommandId instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Operators
Name | Description
Equality(ExternalDataManagerCommandId, ExternalDataManagerCommandId) | Compares two ExternalDataManagerCommandId instances.
Inequality(ExternalDataManagerCommandId, ExternalDataManagerCommandId) | Compares two ExternalDataManagerCommandId instances.
Top
Remarks
 Each external data manager command must have a unique GUID. The Id can be registered with Revit for servers to easily find it. Unique GUID should be created using GUID generation tool.
See Also
Reference
Autodesk.Revit.UI Namespace