Revit 2027 API
CADLinkType Class
 CADLinkType represents both CAD links and CAD imports. The function IsLink can be used to distinguish between the two. CAD imports are not ExternalFileReferences; they are brought completely into the document and maintain no connection to their original file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.CADLinkType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CADLinkType : ElementType
Public Class CADLinkType
	Inherits ElementType
public ref class CADLinkType : public ElementType
type CADLinkType =
    class
        inherit ElementType
    end
The CADLinkType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
LoadFrom(ExternalResourceReference) |  Loads or reloads the DWG link from the given external resource reference.
LoadFrom(String) |  Loads or reloads the DWG link from the given file path.
Reload() |  Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Reload(CADLinkOptions) |  Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Top
See Also
Reference
Autodesk.Revit.DB Namespace