Revit 2027 API
TabbedDialogExtension Methods
The TabbedDialogExtension type exposes the following members.
Methods
Name | Description
GetContextualHelp | Gets the contextual help.
SetContextualHelp | Sets the contextual help.
Top
See Also
Reference
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace