Revit 2027 API
FileExportedEventArgs Properties
The FileExportedEventArgs type exposes the following members.
Properties
Name | Description
BackgroundOperation |  Identifies whether the event belongs to a background export operation.
Format |  Identifies the export format, e.g. DWG or image.
Path |  Target path for the exported file (or files).
Top
See Also
Reference
FileExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace