Revit 2027 API
ClipPlane Methods
The ClipPlane type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace