Revit 2027 API
RevisionSettings Class
 Provides access to project-wide settings related to revisions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.RevisionSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevisionSettings : Element
Public Class RevisionSettings
	Inherits Element
public ref class RevisionSettings : public Element
type RevisionSettings =
    class
        inherit Element
    end
The RevisionSettings type exposes the following members.
Properties
Name | Description
RevisionCloudSpacing |  Determines the size in paper space of revision clouds drawn in a project.
RevisionNumbering |  Determines how the revision number values will display on sheets.
Top
Methods
Name | Description
GetRevisionSettings |  Returns the RevisionSettings for the given project document.
IsAcceptableRevisionCloudSpacing |  Rounds the given raw value and checks whether it is an acceptable cloud spacing value after it is rounded.
RoundRevisionCloudSpacing |  Rounds the given revision cloud spacing value according to the document's settings.
Top
Remarks
 This class provides access to the project-wide settings that affect the appearance and numbering of revisions and revision clouds. The settings are only available in project documents.
See Also
Reference
Autodesk.Revit.DB Namespace