Revit 2027 API
LinkedResourceOpenedEventArgs Properties
The LinkedResourceOpenedEventArgs type exposes the following members.
Properties
Name | Description
LinkedResourcePathName |  Path of the linked resource.
ResourceType |  The desired linked resource type.
ResourceTypeId |  Element id of the linked resource.
Top
See Also
Reference
LinkedResourceOpenedEventArgs Class
Autodesk.Revit.DB.Events Namespace