Revit 2027 API
BeforeExecutedEventArgs Properties
The BeforeExecutedEventArgs type exposes the following members.
Properties
Name | Description
UsingCommandData |  Indicates whether or not the Revit journal will include custom data populated by the application associated with this command.
Top
See Also
Reference
BeforeExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace