Revit 2027 API
Room Properties
The Room type exposes the following members.
Properties
Name | Description
BaseOffset | Get or Set the Base Offset of the Room.
ClosedShell | Return the closedShell of the Room.
LimitOffset | Get or Set the Limit Offset of the Room.
UnboundedHeight | Get the Unbounded Height of the Room.
UpperLimit | Get or Set the Upper Limit of the Room.
Volume | Get the Volume of the Room.
Top
See Also
Reference
Room Class
Autodesk.Revit.DB.Architecture Namespace