Revit 2027 API
ConceptualConstructionType Class
 This element is used to describe the conceptual physical, construction, and energy properties in a manner that can be understood by both the Revit BIM model and Green Building Studio/Green Building XML. For serialization
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Analysis.ConceptualConstructionType
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConceptualConstructionType : ElementType
Public Class ConceptualConstructionType
	Inherits ElementType
public ref class ConceptualConstructionType : public ElementType
type ConceptualConstructionType =
    class
        inherit ElementType
    end
The ConceptualConstructionType type exposes the following members.
Properties
Name | Description
MassSurfaceSubCategoryId |  The surface type subcategory element id associated with the ConceptualConstructionType.
MaterialId |  Material used for visualization of this construction.
Top
Methods
Name | Description
GetAllConceptualConstructionsForCategory |  Get all the ids of constructions applicable to the input massSubCategory
GetFloorOrSlabConstructionType |  Get a Floor or Slab ConceptualConstructionType by its ConceptualConstructionFloorSlabType.
GetGBSId |  Gets the Green Building Studio identifier associated with the construction.
GetOpeningConstructionType |  Get an Opening ConceptualConstructionType by its ConceptualConstructionOpeningType.
GetRoofConstructionType |  Get a Roof ConceptualConstructionType by its ConceptualConstructionRoofType.
GetShadeConstructionType |  Get a Shade ConceptualConstructionType by its ConceptualConstructionShadeType.
GetWallConstructionType |  Get a Wall ConceptualConstructionType by its ConceptualConstructionWallType.
GetWindowOrSkylightConstructionType |  Get a Window or Skylight ConceptualConstructionType by its ConceptualConstructionWindowSkylightType.
IsValidConceptualConstructionId |  Indicates if the ElementId is an id of a ConceptualConstructionType.
IsValidConceptualConstructionIdForCategory |  Indicate if a ConceptualConstruction is appropriate to assign to a MassSurfaceData of a particular Mass subcategory.
IsValidSubcategoryForMassSurfaceDatas |  Validate if a subcategory is appropriate for assignment to Massing surfaces (MassSurfaceData). This is the list of acceptable values:
OST_MassInteriorWall
OST_MassExteriorWall
OST_MassExteriorWallUnderground
OST_MassRoof
OST_MassFloor
OST_MassSlab
OST_MassShade
OST_MassGlazing
OST_MassSkylights
OST_MassOpening
IsValidSurfaceSubcategoryForConstruction |  Indicates if this ConceptualConstructionType is appropriate for the input MassSurfaceData subcategory.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace