Revit 2027 API
PrintParameters Class
An object that contains settings used for printing the document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PrintParameters
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrintParameters : APIObject
Public Class PrintParameters
	Inherits APIObject
public ref class PrintParameters : public APIObject
type PrintParameters =
    class
        inherit APIObject
    end
The PrintParameters type exposes the following members.
Properties
Name | Description
ColorDepth |  The color depth type.
HiddenLineViews |  The hidden line views type.
HideCropBoundaries |  Indicates whether to hide crop boundaries when printing.
HideReforWorkPlanes |  Indicates whether to hide reference/work planes when printing.
HideScopeBoxes |  Indicates whether to hide scope boxes when printing.
HideUnreferencedViewTags |  Indicates whether to hide unreferenced view tags when printing.
MarginType |  The print margin type.
MaskCoincidentLines |  Indicates whether to mask coincident lines when printing.
OriginOffsetX |  The User defined X value of offset from left bottom corner. Unit is feet.
OriginOffsetY |  The User defined Y value of offset from left bottom corner. Unit is feet.
PageOrientation |  The Page Orientation of the Print Setting.
PaperPlacement |  The paper placement type.
PaperSize |  The page size.
PaperSource |  The page source.
RasterQuality |  The raster quality type.
ReplaceHalftoneWithThinLines |  Indicates whether to replace halftone with thin lines when printing.
UserDefinedMarginX | Obsolete.
 The User defined X value of offset from left bottom corner. Unit is inch.
UserDefinedMarginY | Obsolete.
 The User defined Y value of offset from left bottom corner. Unit is inch.
ViewLinksinBlue |  Indicates whether to view links in blue when printing.
Zoom |  The zoom value to a percentage of the original size.
ZoomType |  The zoom type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace