Revit 2027 API
DocumentChangedEventArgs Properties
The DocumentChangedEventArgs type exposes the following members.
Properties
Name | Description
Operation |  The operation associated with this event
Top
See Also
Reference
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace