Revit 2027 API
LayoutRuleFixedNumber Class
This class indicate the layout rule of a Beam System is Fixed-Number.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleFixedNumber
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LayoutRuleFixedNumber : LayoutRule
Public Class LayoutRuleFixedNumber
	Inherits LayoutRule
public ref class LayoutRuleFixedNumber : public LayoutRule
type LayoutRuleFixedNumber =
    class
        inherit LayoutRule
    end
The LayoutRuleFixedNumber type exposes the following members.
Constructors
Name | Description
LayoutRuleFixedNumber | Constructor of LayoutRuleFixedNumber.
Top
Properties
Name | Description
NumberOfLines | Get or set the number of the beams in a beam system.
Top
Methods
Name | Description
Top
Remarks
To use this type of LayoutRule, only the number of the beams must be set.
Example
private bool LayoutRuleFixedNumberInformation(BeamSystem beamSystem)
{
    //get the layoutRule of the beamsystem
    Autodesk.Revit.DB.LayoutRule layoutRule = beamSystem.LayoutRule;
    string message = "BeamSystem layout rule : " + layoutRule;
    //create a new instance of the LayoutRuleClearSpacing class
    LayoutRuleFixedNumber myLayoutRuleFixedNumber =
                        new LayoutRuleFixedNumber(8);
    //set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleFixedNumber;
    LayoutRuleFixedNumber fixedNumber = beamSystem.LayoutRule as LayoutRuleFixedNumber;
    if (null == fixedNumber)
    {
        return false;
    }
    //try to get the property value of the beamsystem LayoutRule
    int numberOfLines = fixedNumber.NumberOfLines;
    message += "\nNew BeamSystem layout rule: " + fixedNumber;
    message += "\nNew BeamSystem number of beams: " + numberOfLines;
    TaskDialog.Show("Revit",message);
    return true;
}
See Also
Reference
Autodesk.Revit.DB Namespace