Revit 2027 API
RebarSplice Methods
The RebarSplice type exposes the following members.
Methods
Name | Description
Dispose
GetRebarSpliceGeometry |  Gets the RebarSpliceGeometry.
MoveRebarSpliceGeometry |  Moves the RebarSpliceGeometry with the specified vector.
RotateRebarSpliceGeometry |  Rotates the RebarSpliceGeometry about the given axis and angle.
Top
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace