Revit 2027 API
PipeSegment Properties
The PipeSegment type exposes the following members.
Properties
Name | Description
ScheduleTypeId |  The ElementId of the PipeScheduleType.
Top
See Also
Reference
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace