Revit 2027 API
RebarShapeDefinitionBySegments Methods
The RebarShapeDefinitionBySegments type exposes the following members.
Methods
Name | Description
AddBendDefaultRadius |  Specify a default-radius bend.
AddBendVariableRadius |  Specify a variable-radius bend.
AddConstraintParallelToSegment |  Constrain the length of a segment by parameterizing its length.
AddConstraintToSegment |  Add a constraint that helps determine the length of a segment.
AddListeningDimensionBendToBend |  Specify a dimension between two bends, measured by a read-only parameter.
AddListeningDimensionSegmentToBend |  Specify a dimension perpendicular to one fixed-direction segment, referring to that segment and some other bend in the shape, measured by a read-only parameter.
AddListeningDimensionSegmentToSegment |  Specify a dimension perpendicular to two fixed-direction segments, measured by a read-only parameter.
GetSegment |  Return a reference to one of the segments in the definition.
GetVertex |  Return a reference to one of the vertices in the definition.
RemoveParameterFromSegment |  Remove constraints from a segment.
SetSegmentAs180DegreeBend(Int32) |  Indicates that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be taken from the Bar Type.
SetSegmentAs180DegreeBend(Int32, ElementId, Boolean) |  Indicate that a segment is a "virtual" segment introduced to describe a 180-degree bend. The radius of the bend will be driven by radiusParam.
SetSegmentFixedDirection |  Fix the direction of a segment.
SetSegmentVariableDirection |  Remove the fixed direction from a segment.
Top
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace