Revit 2027 API
TaskDialogShowingEventArgs Properties
The TaskDialogShowingEventArgs type exposes the following members.
Properties
Name | Description
Message |  The message that has been displayed in the dialog box.
Top
See Also
Reference
TaskDialogShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace