Revit 2027 API
FieldDomainPoints Class
 Abstract base class for various classes of field domain points
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.FieldDomainPoints
 Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter
 Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV
 Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FieldDomainPoints : IDisposable
Public Class FieldDomainPoints
	Implements IDisposable
public ref class FieldDomainPoints : IDisposable
type FieldDomainPoints =
    class
        interface IDisposable
    end
The FieldDomainPoints type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FieldDomainPoints
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace