Revit 2027 API
LightingFixture Class
Provides access to the Lighting Fixture in Autodesk Revit MEP.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.MEPModel
 Autodesk.Revit.DB.Electrical.LightingFixture
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LightingFixture : MEPModel
Public Class LightingFixture
	Inherits MEPModel
public ref class LightingFixture : public MEPModel
type LightingFixture =
    class
        inherit MEPModel
    end
The LightingFixture type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
The Lighting Fixture object can only be queried in Autodesk Revit MEP.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace