Revit 2027 API
ExportLineweightKey Class
 A key used to represent an item stored in an ExportLineweightTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLineweightKey
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLineweightKey : IDisposable
Public Class ExportLineweightKey
	Implements IDisposable
public ref class ExportLineweightKey : IDisposable
type ExportLineweightKey =
    class
        interface IDisposable
    end
The ExportLineweightKey type exposes the following members.
Constructors
Name | Description
ExportLineweightKey() |  Constructs a new default ExportLineweightKey.
ExportLineweightKey(ExportLineweightKey) |  Constructs a new copy of the input ExportLineweightKey object.
ExportLineweightKey(Int32) |  Constructs a new default ExportLineweightKey using the original line weight as input.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OriginalLineweight |  The original line weight.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLineweightKey
Top
See Also
Reference
Autodesk.Revit.DB Namespace