Revit 2027 API
ReferenceArrayIterator Class
An iterator to a reference array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferenceArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ReferenceArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class ReferenceArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ReferenceArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ReferenceArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ReferenceArrayIterator type exposes the following members.
Constructors
Name | Description
ReferenceArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace