Revit 2027 API
ExternalGeometryId Methods
The ExternalGeometryId type exposes the following members.
Methods
Name | Description
Dispose
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the hash code.
(Overrides Object.GetHashCode())
IsValidExternalGeometryId |  Checks whether a given string represents a valid ExternalGeometryId or not.
Top
See Also
Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace