Revit 2027 API
Group Properties
The Group type exposes the following members.
Properties
Name | Description
AttachedParentId |  Indicates the Id of the parent group this group is attached to.
GroupType | Get or set the type of the group.
IsAttached |  Indicates wether or not this group is attached to a parent group.
Location | This property is used to find the physical location of a group within project.
(Overrides Element.Location)
Top
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace