Revit 2027 API
CategorySetIterator Properties
The CategorySetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
CategorySetIterator Class
Autodesk.Revit.DB Namespace