Revit 2027 API
FamilyInstance Properties
The FamilyInstance type exposes the following members.
Properties
Name | Description
CanFlipFacing | Property to test whether the orientation of family instance facing can be flipped.
CanFlipHand | Property to test whether the orientation of family instance hand can be flipped.
CanFlipWorkPlane | Identifies if the instance can flip its work plane.
CanRotate | Property to test whether the family instance can be rotated by 180 degrees.
CanSplit | Identifies whether a particular family instance can be split at a point on it's defining curve (by Split(Double)).
ExtensionUtility | Property to check whether the instance can be extended and return the interface for extension operation.
FacingFlipped | Property to test whether the orientation of family instance facing is flipped.
FacingOrientation | Property to get the orientation of family instance facing.
FromRoom | The "From Room" set for the door or window in the last phase of the project.
FromRoom[Phase]
HandFlipped | Property to test whether the orientation of family instance hand is flipped.
HandOrientation | Property to get the orientation of family instance hand.
HasSpatialElementCalculationPoint | Identifies if this instance has a single SpatialElementCalculationPoint used as the search point for Revit to identify if the instance is inside a room or space.
HasSpatialElementFromToCalculationPoints | Identifies if this instance has a pair of SpatialElementCalculationPoints used as the search points for Revit to identify if the instance lies between up to two rooms or spaces.
Host | If the instance is contained within another element, this property returns the containing element. An instance that is face hosted will return the element containing the face.
HostFace | Property to get the reference to the host face of family instance.
HostParameter | If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve, as long as the family of the instance isn't work plane based.
Invisible | Property to test whether the family instance is invisible.
IsSlantedColumn |  Indicates if the family instance is a slanted column.
IsWorkPlaneFlipped | Identifies if the instance's work plane is flipped.
Location | This property is used to find the physical location of an instance within project.
(Overrides Element.Location)
MEPModel | Retrieves the MEP model for the family instance.
Mirrored | Property to test whether the family instance is mirrored. (only one axis is flipped)
Room | The room in which the instance is located (during the last phase of the project).
Room[Phase]
Space | The space in which the instance is located (during the last phase of the project).
Space[Phase]
StructuralMaterialId | Identifies the material that defines the instance's structural analysis properties.
StructuralMaterialType | This property returns the physical material from which the instance is made.
StructuralType | Provides the primary structural type of the instance, such as beam or column etc.
StructuralUsage | Provides the primary structural usage of the instance, such as brace, girder etc.
SuperComponent | Property to get the super component of current family instance.
Symbol | Returns or changes the FamilySymbol object that represents the type of the instance.
ToRoom | The "To Room" set for the door or window in the last phase of the project.
ToRoom[Phase]
Top
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace