Revit 2027 API
StructuralSectionsServiceData Class
 The data needed by section type server to perform type definition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSectionsServiceData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionsServiceData : IDisposable
Public Class StructuralSectionsServiceData
	Implements IDisposable
public ref class StructuralSectionsServiceData : IDisposable
type StructuralSectionsServiceData =
    class
        interface IDisposable
    end
The StructuralSectionsServiceData type exposes the following members.
Properties
Name | Description
Document |  The current document.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the StructuralSectionsServiceData
GetCurrentElements |  Returns the list of Ids of the current elements.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace