Revit 2027 API
MultipleValuesIndicationSettings Properties
The MultipleValuesIndicationSettings type exposes the following members.
Properties
Name | Description
Custom |  If true, CustomValue is used as multiple values indication, otherwise a hardcoded standard value.
CustomValue |  Value used as multiple values indication if Custom is set to true.
Value |  Value to be used as multiple values indication in the document. If Custom is true, returns CustomValue, otherwise returns a hardcoded standard value.
Top
See Also
Reference
MultipleValuesIndicationSettings Class
Autodesk.Revit.DB Namespace