Revit 2027 API
SSEPointVisibilitySettings Class
 Represents the settings contained in the document associated to the point display of Floor, Roof and Toposolid. for serialization public api methods
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SSEPointVisibilitySettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SSEPointVisibilitySettings : Element
Public Class SSEPointVisibilitySettings
	Inherits Element
public ref class SSEPointVisibilitySettings : public Element
type SSEPointVisibilitySettings =
    class
        inherit Element
    end
The SSEPointVisibilitySettings type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetVisibility |  Gets the SSE point visibility for the given category.
SetVisibility |  Sets the SSE point visibility for the given category.
Top
See Also
Reference
Autodesk.Revit.DB Namespace