Revit 2027 API
SizingCalculator Methods
The SizingCalculator type exposes the following members.
Methods
Name | Description
CalculateSizeByFriction |  Calculates the duct or pipe size based on the specified flow and friction.
CalculateSizeByVelocity |  Calculates the duct or pipe size based on the specified flow and velocity.
Dispose
EquivalentDiameter |  Calculates the equivalent diameter based on the specified profile type, width, and height.
Friction |  Calculates the friction based on the specified parameters.
Velocity |  Calculates the velocity based on the specified parameters.
Top
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace