Revit 2027 API
SystemsAnalysisOptions Methods
The SystemsAnalysisOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace