Revit 2027 API
CircuitNamingSchemeSettings Methods
The CircuitNamingSchemeSettings type exposes the following members.
Methods
Name | Description
GetCircuitNamingSchemeSettings |  Gets the circuit naming scheme settings of the project.
IsValidCircuitNamingSchemeId |  Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings.
Top
See Also
Reference
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace