Revit 2027 API
ZoneEquipmentData Class
 Represents the data and parameters of analytical zone equipment.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.ZoneEquipmentData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ZoneEquipmentData : IDisposable
Public Class ZoneEquipmentData
	Implements IDisposable
public ref class ZoneEquipmentData : IDisposable
type ZoneEquipmentData =
    class
        interface IDisposable
    end
The ZoneEquipmentData type exposes the following members.
Properties
Name | Description
AirSystemId |  The air system used for this zone equipment, if applicable.
ChilledWaterLoopId |  The chilled water loop used for the chilled water option of cooling coil.
CondenserWaterLoopId |  The condenser water loop used for the direction expansion water cooled option of cooling coil.
CoolingCoilType |  The type of cooling coil. Note this property change would reset the chilled water loop.
EquipmentBehavior |  The behavior of how zone equipment is allocated with assigned spaces.
EquipmentType |  The type of zone equipment. Note this property would reset other properties.
HeatingCoilType |  The type of heating coil. Note this property change would reset the hot water loop.
HotWaterLoopId |  The water loop element id for the hot-water heating coil.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
VRFLoopId |  The Varible Refrigerant Flow loop for the VRF fan coil equipment type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ZoneEquipmentData
IsDataCompleted |  Is the required data completed for this zone equipment?
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace