Revit 2027 API
AlignmentStationLabel Class
 Represents an object which provides access to a specialized Revit annotation element used for labeling Alignment stations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AlignmentStationLabel
Public Class AlignmentStationLabel
public ref class AlignmentStationLabel
type AlignmentStationLabel = class end
The AlignmentStationLabel type exposes the following members.
Properties
Name | Description
AlignmentId |  The ElementId of the Alignment on which the SpotDimension is placed.
Element |  The underlying SpotDimension element.
Station |  The alignment station at which the SpotDimension is placed.
Top
Methods
Name | Description
Create |  Creates an AlignmentStationLabel object along with its underlying SpotDimension element. Returns null if element creation fails.
CreateRecommendedTypeForSet |  Creates an element type recommended for alignment label sets and returns its ElementId.
CreateSet |  Creates a collection of AlignmentStationLabel objects along with their underlying SpotDimension elements.
Get |  Returns an AlignmentStationLabel object for the given element.
GetAlignmentStationLabels(Alignment) |  Returns all alignment station labels placed on the given alignment.
GetAlignmentStationLabels(Alignment, ElementId) |  Returns all alignment station labels placed on the given alignment in the given view.
IsRecommendedTypeForSet |  Checks if the element type is recommended for alignment labels in sets.
IsValid() |  Checks if this object is a valid alignment station label.
IsValid(Element) |  Checks if the element is a valid alignment station label.
IsValidType |  Checks if the type is a valid alignment station label type.
Top
Remarks
 The element is a SpotDimension. The element's category is OST_AlignmentStationLabels or, if in a set of labels, OST_AlignmentStationLabelSets. The element's type is a SpotDimensionType with DimensionStyleType equal to AlignmentStationLabel. The element's Origin is a point on the tessellated representation of an alignment. To get the precise point on the alignment's curve, use GetPointAtStation(Double) with input obtained from Station.
See Also
Reference
Autodesk.Revit.DB.Infrastructure Namespace