Revit 2027 API
ExclusionFilter Methods
The ExclusionFilter type exposes the following members.
Methods
Name | Description
GetIdsToExclude |  Returns the ids to be excluded by this filter.
Top
See Also
Reference
ExclusionFilter Class
Autodesk.Revit.DB Namespace