Revit 2027 API
DocumentSaveToCentralProgressChangedEventArgs Class
 The event arguments used during the save to central phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSaveToCentralProgressChangedEventArgs : DataTransferProgressChangedEventArgs
Public Class DocumentSaveToCentralProgressChangedEventArgs
	Inherits DataTransferProgressChangedEventArgs
public ref class DocumentSaveToCentralProgressChangedEventArgs : public DataTransferProgressChangedEventArgs
type DocumentSaveToCentralProgressChangedEventArgs =
    class
        inherit DataTransferProgressChangedEventArgs
    end
The DocumentSaveToCentralProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
FailureDueToConflicts |  Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.
RetryTimes |  The number of times Revit has tried to Save to Central." Its value is '0' at the first time.
SaveToCentralFinished |  Indicates if current 'save to central' is finished.
Top
Methods
Name | Description
Top
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time. Name correction - it is renamed from 'DocumentSaveToCentralProgessChangedEventArgs' released since 2017 Subscription Update.
See Also
Reference
Autodesk.Revit.DB.Events Namespace