Revit 2027 API
AnalyticalDistributionNodePropertyData Methods
The AnalyticalDistributionNodePropertyData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
AnalyticalDistributionNodePropertyData Class
Autodesk.Revit.DB.Electrical Namespace