Revit 2027 API
DuctFittingAndAccessoryPressureDropUIDataItem Methods
The DuctFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Methods
Name | Description
Dispose
GetDuctFittingAndAccessoryData |  Gets the fitting data stored in the UI data item.
GetEntity |  Returns the entity set by UI server. or an invalid entity otherwise.
SetEntity |  Stores the entity in the UI data item.
Top
See Also
Reference
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace