Revit 2027 API
TextBox Class
The TextBox object represents text-based control that allows the user to enter text.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.TextBox
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextBox : RibbonItem
Public Class TextBox
	Inherits RibbonItem
public ref class TextBox : public RibbonItem
type TextBox =
    class
        inherit RibbonItem
    end
The TextBox type exposes the following members.
Properties
Name | Description
Image | The image of the TextBox.
PromptText | The prompt text for the text box.
SelectTextOnFocus |  A value that indicates if the text is selected when the text box gains focus.
ShowImageAsButton | Gets or sets a value that indicates if the Image set in the text box should be displayed as a clickable button.
Value | The object that supplies the text value.
Width | Gets or sets the width of the TextBox.
Top
Methods
Name | Description
Top
Events
Name | Description
EnterPressed | Subscribe to this event to be notified when the Enter button is pressed in the text box.
Top
Remarks
The ItemText property inherited from RibbonItem has no effect. The text entered in the TextBox is edited by the UI user is accepted only if the user presses the Enter key or click the image button when ShowImageAsButton is true. If the user clicks off of this component without pressing Enter or click the image button; then the text will be reverted to the previous value. Use of this class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace