Revit 2027 API
CableType Class
 This class represents a cable type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.CableType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableType : ElementType
Public Class CableType
	Inherits ElementType
public ref class CableType : public ElementType
type CableType =
    class
        inherit ElementType
    end
The CableType type exposes the following members.
Properties
Name | Description
ConductorMaterial |  The Conductor Material of this Cable Type.
CoreType |  The core type of the cable type.
InsulationMaterial |  The Conductor Insulation Material of this Cable Type.
TemperatureRating |  The Conductor Temperature Rating of this Cable Type.
Top
Methods
Name | Description
Create |  Creates a Cable Type.
Duplicate() |  Duplicates this Cable Type.
GetCableTypeId |  Gets the Cable Type id by given cable type name.
GetCableTypeIds |  Gets all the Cable Types in the given document, sorted by name.
GetUsableCableSizeIds |  Gets all the Cable Sizes that can be used by this Cable Type, sorted by name.
IsCableSizeUsable |  Checks whether the Cable Size can be used by this Cable Type or not.
SetCableSizeUsable |  Marks the Cable Size can be used by this Cable Type.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace