Revit 2027 API
NumericRevisionSettings Methods
The NumericRevisionSettings type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Determines whether a specified NumericRevisionSettings is the same as 'this'.
IsValid |  Determines whether the NumericRevisionSettings object is in a valid state.
Top
See Also
Reference
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace