Revit 2027 API
TransientElementCreationException Class
The exception that is thrown when TransientElementCreationScope is used incorrectly.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.TransientElementCreationException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class TransientElementCreationException : InvalidOperationException
<SerializableAttribute>
Public Class TransientElementCreationException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class TransientElementCreationException : public InvalidOperationException
[<SerializableAttribute>]
type TransientElementCreationException =
    class
        inherit InvalidOperationException
    end
The TransientElementCreationException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
Remarks
The exception would be thrown in the following cases:
 An element that does not support TransientElementCreationScope is being created in the Scope.
 A TransientElementCreationScope is being created while another such scope is already active.
See Also
Reference
Autodesk.Revit.Exceptions Namespace