Revit 2027 API
AnnotationLabelParameterFormatting Class
 The annotation label parameter formatting settings for a parameter in an annotation label element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AnnotationLabelParameterFormatting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnnotationLabelParameterFormatting : IDisposable
Public Class AnnotationLabelParameterFormatting
	Implements IDisposable
public ref class AnnotationLabelParameterFormatting : IDisposable
type AnnotationLabelParameterFormatting =
    class
        interface IDisposable
    end
The AnnotationLabelParameterFormatting type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LeadingLineBreak |  True if a leading line break should be added the leading spaces, prefix and parameter value.
LeadingSpaces |  The number of spaces to add before the parameter value.
Prefix |  The prefix to add before the parameter value.
SampleText |  The sample text to show in the label in the family environment.
Suffix |  The suffix to add after the parameter value.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnnotationLabelParameterFormatting
GetParameterDefinition |  The definition of the parameter shown in the label.
Top
See Also
Reference
Autodesk.Revit.DB Namespace