Revit 2027 API
FabricationConnectorInfo Class
 Fabrication connector information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationConnectorInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationConnectorInfo : IDisposable
Public Class FabricationConnectorInfo
	Implements IDisposable
public ref class FabricationConnectorInfo : IDisposable
type FabricationConnectorInfo =
    class
        interface IDisposable
    end
The FabricationConnectorInfo type exposes the following members.
Properties
Name | Description
BodyConnectorId |  Fabrication body connector Id.
DoubleWallConnectorId |  Fabrication double wall connector Id.
FabricationIndex |  The index of the connector shown within the fabrication software.
IsBodyConnectorLocked |  Fabrication body connector lock.
IsDoubleWallConnectorLocked |  Fabrication double wall connector lock.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationConnectorInfo
HasDoubleWallConnector |  Checks if there are any double wall connectors fabricated.
IsValid |  Checks if the connector has fabrication parameters associated with it that can be set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace