Revit 2027 API
ExportIFCCategoryInfo Class
 Represents the mapped IFC information stored in the template.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportIFCCategoryInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportIFCCategoryInfo : IDisposable
Public Class ExportIFCCategoryInfo
	Implements IDisposable
public ref class ExportIFCCategoryInfo : IDisposable
type ExportIFCCategoryInfo =
    class
        interface IDisposable
    end
The ExportIFCCategoryInfo type exposes the following members.
Constructors
Name | Description
ExportIFCCategoryInfo() |  Constructs a new ExportIFCCategoryInfo with default values.
ExportIFCCategoryInfo(Boolean, String, String, String, String) |  Constructs a new ExportIFCCategoryInfo with input values.
Top
Properties
Name | Description
IFCEntityName |  The name of the IFC entity mapped to a particular Revit category.
IFCExportFlag |  The boolean value that indicates whether the category is exported to IFC.
IFCPredefinedType |  The name of the predefined type mapped to a particular Revit category.
IFCPresentationLayerName |  The name of the presentation layer mapped to a particular Revit category.
IFCUserDefinedType |  The name of the user-defined type mapped to a particular Revit category.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportIFCCategoryInfo
IsDefault |  Determines if a ExportIFCCategoryInfo contains default information.
Top
See Also
Reference
Autodesk.Revit.DB Namespace