Revit 2027 API
IIFCEntityTreeUIServer Methods
The IIFCEntityTreeUIServer type exposes the following members.
Methods
Name | Description
ShowDialog |  Shows dialog on managing IFCEntityTreeUI.
Top
See Also
Reference
IIFCEntityTreeUIServer Interface
Autodesk.Revit.UI Namespace