Revit 2027 API
ViewsExportingByContextEventArgs Class
 The event arguments used by the ViewsExportingByContext event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewsExportingByContextEventArgs : RevitAPIPreDocEventArgs
Public Class ViewsExportingByContextEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ViewsExportingByContextEventArgs : public RevitAPIPreDocEventArgs
type ViewsExportingByContextEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ViewsExportingByContextEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetViewIds |  Gets the views about to be exported by CustomExporter.
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace