Revit 2027 API
PaperSource Properties
The PaperSource type exposes the following members.
Properties
Name | Description
Name |  Retrieve the paper source name of current project.
Top
See Also
Reference
PaperSource Class
Autodesk.Revit.DB Namespace