Revit 2027 API
AreaLoad Class
 An object that represents a force applied across an area.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadBase
 Autodesk.Revit.DB.Structure.AreaLoad
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaLoad : LoadBase
Public Class AreaLoad
	Inherits LoadBase
public ref class AreaLoad : public LoadBase
type AreaLoad =
    class
        inherit LoadBase
    end
The AreaLoad type exposes the following members.
Properties
Name | Description
Area |  Returns area of the area load.
ForceVector1 |  The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting.
ForceVector2 |  The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting.
ForceVector3 |  The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
IsProjected |  Indicates if the load is projected.
NumRefPoints |  Returns the total number of reference points for the area load.
SketchId |  Sketch associated to this Revit element.
Top
Methods
Name | Description
AreCurveLoopsValid |  Checks if curve loops are valid for creating an area load.
Create(Document, ElementId, XYZ, AreaLoadType) |  Creates a new hosted area load within the project.
Create(Document, ElementId, IList<CurveLoop>, XYZ, AreaLoadType) |  Creates a new custom area load within the project.
Create(Document, ElementId, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType) |  Creates a new custom area load within the project.
GetLoops |  Returns curve loops that define geometry of the area load.
GetRefPoint |  Returns the physical location of the reference point.
IsCurveLoopsInsideHostBoundaries |  Checks if contour loops is inside host boundaries.
IsValidHostId |  Indicates if the provided host id can host area loads.
SetLoops |  Sets curve loops that define geometry of the area load.
Top
Example
public void GetInfo_AreaLoad(AreaLoad areaLoad)
{
    string message = "AreaLoad Force : ";
    // Get areaload force1 position
    message += "\nAreaLoad Force1 position :(" + areaLoad.ForceVector1.X + ", "
        + areaLoad.ForceVector1.Y + ", " + areaLoad.ForceVector1.Z + ")";
    // Get areaload force2 position
    message += "\nAreaLoad Force2 position :(" + areaLoad.ForceVector2.X + ", "
        + areaLoad.ForceVector2.Y + ", " + areaLoad.ForceVector2.Z + ")";
    // Get areaload force3 position
    message += "\nAreaLoad Force3 position :(" + areaLoad.ForceVector3.X + ", "
        + areaLoad.ForceVector3.Y + ", " + areaLoad.ForceVector3.Z + ")";
    // Get Loops
    int loopIndex = 0;
    foreach (CurveLoop curveLoop in areaLoad.GetLoops())
    {
       message += "\nLoop " + loopIndex + " consist of following points :";
       foreach (Curve curve in curveLoop)
       {
          message += " (" + curve.GetEndPoint(0).X + ", " + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
       }
       loopIndex++;
    }
    // Get ref points information
    for (int k = 0; k < areaLoad.NumRefPoints; k++)
    {
        // Get areaload Ref point
        message += "\nAreaLoad Ref point :(" + areaLoad.GetRefPoint(k).X + ", "
            + areaLoad.GetRefPoint(k).Y + ", " + areaLoad.GetRefPoint(k).Z + ")";
    }
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace