Revit 2027 API
Zone Properties
The Zone type exposes the following members.
Properties
Name | Description
Area | Get the Area of the Zone.
Boundary | Returns the boundary of the Zone.
Name | Get or Set the Name of the Zone.
(Overrides Element.Name)
Phase | Get the Phase of the Zone.
Spaces | Obsolete.
Get the Spaces of the Zone.
Top
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace