Revit 2027 API
MEPSystem Methods
The MEPSystem type exposes the following members.
Methods
Name | Description
Add |  Add elements into the system and connect them with the system using given connectors.
DivideSystem |  Divide the phyisical networks in the system and create a new system for each network.
GetCriticalPathSectionNumbers |  Obtains a list of the critical path section numbers.
GetPhysicalNetworksNumber |  Get the physical networks number in the system.
GetSectionByIndex |  Get the section from the index.
GetSectionByNumber |  Get the Section from section number
IsSystemDividable |  Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
Remove(ConnectorSet) | Removes connectors from system.
Remove(ICollection<ElementId>) | Remove elements from system.
Top
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace