Revit 2027 API
CurtainGrid Class
Represents a curtain grid element within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurtainGrid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurtainGrid : APIObject
Public Class CurtainGrid
	Inherits APIObject
public ref class CurtainGrid : public APIObject
type CurtainGrid =
    class
        inherit APIObject
    end
The CurtainGrid type exposes the following members.
Properties
Name | Description
Grid1Angle | The angle for the U grid line pattern of the curtain grid.
Grid1Justification | The justification for the U grid line pattern of the curtain grid.
Grid1Offset | The offset for the U grid line pattern of the curtain grid.
Grid2Angle | The angle for V grid line pattern of the curtain grid.
Grid2Justification | The justification for the V grid line pattern of the curtain grid.
Grid2Offset | The offset for V grid line pattern of the curtain grid.
NumPanels |  The number of panels.
NumULines |  Get the number of grid lines in the U direction.
NumVLines |  Get the number of grid lines in the V direction.
Top
Methods
Name | Description
AddGridLine |  Add a grid line to the curtain grid.
ChangePanelType |  Change the type of a curtain panel.
GetCell |  Get the specified cell located by the intersection of the grid lines.
GetCurtainCells |  Gets the CurtainCells owned by this curtain grid.
GetMullionIds |  Gets all ElementIds of the mullions of the curtain grid.
GetPanel |  Get the specified panel located by the intersection of the grid lines.
GetPanelIds |  Gets all ElementIds of the panels of the curtain grid.
GetUGridLineIds |  Gets all ElementIds of grid lines in the U direction.
GetUnlockedMullionIds |  Gets all ElementIds of the unlocked mullions of the curtain grid.
GetUnlockedPanelIds |  Gets all ElementIds of the unlocked panels of the curtain grid.
GetVGridLineIds |  Gets all ElementIds of grid lines in the V direction.
Top
Remarks
This element is obtained from a curtain wall, curtain system, or curtain roof. A curtain wall has only one curtain grid, while a curtain system or curtain roof may have several curtain grids.
See Also
Reference
Autodesk.Revit.DB Namespace