Revit 2027 API
ValueParsingOptions Class
 Options for parsing strings into numbers with units.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueParsingOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ValueParsingOptions : IDisposable
Public Class ValueParsingOptions
	Implements IDisposable
public ref class ValueParsingOptions : IDisposable
type ValueParsingOptions =
    class
        interface IDisposable
    end
The ValueParsingOptions type exposes the following members.
Constructors
Name | Description
ValueParsingOptions |  Creates a new ValueParsingOptions object with default settings.
Top
Properties
Name | Description
AllowedValues |  The allowable range of values to be parsed.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ValueParsingOptions
GetFormatOptions |  Gets the FormatOptions to optionally override the default settings in the Units class.
SetFormatOptions |  Sets the FormatOptions to optionally override the default settings in the Units class.
Top
See Also
Reference
Autodesk.Revit.DB Namespace