Revit 2027 API
CurveByPointsArray Properties
The CurveByPointsArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a curve at a specified index within the array.
Size | Returns the number of curves that are in the array.
Top
See Also
Reference
CurveByPointsArray Class
Autodesk.Revit.DB Namespace