Revit 2027 API
FaceDetailNode Properties
The FaceDetailNode type exposes the following members.
Properties
Name | Description
LineProperties |  Access to the line (pen) properties of the curve being drawn.
Top
See Also
Reference
FaceDetailNode Class
Autodesk.Revit.DB Namespace