Revit 2027 API
DetailLine Class
Represents a DetailLine within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.DetailLine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DetailLine : DetailCurve
Public Class DetailLine
	Inherits DetailCurve
public ref class DetailLine : public DetailCurve
type DetailLine =
    class
        inherit DetailCurve
    end
The DetailLine type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.
See Also
Reference
Autodesk.Revit.DB Namespace