Revit 2027 API
PhaseArray Methods
The PhaseArray type exposes the following members.
Methods
Name | Description
Append | Add the phase to the end of the array.
Clear | Removes every phase from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified phase into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
PhaseArray Class
Autodesk.Revit.DB Namespace