Revit 2027 API
ExternalResourceReference Methods
The ExternalResourceReference type exposes the following members.
Methods
Name | Description
CreateLocalResource |  Creates an ExternalResourceReference representing a local file managed by Revit's built-in server.
Dispose
GetReferenceInformation |  Returns a copy of an object containing previously-stored reference or lookup information about the specific resource provided by the server.
GetResourceShortDisplayName |  Gets the short display name of the external resource.
GetResourceVersionStatus |  Checks whether this ExternalResourceReference corresponds to the current version of the resource.
HasValidDisplayPath |  Checks whether this external Resource has a valid display path.
IsValidReference |  Checks whether the reference is in a valid format.
Top
See Also
Reference
ExternalResourceReference Class
Autodesk.Revit.DB Namespace