Revit 2027 API
VertexStreamPosition Methods
The VertexStreamPosition type exposes the following members.
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPosition into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPosition instances into the stream and associated buffer.
Top
See Also
Reference
VertexStreamPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace