Revit 2027 API
ConduitSizes Class
 Class ConduitSizeSet being used to store the conduit sizes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConduitSizes
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConduitSizes : IEnumerable<ConduitSize>,
	IDisposable
Public Class ConduitSizes
	Implements IEnumerable(Of ConduitSize), IDisposable
public ref class ConduitSizes : IEnumerable<ConduitSize^>,
	IDisposable
type ConduitSizes =
    class
        interface IEnumerable<ConduitSize>
        interface IDisposable
    end
The ConduitSizes type exposes the following members.
Properties
Name | Description
Count |  Count of the items contained in the collection.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Contains |  Checks whether a conduit size with the nominal diameter exists.
Dispose | Releases all resources used by the ConduitSizes
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetConduitSizesIterator |  Returns a ConduitSizeIterator to the conduit sizes.
GetEnumerator | Returns an enumerator that iterates through a collection.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace