Revit 2027 API
KeynoteEntry Properties
The KeynoteEntry type exposes the following members.
Properties
Name | Description
KeynoteText |  The text associated with this KeynoteEntry.
Top
See Also
Reference
KeynoteEntry Class
Autodesk.Revit.DB Namespace