Revit 2027 API
Panel Properties
The Panel type exposes the following members.
Properties
Name | Description
Lockable | This property is used to know whether a panel can be locked.
PanelType |  The Panel style of this Panel.
Transform | This property is used to find the transform of a curtain panel within project.
Top
See Also
Reference
Panel Class
Autodesk.Revit.DB Namespace