Revit 2027 API
MechanicalEquipmentSetType Methods
The MechanicalEquipmentSetType type exposes the following members.
Methods
Name | Description
Create |  Creates a new type of a mechanical equipment set and adds it to the document.
Top
See Also
Reference
MechanicalEquipmentSetType Class
Autodesk.Revit.DB.Mechanical Namespace