Revit 2027 API
StructuralSectionConcreteI Class
 Defines parameters for parameterized concrete I structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteI
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcreteI : StructuralSectionRectangular
Public Class StructuralSectionConcreteI
	Inherits StructuralSectionRectangular
public ref class StructuralSectionConcreteI : public StructuralSectionRectangular
type StructuralSectionConcreteI =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionConcreteI type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteI |  Creates a new instance of Structural Section Concrete I shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BottomFlangeThickness |  Bottom Flange Thickness.
BottomFlangeWidth |  Bottom Flange Width.
TopFlangeThickness |  Top Flange Thickness.
TopFlangeWidth |  Top Flange Width.
WebThickness |  Web Thickness.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace