Revit 2027 API
VertexBuffer Methods
The VertexBuffer type exposes the following members.
Methods
Name | Description
Dispose
GetMappedHandle |  Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
GetVertexStreamPosition |  Gets a stream that can be used to write vertices of type VertexPosition into the buffer.
GetVertexStreamPositionColored |  Gets a stream that can be used to write vertices of type VertexPositionColored into the buffer.
GetVertexStreamPositionNormal |  Gets a stream that can be used to write vertices of type VertexPositionNormal into the buffer.
GetVertexStreamPositionNormalColored |  Gets a stream that can be used to write vertices of type VertexPositionNormalColored into the buffer.
IsValid |  Tests whether the buffer is valid for rendering.
Map |  Maps a portion of the buffer into memory, so that vertex data can be written into it. (see VertexStream).
Unmap |  Unmaps the buffer, so that it can be used for rendering.
Top
See Also
Reference
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace