Revit 2027 API
PreviewControl Properties
The PreviewControl type exposes the following members.
Properties
Name | Description
ScrollbarVisibility |  The visibility of the preview view scrollbars.
UIView | The UI view representing the preview view.
ViewId | The view Id.
Top
See Also
Reference
PreviewControl Class
Autodesk.Revit.UI Namespace