Revit 2027 API
RevitServerUnauthenticatedUserException Methods
The RevitServerUnauthenticatedUserException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerUnauthenticatedUserException Class
Autodesk.Revit.Exceptions Namespace