Revit 2027 API
IPipePressureDropServer Interface
 Interface for external servers implementing pipe pressure drop calculation.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IPipePressureDropServer : IExternalServer
Public Interface IPipePressureDropServer
	Inherits IExternalServer
public interface class IPipePressureDropServer : IExternalServer
type IPipePressureDropServer =
    interface
        interface IExternalServer
    end
The IPipePressureDropServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the pipe pressure drop.
GetHtmlDescription |  The method that Revit will invoke to get an HTML formatted description of the server.
GetInformationLink |  The method that Revit will invoke to obtain a URL address which provides more information about the server.
Top
Remarks
 A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service, see ExternalServiceRegistry.
Assign server for the pipe pressure drop calculation in PipeSettings.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace