Revit 2027 API
ExportIFCCategoryInfo Methods
The ExportIFCCategoryInfo type exposes the following members.
Methods
Name | Description
Dispose
IsDefault |  Determines if a ExportIFCCategoryInfo contains default information.
Top
See Also
Reference
ExportIFCCategoryInfo Class
Autodesk.Revit.DB Namespace