Revit 2027 API
FamilyPointLocation Methods
The FamilyPointLocation type exposes the following members.
Methods
Name | Description
GetLocation |  Gets the location of the point.
Top
See Also
Reference
FamilyPointLocation Class
Autodesk.Revit.DB Namespace