Revit 2027 API
PointCloudColorSettings Class
 The color settings which are applied to a PointCloudInstance element, or one of its scans.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudColorSettings
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointCloudColorSettings : IDisposable
Public Class PointCloudColorSettings
	Implements IDisposable
public ref class PointCloudColorSettings : IDisposable
type PointCloudColorSettings =
    class
        interface IDisposable
    end
The PointCloudColorSettings type exposes the following members.
Constructors
Name | Description
PointCloudColorSettings() |  Constructs color settings object with default colors.
PointCloudColorSettings(PointCloudColorMode) |  Constructs color settings object with default color for given color mode.
PointCloudColorSettings(PointCloudColorSettings) |  Constructs a copy of source object.
PointCloudColorSettings(Color, Color) |  Constructs color settings object from given colors.
Top
Properties
Name | Description
Color1 |  Color 1
Color2 |  Color 2
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose | Releases all resources used by the PointCloudColorSettings
IsEqual |  Check if the contents of two settings are equal.
Top
Remarks
 For different color modes (PointCloudColorMode), the color settings mean different things:
for single color, color1 means the display color
for other modes (intensity, elevation), color1 and color2 form a gradient from min to max
for no overrides and normals, color1 and color2 are not used
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace