Revit 2027 API
OffsetSurface Methods
The OffsetSurface type exposes the following members.
Methods
Name | Description
GetBasisSurface |  Returns a copy of basis surface of this OffsetSurface.
GetOffsetDistance |  Returns offset distance of this OffsetSurface.
IsOrientationSameAsBasisSurface |  Indicates whether the orientation of the OffsetSurface is same as that of its basis surface, in the sense that their oriented normals at any (u, v) have the same direction.
Top
See Also
Reference
OffsetSurface Class
Autodesk.Revit.DB Namespace