Revit 2027 API
IIFCImporterServer Methods
The IIFCImporterServer type exposes the following members.
Methods
Name | Description
ImportIFC |  The method that Revit will invoke to perform an import from IFC.
Top
See Also
Reference
IIFCImporterServer Interface
Autodesk.Revit.DB.IFC Namespace