Revit 2027 API
CentralModelAccessDeniedException Methods
The CentralModelAccessDeniedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CentralModelAccessDeniedException Class
Autodesk.Revit.Exceptions Namespace