Revit 2027 API
PipeFittingAndAccessoryPressureDropItem Class
 A flow path of the pipe/pipe fitting and accessory. It is defined by the begin connector and end connector
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeFittingAndAccessoryPressureDropItem : IDisposable
Public Class PipeFittingAndAccessoryPressureDropItem
	Implements IDisposable
public ref class PipeFittingAndAccessoryPressureDropItem : IDisposable
type PipeFittingAndAccessoryPressureDropItem =
    class
        interface IDisposable
    end
The PipeFittingAndAccessoryPressureDropItem type exposes the following members.
Properties
Name | Description
BeginConnectorIndex |  The index of the begin connector of the flow path.
Coefficient |  The coefficient between the begin connector and end connector, unitlesss.
EndConnectorIndex |  The index of the end conector of the flow path.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
VelocityPressure |  The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipeFittingAndAccessoryPressureDropItem
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace