Revit 2027 API
TransmittedModelException Class
The exception thrown when model was transmitted (sent by eTransmit) and insufficient OpenOptions were provided to handle its transmitted flag.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.TransmittedModelException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class TransmittedModelException : InvalidOperationException
<SerializableAttribute>
Public Class TransmittedModelException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class TransmittedModelException : public InvalidOperationException
[<SerializableAttribute>]
type TransmittedModelException =
    class
        inherit InvalidOperationException
    end
The TransmittedModelException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace