Revit 2027 API
RebarSpliceRules Class
 Describes the rules for splicing Rebar.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarSpliceRules
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarSpliceRules : IDisposable
Public Class RebarSpliceRules
	Implements IDisposable
public ref class RebarSpliceRules : IDisposable
type RebarSpliceRules =
    class
        interface IDisposable
    end
The RebarSpliceRules type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaximumBarLength |  Identifies the maximum bar length. The default value is 12 meters if the document units are in Metric System, or 40 feet if the units are in Imperial System.
MinimumBarLength |  Identifies the minimum bar length. The default value is 1 meter if the document units are in Metric System, or 3 feet if the units are in Imperial System.
RunOutPosition |  Identifies the run-out position. The default value is RebarSpliceByRulesRunOutPosition.End.
Top
Methods
Name | Description
Create |  Creates a new instance of RebarSpliceRules with the default options.
Dispose | Releases all resources used by the RebarSpliceRules
SetMaximumAndMinimumBarLength |  Sets the maximum and minimum bar length.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace