Revit 2027 API
MultistoryStairs Properties
The MultistoryStairs type exposes the following members.
Properties
Name | Description
ActualTreadDepth |  The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
StandardStairsId |  Id of the stair associated with the Reference Level for the multistory stairs. The standard stair is regarded as a definition to generate new stairs when extending multistory stairs to a different level height.
Top
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace