Revit 2027 API
Definitions Class
A base class that supports the addition of new parameter definitions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definitions
 Autodesk.Revit.DB.ExternalDefinitions
 Autodesk.Revit.DB.InternalDefinitions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Definitions : IEnumerable<Definition>,
	IDisposable
Public Class Definitions
	Implements IEnumerable(Of Definition), IDisposable
public ref class Definitions : IEnumerable<Definition^>,
	IDisposable
type Definitions =
    class
        interface IEnumerable<Definition>
        interface IDisposable
    end
The Definitions type exposes the following members.
Constructors
Name | Description
Definitions | Constructs an empty set of parameter definitions.
Top
Properties
Name | Description
IsEmpty | Identifies if the definitions collection is empty.
Item | Retrieves a definition by a given name.
Size | The number of definitions in the collection.
Top
Methods
Name | Description
Contains | Tests for the existence of a definition within the set.
Create | Creates a new parameter definition using specified options.
Dispose | Releases all resources used by the Definitions
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Retrieves an enumerator to the collection.
Top
Remarks
There are two derivations of this class, one of which handles external parameters and another which handles internal parameters.
See Also
Reference
Autodesk.Revit.DB Namespace