Revit 2027 API
IFCOpeningData Class
 A class that contains opening data including extrusion data, opening solids and opening element id.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCOpeningData
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCOpeningData : IDisposable
Public Class IFCOpeningData
	Implements IDisposable
public ref class IFCOpeningData : IDisposable
type IFCOpeningData =
    class
        interface IDisposable
    end
The IFCOpeningData type exposes the following members.
Properties
Name | Description
IsRecess |  Trus if it is a recess, false if it is an opening.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OpeningElementId |  The opening element id.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCOpeningData
GetExtrusionData |  Gets extrusion data.
GetOpeningSolids |  Gets opening solids.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace