Revit 2027 API
AnalyticalTransferSwitchData Class
 Represents the data and parameters of electrical analytical transfer switch.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
 Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalTransferSwitchData : AnalyticalPowerDistributableNodeData
Public Class AnalyticalTransferSwitchData
	Inherits AnalyticalPowerDistributableNodeData
public ref class AnalyticalTransferSwitchData : public AnalyticalPowerDistributableNodeData
type AnalyticalTransferSwitchData =
    class
        inherit AnalyticalPowerDistributableNodeData
    end
The AnalyticalTransferSwitchData type exposes the following members.
Properties
Name | Description
CurrentRating |  The current rating value of the electrical analytical transfer switch.
TotalConnectedCurrent |  The total connected current of the electrical analytical transfer switch.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace