Revit 2027 API
InapplicableDataException Methods
The InapplicableDataException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
InapplicableDataException Class
Autodesk.Revit.Exceptions Namespace