Revit 2027 API
Line Properties
The Line type exposes the following members.
Properties
Name | Description
Direction | Returns the direction of the line.
Origin | Returns the origin of the line.
Top
See Also
Reference
Line Class
Autodesk.Revit.DB Namespace