Revit 2027 API
Plane Properties
The Plane type exposes the following members.
Properties
Name | Description
Normal |  Plane normal.
Origin |  Plane origin.
XVec |  Axis defining the first parametric direction of the plane.
YVec |  Axis defining the second parametric direction of the plane.
Top
See Also
Reference
Plane Class
Autodesk.Revit.DB Namespace