Revit 2027 API
ExternalGeometryId Class
 This class represents an identifier for geometry from external sources.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalGeometryId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalGeometryId : IDisposable
Public Class ExternalGeometryId
	Implements IDisposable
public ref class ExternalGeometryId : IDisposable
type ExternalGeometryId =
    class
        interface IDisposable
    end
The ExternalGeometryId type exposes the following members.
Constructors
Name | Description
ExternalGeometryId |  Constructs an ExternalGeometryId object holding the given external geometry identifier.
Top
Properties
Name | Description
Id |  External geometry identifier.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalGeometryId
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the hash code.
(Overrides Object.GetHashCode())
IsValidExternalGeometryId |  Checks whether a given string represents a valid ExternalGeometryId or not.
Top
Operators
Name | Description
Equality(ExternalGeometryId, ExternalGeometryId) | Determines whether two ExternalGeometryIds are the same.
Inequality(ExternalGeometryId, ExternalGeometryId) | Determines whether two ExternalGeometryIds are different.
Top
See Also
Reference
Autodesk.Revit.DB Namespace