Revit 2027 API
ElementIsElementTypeFilter Class
 A filter used to match elements which are ElementTypes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementIsElementTypeFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementIsElementTypeFilter : ElementQuickFilter
Public Class ElementIsElementTypeFilter
	Inherits ElementQuickFilter
public ref class ElementIsElementTypeFilter : public ElementQuickFilter
type ElementIsElementTypeFilter =
    class
        inherit ElementQuickFilter
    end
The ElementIsElementTypeFilter type exposes the following members.
Constructors
Name | Description
ElementIsElementTypeFilter() |  Constructs a new instance of a filter to match only ElementTypes.
ElementIsElementTypeFilter(Boolean) |  Constructs a new instance of a filter to match only ElementTypes, with the option to match all elements which are not ElementTypes.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace