Revit 2027 API
DWGExportOptions Methods
The DWGExportOptions type exposes the following members.
Methods
Name | Description
GetPredefinedOptions |  Returns an instance DWGExportOptions containing settings from a predefined export setup.
Top
See Also
Reference
DWGExportOptions Class
Autodesk.Revit.DB Namespace