Revit 2027 API
GuidEnum Methods
The GuidEnum type exposes the following members.
Methods
Name | Description
Equals |  Compares two Guid-based enum object based on their concrete class and GUID value.
(Overrides Object.Equals(Object))
GetHashCode |  Generates a hash code for this Guid-based enum object.
(Overrides Object.GetHashCode())
Top
See Also
Reference
GuidEnum Class
Autodesk.Revit.DB Namespace