Revit 2027 API
StructuralSectionHotRolled Class
 Defines parameters for hot rolled structural sections.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 More
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionHotRolled : StructuralSectionRectangular
Public Class StructuralSectionHotRolled
	Inherits StructuralSectionRectangular
public ref class StructuralSectionHotRolled : public StructuralSectionRectangular
type StructuralSectionHotRolled =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionHotRolled type exposes the following members.
Properties
Name | Description
FlangeThickness |  Flange Thickness.
FlangeThicknessLocation |  Flange Thickness Location.
WebFillet |  Web Fillet - fillet radius between web and flange.
WebThickness |  Web Thickness.
WebThicknessLocation |  Web Thickness Location.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange