Revit 2027 API
RoutingCriterionBase Methods
The RoutingCriterionBase type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Verify if two criteria are the same.
Top
See Also
Reference
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace