Revit 2027 API
ArgumentOutOfRangeException Class
The exception that is thrown when the value of an argument is outside the allowable range of values as defined by the invoked method.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.ArgumentOutOfRangeException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ArgumentOutOfRangeException : ArgumentException
<SerializableAttribute>
Public Class ArgumentOutOfRangeException
	Inherits ArgumentException
[SerializableAttribute]
public ref class ArgumentOutOfRangeException : public ArgumentException
[<SerializableAttribute>]
type ArgumentOutOfRangeException =
    class
        inherit ArgumentException
    end
The ArgumentOutOfRangeException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace