Revit 2027 API
CircuitNamingSchemeSettings Class
 This class represents a circuit naming scheme settings in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CircuitNamingSchemeSettings : Element
Public Class CircuitNamingSchemeSettings
	Inherits Element
public ref class CircuitNamingSchemeSettings : public Element
type CircuitNamingSchemeSettings =
    class
        inherit Element
    end
The CircuitNamingSchemeSettings type exposes the following members.
Properties
Name | Description
CircuitNamingSchemeId |  The circuit naming scheme id set in CircuitNamingSchemeSettings.
Top
Methods
Name | Description
GetCircuitNamingSchemeSettings |  Gets the circuit naming scheme settings of the project.
IsValidCircuitNamingSchemeId |  Verifies that the circuit naming scheme id can be used with CircuitNamingSchemeSettings.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace