Revit 2027 API
ConnectionValidationWarning Class
 Contains information about a specific connection validation problem.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ConnectionValidationWarning
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConnectionValidationWarning : IDisposable
Public Class ConnectionValidationWarning
	Implements IDisposable
public ref class ConnectionValidationWarning : IDisposable
type ConnectionValidationWarning =
    class
        interface IDisposable
    end
The ConnectionValidationWarning type exposes the following members.
Constructors
Name | Description
ConnectionValidationWarning |  Constructor.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Reason |  Enumeration for reason of warning.
Resolution |  Enumeration for resolution that was applied.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConnectionValidationWarning
GetParts |  Get ElementIds of affected parts.
Top
See Also
Reference
Autodesk.Revit.DB Namespace