Revit 2027 API
FamilyManager Properties
The FamilyManager type exposes the following members.
Properties
Name | Description
CurrentType | The current family type.
Parameter[BuiltInParameter] | Obtains the parameter of this type with a given parameter id.
Parameter[Definition] | Obtains the parameter of this type with a given definition.
Parameter[Guid] | Obtains the parameter of this type with a given GUID for a shared parameter.
Parameter[String] | Obtains the parameter of this type with a given name.
Parameters | All family parameters in this family.
Types | All family types in the family.
Top
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace