Revit 2027 API
CentralModelAlreadyExistsException Methods
The CentralModelAlreadyExistsException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CentralModelAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace