Revit 2027 API
ModelArc Class
Represents a ModelArc within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.ModelCurve
 Autodesk.Revit.DB.ModelArc
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelArc : ModelCurve
Public Class ModelArc
	Inherits ModelCurve
public ref class ModelArc : public ModelCurve
type ModelArc =
    class
        inherit ModelCurve
    end
The ModelArc type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from ModelCurve::geometryCurve property.
See Also
Reference
Autodesk.Revit.DB Namespace