Revit 2027 API
RoutingCriterionBase Class
 RoutingCriteriaBase is the base class for all routing criteria.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingCriterionBase
 Autodesk.Revit.DB.PrimarySizeCriterion
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoutingCriterionBase : IDisposable
Public Class RoutingCriterionBase
	Implements IDisposable
public ref class RoutingCriterionBase : IDisposable
type RoutingCriterionBase =
    class
        interface IDisposable
    end
The RoutingCriterionBase type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RoutingCriterionBase
IsEqual |  Verify if two criteria are the same.
Top
See Also
Reference
Autodesk.Revit.DB Namespace