Revit 2027 API
RailingType Properties
The RailingType type exposes the following members.
Properties
Name | Description
BalusterPlacement |  Accesses the object containing properties related to the baluster placement.
PrimaryHandrailHeight |  The height of the primary handrail.
PrimaryHandrailLateralOffset |  The lateral offset of the primary handrail.
PrimaryHandRailPosition |  The position of the primary handrail.
PrimaryHandrailType |  The type of the primary handrail.
RailStructure |  The NonContinuousRailStructure.
SecondaryHandrailHeight |  The height of the secondary handrail.
SecondaryHandrailLateralOffset |  The lateral offset of the secondary handrail.
SecondaryHandRailPosition |  The position of the secondary handrail.
SecondaryHandrailType |  The type of the secondary handrail.
TopRailHeight |  The height of the top rail in the railing system.
TopRailType |  The type of the top rail in the railing system.
Top
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace