Revit 2027 API
AssemblyMemberDifferentGeometry Class
 The two assembly members being compared have different geometry
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentGeometry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyMemberDifferentGeometry : AssemblyMemberDifference
Public Class AssemblyMemberDifferentGeometry
	Inherits AssemblyMemberDifference
public ref class AssemblyMemberDifferentGeometry : public AssemblyMemberDifference
type AssemblyMemberDifferentGeometry =
    class
        inherit AssemblyMemberDifference
    end
The AssemblyMemberDifferentGeometry type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace