Revit 2027 API
FaceArray Methods
The FaceArray type exposes the following members.
Methods
Name | Description
Append | Add the face to the end of the array.
Clear | Removes every face from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified face into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
FaceArray Class
Autodesk.Revit.DB Namespace