Revit 2027 API
AnnotationMultipleAlignmentUtils Methods
The AnnotationMultipleAlignmentUtils type exposes the following members.
Methods
Name | Description
Dispose
ElementSupportsMultiAlign |  Returns true if element can be aligned to other similar elements.
GetAnnotationCenter |  Gets the center of the alignable element in model space.
GetAnnotationOutlineWithoutLeaders |  Gets the four corners of the alignable element in model space without its leaders.
MoveWithAnchoredLeaders |  Moves the element while keeping the leader end points anchored.
Top
See Also
Reference
AnnotationMultipleAlignmentUtils Class
Autodesk.Revit.DB Namespace