Revit 2027 API
AngularDimension Methods
The AngularDimension type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of an Angular Dimension element within the project.
SetAngularRadius |  Set radius of an Angular Dimension arc. The new radius of the arc.
Top
See Also
Reference
AngularDimension Class
Autodesk.Revit.DB Namespace