Revit 2027 API
InternalOrigin Class
 A class representing the origin of internal coordinate system. Each Revit project contains one InternalOrigin.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.InternalOrigin
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InternalOrigin : Element
Public Class InternalOrigin
	Inherits Element
public ref class InternalOrigin : public Element
type InternalOrigin =
    class
        inherit Element
    end
The InternalOrigin type exposes the following members.
Properties
Name | Description
Position |  The position of the InternalOrigin.
SharedPosition |  The position of the InternalOrigin relative to the active ProjectLocation set for the document.
Top
Methods
Name | Description
Get |  Gets the internal origin for the document.
Top
Remarks
 The internal origin cannot be selected (e.g. as a reference) nor can it be modified.
See Also
Reference
Autodesk.Revit.DB Namespace