Revit 2027 API
InSessionViewSheetSet Class
Represents the in-session ViewSheetSet.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.InSessionViewSheetSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InSessionViewSheetSet : IViewSheetSet,
	IDisposable
Public Class InSessionViewSheetSet
	Implements IViewSheetSet, IDisposable
public ref class InSessionViewSheetSet : IViewSheetSet,
	IDisposable
type InSessionViewSheetSet =
    class
        interface IViewSheetSet
        interface IDisposable
    end
The InSessionViewSheetSet type exposes the following members.
Properties
Name | Description
IsAutomatic |  Automatic order or manual order.
OrderedViewList |  Ordered views.
SheetOrganizationId | ElementId to the BrowserOrganization for sheets.
ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views.
Views | The views.
Top
Methods
Name | Description
Dispose | Releases all resources used by the InSessionViewSheetSet
Top
Remarks
The in-session ViewSheetSet can't be stored in document.
See Also
Reference
Autodesk.Revit.DB Namespace