Revit 2027 API
RebarHostData Methods
The RebarHostData type exposes the following members.
Methods
Name | Description
Dispose
GetAreaReinforcementsInHost |  Returns all AreaReinforcement elements hosted by the referenced element.
GetCommonCoverType |  If all exposed faces of the host have the same associated CoverType, return that CoverType; otherwise, return null.
GetCoverType |  Gets the CoverType associated with a face of the element.
GetExposedFaces |  Returns all the exposed faces, that is, those that have an associated CoverType.
GetFabricAreasInHost |  Returns all FabricArea elements hosted by the referenced element.
GetFabricSheetsInHost |  Returns all FabricSheet elements hosted by the referenced element.
GetPathReinforcementsInHost |  Returns all PathReinforcement elements hosted by the referenced element.
GetRebarContainersInHost |  Returns all RebarContainer elements hosted by the referenced element.
GetRebarHostData |  Gets a RebarHostData object referring to the specified rebar host element.
GetRebarHostDirectNeighbors |  Returns a set of ElementIds for Elements joined to the provided host element.
GetRebarsInHost |  Returns all Rebar elements hosted by the referenced element.
IsFaceExposed |  Checks whether the specified face is considered exposed, and therefore has an associated CoverType.
IsReferenceContainedByAValidHost |  Identifies whether an element that contains the given reference can host reinforcement.
IsValidHost() |  Reports whether the element is a valid rebar host.
IsValidHost(Element) |  Identifies whether a given element can host reinforcement.
SetCommonCoverType |  Associate a single CoverType with all exposed faces of the host element.
SetCoverType |  Associates the specified CoverType with the specified face of the element.
Top
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace