Revit 2027 API
InsulationLiningBase Methods
The InsulationLiningBase type exposes the following members.
Methods
Name | Description
GetInsulationIds |  Returns the ids of the insulation elements associated to a given element.
GetLiningIds |  Returns the ids of the lining elements associated to a given element.
IsValidThickness |  Identifies if the given thickness value is valid for assignment to insulation or lining elements.
Top
See Also
Reference
InsulationLiningBase Class
Autodesk.Revit.DB Namespace