Revit 2027 API
BaseExportOptions Methods
The BaseExportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetExportFontTable |  Gets font table.
GetExportLayerTable |  Gets the layer table.
GetExportLinetypeTable |  Gets a copy of the line type table.
GetExportPatternTable |  Gets a copy of the pattern table.
GetPredefinedSetupNames |  Returns a list of names of predefined setups of export options.
SetExportFontTable |  Sets font table to option.
SetExportLayerTable |  Sets layer table back to option
SetExportLinetypeTable |  Sets the line type table to use during export.
SetExportPatternTable |  Sets the pattern table to use during export.
Top
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace