Revit 2027 API
ZoneEquipment Class
 Represents an early-stage equipment placeholder that provides heating or cooling to part of air system or water loop.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.ZoneEquipment
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ZoneEquipment : Element
Public Class ZoneEquipment
	Inherits Element
public ref class ZoneEquipment : public Element
type ZoneEquipment =
    class
        inherit Element
    end
The ZoneEquipment type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new zone equipment
GetAssociatedZoneEquipment(Document, ElementId) |  Gets the associated zone equipment of the specified analytical space.
GetAssociatedZoneEquipment(Document, ISet<ElementId>) |  Gets the associated zone equipment of all specified analytical spaces.
GetZoneEquipmentData |  Gets the zone equipment data.
MoveSpaceToEquipment |  Moves the selected analytical spaces from the identified zone equipment to another target zone equipment.
Top
Remarks
 A zone equipment is different from physical equipment. Depending on its behavior type, it may be mapped to multiple physical equipment later.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace