Revit 2027 API
StructuralSectionGeneralW Class
 Defines parameters for Angle structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralW : StructuralSectionHotRolled
Public Class StructuralSectionGeneralW
	Inherits StructuralSectionHotRolled
public ref class StructuralSectionGeneralW : public StructuralSectionHotRolled
type StructuralSectionGeneralW =
    class
        inherit StructuralSectionHotRolled
    end
The StructuralSectionGeneralW type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralW |  Creates a new instance of Angle shape.
Top
Properties
Name | Description
FlangeFillet |  Flange Fillet - fillet radius at the flange end.
TopWebFillet |  Top Web Fillet - fillet radius at the top of web.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace