Revit 2027 API
DefaultOpenFromCloudCallback Class
 A default callback that may be used to control Revit's behavior when opening a model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DefaultOpenFromCloudCallback
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
Public Class DefaultOpenFromCloudCallback
	Implements IOpenFromCloudCallback, IDisposable
public ref class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
type DefaultOpenFromCloudCallback =
    class
        interface IOpenFromCloudCallback
        interface IDisposable
    end
The DefaultOpenFromCloudCallback type exposes the following members.
Constructors
Name | Description
DefaultOpenFromCloudCallback |  Create a default open callback. Open latest by default for all scenarios.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DefaultOpenFromCloudCallback
OnOpenConflict |  A method called when the conflict is happen during the model opening.
Top
See Also
Reference
Autodesk.Revit.DB Namespace