Revit 2027 API
ConduitSizeSettingIterator Class
 An iterator to a set of items from ConduitSizeSettings. Each item is a KeyValuePair(System::String^, ConduitSizes). ElementId is the id of the conduit standard type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConduitSizeSettingIterator : IEnumerator<KeyValuePair<string, ConduitSizes>>
Public Class ConduitSizeSettingIterator
	Implements IEnumerator(Of KeyValuePair(Of String, ConduitSizes))
public ref class ConduitSizeSettingIterator : IEnumerator<KeyValuePair<String^, ConduitSizes^>>
type ConduitSizeSettingIterator =
    class
        interface IEnumerator<KeyValuePair<string, ConduitSizes>>
    end
The ConduitSizeSettingIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConduitSizeSettingIterator
HasCurrent |  Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the enumerator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace