Revit 2027 API
ConicalFace Class
A conical face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.ConicalFace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConicalFace : Face
Public Class ConicalFace
	Inherits Face
public ref class ConicalFace : public Face
type ConicalFace =
    class
        inherit Face
    end
The ConicalFace type exposes the following members.
Properties
Name | Description
Axis | Axis of the surface.
HalfAngle | Half angle of the surface.
Origin | Origin of the surface.
Radius | Radii of the surface.
Top
Methods
Name | Description
Top
Remarks
For details on the parameterization, refer to the documentation for ConicalSurface.
Example
private void GetConicalFaceInfo(Face face)
{
    ConicalFace conicalFace = face as ConicalFace;
    if (null != conicalFace)
    {
       XYZ axis = conicalFace.Axis;
       XYZ origin = conicalFace.Origin;
        double halfAngle = conicalFace.HalfAngle;
        XYZ radius = conicalFace.get_Radius(0);
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace