Revit 2027 API
AreaVolumeSettings Class
 This class provides access to settings related to volume and area computations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.AreaVolumeSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaVolumeSettings : Element
Public Class AreaVolumeSettings
	Inherits Element
public ref class AreaVolumeSettings : public Element
type AreaVolumeSettings =
    class
        inherit Element
    end
The AreaVolumeSettings type exposes the following members.
Properties
Name | Description
ComputeVolumes |  True to enable volume computation. False to disable it.
Top
Methods
Name | Description
GetAreaVolumeSettings |  Get the area and volume settings of the project.
GetSpatialElementBoundaryLocation |  Gets the spatial element boundary location based on spatial element type.
SetSpatialElementBoundaryLocation |  Sets the spatial element boundary location of a spatial element type.
Top
See Also
Reference
Autodesk.Revit.DB Namespace