Revit 2027 API
ViewNavigationToolSettings Class
 Represents the settings contained in the document associated to the View Navigation tools (such as the View Cube).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ViewNavigationToolSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewNavigationToolSettings : Element
Public Class ViewNavigationToolSettings
	Inherits Element
public ref class ViewNavigationToolSettings : public Element
type ViewNavigationToolSettings =
    class
        inherit Element
    end
The ViewNavigationToolSettings type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetHomeCamera |  Gets a copy of the structure containing information about the store Home view orientation.
GetViewNavigationToolSettings |  Gets the instance of the settings for the given document.
IsHomeCameraSet |  Checks if the home view is set in the settings.
Top
See Also
Reference
Autodesk.Revit.DB Namespace