Revit 2027 API
StructuralSectionGeneralF Class
 Defines parameters for Flat Bar.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralF : StructuralSectionRectangular
Public Class StructuralSectionGeneralF
	Inherits StructuralSectionRectangular
public ref class StructuralSectionGeneralF : public StructuralSectionRectangular
type StructuralSectionGeneralF =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionGeneralF type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralF |  Creates a new instance of Structural Section Flat Bar.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace