Revit 2027 API
Curve Properties
The Curve type exposes the following members.
Properties
Name | Description
ApproximateLength | The approximate length of the curve.
IsBound | Describes whether the parameter of the curve is restricted to a particular interval.
IsClosed | Describes whether the curve is closed.
IsCyclic | The boolean value that indicates whether this curve is cyclic.
Length | The exact length of the curve.
Period | The period of this curve.
Reference | Returns a stable reference to the curve.
Top
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace