Revit 2027 API
WorksharedOperationProgressChangedEventArgs Properties
The WorksharedOperationProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
Location |  Full path of the central model which is to be operated.
Status |  Gets API event status, reflect current operation execution status.
Top
See Also
Reference
WorksharedOperationProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace