Revit 2027 API
PlanarFace Properties
The PlanarFace type exposes the following members.
Properties
Name | Description
FaceNormal | Normal of the planar face.
Origin | Origin of the surface.
XVector | The X-vector of the planar face.
YVector | The Y-vector of the planar face.
Top
See Also
Reference
PlanarFace Class
Autodesk.Revit.DB Namespace