Revit 2027 API
LoadComponent Class
 An object that represents a load combination component.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.LoadComponent
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LoadComponent : IDisposable
Public Class LoadComponent
	Implements IDisposable
public ref class LoadComponent : IDisposable
type LoadComponent =
    class
        interface IDisposable
    end
The LoadComponent type exposes the following members.
Constructors
Name | Description
LoadComponent |  Constructs a new instance of a LoadComponent. The load case or combination id. The load case or combination factor.
Top
Properties
Name | Description
Factor |  Load component factor.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LoadCaseOrCombinationId |  Load case or combination id.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LoadComponent
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace