Revit 2027 API
ArgumentNullException Class
The exception that is thrown when null is passed to a method that does not accept it as a valid argument.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.ArgumentNullException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ArgumentNullException : ArgumentException
<SerializableAttribute>
Public Class ArgumentNullException
	Inherits ArgumentException
[SerializableAttribute]
public ref class ArgumentNullException : public ArgumentException
[<SerializableAttribute>]
type ArgumentNullException =
    class
        inherit ArgumentException
    end
The ArgumentNullException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace