Revit 2027 API
EnergyDataSettings Class
 This element contains settings for Export gbXML and Systems Analysis and project level settings for Energy Analysis. for serialization
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyDataSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyDataSettings : Element
Public Class EnergyDataSettings
	Inherits Element
public ref class EnergyDataSettings : public Element
type EnergyDataSettings =
    class
        inherit Element
    end
The EnergyDataSettings type exposes the following members.
Properties
Name | Description
AnalysisType |  The type of analysis mode.
AnalyticalGridCellSize |  The cell size for the uniform cubical grid used when computing the building envelope. This property is ingnored unless AnalysisType is RoomsOrSpaces and BuildingEnvelopeDeterminationMethod is IdentifyExteriorElements.
AnalyticalSpaceResolution |  Analytical Space Resolution defines the minimum gap between Revit elements that will be ignored in the identification of energy analytical model spaces. This setting is ignored if AnalysisType is RoomsOrSpaces.
AnalyticalSurfaceResolution |  Analytical Surface Resolution defines the smallest dimension of any surface to be included in the energy analytical model. This setting is ignored if AnalysisType is RoomsOrSpaces.
BuildingConstructionClass |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Construction class of building as defined by: loose, medium, tight, or none.
BuildingEnvelopeDeterminationMethod |  Indicates if an analysis should be performed to find the model elements that are part of the building envelope.
BuildingHVACSystem | Obsolete.
 The type of HVAC system used by the building for conceptual model energy calculations.
BuildingOperatingSchedule | Obsolete.
 The operating schedule of the building used for conceptual model energy calculations.
BuildingType |  The type of building.
BuildingTypeId |  The building type element.
CoreOffset |  The default offset used to determine the outer perimeter to be divided into zones. Ignored if AnalysisType is not ConceptualMassesAndBuildingElements.
CreateAnalyticalModel | Obsolete.
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
DividePerimeter |  If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.
EnergyModel |  if this is on there should be an energy model dependent on the current AnalysisType if it is off the conceptual energy model should be turned off
ExportCategory |  Value is a category indicating which discipline model will be used for GreenBuildingXML export. This property only applies if AnalysisType is RoomsOrSpaces.
ExportComplexity |  Value determines Export Complexity when AnalysisType is RoomsOrSpaces.
ExportDefaults | Obsolete.
 Use for detailed model GreenBuildingXML export. When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML. When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.
GroundPlane |  Id of level which represents ground level.
IncludeThermalProperties |  Indicates if thermal information from model assemblies and components is included in GreenBuildingXML export of the detailed model.
IsExportMullionsEnabled |  Indicates if mullions are included in GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsExportShadingSurfacesEnabled |  Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsExportSimplifiedCurtainSystemsEnabled |  Indicates if curtain system geometry is being simplified for GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsGlazingShaded | Obsolete.
 If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.
OutsideAirChangesRatePerHour | Obsolete.
 The number of times the volume of air interchanges in the room in one hour.
OutsideAirPerArea | Obsolete.
 The rate of flow of outside air available per unit area.
OutsideAirPerPerson | Obsolete.
 The rate of flow of outside air available per person.
PercentageGlazing |  Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
PercentageSkylights |  Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building roof surfaces for masses.
ProjectPhase |  The project phase of the EnergyData information.
ProjectReportType |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Report type: None, simple, standard, detailed, compact.
ReportsFolder |  The folder path where all systems analysis reports are stored. It may include special label and relative path.
ServiceType |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). The type of heating or cooling system.
ShadeDepth | Obsolete.
 Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.
SillHeight | Obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The height from the nearest lower level used for auto-glazing created on walls.
SkylightWidth | Obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate width used for the skylights in massing instances when the Energy Analytical model is being created.
SliverSpaceTolerance |  This property only applies if AnalysisType is RoomsOrSpaces. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
UseAirChangesPerHour |  True if user is specifying air changes per hour, false otherwise.
UseCurrentViewOnly |  True if only elements visible in the currently active view are used for generation of Energy Model.
UseHeatingCredits |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.
UseOutsideAirPerArea | Obsolete.
 True is user is specifying outside air per area, false otherwise.
UseOutsideAirPerPerson | Obsolete.
 True if user is specifying outside air per person, false otherwise. Deprecated in Revit 2027 and may be removed in a later version of Revit.
Top
Methods
Name | Description
CheckAnalysisType |  Checks that the analysis type falls within an appropriate range.
CheckBuildingConstructionClass |  Checks that the building construction class falls within an appropriate range.
CheckBuildingEnvelope |  Checks that the building envelope determination method falls within an appropriate range.
CheckBuildingHVACSystem |  Checks that the building HVAC system falls within an appropriate range.
CheckBuildingOperatingSchedule |  Checks that the building operating schedule falls within an appropriate range.
CheckBuildingType |  Checks that the building type falls within an appropriate range.
CheckConstructionSetElement |  Checks that the construction set ElementId is acceptable.
CheckExportCategory |  Checks whether the export category falls within the list:
OST_Rooms
OST_MEPSpaces
CheckExportComplexity |  Checks that the export complexity falls within an appropriate range.
CheckGroundPlane(ElementId) |  The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
CheckGroundPlane(Document, ElementId) |  The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
CheckProjectPhase |  Checks that the input element is a project phase.
CheckProjectReportType |  Checks that the project report type falls within an appropriate range.
CheckRangeOfPercentageGlazing |  Checks that the percentage glazing value is between 0.00 and 0.95.
CheckRangeOfPercentageSkylights | Obsolete.
 Checks that the percentage skylights value is between 0.00 and 0.95.
CheckRangeOfShadeDepth | Obsolete.
 Checks that the shade depth is greater than or equal to zero.
CheckRangeOfSillHeight | Obsolete.
 Checks that the sill height is greater than or equal to zero.
CheckRangeOfSkylightWidth | Obsolete.
 Checks that the skylight width is greater than or equal to eight inches.
CheckRangeOfSliverSpaceTolerance |  Checks that the sliver space tolerance is greater than or equal to zero.
CheckServiceType |  Checks that the service type falls within an appropriate range.
GetBuildingConstructionSetElementId |  Id of the building construction set.
GetEnergyDataSettings |  Gets the energy data settings element in the document.
GetFromDocument | Obsolete.
 Every project document has a EnergyDataSettings element. Family documents do not have EnergyDataSettings elements.
GetReportsFolderParsed |  Gets the absolute reports folder path that is parsed from the original input.
IsDocumentUsingEnergyDataAnalyticalModel | Obsolete.
 Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
SetReportsFolder |  Sets the reports folder path.
Top
Example
public void GetInfo_EnergyData(Document document)
{
   EnergyDataSettings energyData = EnergyDataSettings.GetEnergyDataSettings(document);
   if (null != energyData)
    {
        string message = "energyData : ";
        message += "\nBuildingType : " + energyData.BuildingType;
        TaskDialog.Show("Revit",message);
    }
}
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace