Revit 2027 API
AssemblyInstance Properties
The AssemblyInstance type exposes the following members.
Properties
Name | Description
AssemblyTypeName |  The name for the assembly type. All matching assembly instances share this name. Unique assembly instances are named automatically based on their naming category.
Location | This property is used to find the physical location of the assembly instance within project.
(Overrides Element.Location)
NamingCategoryId |  Id of the category that drives the default naming scheme for the assembly instance.
Top
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace