Revit 2027 API
AssetPropertyDoubleArray2d Class
 Represents a property consisting of an array of double values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyDoubleArray2d : AssetProperty
Public Class AssetPropertyDoubleArray2d
	Inherits AssetProperty
public ref class AssetPropertyDoubleArray2d : public AssetProperty
type AssetPropertyDoubleArray2d =
    class
        inherit AssetProperty
    end
The AssetPropertyDoubleArray2d type exposes the following members.
Properties
Name | Description
Value | Get the value of the property
Top
Methods
Name | Description
Top
Remarks
 In virtually all cases, the array will contain exactly 2 values.
See Also
Reference
Autodesk.Revit.DB.Visual Namespace