Revit 2027 API
ImageType Methods
The ImageType type exposes the following members.
Methods
Name | Description
CanReload |  Check whether the ImageType can be reloaded from file.
Create |  Creates a new ImageType element and loads the image into it.
GetImage | Get the bitmap image stored in the image symbol.
Reload |  Reloads the ImageType from the file found at the location specified by the Path property, using the same PageNumber and resolution.
ReloadFrom |  Reloads the image in the ImageType from a new image file, and for a new PageNumber.
Unload |  Unload the linked image.
Top
See Also
Reference
ImageType Class
Autodesk.Revit.DB Namespace