Revit 2027 API
SeparatorItem Class
 A class representing a context menu separator.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.MenuItem
 Autodesk.Revit.UI.SeparatorItem
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SeparatorItem : MenuItem
Public Class SeparatorItem
	Inherits MenuItem
public ref class SeparatorItem : public MenuItem
type SeparatorItem =
    class
        inherit MenuItem
    end
The SeparatorItem type exposes the following members.
Constructors
Name | Description
SeparatorItem |  Default constructor.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 A separator can be added between menu items when needed.
See Also
Reference
Autodesk.Revit.UI Namespace