Revit 2027 API
EdgeArrayArray Properties
The EdgeArrayArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an edge array at a specified index within the array.
Size | Returns the number of edge arrays that are in the array.
Top
See Also
Reference
EdgeArrayArray Class
Autodesk.Revit.DB Namespace