Revit 2027 API
TopRailType Class
 A rail type object that is used in the generation of top rail.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.ContinuousRailType
 Autodesk.Revit.DB.Architecture.TopRailType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TopRailType : ContinuousRailType
Public Class TopRailType
	Inherits ContinuousRailType
public ref class TopRailType : public ContinuousRailType
type TopRailType =
    class
        inherit ContinuousRailType
    end
The TopRailType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace