Revit 2027 API
StructuralSectionCProfileWithLips Class
 Defines parameters for C Profile with lips structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionCProfileWithLips : StructuralSectionGeneralC
Public Class StructuralSectionCProfileWithLips
	Inherits StructuralSectionGeneralC
public ref class StructuralSectionCProfileWithLips : public StructuralSectionGeneralC
type StructuralSectionCProfileWithLips =
    class
        inherit StructuralSectionGeneralC
    end
The StructuralSectionCProfileWithLips type exposes the following members.
Constructors
Name | Description
StructuralSectionCProfileWithLips |  Creates a new instance of Structural Section C Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace