Revit 2027 API
AssetPropertyDoubleArray2d Properties
The AssetPropertyDoubleArray2d type exposes the following members.
Properties
Name | Description
Value | Get the value of the property
Top
See Also
Reference
AssetPropertyDoubleArray2d Class
Autodesk.Revit.DB.Visual Namespace