Revit 2027 API
MEPAnalyticalSegment Class
 Represents an analytical segment of the MEP analytical model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPAnalyticalSegment : IDisposable
Public Class MEPAnalyticalSegment
	Implements IDisposable
public ref class MEPAnalyticalSegment : IDisposable
type MEPAnalyticalSegment =
    class
        interface IDisposable
    end
The MEPAnalyticalSegment type exposes the following members.
Properties
Name | Description
Area |  The area of the segment profile.
Comments |  The comments for this analytical segment.
DemandFlow |  The designed flow value, in ft^3/s.
DomainType |  The connector domain type of this segment.
EndNode |  The id of the end analytical node.
Id |  The identity of this segment.
InnerDiameter |  The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OverrideType |  The override type of analytical segment pressure loss calculation.
RevitElementId |  The id of the owning Revit element.
Roughness |  The roughness of this segment, in ft.
SegmentType |  The analytical segment type.
StartNode |  The id of the start analytical node.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPAnalyticalSegment
GetFlowCharacteristics |  Gets all flow characteristics of the segment.
GetFlowConvergenceCharacteristic |  Gets the flow convergence characteristic of the segment.
GetFlowTransitionCharacteristic |  Gets the flow transition characteristic of the segment.
GetLossCoefficientOverride |  Gets the overridden value of loss coefficient, dimensionless.
GetNetworkSegmentId |  Gets the NetworkSegmentId.
GetPressureDropOverride |  Gets the overidden value of pressuer drop, in kg/(ft*s^2).
GetSegment |  Gets the analytical segment from the Subelement
GetSubelement |  Gets the subelement of this segment.
IsSegmentOverridable |  Verifies if the segment can be overridden (e.g., the pressure drop of the pump and curve segments are calculated from the network and cannot be overridden).
SetComments |  Sets the comments for this analytical segment.
SetLossCoefficientOverride |  Sets the overridden value of loss coefficient.
SetOverrideType |  Sets the override type of pressure loss calculation.
SetPressureDropOverride |  Sets the overridden value of pressure drop.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace