Revit 2027 API
MEPAnalyticalNode Methods
The MEPAnalyticalNode type exposes the following members.
Methods
Name | Description
Dispose
IsSameNode |  Verify if this node is connected to the other node and thus represents the same analytical node in the network.
Top
See Also
Reference
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace