Revit 2027 API
ExportLayerKey Class
 A key used to represent an item stored in an ExportLayerTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLayerKey
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLayerKey : IDisposable
Public Class ExportLayerKey
	Implements IDisposable
public ref class ExportLayerKey : IDisposable
type ExportLayerKey =
    class
        interface IDisposable
    end
The ExportLayerKey type exposes the following members.
Constructors
Name | Description
ExportLayerKey() |  Constructs a new ExportLayerKey with default values.
ExportLayerKey(String, String, SpecialType) |  Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type.
Top
Properties
Name | Description
CategoryName |  The category name.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SpecialType |  The special type for layer key.
SubCategoryName |  The subcategrory Name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLayerKey
Top
See Also
Reference
Autodesk.Revit.DB Namespace