Revit 2027 API
SharedParameterApplicableRule Class
 Tests whether an element supports a shared parameter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.SharedParameterApplicableRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SharedParameterApplicableRule : FilterRule
Public Class SharedParameterApplicableRule
	Inherits FilterRule
public ref class SharedParameterApplicableRule : public FilterRule
type SharedParameterApplicableRule =
    class
        inherit FilterRule
    end
The SharedParameterApplicableRule type exposes the following members.
Constructors
Name | Description
SharedParameterApplicableRule |  Constructs an instance of SharedParameterApplicableRule.
Top
Properties
Name | Description
ParameterName |  The name of the parameter that an element must support to pass this rule.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace