Revit 2027 API
FillPatternElement Class
 An element that represents a fill pattern.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FillPatternElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FillPatternElement : Element
Public Class FillPatternElement
	Inherits Element
public ref class FillPatternElement : public Element
type FillPatternElement =
    class
        inherit Element
    end
The FillPatternElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new FillPatternElement.
GetFillPattern |  Gets the FillPattern associated to this element.
GetFillPatternElementByName |  Retrieves the FillPatternElement by its name.
SetFillPattern |  Sets the FillPattern associated to this element.
Top
Remarks
 The FillPatternElement represents a fill pattern in a project. It enables the user to retrieve, modify or create a fill pattern in a project.
See Also
Reference
Autodesk.Revit.DB Namespace