Revit 2027 API
DisplayingOptionsDialogEventArgs Properties
The DisplayingOptionsDialogEventArgs type exposes the following members.
Properties
Name | Description
PagesCount |  The count of pages in the options dialog (include the default pages added by Revit).
Top
See Also
Reference
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace