Revit 2027 API
ShapeImporter Methods
The ShapeImporter type exposes the following members.
Methods
Name | Description
Convert |  Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose
IsServiceAvailable |  Checks whether the data conversion service and Material Library are available.
SetDefaultLengthUnit |  Sets the length unit to be used when the input is a unitless SAT file.
Top
See Also
Reference
ShapeImporter Class
Autodesk.Revit.DB Namespace