Revit 2027 API
FaceArray Properties
The FaceArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a face at a specified index within the array.
Size | Returns the number of faces that are in the array.
Top
See Also
Reference
FaceArray Class
Autodesk.Revit.DB Namespace