Revit 2027 API
BackgroundTaskCancelledException Class
The exception thrown when Revit cancels a background operation. Third-party developers are not expected to catch and handle this exception. Instead, if allowed to propagate back to Revit code, it will be handled by Revit.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.BackgroundTaskCancelledException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class BackgroundTaskCancelledException : ApplicationException
<SerializableAttribute>
Public Class BackgroundTaskCancelledException
	Inherits ApplicationException
[SerializableAttribute]
public ref class BackgroundTaskCancelledException : public ApplicationException
[<SerializableAttribute>]
type BackgroundTaskCancelledException =
    class
        inherit ApplicationException
    end
The BackgroundTaskCancelledException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace