Revit 2027 API
ExtendedPropertiesLinkData Methods
The ExtendedPropertiesLinkData type exposes the following members.
Methods
Name | Description
AddParameterSchemaWithBindings |  Adds a schema id to the extended properties link.
AddValues |  Adds the provided parameter values to the Revit Element identified by %elementId%.
Dispose
HasSchema |  Queries whether the schema already exists in this data.
IsValidContainerName |  Validates that the given name is valid for use as the container name of an extended properties link.
Top
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace