Revit 2027 API
InsufficientResourcesException Class
The exception that is thrown when the OS runs out of resources, e.g. memory, disk space, or USER or GDI objects.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.InsufficientResourcesException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InsufficientResourcesException : InvalidOperationException
<SerializableAttribute>
Public Class InsufficientResourcesException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class InsufficientResourcesException : public InvalidOperationException
[<SerializableAttribute>]
type InsufficientResourcesException =
    class
        inherit InvalidOperationException
    end
The InsufficientResourcesException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace