Revit 2027 API
MEPSystem Class
 A system in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MEPSystem
 Autodesk.Revit.DB.Electrical.ElectricalSystem
 Autodesk.Revit.DB.Mechanical.MechanicalSystem
 Autodesk.Revit.DB.Plumbing.PipingSystem
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPSystem : Element
Public Class MEPSystem
	Inherits Element
public ref class MEPSystem : public Element
type MEPSystem =
    class
        inherit Element
    end
The MEPSystem type exposes the following members.
Properties
Name | Description
BaseEquipment | The base panel or equipment of the system.
BaseEquipmentConnector | The connector within base equipment which is used to connect with system.
ConnectorManager | Connector manager of the system.
Elements | Terminal elements in the system.
HasDesignParts |  Indicates if the system has one or more design parts.
HasFabricationParts |  Indicates if the system has one or more fabrication parts.
HasPlaceholders |  Indicates if the system has one or more placeholders.
IsEmpty |  Indicates if the system is empty or not.
IsMultipleNetwork |  Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
IsValid |  Indicates if the system is valid or not. atom AtomValidateSystem default false
PressureLossOfCriticalPath |  The total pressure loss of the sections in critical path.
SectionsCount |  The number of sections.
Top
Methods
Name | Description
Add |  Add elements into the system and connect them with the system using given connectors.
DivideSystem |  Divide the phyisical networks in the system and create a new system for each network.
GetCriticalPathSectionNumbers |  Obtains a list of the critical path section numbers.
GetPhysicalNetworksNumber |  Get the physical networks number in the system.
GetSectionByIndex |  Get the section from the index.
GetSectionByNumber |  Get the Section from section number
IsSystemDividable |  Checks if the system is dividable. The system is dividable if there is more than one physical network in the system. Currently, only HVAC and piping systems support dividing.
Remove(ConnectorSet) | Removes connectors from system.
Remove(ICollection<ElementId>) | Remove elements from system.
Top
Remarks
 This is the base class for electrical, mechanical and piping systems, available only in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB Namespace