Revit 2027 API
AssetPropertyInt64 Class
 Represents a property of Int64 value.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyInt64
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyInt64 : AssetProperty
Public Class AssetPropertyInt64
	Inherits AssetProperty
public ref class AssetPropertyInt64 : public AssetProperty
type AssetPropertyInt64 =
    class
        inherit AssetProperty
    end
The AssetPropertyInt64 type exposes the following members.
Properties
Name | Description
Value | Get the value of the property.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace