Revit 2027 API
NurbSpline Class
A nurb spline.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.NurbSpline
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NurbSpline : Curve
Public Class NurbSpline
	Inherits Curve
public ref class NurbSpline : public Curve
type NurbSpline =
    class
        inherit Curve
    end
The NurbSpline type exposes the following members.
Properties
Name | Description
CtrlPoints | Returns the control points of the nurb spline.
Degree | Returns the degree of the nurb spline.
isRational | Returns whether the nurb spline is rational or not.
Knots | Return/set the knots of the nurb spline.
Weights | Returns the weights of the nurb spline.
Top
Methods
Name | Description
Create |  Creates a new geometric NurbSpline object from a HermiteSpline.
CreateCurve(HermiteSpline) |  Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(IList<XYZ>, IList<Double>) |  Creates a new geometric Curve object from NURBS curve data containing just control points and weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(Int32, IList<Double>, IList<XYZ>) |  Creates a new geometric Curve object from NURBS curve data, which does not include weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(Int32, IList<Double>, IList<XYZ>, IList<Double>) |  Creates a new geometric Curve object from NURBS curve data, which includes weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
SetControlPointsAndWeights | Set the control points, weights simultaneously.
Top
Remarks
The nurb spline lies in the plane defined by control point, weight,knots,degree.
See Also
Reference
Autodesk.Revit.DB Namespace