Revit 2027 API
RoutingPreferenceRule Methods
The RoutingPreferenceRule type exposes the following members.
Methods
Name | Description
AddCriterion |  Adds a new routing criterion.
Dispose
GetCriterion |  Gets the specified criteria.
RemoveCriteron |  Removes an existing criterion.
Top
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace