Revit 2027 API
SelectionChangedEventArgs Methods
The SelectionChangedEventArgs type exposes the following members.
Methods
Name | Description
GetDocument |  Returns the document associated with this event.
GetReferences |  Returns the references that are currently selected.
GetSelectedElements |  Returns ElementIds of selected elements.
Top
See Also
Reference
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace