Revit 2027 API
Leader Class
 A leader object that can be attached to annotation elements such as text notes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Leader
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Leader : APIObject
Public Class Leader
	Inherits APIObject
public ref class Leader : public APIObject
type Leader =
    class
        inherit APIObject
    end
The Leader type exposes the following members.
Properties
Name | Description
Anchor |  Anchor point of the Leader
Elbow |  Elbow point of the Leader.
End |  End point of the Leader.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LeaderShape |  Geometric style of the leader
Top
Methods
Name | Description
Top
Remarks
 For information on how to attach or get leaders to/from a text annotation refer to corresponding methods of TextNote class.
See Also
Reference
Autodesk.Revit.DB Namespace