Revit 2027 API
VertexStream Methods
The VertexStream type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
VertexStream Class
Autodesk.Revit.DB.DirectContext3D Namespace