Revit 2027 API
AutoJoinFailedException Class
The exception that is thrown when an autojoin operation failed.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.AutoJoinFailedException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class AutoJoinFailedException : InvalidOperationException
<SerializableAttribute>
Public Class AutoJoinFailedException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class AutoJoinFailedException : public InvalidOperationException
[<SerializableAttribute>]
type AutoJoinFailedException =
    class
        inherit InvalidOperationException
    end
The AutoJoinFailedException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace