Revit 2027 API
FilterCategoryRule Methods
The FilterCategoryRule type exposes the following members.
Methods
Name | Description
AllCategoriesFilterable |  Checks that all of the given categories are filterable.
GetCategories |  Gets the rule's categories.
SetCategories |  Sets the rule's categories.
Top
See Also
Reference
FilterCategoryRule Class
Autodesk.Revit.DB Namespace