Revit 2027 API
RevitLinkOperations Methods
The RevitLinkOperations type exposes the following members.
Methods
Name | Description
SetGetLocalPathForOpenCallback |  Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
Top
See Also
Reference
RevitLinkOperations Class
Autodesk.Revit.DB Namespace