Revit 2027 API
BoundaryConditions Methods
The BoundaryConditions type exposes the following members.
Methods
Name | Description
AreCurveLoopsValid |  Checks if curve loops are valid for creating an area boundary conditions.
CanCreateAreaBoundaryConditions |  Checks if the provided host can host an area boundary conditions.
CanCreateLineBoundaryConditions |  Checks if the provided host can host a line boundary conditions.
CanCreatePointBoundaryConditions |  Checks if the provided host can host a point boundary conditions.
CreateAreaBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted area boundary conditions within the project.
CreateAreaBoundaryConditions(Document, ElementId, IList<CurveLoop>, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom area boundary conditions within the project.
CreateLineBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted line boundary conditions within the project.
CreateLineBoundaryConditions(Document, ElementId, Curve, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom line boundary conditions within the project.
CreatePointBoundaryConditions(Document, Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new hosted point boundary conditions within the project.
CreatePointBoundaryConditions(Document, ElementId, XYZ, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) |  Creates a new custom point boundary conditions within the project.
GetBoundaryConditionsType |  Returns the boundary conditions type.
GetCurve |  Returns curve that define geometry of the line boundary conditions.
GetDegreesOfFreedomCoordinateSystem |  Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
GetLoops |  Returns curve loops that define geometry of the area boundary conditions.
GetOrientTo |  Returns the boundary conditions orientation option.
IsValidHostId |  Checks if the provided host id can host a boundary conditions of the provided type.
IsValidPreset |  Checks whether the value set for boundary conditions preset is valid.
IsValidReference |  Checks if the provided reference can host a boundary conditions.
RemoveHostConstraint |  Removes constraint from host for this boundary conditions.
SetCurve |  Sets the curve that defines geometry of the line boundary conditions.
SetLoops |  Sets the curve loops that define geometry of the area boundary conditions.
SetOrientTo |  Sets the boundary condition orientation option.
Top
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace