Revit 2027 API
IExportContextBase Interface
 An interface that as common base for IModelExportContext and IExportContext2D.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExportContextBase : IExportContext
Public Interface IExportContextBase
	Inherits IExportContext
public interface class IExportContextBase : IExportContext
type IExportContextBase =
    interface
        interface IExportContext
    end
The IExportContextBase type exposes the following members.
Methods
Name | Description
OnCurve |  This method is called when a Curve is being output.
OnLineSegment |  This method is called after unhandled curve was tessellated to line segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
OnPolyline |  This method is called when a Polyline is being output.
OnPolylineSegments |  This method is called after unhandled curve was tessellated to polyline segments and sent to the output.
Note for 2D export: if the export is performed for the view in non-Wireframe display style, then
this method is called outside of view, instance and link begin/end calls but still between OnElementBegin2D/OnElementEnd2D calls
this method is never called for annotation elements, i.e. their geometry should be processed in methods OnCurve and OnPolyline
OnText |  This method is called when a text annotation object is being output.
Top
See Also
Reference
Autodesk.Revit.DB Namespace