Revit 2027 API
RevitCommandId Methods
The RevitCommandId type exposes the following members.
Methods
Name | Description
Dispose
LookupCommandId |  Looks up and retrieves the Revit command id with the given id string.
LookupPostableCommandId |  Looks up and retrieves the Revit command id with the given id string.
Top
See Also
Reference
RevitCommandId Class
Autodesk.Revit.UI Namespace