Revit 2027 API
Entity Methods
The Entity type exposes the following members.
Methods
Name | Description
Clear(Field) |  Resets the field to its default value.
Clear(String) |  Resets the field to its default value.
Dispose
Get<FieldType>(Field) |  Retrieves the value of the field in the entity.
Get<FieldType>(String) |  Retrieves the value of the field in the entity.
Get<FieldType>(Field, ForgeTypeId) |  Retrieves the value of the field in the entity.
Get<FieldType>(String, ForgeTypeId) |  Retrieves the value of the field in the entity.
IsValid |  Checks whether this Entity has a live Schema corresponding to it.
ReadAccessGranted |  Checks whether this Entity may be retrieved by the current add-in.
RecognizedField |  Checks whether a Field belongs to the same Schema as this Entity.
Set<FieldType>(Field, FieldType) |  Stores the value of the field in the entity.
Set<FieldType>(String, FieldType) |  Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, ForgeTypeId) |  Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, ForgeTypeId) |  Stores the value of the field in the entity.
WriteAccessGranted |  Checks whether this Entity may be stored by the current add-in.
Top
See Also
Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace