Revit 2027 API
ShapeBuilder Class
 The base class for geometry builder classes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ShapeBuilder
 Autodesk.Revit.DB.BRepBuilder
 Autodesk.Revit.DB.TessellatedShapeBuilder
 Autodesk.Revit.DB.ViewShapeBuilder
 Autodesk.Revit.DB.WireframeBuilder
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ShapeBuilder : IDisposable
Public Class ShapeBuilder
	Implements IDisposable
public ref class ShapeBuilder : IDisposable
type ShapeBuilder =
    class
        interface IDisposable
    end
The ShapeBuilder type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ShapeBuilder
Top
See Also
Reference
Autodesk.Revit.DB Namespace