Revit 2027 API
PathReinforcement Properties
The PathReinforcement type exposes the following members.
Properties
Name | Description
AdditionalOffset |  Additional offset of rebars in the Path Reinforcement.
AlternatingBarOrientation |  Orientation of alternating bars of Path Reinforcement.
AlternatingBarShapeId |  The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement.
PathReinforcementType |  Retrieves the type of the Path Reinforcement.
PrimaryBarOrientation |  Orientation of primary bars of Path Reinforcement.
PrimaryBarShapeId |  The RebarShape element that defines the shape of the primary bars of the Path Reinforcement.
Top
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace