Revit 2027 API
EdgeArrayArrayIterator Properties
The EdgeArrayArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
EdgeArrayArrayIterator Class
Autodesk.Revit.DB Namespace