Revit 2027 API
FaceEdgeNode Class
 An output node that represents a Face edge.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceEdgeNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceEdgeNode : FaceDetailNode
Public Class FaceEdgeNode
	Inherits FaceDetailNode
public ref class FaceEdgeNode : public FaceDetailNode
type FaceEdgeNode =
    class
        inherit FaceDetailNode
    end
The FaceEdgeNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetFaceEdge |  Returns the Face edge object corresponding to the node.
Top
Remarks
 See also: OnFaceEdge2D(FaceEdgeNode).
See Also
Reference
Autodesk.Revit.DB Namespace