Revit 2027 API
Categories Class
The Categories object is a map that contains all the top-level Category objects within the Document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CategoryNameMap
 Autodesk.Revit.DB.Categories
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Categories : CategoryNameMap
Public Class Categories
	Inherits CategoryNameMap
public ref class Categories : public CategoryNameMap
type Categories =
    class
        inherit CategoryNameMap
    end
The Categories type exposes the following members.
Properties
Name | Description
IsEmpty | Whether or not the list of top-level categories is empty.
(Overrides CategoryNameMap.IsEmpty)
Item[BuiltInCategory] |  Retrieves a category object corresponding to a BuiltInCategory id.
Item[String] | Gets a category which has the specified name from this list of top-level categories.
(Overrides CategoryNameMap.Item[String])
Size | The total number of top-level categories in the document.
(Overrides CategoryNameMap.Size)
Top
Methods
Name | Description
Contains | Identifies if a category which has the specified name is in the list of top-level categories.
(Overrides CategoryNameMap.Contains(String))
ForwardIterator | Retrieves a forward moving iterator to the map.
(Overrides CategoryNameMap.ForwardIterator())
GetEnumerator | Retrieves a forward moving iterator to the map.
(Overrides CategoryNameMap.GetEnumerator())
Insert | Inserts the specified category with the specified name into the map.
(Overrides CategoryNameMap.Insert(String, Category))
NewSubcategory | Add a new subcategory into the Autodesk Revit document.
ReverseIterator | Retrieves a backward moving iterator to the map.
(Overrides CategoryNameMap.ReverseIterator())
Top
Remarks
Use this object to retrieve categories by name or by BuiltInCategory id.
Example
// Get settings of current document
Settings documentSettings = document.Settings;
// Get all categories of current document
Categories groups = documentSettings.Categories;
// Show the number of all the categories to the user
String prompt = "Number of all categories in current Revit document:" + groups.Size;
// get Floor category according to OST_Floors and show its name
Category floorCategory = groups.get_Item(BuiltInCategory.OST_Floors);
prompt += floorCategory.Name;
// Give the user some information
TaskDialog.Show("Revit",prompt);
See Also
Reference
Autodesk.Revit.DB Namespace