Revit 2027 API
EndTreatmentType Properties
The EndTreatmentType type exposes the following members.
Properties
Name | Description
EndTreatment |  String describing the end treatment
Top
See Also
Reference
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace