Revit 2027 API
DataStorage Methods
The DataStorage type exposes the following members.
Methods
Name | Description
Create |  Creates a new DataStorage element and adds it to the document.
Top
See Also
Reference
DataStorage Class
Autodesk.Revit.DB.ExtensibleStorage Namespace