Revit 2027 API
FormulaEditingEventArgs Class
 The event arguments used by the DocumentSaving event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.FormulaEditingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FormulaEditingEventArgs : RevitAPIPreEventArgs
Public Class FormulaEditingEventArgs
	Inherits RevitAPIPreEventArgs
public ref class FormulaEditingEventArgs : public RevitAPIPreEventArgs
type FormulaEditingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The FormulaEditingEventArgs type exposes the following members.
Properties
Name | Description
CurrentDocument |  Returns the current document
Formula |  Returns text of the formula that will be modified
ParameterId |  Returns the Id of the modified parameter
Top
Methods
Name | Description
Apply |  Applies formula to the parameter
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace