Revit 2027 API
Hub Class
 Represents a connection between two or more Autodesk Revit Elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.Hub
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Hub : Element
Public Class Hub
	Inherits Element
public ref class Hub : public Element
type Hub =
    class
        inherit Element
    end
The Hub type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetHubConnectorManager |  Retrieves the ConnectorManager of the Hub.
GetOrigin |  Retrieves position of a Hub if such position is a 3D point.
GetPointId |  Returns ElementId of the associated Point element.
HasOrigin |  Provides information if Hub has a specific location at point in 3D space.
Top
Remarks
Elements connected via a Hub do not refer directly to each other - they each refer to the Hub that keeps all the connectivity information.
Hubs connect only structural Analytical Model Elements.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace