Revit 2027 API
ZoneEquipmentData Methods
The ZoneEquipmentData type exposes the following members.
Methods
Name | Description
Dispose
IsDataCompleted |  Is the required data completed for this zone equipment?
Top
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace