Revit 2027 API
ValueAtPointBase Class
 A base class representing storage of values at a given point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueAtPointBase
 Autodesk.Revit.DB.Analysis.ValueAtPoint
 Autodesk.Revit.DB.Analysis.VectorAtPoint
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ValueAtPointBase : IDisposable
Public Class ValueAtPointBase
	Implements IDisposable
public ref class ValueAtPointBase : IDisposable
type ValueAtPointBase =
    class
        interface IDisposable
    end
The ValueAtPointBase type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
ClearAllFlags |  Sets flags for all measurements to ValueAtPointFlags::None.
ClearFlagsAt |  Sets flags for the given measurement to ValueAtPointFlags::None.
Dispose | Releases all resources used by the ValueAtPointBase
GetFlags |  Returns flags for the given measurement.
SetFlags(IList<Int32>) |  Independently sets the flags associated to all measurements.
SetFlags(Int32) |  Sets the flags associated to all measurements to the same value.
SetFlags(Int32, Int32) |  Sets the flags associated to a given measurement.
Top
Remarks
 This class stores a set of measurements and corresponding mapped flags. The flags are defined in the enumerated type ValueAtPointFlags.
See Also
Reference
Autodesk.Revit.DB Namespace