Revit 2027 API
ContourSettingItem Methods
The ContourSettingItem type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ContourSettingItem Class
Autodesk.Revit.DB Namespace