Revit 2027 API
VertexPosition Properties
The VertexPosition type exposes the following members.
Properties
Name | Description
Position |  The vertex's position.
Top
See Also
Reference
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace