Revit 2027 API
MemberForcesServiceData Class
 The data needed by member forces server to perform type definition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.MemberForcesServiceData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MemberForcesServiceData : IDisposable
Public Class MemberForcesServiceData
	Implements IDisposable
public ref class MemberForcesServiceData : IDisposable
type MemberForcesServiceData =
    class
        interface IDisposable
    end
The MemberForcesServiceData type exposes the following members.
Properties
Name | Description
Document |  The current document.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MemberForcesServiceData
GetCurrentElements |  Returns the list of Ids of the current elements.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace