Revit 2027 API
CableTrayConduitRunBase Class
 The base class for a cable tray or conduit run in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase
 Autodesk.Revit.DB.Electrical.CableTrayRun
 Autodesk.Revit.DB.Electrical.ConduitRun
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTrayConduitRunBase : Element
Public Class CableTrayConduitRunBase
	Inherits Element
public ref class CableTrayConduitRunBase : public Element
type CableTrayConduitRunBase =
    class
        inherit Element
    end
The CableTrayConduitRunBase type exposes the following members.
Properties
Name | Description
Length |  The length of the whole (cable tray or conduit) run default 0.0
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace