Revit 2027 API
ComboBoxCurrentChangedEventArgs Class
The event arguments used by ComboBox's CurrentChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.UI.Events.RibbonItemEventArgs
 Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComboBoxCurrentChangedEventArgs : RibbonItemEventArgs
Public Class ComboBoxCurrentChangedEventArgs
	Inherits RibbonItemEventArgs
public ref class ComboBoxCurrentChangedEventArgs : public RibbonItemEventArgs
type ComboBoxCurrentChangedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
The ComboBoxCurrentChangedEventArgs type exposes the following members.
Properties
Name | Description
NewValue | The current item for the ComboBox after the change.
OldValue | The current item for the ComboBox before the change.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace