Revit 2027 API
Group Methods
The Group type exposes the following members.
Methods
Name | Description
GetAvailableAttachedDetailGroupTypeIds |  Returns the attached detail groups available for this group type.
GetMemberIds | Retrieves all the member ElementIds of the group.
GetShownAttachedDetailGroupTypeIds |  Returns the attached detail groups which have displayed instances for this group type in the input view.
HideAllAttachedDetailGroups |  Hides all the available attached detail groups for this element group type that are compatible with the input view type.
HideAttachedDetailGroups |  Hides the element group's attached detail groups of the input group type that are compatible with the input view.
IsCompatibleAttachedDetailGroupType |  Checks if the orientation of the input attached detail group matches the input view's orientation.
ShowAllAttachedDetailGroups |  Shows all the available attached detail groups for this element group type that are compatible with the input view type.
ShowAttachedDetailGroups |  Shows the element group's attached detail groups of the input group type that are compatible with the input view.
UngroupMembers | Ungroups the group.
Top
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace