Revit 2027 API
Gutter Properties
The Gutter type exposes the following members.
Properties
Name | Description
GutterType | Retrieves/set an object that represents the type of the Gutter.
Top
See Also
Reference
Gutter Class
Autodesk.Revit.DB.Architecture Namespace