Revit 2027 API
ParameterSet Properties
The ParameterSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of parameters that are in the set.
Top
See Also
Reference
ParameterSet Class
Autodesk.Revit.DB Namespace