Revit 2027 API
MEPFamilyConnectorInfo Class
 MEP family connector information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPConnectorInfo
 Autodesk.Revit.DB.MEPFamilyConnectorInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPFamilyConnectorInfo : MEPConnectorInfo
Public Class MEPFamilyConnectorInfo
	Inherits MEPConnectorInfo
public ref class MEPFamilyConnectorInfo : public MEPConnectorInfo
type MEPFamilyConnectorInfo =
    class
        inherit MEPConnectorInfo
    end
The MEPFamilyConnectorInfo type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetAssociateFamilyParameterId |  Gets the associate family parameter id of the specified connector parameter id.
GetConnectorParameterValue |  Gets the parameter value of the specified connector parameter id.
Top
See Also
Reference
Autodesk.Revit.DB Namespace