Revit 2027 API
Blend Class
A blend solid or void form.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Blend
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Blend : GenericForm
Public Class Blend
	Inherits GenericForm
public ref class Blend : public GenericForm
type Blend =
    class
        inherit GenericForm
    end
The Blend type exposes the following members.
Properties
Name | Description
BottomOffset | The offset of the bottom end of the blend relative to the sketch plane.
BottomProfile | The curves which make up the bottom profile of the sketch.
BottomSketch | Returns the Bottom Sketch of the Blend.
TopOffset | The offset of the top end of the blend relative to the sketch plane.
TopProfile | The curves which make up the top profile of the sketch.
TopSketch | Returns the Top Sketch of the Blend.
Top
Methods
Name | Description
GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles.
SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles.
Top
See Also
Reference
Autodesk.Revit.DB Namespace