Revit 2027 API
LinkNode Properties
The LinkNode type exposes the following members.
Properties
Name | Description
SymbolId |  Identifies the Id of the symbol associated with the node.
Top
See Also
Reference
LinkNode Class
Autodesk.Revit.DB Namespace