Revit 2027 API
StructuralSectionCProfileWithFold Class
 Defines parameters for C Profile with fold structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionCProfileWithFold : StructuralSectionGeneralCEx
Public Class StructuralSectionCProfileWithFold
	Inherits StructuralSectionGeneralCEx
public ref class StructuralSectionCProfileWithFold : public StructuralSectionGeneralCEx
type StructuralSectionCProfileWithFold =
    class
        inherit StructuralSectionGeneralCEx
    end
The StructuralSectionCProfileWithFold type exposes the following members.
Constructors
Name | Description
StructuralSectionCProfileWithFold |  Creates a new instance of Structural Section C Profile With Fold shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace