Revit 2027 API
DuctSizeSettings Class
 Duct sizes settings
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.DuctSizeSettings
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctSizeSettings : Element,
	IEnumerable<KeyValuePair<DuctShape, DuctSizes>>
Public Class DuctSizeSettings
	Inherits Element
	Implements IEnumerable(Of KeyValuePair(Of DuctShape, DuctSizes))
public ref class DuctSizeSettings : public Element,
	IEnumerable<KeyValuePair<DuctShape, DuctSizes^>>
type DuctSizeSettings =
    class
        inherit Element
        interface IEnumerable<KeyValuePair<DuctShape, DuctSizes>>
    end
The DuctSizeSettings type exposes the following members.
Properties
Name | Description
Item |  Get the DuctSizes for this DuctShape.
Top
Methods
Name | Description
AddSize |  Inserts a new MEPSize in to the duct size settings. The duct shape determines the location of the new size in the size table.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetDuctSizeSettingIterator | Returns a DuctSizeSettingIterator object that iterates through the collection.
GetDuctSizeSettings |  Get the duct size settings of the project.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetSizeCount |  Get the size count of the duct size table. The duct shape determines the location of the size in the size table.
RemoveSize |  Erase the existing MEPSize with this nominal diameter. The duct shape determines the location of the size in the size table.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace