Revit 2027 API
ScheduleSheetInstance Class
 An element that represents a particular placement of a schedule on a sheet.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ScheduleSheetInstance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ScheduleSheetInstance : Element
Public Class ScheduleSheetInstance
	Inherits Element
public ref class ScheduleSheetInstance : public Element
type ScheduleSheetInstance =
    class
        inherit Element
    end
The ScheduleSheetInstance type exposes the following members.
Properties
Name | Description
IsTitleblockRevisionSchedule |  Identifies if this ScheduleSheetInstance is a revision schedule in a titleblock family.
Point |  Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Rotation |  Rotation of the ScheduleInstance.
ScheduleId |  Id of the primary schedule that generates this ScheduleInstance.
SegmentIndex |  The schedule segment index of this ScheduleSheetInstance.
Top
Methods
Name | Description
Create(Document, ElementId, ElementId, XYZ) |  Create an instance of a schedule on a sheet.
Create(Document, ElementId, ElementId, XYZ, Int32) |  Creates an instance of a schedule segment on a sheet.
Top
Remarks
 Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
 When a schedule is set to filter by sheet and placed on a sheet, it will create a new schedule with elements visible in the Viewport(s) on that sheet. The instance created belongs to the newly created schedule.
See Also
Reference
Autodesk.Revit.DB Namespace