Revit 2027 API
StructuralSectionSigmaProfile Properties
The StructuralSectionSigmaProfile type exposes the following members.
Properties
Name | Description
BendWidth |  Bend segment width.
MiddleBendLength |  Middle Bend segment length.
TopBendLength |  Top Bend segment length.
Top
See Also
Reference
StructuralSectionSigmaProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace