Revit 2027 API
DividedPath Properties
The DividedPath type exposes the following members.
Properties
Name | Description
BeginningIndent |  The beginningIndent is an offset distance from the beginning of the first curve that determines the beginning of the range over which the layout is applied. The measurement type determines how the distance is measured.
DisplayNodeNumbers |  Controls whether the node numbers are shown when the divided path is selected
DisplayNodes |  Controls whether the points of the divided path are visible
DisplayReferenceCurves |  Controls whether the curves in the path are visible
Distance |  The distance between points that are distributed along the path according to the selected layout. When the layout is set to 'FixedDistance' this value can be set to desired distance. The measurement type determines how the distance is measured.
EndIndent |  The endIndent is an offset distance from the end of the last curve that determines the end of the range over which the layout is applied. The measurement type determines how the distance is measured.
FixedNumberOfPoints |  The number of points used when the layout is set to 'FixedNumber'.
Flipped |  If the divided path is flipped the nodes are numbered in the reverse order. It also switches the ends from which beginningIndent and endIndent are measured from.
IsClosedLoop |  Whether or not the path forms a closed loop.
IsCyclical |  True if the first and last point coincide False otherwise.
MaximumDistance |  The maximum distance is used when the layout is set to 'MaximumSpacing'. When that layout rule is used the distance between points will not exceed this value. The measurement type determines how the distance is measured.
MeasurementType |  The measurement type determines how distances are calculated. Either along a straight line between two points ('ChordLength') or along the segment of the path that connects them. ('SegmentLength').
MinimumDistance |  The minimum distance is used when the layout is set to 'MinimumSpacing'. When that layout rule is used the distance between points will not fall below this value. The measurement type determines how the distance is measured.
NumberOfPoints |  The total number of points of the divided surface. This combines the layout points and the intersection points.
SpacingRuleJustification |  When the layout is set to 'FixedDistance' the points may not cover the entire range of the path. The justification determines whether the points are centered on the range, or shifted towards the start or end of the range.
SpacingRuleLayout |  The layout determines how points are distributed along the path.
TotalPathLength |  The sum of the curve lengths.
Top
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace