Revit 2027 API
TextElement Methods
The TextElement type exposes the following members.
Methods
Name | Description
GetMaximumAllowedWidth() |  Returns the maximum width the text element can be assigned.
GetMaximumAllowedWidth(Document, ElementId) |  Returns the maximum width the text element can be created with.
GetMinimumAllowedWidth() |  Returns the minimum width the text element can be assigned.
GetMinimumAllowedWidth(Document, ElementId) |  Returns the minimum width a text element can be created with.
Top
See Also
Reference
TextElement Class
Autodesk.Revit.DB Namespace