Revit 2027 API
RoomTagType Class
An object that represents a Room Tag type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.Architecture.RoomTagType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoomTagType : FamilySymbol
Public Class RoomTagType
	Inherits FamilySymbol
public ref class RoomTagType : public FamilySymbol
type RoomTagType =
    class
        inherit FamilySymbol
    end
The RoomTagType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace