Revit 2027 API
AssetPropertyUInt64 Properties
The AssetPropertyUInt64 type exposes the following members.
Properties
Name | Description
Value | Get the value of the property.
Top
See Also
Reference
AssetPropertyUInt64 Class
Autodesk.Revit.DB.Visual Namespace