Revit 2027 API
FabricWireItem Methods
The FabricWireItem type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a single Fabric wire.
Dispose
Top
See Also
Reference
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace