Revit 2027 API
FabricRoundingManager Class
 Provides access to element reinforcement roundings overrides.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
 Autodesk.Revit.DB.Structure.FabricRoundingManager
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricRoundingManager : ReinforcementRoundingManager
Public Class FabricRoundingManager
	Inherits ReinforcementRoundingManager
public ref class FabricRoundingManager : public ReinforcementRoundingManager
type FabricRoundingManager =
    class
        inherit ReinforcementRoundingManager
    end
The FabricRoundingManager type exposes the following members.
Properties
Name | Description
ApplicableReinforcementRoundingSource |  Identifies the source of the rounding settings for this element.
ApplicableSegmentLengthRounding |  The applicable rounding for fabric segments.
ApplicableSegmentLengthRoundingMethod |  The applicable rounding method for fabric segments.
ApplicableTotalLengthRounding |  The applicable rounding for Cut Overall Length and Cut Overall Width parameters.
ApplicableTotalLengthRoundingMethod |  The applicable rounding method for Cut Overall Length and Cut Overall Width parameters.
SegmentLengthRounding |  The rounding for fabric segments.
SegmentLengthRoundingMethod |  Identifies the segment length rounding method
TotalLengthRounding |  The rounding for Cut Overall Length and Cut Overall Width parameters.
TotalLengthRoundingMethod |  Identifies the total length rounding method
Top
Methods
Name | Description
Top
Remarks
 An instance of this class can be obtained from specific FabricSheetType or individual FabricSheet or FabricArea elements to apply overrides different from the global settings for the project.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace