Revit 2027 API
AddInIdAttribute Properties
The AddInIdAttribute type exposes the following members.
Properties
Name | Description
Value | AddInId guid value.
Top
See Also
Reference
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace