Revit 2027 API
FaceSecondDerivatives Class
 Contains second partial derivatives of a face at a specified point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FaceSecondDerivatives
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceSecondDerivatives : IDisposable
Public Class FaceSecondDerivatives
	Implements IDisposable
public ref class FaceSecondDerivatives : IDisposable
type FaceSecondDerivatives =
    class
        interface IDisposable
    end
The FaceSecondDerivatives type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MixedDerivative |  The mixed derivative.
UUDerivative |  The second derivative with respect to U.
VVDerivative |  The second derivative with respect to V.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FaceSecondDerivatives
Top
See Also
Reference
Autodesk.Revit.DB Namespace