Revit 2027 API
SlabShapeVertex Methods
The SlabShapeVertex type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SlabShapeVertex Class
Autodesk.Revit.DB Namespace