Revit 2027 API
AssetPropertyFloat Methods
The AssetPropertyFloat type exposes the following members.
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
AssetPropertyFloat Class
Autodesk.Revit.DB.Visual Namespace