Revit 2027 API
PipingSystem Class
 A piping system element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MEPSystem
 Autodesk.Revit.DB.Plumbing.PipingSystem
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipingSystem : MEPSystem
Public Class PipingSystem
	Inherits MEPSystem
public ref class PipingSystem : public MEPSystem
type PipingSystem =
    class
        inherit MEPSystem
    end
The PipingSystem type exposes the following members.
Properties
Name | Description
BaseEquipmentConnector | The connector within base equipment which is used to connect with system.
IsWellConnected |  Indicates if the system is well connected or not.
PipingNetwork |  Pipes and fittings which are contained in this system.
SystemType | The type of this piping system.
Top
Methods
Name | Description
CanBeHydraulicLoopBoundary |  Checks if the element can be used as a hydraulic loop boundary.
Create(Document, ElementId) |  Creates a new instance of a piping system and adds it to the document.
Create(Document, ElementId, String) |  Creates a new instance of a piping system and adds it to the document.
CreateHydraulicSeparation |  Creates new system which is hydraulically separated from the existing system.
DeleteHydraulicSeparation |  Deletes hydraulically separated systems and merges the system components into the connected system.
GetFixtureUnits |  Gets the fixture units of this piping system.
GetFlow |  Gets the flow of this piping system.
GetPumpSets |  Gets the set of element Id's for all pump sets in the system, if any.
GetStaticPressure |  Gets the static pressure of this piping system.
GetVolume |  Gets the volume of this piping system.
IsFlowServerMissing |  Indicates if any flow server which was used in the piping system is not available.
IsHydraulicLoopBoundary |  Checks if the element is a valid hydraulic loop boundary.
IsPressureDropServerMissing |  Indicates if any pressure drop server which was used in the piping system is not available.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace