Revit 2027 API
DocumentSavedAsEventArgs Class
 The event arguments used by the DocumentSavedAs event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSavedAsEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentSavedAsEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentSavedAsEventArgs : public RevitAPIPostDocEventArgs
type DocumentSavedAsEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentSavedAsEventArgs type exposes the following members.
Properties
Name | Description
IsSavingAsCentralFile |  Indicates whether the document is to be saved as central file.
OriginalPath |  Original path of the document.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace