Revit 2027 API
ApplicationException Methods
The ApplicationException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides Exception.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ApplicationException Class
Autodesk.Revit.Exceptions Namespace