Revit 2027 API
CableTrayConduitBase Methods
The CableTrayConduitBase type exposes the following members.
Methods
Name | Description
IsValidEndPoints |  Identifies if two end points are valid.
IsValidLevelId |  Identifies if a level id is valid.
IsWithFitting |  Return whether its cable tray/conduit type is with fitting
Top
See Also
Reference
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace