Revit 2027 API
WallType Properties
The WallType type exposes the following members.
Properties
Name | Description
Function |  The wall function.
Kind |  The nature of the wall.
ThermalProperties |  The calculated and settable thermal properties of the WallType
Width |  The overall thickness of this type of wall.
Top
See Also
Reference
WallType Class
Autodesk.Revit.DB Namespace