Revit 2027 API
BeamSystemType Class
An object that specifies the type of a beam system in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.BeamSystemType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BeamSystemType : ElementType
Public Class BeamSystemType
	Inherits ElementType
public ref class BeamSystemType : public ElementType
type BeamSystemType =
    class
        inherit ElementType
    end
The BeamSystemType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace