Revit 2027 API
WireSet Methods
The WireSet type exposes the following members.
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains
Erase
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
WireSet Class
Autodesk.Revit.DB.Electrical Namespace