Revit 2027 API
VoltageType Class
Represents electrical voltage type. An electrical voltage type define a range of voltages, and circuits can be created between components with rated voltages that do not precisely match the voltage definition value.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.VoltageType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VoltageType : ElementType
Public Class VoltageType
	Inherits ElementType
public ref class VoltageType : public ElementType
type VoltageType =
    class
        inherit ElementType
    end
The VoltageType type exposes the following members.
Properties
Name | Description
ActualValue |  Get actual voltage value of this voltage definition, the unit is volt.
IsInUse |  Indicates whether this voltage type is in service now, such as by other distribution system.
MaxValue |  Get upper boundary of voltage value of this voltage definition, the unit is volt.
MinValue |  Get lower boundary of voltage value of this voltage definition, the unit is volt.
Top
Methods
Name | Description
SetVoltageValue |  Assign new values to modify voltage type, all of the unit are volt.
Top
Remarks
Actual, minimum and maximum value of voltage type can retrieved through properties, but only can be modified through SetVoltageValue method. All the unit of voltage properties in this class is volt.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace