Revit 2027 API
StructuralConnectionSettings Properties
The StructuralConnectionSettings type exposes the following members.
Properties
Name | Description
IncludeWarningControls |  This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed.
Top
See Also
Reference
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace