Revit 2027 API
FabricationServiceSettings Methods
The FabricationServiceSettings type exposes the following members.
Methods
Name | Description
GetFabricationServiceSettings |  Gets the settings element in the document.
GetFluidTemperature |  Gets the fluid temperature of the specified service.
GetFluidType |  Gets the fluid type of the specified service.
HasValidFluidSetting |  Is the service associated with a fluid type and temperature?
RemoveFluidSetting |  Clears the fluid setting of the specified service if found.
SetFluidTypeAndTemperature |  Sets the fluid type and temperature of the specified service.
Top
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace