Revit 2027 API
IFCLinkDocumentExportScope Methods
The IFCLinkDocumentExportScope type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace