Revit 2027 API
NotTransmittedModelException Class
The exception thrown when OpenOptions were provided to deal with a transmitted model, but the model is not transmitted.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.NotTransmittedModelException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class NotTransmittedModelException : InvalidOperationException
<SerializableAttribute>
Public Class NotTransmittedModelException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class NotTransmittedModelException : public InvalidOperationException
[<SerializableAttribute>]
type NotTransmittedModelException =
    class
        inherit InvalidOperationException
    end
The NotTransmittedModelException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace