Revit 2027 API
StructuralSectionGeneralC Class
 Defines parameters for Channel Cold Formed shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralC : StructuralSectionColdFormed
Public Class StructuralSectionGeneralC
	Inherits StructuralSectionColdFormed
public ref class StructuralSectionGeneralC : public StructuralSectionColdFormed
type StructuralSectionGeneralC =
    class
        inherit StructuralSectionColdFormed
    end
The StructuralSectionGeneralC type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralC |  Creates a new instance of general Channel Cold Formed shape.
Top
Properties
Name | Description
LipLength |  Lip segment length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace