Revit 2027 API
HorizontalCurveEndpoint Class
 Represents an endpoint (start or end) of a horizontal curve in Alignment geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HorizontalCurveEndpoint
Public Class HorizontalCurveEndpoint
public ref class HorizontalCurveEndpoint
type HorizontalCurveEndpoint = class end
The HorizontalCurveEndpoint type exposes the following members.
Properties
Name | Description
NextCurveType |  The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type.
PreviousCurveType |  The HorizontalCurveType of the curve which connects the endpoint to the previous displayed curve. If this endpoint's Station equals DisplayedStartStation, returns Unknown curve type.
Station |  The endpoint's station value.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Infrastructure Namespace