Revit 2027 API
DimensionType Properties
The DimensionType type exposes the following members.
Properties
Name | Description
AlternateUnits |  The alternate units display mode for this DimensionType.
AlternateUnitsPrefix |  The prefix text for the alternate units value.
AlternateUnitsSuffix |  The suffix text for the alternate units value.
Prefix |  The prefix text for the dimension value.
StyleType |  The dimension style type of this DimensionType.
Suffix |  The suffix text for the dimension value.
Top
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace