Revit 2027 API
RoutingCondition Class
 RoutingCondition represents routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingCondition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoutingCondition : IDisposable
Public Class RoutingCondition
	Implements IDisposable
public ref class RoutingCondition : IDisposable
type RoutingCondition =
    class
        interface IDisposable
    end
The RoutingCondition type exposes the following members.
Constructors
Name | Description
RoutingCondition |  Creates a new RoutingCondition.
Top
Properties
Name | Description
Diameter |  The diameter of the segment or fitting specified for the routing condition.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RoutingCondition
Top
See Also
Reference
Autodesk.Revit.DB Namespace