Revit 2027 API
FabricationItemFile Methods
The FabricationItemFile type exposes the following members.
Methods
Name | Description
Dispose
GetImage | Gets the image for the fabrication item file.
IsLoaded |  Checks to see if the item file has been loaded into the configuration.
IsValid |  Checks to see if the item file is valid.
Top
See Also
Reference
FabricationItemFile Class
Autodesk.Revit.DB Namespace