Revit 2027 API
AssemblyDifference Methods
The AssemblyDifference type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
AssemblyDifference Class
Autodesk.Revit.DB Namespace