Revit 2027 API
DWGImportOptions Methods
The DWGImportOptions type exposes the following members.
Methods
Name | Description
GetLineWeights |  Gets array of line weights.
SetLineWeights |  Set array of line weights.
Top
See Also
Reference
DWGImportOptions Class
Autodesk.Revit.DB Namespace