Revit 2027 API
StdPostedWarning Class
 Support for Reviewable Warnings sent from AddOn.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.StdPostedWarning
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StdPostedWarning : IDisposable
Public Class StdPostedWarning
	Implements IDisposable
public ref class StdPostedWarning : IDisposable
type StdPostedWarning =
    class
        interface IDisposable
    end
The StdPostedWarning type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the StdPostedWarning
Top
Remarks
 Used to create and send Reviewable Warning from AddOn.
See Also
Reference
Autodesk.Revit.DB Namespace