Revit 2027 API
PipingSystem Properties
The PipingSystem type exposes the following members.
Properties
Name | Description
BaseEquipmentConnector | The connector within base equipment which is used to connect with system.
IsWellConnected |  Indicates if the system is well connected or not.
PipingNetwork |  Pipes and fittings which are contained in this system.
SystemType | The type of this piping system.
Top
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace