Revit 2027 API
PipingSystemType Properties
The PipingSystemType type exposes the following members.
Properties
Name | Description
FlowConversionMethod |  The flow conversion method for the piping system type.
FluidTemperature |  Fluid Temperature, in Kelvin.
FluidType |  Fluid Type
SingleLineBendDropType |  Symbol for a 1 line drop
SingleLineBendRiseType |  Symbol for a 1 line rise
SingleLineJunctionDropType |  Symbol for a 1 line junction drop
SingleLineJunctionRiseType |  Symbol for a 1 line junction rise
TwoLineDropType |  Symbol for a 2 line drop
TwoLineRiseType |  Symbol for a 2 line rise
Top
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace