Revit 2027 API
CableTrayType Properties
The CableTrayType type exposes the following members.
Properties
Name | Description
BendMultiplier |  Bend multiplier.
IsWithFitting |  Whether this cable tray type is with fitting
ShapeType |  Shape of this cable tray type.
Top
See Also
Reference
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace