Revit 2027 API
HasValueFilterRule Class
 Tests whether an element's parameter has a value.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.ParameterValuePresenceRule
 Autodesk.Revit.DB.HasValueFilterRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HasValueFilterRule : ParameterValuePresenceRule
Public Class HasValueFilterRule
	Inherits ParameterValuePresenceRule
public ref class HasValueFilterRule : public ParameterValuePresenceRule
type HasValueFilterRule =
    class
        inherit ParameterValuePresenceRule
    end
The HasValueFilterRule type exposes the following members.
Constructors
Name | Description
HasValueFilterRule |  constructs an instance of HasValueFilterRule.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace