Revit 2027 API
BeamSystem Class
 An object that represents a BeamSystem within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.BeamSystem
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BeamSystem : Element
Public Class BeamSystem
	Inherits Element
public ref class BeamSystem : public Element
type BeamSystem =
    class
        inherit Element
    end
The BeamSystem type exposes the following members.
Properties
Name | Description
BeamSystemType | Retrieves or changes the type of the BeamSystem.
BeamType | Retrieves or changes the Beam Type of the BeamSystem.
Direction | The Direction of the BeamSystem.
Elevation | Retrieves or changes the Elevation of the BeamSystem.
LayoutRule | Retrieves or changes the LayoutRule of the BeamSystem.
Level | Get or change the level of the BeamSystem. When the level is changed, the elevation is changed to make the the BeamSystem remain the location.
Profile | Retrieve or set the profile of the BeamSystem.
Top
Methods
Name | Description
BeamBelongsTo | Find out the BeamSystem to which the beam belongs.
Create(Document, IList<Curve>, SketchPlane, Int32) |  Creates a 2D BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, XYZ, Boolean) |  Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, Int32, Boolean) |  Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, SketchPlane, XYZ, Boolean) |  Creates a new BeamSystem with specified profile curves.
DropBeamSystem | Drop beam system, it will disassociate all members from the beam system and delete the beam system.
GetBeamIds | Gets all the beams of the BeamSystem.
Top
Remarks
 This object is derived from the Element base object. It can be used to access properties of a BeamSystem, such as elevation, level, etc. It also provides access to the beams (FamilyInstances) that are created by this BeamSystem.
Example
public void GetInfo_BeamSystem(BeamSystem beamSystem)
{
    string message = "BeamSystem : ";
    // Get BeamSystem family name
    message += "\nBeamSystem Direction is:(" + beamSystem.Direction.X + ", "
        + beamSystem.Direction.Y + ", " + beamSystem.Direction.Z + ")";
    // Get BeamSystem elevation
    message += "\nBeamSystem elevation is: " + beamSystem.Elevation;
    Document document = beamSystem.Document;
    ICollection<ElementId> beamIds = beamSystem.GetBeamIds();
    foreach (ElementId beamId in beamIds)
    {
        Element beam = document.GetElement(beamId);
        // Get Beam name
        message += "\nBeam name: " + beam.Name;
    }
    // Get BeamSystem layout rule
    message += "\nBeamSystem layout rule is: " + beamSystem.LayoutRule;
    // Get BeamSystem level name
    message += "\nBeamSystem level name is: " + beamSystem.Level.Name;
    message += "\nBeamSystem Profile: " + beamSystem.Level.Name;
    foreach (Autodesk.Revit.DB.Curve curve in beamSystem.Profile)
    {
        // Get curve start point
        message += "\nCurve start point:(" + curve.GetEndPoint(0).X + ", "
             + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
        // Get curve end point
        message += "; Curve end point:(" + curve.GetEndPoint(1).X + ", "
             + curve.GetEndPoint(1).Y + ", " + curve.GetEndPoint(1).Z + ")";
    }
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace