Revit 2027 API
TrussType Class
Represents a specific type of truss.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.Structure.TrussType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TrussType : FamilySymbol
Public Class TrussType
	Inherits FamilySymbol
public ref class TrussType : public FamilySymbol
type TrussType =
    class
        inherit FamilySymbol
    end
The TrussType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace