Revit 2027 API
PanelScheduleSheetInstance Methods
The PanelScheduleSheetInstance type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of panel schedule on sheet and adds it to the document.
GetSchedule |  Gets the panel schedule view.
SplitSegment |  Split the panel schedule into Thrown if the index is out of bounds.
Top
See Also
Reference
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace