Revit 2027 API
Stairs Methods
The Stairs type exposes the following members.
Methods
Name | Description
GetAssociatedRailings |  Gets a list of the Railing elements which are associated to the boundaries of the stairs.
GetStairsLandings |  Returns all the stairs landing components in the stairs.
GetStairsRuns |  Returns all the stairs run components in the stairs.
GetStairsSupports |  Returns all the stairs support components in the stairs.
IsByComponent |  Indicates if the stairs is created by stairs components(runs, landings and supports).
IsInEditMode |  Indicates whether the stairs is in edit mode or not.
Top
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace