Revit 2027 API
IFCFileWriteOptions Methods
The IFCFileWriteOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace