Revit 2027 API
RebarShapeConstraint180DegreeBendRadius Properties
The RebarShapeConstraint180DegreeBendRadius type exposes the following members.
Properties
Name | Description
ArcReferenceType |  A choice of rule for measuring the radius.
Top
See Also
Reference
RebarShapeConstraint180DegreeBendRadius Class
Autodesk.Revit.DB.Structure Namespace