Revit 2027 API
ModificationForbiddenException Methods
The ModificationForbiddenException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ModificationForbiddenException Class
Autodesk.Revit.Exceptions Namespace