Revit 2027 API
BuildingPadType Methods
The BuildingPadType type exposes the following members.
Methods
Name | Description
CreateDefault |  Creates a BuildingPadType element and adds it to the document.
Top
See Also
Reference
BuildingPadType Class
Autodesk.Revit.DB Namespace