Revit 2027 API
VertexPositionNormal Properties
The VertexPositionNormal type exposes the following members.
Properties
Name | Description
Normal |  The vertex's normal vector.
Position |  The vertex's position.
Top
See Also
Reference
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace