Revit 2027 API
ModelCurveArray Properties
The ModelCurveArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a model curve at a specified index within the array.
Size | Returns the number of model curves that are in the array.
Top
See Also
Reference
ModelCurveArray Class
Autodesk.Revit.DB Namespace