Revit 2027 API
PipeFittingAndAccessoryPressureDropUIData Class
 The input and output data used by external UI servers for storing UI settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeFittingAndAccessoryPressureDropUIData : IDisposable
Public Class PipeFittingAndAccessoryPressureDropUIData
	Implements IDisposable
public ref class PipeFittingAndAccessoryPressureDropUIData : IDisposable
type PipeFittingAndAccessoryPressureDropUIData =
    class
        interface IDisposable
    end
The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipeFittingAndAccessoryPressureDropUIData
GetUIDataItems |  Gets all UI data items stored in the UI data.
GetUnits |  Gets units.
Top
See Also
Reference
Autodesk.Revit.UI.Plumbing Namespace