Revit 2027 API
RevitServerInternalException Class
The exception that is thrown when there is any server internal error happening.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerInternalException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerInternalException : RevitServerException
<SerializableAttribute>
Public Class RevitServerInternalException
	Inherits RevitServerException
[SerializableAttribute]
public ref class RevitServerInternalException : public RevitServerException
[<SerializableAttribute>]
type RevitServerInternalException =
    class
        inherit RevitServerException
    end
The RevitServerInternalException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace