Revit 2027 API
IndexPoint Methods
The IndexPoint type exposes the following members.
Methods
Name | Description
GetSizeInShortInts |  Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Top
See Also
Reference
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace