Revit 2027 API
CircleLightShape Class
 This class encapsulates a circle light shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightShape
 Autodesk.Revit.DB.Lighting.CircleLightShape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CircleLightShape : LightShape
Public Class CircleLightShape
	Inherits LightShape
public ref class CircleLightShape : public LightShape
type CircleLightShape =
    class
        inherit LightShape
    end
The CircleLightShape type exposes the following members.
Constructors
Name | Description
CircleLightShape() |  Creates a circle light shape object with 2.0' emit diameter.
CircleLightShape(CircleLightShape) |  Creates a copy of the given circle light shape
CircleLightShape(Double) |  Creates a circle light shape object with the given emit diameter.
Top
Properties
Name | Description
EmitDiameter |  The emit diameter.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace