Revit 2027 API
FluidType Class
 Has been extended to provide read and write access to a collection of FluidTemperature objects which represent the fluid's properties at various temperatures.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Plumbing.FluidType
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FluidType : ElementType, IEnumerable<FluidTemperature>
Public Class FluidType
	Inherits ElementType
	Implements IEnumerable(Of FluidTemperature)
public ref class FluidType : public ElementType,
	IEnumerable<FluidTemperature^>
type FluidType =
    class
        inherit ElementType
        interface IEnumerable<FluidTemperature>
    end
The FluidType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddTemperature |  Adds a fluid temperature to the set.
ClearAllTemperatures |  Clears all fluid temperatures in the set.
Create(Document, String) |  Creates a new empty fluid type and adds it to the document.
Create(Document, String, FluidType) |  Creates a new fluid type and adds it to the document.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetFluidTemperatureSetIterator | Returns a FluidTemperatureSetIterator that iterates through the collection.
GetFluidType |  Gets a fluid type by name.
GetTemperature |  Gets a copy of the FluidTemperature object matching a given temperature value.
IsFluidInUse |  Identifies if the fluid type is in use.
RemoveTemperature |  Removes a fluid temperature via the temperature value from the set.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace