Revit 2027 API
LinkElementId Class
 LinkElementId represents an element in a linked document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkElementId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkElementId
Public Class LinkElementId
public ref class LinkElementId
type LinkElementId = class end
The LinkElementId type exposes the following members.
Constructors
Name | Description
LinkElementId(ElementId) |  Creates a new LinkElementId representing an element in the host document.
LinkElementId(ElementId, ElementId) |  Creates a new LinkElementId representing an element in a linked document.
Top
Properties
Name | Description
HostElementId |  The id of the element in the host, or invalidElementId if there is a link.
LinkedElementId |  The id of the element in the link, or invalidElementId if no link.
LinkInstanceId |  The id of the link, or invalidElementId if no link.
Top
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
Top
Operators
Name | Description
Equality(LinkElementId, LinkElementId) | Determines whether these two LinkElementIds are the same.
Inequality(LinkElementId, LinkElementId) | Determines whether these two LinkElementIds are different.
Top
Remarks
 The id contains two element ids:
The id of the linked model element in host document.
The id of the element in the linked model document.
See Also
Reference
Autodesk.Revit.DB Namespace