Revit 2027 API
ApplicationException Properties
The ApplicationException type exposes the following members.
Properties
Name | Description
FunctionId | The information of the function throwing the exception.
Top
See Also
Reference
ApplicationException Class
Autodesk.Revit.Exceptions Namespace