Revit 2027 API
FabricationOptionDefinition Class
 Represents a single fabrication pattern option definition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationOptionDefinition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationOptionDefinition : IDisposable
Public Class FabricationOptionDefinition
	Implements IDisposable
public ref class FabricationOptionDefinition : IDisposable
type FabricationOptionDefinition =
    class
        interface IDisposable
    end
The FabricationOptionDefinition type exposes the following members.
Properties
Name | Description
IsModifiable |  Checks if the fabrication option is modifiable by user.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  Fabrication option name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationOptionDefinition
Top
See Also
Reference
Autodesk.Revit.DB Namespace