Revit 2027 API
OBJExportOptions Properties
The OBJExportOptions type exposes the following members.
Properties
Name | Description
GridAspectRatio |  The maximum aspect ratio allowed in the grid placed across the face. The minimum allowed value is 1.0. The maximum allowed value is 10.0. By default this property is ignored.
MaxEdgeLength |  The maximum length allowed for any chord on an edge or between any two adjacent grid lines. This is a percentage value. By exporting, the real value of maximum edge length is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.1%. The maximum allowed value is 10.0%. By default this property is ignored.
NormalTolerance |  The maximum change in the surface normal between adjacent nodes in the mesh. This property is defined in degrees. The minimum allowed value is 1.0 degrees. The maximum allowed value is 45.0 degrees. Default value is 15.0 degrees.
SurfaceTolerance |  The maximum distance between mesh triangles and model geometry. This is a percentage value. By exporting, the real value of surface tolerance is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.001%. The maximum allowed value is 1.0%. Default value is 0.1%.
TargetUnit |  The unit type of geometry in the resultant OBJ file. Default value is ExportUnit::Default.
Top
See Also
Reference
OBJExportOptions Class
Autodesk.Revit.DB Namespace