Revit 2027 API
RibbonButtonOptions Methods
The RibbonButtonOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace