Revit 2027 API
CutMarkType Class
 An object represents the cut mark type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.CutMarkType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CutMarkType : ElementType
Public Class CutMarkType
	Inherits ElementType
public ref class CutMarkType : public ElementType
type CutMarkType =
    class
        inherit ElementType
    end
The CutMarkType type exposes the following members.
Properties
Name | Description
CutLineAngle |  The rotation angle of the cut mark.
CutLineDistance |  The distance between 2 cut lines.
CutLineExtension |  The extension distance to the boundary.
CutLineType |  The cut line type of the cut mark.
CutMarkSymbol |  The symbol type of the cut mark.
CutMarkSymbolSize |  The size of the cut mark symbol.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace