Revit 2027 API
IFCFile Class
 Represents the IFC file which is being created during export.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCFile
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCFile : IDisposable
Public Class IFCFile
	Implements IDisposable
public ref class IFCFile : IDisposable
type IFCFile =
    class
        interface IDisposable
    end
The IFCFile type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Close |  Close the IFC file.
Create |  Creates an IFC file for exporting.
CreateHeaderInstance |  Creates an IFC header instance in the file model.
CreateInstance |  Creates an IFC instance in the file model.
CreateStyle(ExporterIFC, IFCAnyHandle) |  Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
CreateStyle(ExporterIFC, IFCAnyHandle, Color, ElementId) |  Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
Dispose | Releases all resources used by the IFCFile
GetInstanceCount |  Counts IFC instances of one particular type.
GetInstances |  Gets IFC instances of one particular type.
Read(IFCFileReadOptions) |  Reads content from a file of IFC format.
Read(IFCFileReadOptions, Int32, Int32) |  Reads content from a file of IFC format.
Write |  Writes content to a file of IFC format.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace