Revit 2027 API
AngularDimension Class
 An object that represents an Angular Dimension within the Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.AngularDimension
 Autodesk.Revit.DB.ArcLengthDimension
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AngularDimension : Dimension
Public Class AngularDimension
	Inherits Dimension
public ref class AngularDimension : public Dimension
type AngularDimension =
    class
        inherit Dimension
    end
The AngularDimension type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of an Angular Dimension element within the project.
SetAngularRadius |  Set radius of an Angular Dimension arc. The new radius of the arc.
Top
See Also
Reference
Autodesk.Revit.DB Namespace