Revit 2027 API
WorksetKindFilter Class
 A filter used to match worksets of the given WorksetKind.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetFilter
 Autodesk.Revit.DB.WorksetKindFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksetKindFilter : WorksetFilter
Public Class WorksetKindFilter
	Inherits WorksetFilter
public ref class WorksetKindFilter : public WorksetFilter
type WorksetKindFilter =
    class
        inherit WorksetFilter
    end
The WorksetKindFilter type exposes the following members.
Constructors
Name | Description
WorksetKindFilter(WorksetKind) |  Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
WorksetKindFilter(WorksetKind, Boolean) |  Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
Top
Properties
Name | Description
WorksetKind |  The WorksetKind.
Top
Methods
Name | Description
Top
Remarks
 This filter is a quick filter.
See Also
Reference
Autodesk.Revit.DB Namespace