Revit 2027 API
IPipeFittingAndAccessoryPressureDropUIServer Methods
The IPipeFittingAndAccessoryPressureDropUIServer type exposes the following members.
Methods
Name | Description
GetDBServerId |  Returns the Id of the corresponding DB server for which this server provides an optional UI.
ShowSettings |  Shows the settings UI.
Top
See Also
Reference
IPipeFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Plumbing Namespace