Revit 2027 API
PhotometricWebLightDistribution Class
 This class encapsulates a photometric web light distribution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PhotometricWebLightDistribution : LightDistribution
Public Class PhotometricWebLightDistribution
	Inherits LightDistribution
public ref class PhotometricWebLightDistribution : public LightDistribution
type PhotometricWebLightDistribution =
    class
        inherit LightDistribution
    end
The PhotometricWebLightDistribution type exposes the following members.
Constructors
Name | Description
PhotometricWebLightDistribution(PhotometricWebLightDistribution) |  Creates a copy of the given photometric web light distribution
PhotometricWebLightDistribution(String, Double) |  Creates a photometric web light distribution object with the given filename and tilt.
Top
Properties
Name | Description
PhotometricWebFile |  The filename of an IES photometric web file.
TiltAngle |  The tilt angle.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace