Revit 2027 API
LightShape Class
 This class is the base class for specifying light shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightShape
 Autodesk.Revit.DB.Lighting.CircleLightShape
 Autodesk.Revit.DB.Lighting.LineLightShape
 Autodesk.Revit.DB.Lighting.PointLightShape
 Autodesk.Revit.DB.Lighting.RectangleLightShape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LightShape : IDisposable
Public Class LightShape
	Implements IDisposable
public ref class LightShape : IDisposable
type LightShape =
    class
        interface IDisposable
    end
The LightShape type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Clone |  Creates a copy of the LightShape derived object.
Dispose | Releases all resources used by the LightShape
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace