Revit 2027 API
RebarShapeMultiplanarDefinition Methods
The RebarShapeMultiplanarDefinition type exposes the following members.
Methods
Name | Description
Dispose
SetPresenceOfSegments |  Simultaneously set the presence of all 3D segments.
Top
See Also
Reference
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace