Revit 2027 API
ExecutedEventArgs Class
The event arguments used by AddInCommandBinding's Executed event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.ExecutedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExecutedEventArgs : CommandEventArgs
Public Class ExecutedEventArgs
	Inherits CommandEventArgs
public ref class ExecutedEventArgs : public CommandEventArgs
type ExecutedEventArgs =
    class
        inherit CommandEventArgs
    end
The ExecutedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetJournalData |  Gets the journal data associated to this command (on journal playback).
SetJournalData |  Sets the journal data associated to this command (on journal playback).
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace