Revit 2027 API
RebarSpliceGeometry Class
 This class consists of a vector and a point which will be projected to the nearest Rebar curve.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarSpliceGeometry
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarSpliceGeometry : IDisposable
Public Class RebarSpliceGeometry
	Implements IDisposable
public ref class RebarSpliceGeometry : IDisposable
type RebarSpliceGeometry =
    class
        interface IDisposable
    end
The RebarSpliceGeometry type exposes the following members.
Constructors
Name | Description
RebarSpliceGeometry |  Constructs a RebarSpliceGeometry.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SpliceNormal |  Identifies the splice face normal.
SpliceOrigin |  Identifies the splice face origin.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarSpliceGeometry
Top
Remarks
 The splice will be done with a plane that contains this point and has the normal the provided vector.
 If this plane is intersecting other Rebar curves these intersection will not be taken into account.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace