Revit 2027 API
EdgeArray Class
An array that contains edges.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.EdgeArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EdgeArray : APIObject, IEnumerable
Public Class EdgeArray
	Inherits APIObject
	Implements IEnumerable
public ref class EdgeArray : public APIObject,
	IEnumerable
type EdgeArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The EdgeArray type exposes the following members.
Constructors
Name | Description
EdgeArray | Initializes a new instance of the EdgeArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an edge at a specified index within the array.
Size | Returns the number of edges that are in the array.
Top
Methods
Name | Description
Append | Add the edge to the end of the array.
Clear | Removes every edge from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified edge into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace