Revit 2027 API
CurveElement Properties
The CurveElement type exposes the following members.
Properties
Name | Description
CenterPointReference | Centerpoint reference of curve element. Curves such as circles, arcs, ellipses, and partial ellipses support this property.
CurveElementType |  Type of the curve element.
GeometryCurve | Geometry curve of the curve element.
LineStyle | The line style of this curve element.
SketchPlane | The sketch plane the curve element lies in.
SupportsTangentLocks |  Indicates whether or not this curve element can have a locked tangent join at either of its end-points shared with another curve element.
Top
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace