Revit 2027 API
MassInstanceUtils Methods
The MassInstanceUtils type exposes the following members.
Methods
Name | Description
AddMassLevelDataToMassInstance |  Create a MassLevelData (Mass Floor) to associate a Level with a mass instance.
Dispose
GetGrossFloorArea |  Get the total occupiable floor area represented by a mass instance.
GetGrossSurfaceArea |  Get the total exterior building surface area represented by a mass instance.
GetGrossVolume |  Get the total building volume represented by a mass instance.
GetJoinedElementIds |  Get the ElementIds of Elements that are joined to a mass instance.
GetMassLevelDataIds |  Get the ElementIds of the MassLevelDatas (Mass Floors) associated with a mass instance.
GetMassLevelIds |  Get the ElementIds of the Levels associated with a mass instance.
RemoveMassLevelDataFromMassInstance |  Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance.
Top
See Also
Reference
MassInstanceUtils Class
Autodesk.Revit.DB Namespace