Revit 2027 API
PanelScheduleTemplate Properties
The PanelScheduleTemplate type exposes the following members.
Properties
Name | Description
IsBranchPanelSchedule |  Checks to see if this object is branch panel schedule template element.
IsDataPanelSchedule |  Checks to see if this object is data panel schedule template element.
IsDefault |  Checks to see if this is default template for the given panel schedule type.
IsSwitchboardSchedule |  Checks to see if this object is switchboard schedule template element.
Top
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace