Revit 2027 API
AssetPropertyString Class
 Represents a property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyString
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyString : AssetProperty
Public Class AssetPropertyString
	Inherits AssetProperty
public ref class AssetPropertyString : public AssetProperty
type AssetPropertyString =
    class
        inherit AssetProperty
    end
The AssetPropertyString type exposes the following members.
Properties
Name | Description
Value |  value of the property
Top
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace