Revit 2027 API
Edge Class
An edge of a 3d solid.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Edge
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Edge : GeometryObject
Public Class Edge
	Inherits GeometryObject
public ref class Edge : public GeometryObject
type Edge =
    class
        inherit GeometryObject
    end
The Edge type exposes the following members.
Properties
Name | Description
ApproximateLength | Returns the approximate length of the edge.
Reference | Returns a stable reference to the edge.
Top
Methods
Name | Description
AsCurve | Returns a curve that corresponds to the edge's parametric orientation.
AsCurveFollowingFace | Returns a curve that corresponds to this edge as oriented in its topological direction on the specified face.
ComputeDerivatives | Returns the vectors describing the edge at the specified parameter.
Evaluate | Evaluates a parameter on the edge.
EvaluateOnFace | Evaluates a parameter on the edge to produce UV coordinates on the face.
GetCurveUV(Int32) | Calculate a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face.
GetCurveUV(Int32, Transform2D) | Calculate and transform a 2D curve that represents the edge in the uv-parameter plane of one of the edge's faces. The output curve's direction will follow the parametric direction of the edge, not the topological direction of the edge on the given face.
GetEndPointReference | Returns a stable reference to the start or the end point of the edge.
GetFace | Returns one of the two faces that meet at the edge.
IsFlippedOnFace(Face) | Determines if this edge's topological direction on the Face is opposite to its parametric direction.
IsFlippedOnFace(Int32) | Determines if this edge's topological direction on the Face is opposite to its parametric direction.
Tessellate | Returns a polyline approximation to the edge.
TessellateOnFace | Returns a polyline approximation to the edge in UV parameters of the face.
Top
Remarks
Edges are defined by intersections of surfaces that form faces of the solid. They have arbitrary parameterization that is normalized to [0,1].
See Also
Reference
Autodesk.Revit.DB Namespace