Revit 2027 API
IFCTransaction Class
 IFC transactions are context-like objects that guard any changes made to an IFC file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCTransaction
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCTransaction : IDisposable
Public Class IFCTransaction
	Implements IDisposable
public ref class IFCTransaction : IDisposable
type IFCTransaction =
    class
        interface IDisposable
    end
The IFCTransaction type exposes the following members.
Constructors
Name | Description
IFCTransaction |  Instantiates a transaction object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Commit |  Commits all changes made to the IFC file during the transaction.
Dispose | Releases all resources used by the IFCTransaction
RollBack |  Rolls back all changes made to the IFC file during the transaction.
Top
Remarks
 Any change to an IFC file can only be made while there is an active transaction open for that file. Changes do not become a part of the file until the active transaction is committed. Consequently, all changes made in a transaction can be rolled back either explicitly or implicitly (by the destructor).
See Also
Reference
Autodesk.Revit.DB.IFC Namespace