Revit 2027 API
VertexPosition Class
 A geometry vertex specified as a position in space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Vertex
 Autodesk.Revit.DB.DirectContext3D.VertexPosition
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexPosition : Vertex
Public Class VertexPosition
	Inherits Vertex
public ref class VertexPosition : public Vertex
type VertexPosition =
    class
        inherit Vertex
    end
The VertexPosition type exposes the following members.
Constructors
Name | Description
VertexPosition |  Constructs the vertex from a point.
Top
Properties
Name | Description
Position |  The vertex's position.
Top
Methods
Name | Description
GetSizeInFloats |  Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Top
Remarks
 Since these vertices do not have a color their color is obtained from the EffectInstance
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace