Revit 2027 API
RebarCurvesData Class
 The class that contains the information needed to calculate and return the result of the external curve generation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarCurvesData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarCurvesData : IDisposable
Public Class RebarCurvesData
	Implements IDisposable
public ref class RebarCurvesData : IDisposable
type RebarCurvesData =
    class
        interface IDisposable
    end
The RebarCurvesData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddBarGeometry(CurveLoop) |  Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(IList<Curve>) |  Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
CanAddBarGeometry
If the layout rule is Single or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.
If the layout rule is CustomSpacing, it will return true if GetNumberOfBarGeometry() is less the number of bars (specified by the formula), false otherwise.
For the other layout types, will return true.
ClearAllAddedBarGeometry |  This function will remove all bars geometry that were added by calling AddBarGeometry().
Dispose | Releases all resources used by the RebarCurvesData
GetAddedBarGeometry |  Gets the added curves that will represent the bar at index barIndex.
GetDistributionPath |  Gets the distribution path currently stored in the rebar.
GetNumberOfBarGeometry |  Gets the number of Bar Geometry that were added.
GetRebarUpdateCurvesData |  Gets a class that contains information used as input and output for rebar free form calculation.
SetDistributionPath |  Sets a new distribution path to be applied to the rebar. This information is set to the rebar after the API execution is finished successfully.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace