Revit 2027 API
IFCHybridImport Methods
The IFCHybridImport type exposes the following members.
Methods
Name | Description
CreateMap
Dispose
GetIFCStepIdToElementIdMap |  Retrieves the association between the original IFC STEP identifiers and the created or updated Elements.
ImportElements |  Imports IFC Elements using AnyCAD.
UpdateElements |  Updates IFC Elements using AnyCAD.
Top
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace