Revit 2027 API
Viewport Properties
The Viewport type exposes the following members.
Properties
Name | Description
LabelLineLength |  The length of the viewport label line in sheet space, measured in feet.
LabelOffset |  The offset is a two-dimensional vector from left bottom corner of the viewport with Rotation set to None to the left end of the viewport label line. The Z coordinate is ignored.
Rotation |  The rotation of the viewport on the sheet.
SheetId |  The element id of the ViewSheet on which the viewport appears, or InvalidElementId if this viewport does not associate a view with placement onto a sheet.
ViewAnchor |  Specifies the method by which the view will be positioned on the sheet and for the case when it is swapped to another view. Default is set to ViewAnchor.ViewOrigin.
ViewId |  The element id of the associated View.
ViewPosition |  Specifies view's position. Default is set to XYZ.Zero.
Top
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace