Revit 2027 API
AnalysisDisplayColorEntry Class
 Contains one entry of intermediate colors in color settings for analysis display style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayColorEntry : IDisposable
Public Class AnalysisDisplayColorEntry
	Implements IDisposable
public ref class AnalysisDisplayColorEntry : IDisposable
type AnalysisDisplayColorEntry =
    class
        interface IDisposable
    end
The AnalysisDisplayColorEntry type exposes the following members.
Constructors
Name | Description
AnalysisDisplayColorEntry() |  Constructs a new AnalysisDisplayColorEntry with default settings.
AnalysisDisplayColorEntry(Color) |  Constructs a color entry with no value assigned.
AnalysisDisplayColorEntry(Color, Double) |  Constructs a color entry with a specific value assigned.
Top
Properties
Name | Description
Color |  Color associated with color entry.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Value |  Value associated with color entry.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisDisplayColorEntry
HasValue |  Check if color entry has associated value.
IsEqual |  Compare color entries.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace