Revit 2027 API
AnalysisDisplayLegend Properties
The AnalysisDisplayLegend type exposes the following members.
Properties
Name | Description
Height |  The height, in sheet size, of the legend's rectangle
Top
See Also
Reference
AnalysisDisplayLegend Class
Autodesk.Revit.DB.Analysis Namespace