Revit 2027 API
RebarShapeDefinitionByArc Properties
The RebarShapeDefinitionByArc type exposes the following members.
Properties
Name | Description
Type |  Among those rebar shapes defined by an arc, specify which kind.
Top
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace