Revit 2027 API
ImportOptions3DM Class
 The import options used to import 3DM format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.ImportOptions3DM
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ImportOptions3DM : BaseImportOptions
Public Class ImportOptions3DM
	Inherits BaseImportOptions
public ref class ImportOptions3DM : public BaseImportOptions
type ImportOptions3DM =
    class
        inherit BaseImportOptions
    end
The ImportOptions3DM type exposes the following members.
Constructors
Name | Description
ImportOptions3DM() |  Constructs a new instance of ImportOptions3DM with default values of all properties.
ImportOptions3DM(ImportOptions3DM) |  Constructs a new instance of ImportOptions3DM as a copy of the provided import options.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace