Revit 2027 API
IRevisionsOnSheetUIServer Interface
Note: This API is now obsolete.
 The interface used to provide UI for sheet's Revisions On Sheet property.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
public interface IRevisionsOnSheetUIServer : IExternalServer
<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>
Public Interface IRevisionsOnSheetUIServer
	Inherits IExternalServer
[ObsoleteAttribute(L"This is deprecated in Revit 2027 and may be removed in a future version of Revit.")]
public interface class IRevisionsOnSheetUIServer : IExternalServer
[<ObsoleteAttribute("This is deprecated in Revit 2027 and may be removed in a future version of Revit.")>]
type IRevisionsOnSheetUIServer =
    interface
        interface IExternalServer
    end
The IRevisionsOnSheetUIServer type exposes the following members.
Methods
Name | Description
ShowDialog | Obsolete.
 Shows dialog on managing RevisionsOnSheetUI.
Top
See Also
Reference
Autodesk.Revit.UI Namespace