Revit 2027 API
Duct Class
 A duct in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Mechanical.Duct
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Duct : MEPCurve
Public Class Duct
	Inherits MEPCurve
public ref class Duct : public MEPCurve
type Duct =
    class
        inherit MEPCurve
    end
The Duct type exposes the following members.
Properties
Name | Description
DuctType |  The duct type of this duct.
IsPlaceholder |  Identifies if the duct is a placeholder or not.
Top
Methods
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector) |  Creates a new duct that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ) |  Creates a new duct that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) |  Creates a new duct from two points.
CreatePlaceholder |  Creates a new placeholder duct.
IsDuctTypeId |  Checks if given type is valid duct type.
IsHvacSystemTypeId |  Checks if given type is valid HVAC system type.
SetSystemType |  Updates the associated system type for the duct.
Top
Remarks
 The duct is only available in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace