Revit 2027 API
IPipeFittingAndAccessoryPressureDropUIServer Interface
 Interface for external servers providing optional UI for pipe fitting and pipe accessory coefficient calculation.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IPipeFittingAndAccessoryPressureDropUIServer : IExternalServer
Public Interface IPipeFittingAndAccessoryPressureDropUIServer
	Inherits IExternalServer
public interface class IPipeFittingAndAccessoryPressureDropUIServer : IExternalServer
type IPipeFittingAndAccessoryPressureDropUIServer =
    interface
        interface IExternalServer
    end
The IPipeFittingAndAccessoryPressureDropUIServer type exposes the following members.
Methods
Name | Description
GetDBServerId |  Returns the Id of the corresponding DB server for which this server provides an optional UI.
ShowSettings |  Shows the settings UI.
Top
Remarks
 This service works with pipe fitting and accessory pressure drop service. It provides the settings for the pipe fitting and accessory pressure drop server if needed; and it also provides UI for user to input the settings in Revit. A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service.
See Also
Reference
Autodesk.Revit.UI.Plumbing Namespace