Revit 2027 API
FaceEdgeNode Methods
The FaceEdgeNode type exposes the following members.
Methods
Name | Description
GetFaceEdge |  Returns the Face edge object corresponding to the node.
Top
See Also
Reference
FaceEdgeNode Class
Autodesk.Revit.DB Namespace