Revit 2027 API
LoadCombination Methods
The LoadCombination type exposes the following members.
Methods
Name | Description
Create(Document, String) |  Creates a new default LoadCombination.
Create(Document, String, LoadCombinationType, LoadCombinationState) |  Creates a new LoadCombination.
GetCaseAndCombinationIds |  Returns collection of the load combination case and combination IDs.
GetComponents |  Returns collection of the load combination components.
GetUsageIds |  Returns collection of the load combination usage IDs.
SetComponents |  Sets a collection of the load combination components.
SetUsageIds |  Sets a collection of the load combination usage IDs.
Top
See Also
Reference
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace