Revit 2027 API
FieldValues Class
 Contains values corresponding to domain points. Each domain point may have an array of values, each corresponding to a separate "measurement" for which this value was calculated.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.FieldValues
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FieldValues : IDisposable
Public Class FieldValues
	Implements IDisposable
public ref class FieldValues : IDisposable
type FieldValues =
    class
        interface IDisposable
    end
The FieldValues type exposes the following members.
Constructors
Name | Description
FieldValues(FieldValues) |  Creates a copy of the given FieldValues instance.
FieldValues(IList<ValueAtPoint>) |  Creates object from an array of domain point values
FieldValues(IList<VectorAtPoint>) |  Creates object from an array of domain point vectors
FieldValues(IList<ValueAtPoint>, XYZ) |  Creates object from an array of domain point values
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FieldValues
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace