Revit 2027 API
LinkLoadContent Class
 This class is used by IExternalResourceServers to return Link data to Revit when their LoadResource method is invoked. It also contains additional information used by IExternalResourceUIServers to display link load status results to the user.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceLoadContent
 Autodesk.Revit.DB.LinkLoadContent
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkLoadContent : ExternalResourceLoadContent
Public Class LinkLoadContent
	Inherits ExternalResourceLoadContent
public ref class LinkLoadContent : public ExternalResourceLoadContent
type LinkLoadContent =
    class
        inherit ExternalResourceLoadContent
    end
The LinkLoadContent type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetLinkDataPath |  Returns the Link data path owned by this LinkLoadContent object.
GetLinkLoadResult |  Retrieves the LinkLoadResult of the attempt to load or reload a Revit link.
SetLinkDataPath |  Sets the Link data path owned by this LinkLoadContent object.
Top
Remarks
 This class handles Revit links.
 Revit links must be loaded from a path accessible to Revit. Server implementors should provide Revit with a ModelPath representing a location from which to load the link. Revit will handle the actual file loading.
 Servers which represent non-local file locations will need to create their own implementation for copying or moving files to a Revit-accessible location.
The link data path used for link loading may be different from the path displayed to the user. The link data path represents the literal location of the file, whereas the link's display path represents what the user sees as the name of the link. See [!:Autodesk::Revit::DB::ExternalResourceReference::InSessionPath] for more details on display paths.
See Also
Reference
Autodesk.Revit.DB Namespace