Revit 2027 API
TransmittedModelException Methods
The TransmittedModelException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
TransmittedModelException Class
Autodesk.Revit.Exceptions Namespace