Revit 2027 API
EnergyAnalysisSurface Class
 Analytical surface. The collection of analytic openings belonging to this analytical parent surface
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyAnalysisSurface : Element
Public Class EnergyAnalysisSurface
	Inherits Element
public ref class EnergyAnalysisSurface : public Element
type EnergyAnalysisSurface =
    class
        inherit Element
    end
The EnergyAnalysisSurface type exposes the following members.
Properties
Name | Description
Azimuth |  The azimuth angle for this surface, in radians.
CADLinkUniqueId |  The unique id of the originating CAD object's link (linked document) associated with this surface.
CADObjectUniqueId |  The unique id of the originating CAD object (model element) associated with this surface.
Corner |  The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Height |  The height of the analytical rectangular geometry.
Normal |  The outward normal for this surface.
OriginatingElementDescription |  The description for the originating Revit element.
OriginatingElementId |  The element id for the originating Revit element.
OriginatingElementName |  The name for the originating Revit element.
SurfaceId |  The unique identifier for the surface.
SurfaceName |  The unique name identifier for this surface.
SurfaceType | Obsolete.
 The analytical surface type.
Tilt |  The tilt angle for this surface, in radians.
Type |  The gbXML surface type attribute.
Width |  The width of the analytical rectangular geometry.
Top
Methods
Name | Description
GetAdjacentAnalyticalSpace |  Gets the secondary adjacent analytical space this surface is associated with.
GetAnalyticalOpenings |  Returns the analytical openings of the analytical surface.
GetAnalyticalSpace |  Gets the primary analytical space this surface is associated with.
GetConstruction |  Gets the analytic construction this surface is associated with.
GetPolyloops |  Gets the collection of planar polygons describing the surface geometry.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace