Revit 2027 API
ExportLineweightInfo Class
 A value used to represent the info stored in the ExportLineweightTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLineweightInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLineweightInfo : IDisposable
Public Class ExportLineweightInfo
	Implements IDisposable
public ref class ExportLineweightInfo : IDisposable
type ExportLineweightInfo =
    class
        interface IDisposable
    end
The ExportLineweightInfo type exposes the following members.
Constructors
Name | Description
ExportLineweightInfo() |  Constructs a new default ExportLineweightInfo.
ExportLineweightInfo(ExportLineweightInfo) |  Constructs a new copy of the input ExportLineweightInfo object.
ExportLineweightInfo(String) |  Constructs a new ExportLineweightInfo using the destination line weight name as input.
Top
Properties
Name | Description
DestinationLineweightName |  The destination lineweight name (the name of the line weight in the exported format)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLineweightInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace