Revit 2027 API
FileNotFoundException Class
The exception that is thrown when the specified file could not be found.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.IOException
 Autodesk.Revit.Exceptions.FileNotFoundException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class FileNotFoundException : IOException
<SerializableAttribute>
Public Class FileNotFoundException
	Inherits IOException
[SerializableAttribute]
public ref class FileNotFoundException : public IOException
[<SerializableAttribute>]
type FileNotFoundException =
    class
        inherit IOException
    end
The FileNotFoundException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace