Revit 2027 API
ParameterDownloadOptions Class
 An option class used for downloading parameters from the Parameters Service.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterDownloadOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ParameterDownloadOptions : IDisposable
Public Class ParameterDownloadOptions
	Implements IDisposable
public ref class ParameterDownloadOptions : IDisposable
type ParameterDownloadOptions =
    class
        interface IDisposable
    end
The ParameterDownloadOptions type exposes the following members.
Constructors
Name | Description
ParameterDownloadOptions() |  Default constructor.
ParameterDownloadOptions(ISet<ElementId>, Boolean, Boolean, ForgeTypeId) |  Creates a new ParameterDownloadOptions instance. Category bindings are represented by an ElementIdSet populated with category identifiers.
Top
Properties
Name | Description
IsInstance |  True if binding to Element instances, false if binding to Element types.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Visible |  True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ParameterDownloadOptions
GetCategories |  Get categories for binding.
GetGroupTypeId |  Get properties palette group identifier.
SetCategories |  Set categories for binding.
SetGroupTypeId |  Set properties palette group identifier.
Top
See Also
Reference
Autodesk.Revit.DB Namespace