Revit 2027 API
ExternalApplicationArray Methods
The ExternalApplicationArray type exposes the following members.
Methods
Name | Description
Append | Add the item to the end of the array.
Clear | Removes every item from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified item into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace