Revit 2027 API
PostDocEventArgs Properties
The PostDocEventArgs type exposes the following members.
Properties
Name | Description
Document |  The document associated with the event.
Top
See Also
Reference
PostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace