Revit 2027 API
TransferringProjectStandardsEventArgs Properties
The TransferringProjectStandardsEventArgs type exposes the following members.
Properties
Name | Description
SourceDocument |  Source document.
TargetDocument |  Target document.
Top
See Also
Reference
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace