Revit 2027 API
ElementIntersectsElementFilter Methods
The ElementIntersectsElementFilter type exposes the following members.
Methods
Name | Description
GetElement |  Gets the target element.
Top
See Also
Reference
ElementIntersectsElementFilter Class
Autodesk.Revit.DB Namespace