Revit 2027 API
RepeaterBounds Methods
The RepeaterBounds type exposes the following members.
Methods
Name | Description
AdjustForCyclicalBounds |  Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
AreCoordinatesInBounds |  Determines whether given coordinates are within the bounds.
Dispose
GetLowerBound |  Returns the smallest index of the array in the given dimension.
GetUpperBound |  Returns the highest index of the array in the given dimension.
IsCyclical |  True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension.
Top
See Also
Reference
RepeaterBounds Class
Autodesk.Revit.DB Namespace