Revit 2027 API
InsertableObject Class
A base class you all types that are insertable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InsertableObject : ElementType
Public Class InsertableObject
	Inherits ElementType
public ref class InsertableObject : public ElementType
type InsertableObject =
    class
        inherit ElementType
    end
The InsertableObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace