Revit 2027 API
FabricationServiceSettings Class
 Represents the settings related to the fabrication services.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FabricationServiceSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationServiceSettings : Element
Public Class FabricationServiceSettings
	Inherits Element
public ref class FabricationServiceSettings : public Element
type FabricationServiceSettings =
    class
        inherit Element
    end
The FabricationServiceSettings type exposes the following members.
Properties
Name | Description
AirFluidType |  A special fluid type for fabrication HVAC services.
Top
Methods
Name | Description
GetFabricationServiceSettings |  Gets the settings element in the document.
GetFluidTemperature |  Gets the fluid temperature of the specified service.
GetFluidType |  Gets the fluid type of the specified service.
HasValidFluidSetting |  Is the service associated with a fluid type and temperature?
RemoveFluidSetting |  Clears the fluid setting of the specified service if found.
SetFluidTypeAndTemperature |  Sets the fluid type and temperature of the specified service.
Top
See Also
Reference
Autodesk.Revit.DB Namespace