Revit 2027 API
IFCGeometryInfo Class
 A container class for Revit geometry extracted from an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCGeometryInfo
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCGeometryInfo : IDisposable
Public Class IFCGeometryInfo
	Implements IDisposable
public ref class IFCGeometryInfo : IDisposable
type IFCGeometryInfo =
    class
        interface IDisposable
    end
The IFCGeometryInfo type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
CreateCurveGeometryInfo |  Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double, Boolean) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(ExporterIFC, Plane, XYZ, Double, Boolean) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateSurfaceGeometryInfo |  Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.
Dispose | Releases all resources used by the IFCGeometryInfo
GetCurves |  Gets the IfcCurve handles created representing the processed geometry and stored in this object.
GetFaces |  Gets the IfcFace handles created representing the processed geometry and stored in this object.
GetRepresentations |  Gets the representation handles created representing the processed geometry and stored in this object.
GetSurfaces |  Gets the IfcSurface handles created representing the processed geometry and stored in this object.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace