Revit 2027 API
EnergyAnalysisSurface Methods
The EnergyAnalysisSurface type exposes the following members.
Methods
Name | Description
GetAdjacentAnalyticalSpace |  Gets the secondary adjacent analytical space this surface is associated with.
GetAnalyticalOpenings |  Returns the analytical openings of the analytical surface.
GetAnalyticalSpace |  Gets the primary analytical space this surface is associated with.
GetConstruction |  Gets the analytic construction this surface is associated with.
GetPolyloops |  Gets the collection of planar polygons describing the surface geometry.
Top
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace