Revit 2027 API
AssetPropertyDistance Methods
The AssetPropertyDistance type exposes the following members.
Methods
Name | Description
GetUnitTypeId |  Gets the identifier of the unit quantifying the distance property.
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace