Revit 2027 API
PaperSize Class
An object that represents a Paper Size of Print Setup within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PaperSize
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PaperSize : APIObject
Public Class PaperSize
	Inherits APIObject
public ref class PaperSize : public APIObject
type PaperSize =
    class
        inherit APIObject
    end
The PaperSize type exposes the following members.
Properties
Name | Description
Name |  Retrieve the paper size name of current project.
Top
Methods
Name | Description
Top
Remarks
This object derived from the APIObject base object.
See Also
Reference
Autodesk.Revit.DB Namespace