Revit 2027 API
LossFactor Methods
The LossFactor type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the LossFactor derived object.
Dispose
Top
See Also
Reference
LossFactor Class
Autodesk.Revit.DB.Lighting Namespace