Revit 2027 API
FabricArea Properties
The FabricArea type exposes the following members.
Properties
Name | Description
CoverOffset |  The additional cover offset of the fabric distribution.
Direction |  The Major Direction of the Fabric Area.
DirectionOrigin |  The Origin Point of the Major Direction of the Fabric Area.
DistributionOfWiresAtCover |  The distribution of wires that is closest to the cover.
FabricAreaType |  The type of the Fabric Area.
FabricLocation |  The Fabric location in the host.
FabricSheetTypeId |  The id of the Fabric Sheet Type for this element.
HostId |  The id of the Host element for the fabric area.
LapSplicePosition |  The fabric lap splice position in the fabric distribution.
MajorLapSpliceLength |  The fabric lap splice length in the fabric distribution in the major direction.
MajorSheetAlignment |  The fabric sheet alignment in the fabric distribution in the major direction.
MinorLapSpliceLength |  The fabric lap splice length in the fabric distribution in the minor direction.
MinorSheetAlignment |  The fabric sheet alignment in the fabric distribution in the minor direction.
SketchId |  The id of the Sketch element for this element.
TagViewId |  The element of the view in which to tag new members of this element.
Top
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace