Revit 2027 API
RebarConstraint Class
 A class representing a constraint on a handle of a rebar element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarConstraint
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarConstraint : IDisposable
Public Class RebarConstraint
	Implements IDisposable
public ref class RebarConstraint : IDisposable
type RebarConstraint =
    class
        interface IDisposable
    end
The RebarConstraint type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberOfTargets |  Identifies the number of references associated to the rebar handle.
Top
Methods
Name | Description
ConstrainsRebarEnds |  Returns true if this constraint constrains two rebar ends.
Create |  This method creates a constraint of 'ToHostFace' or 'ToCover' type for a given RebarConstrainedHandle. Using this method for Shape-Driven Rebar will throw exception. If you need a new RebarConstraint for a handle of a Shape-Driven Rebar, you can obtain a list of possible constraints using one of the RebarConstraintsManager.GetConstraintCandidatesForHandle functions, choose the desired one, and set it as preferred.
CreateConstraintToCustomTarget
This method creates a constraint of 'ToCustomTarget' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar should allow constrains to custom target.
CreateConstraintToHostEdge
This method creates a constraint of 'ToHostEdge' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar and must be allowed to constrain to host edges.
CreateConstraintToHostEdgeCover
This method creates a constraint of 'ToHostEdgeCover' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar and must be allowed to constrain to host edges.
The RebarConstrainedHandle that is constrained 'ToHostEdgeCover' must allow offset value.
CreateConstraintToRebarEdge
This method creates a constraint of 'ToOtherRebar' type with Edge target type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar, otherwise it will throw exception.
CreateConstraintToSurface
This method creates a constraint of 'ToSurface' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Shape Driven Rebar, otherwise it will throw exception.
Dispose | Releases all resources used by the RebarConstraint
FlipHandleOverTarget |  Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.
FlipSideForClearBarSpacingZeroDistanceConstraint |  Flips the side on which a RebarConstrainedHandle constrained using clear bar distance with zero offset connects to another Rebar target handle.
GetConstraintToRebarEdgeProperties |  Gets the properties for all target rebar edges.
GetConstraintType |  Returns the RebarConstraintType of a RebarConstraint.
GetCustomHandleTag |  Returns the handle tag of the RebarConstrainedHandle. This is valid only for Free Form Rebar.
GetDistanceToCustomTarget |  Gets the distance from the RebarConstrainedHandle to the custom target.
GetDistanceToTargetCover |  Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover'.
GetDistanceToTargetHostEdge |  Returns the distance from the RebarConstrainedHandle to the target host edge. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' and must allow offset value.
GetDistanceToTargetHostEdgeCover |  Returns the distance from the RebarConstrainedHandle to the target host edge cover. The RebarConstraintType of the RebarConstraint must be 'ToHostEdgeCover'.
GetDistanceToTargetHostFace |  Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'.
GetDistanceToTargetRebar |  Gets the distance from the RebarConstrainedHandle to the target Rebar handle surface. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
GetPositiveOffsetDirectionForToOtherRebarConstraint |  Returns the default positive offset direction vector for a constraint to a Shape Driven Rebar.
GetRebarConstrainedHandle |  Gets the RebarConstrainedHandle for which this constraint is.
GetRebarConstraintTargetHostFaceType() |  Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. Will throw exception if it's a multi target constraint.
GetRebarConstraintTargetHostFaceType(Int32) |  Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
GetSurfaceForConstraintToSurface |  This method retrieves the surface for a constraint of 'To Surface' type.
GetTargetCoverType |  Returns the RebarCoverType for the face specified by targetIndex. Returns null if no RebarHostData is present for target element.
GetTargetCoverTypeForToHostEdgeConstraint |  Returns the RebarCoverType for the face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'. Returns null if no RebarHostData is present for target element.
GetTargetElement() |  Gets the Element object (either Host or Rebar) which provides the target reference at index 0 for this constraint. Will throw exception if it's a multi target constraint.
GetTargetElement(Int32) |  Gets the Element object (either Host or Rebar) which provides the target reference at specified index for this constraint.
GetTargetHostEdgeAndTransform |  Returns the target host edge and the transform that is associated to the host edge's geometry. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'. Only applied to Free Form Rebar.
GetTargetHostFaceAndTransform |  Returns the face to which the RebarConstraint is attached associated to the given target index. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
GetTargetHostFaceReference() |  Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. Will throw exception if it's a multi target constraint.
GetTargetHostFaceReference(Int32) |  Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
GetTargetHostFaceReferenceForEdgeConstraint |  Returns a reference to the host Element face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'.
GetTargetRebarAngleOnBarOrHookBend |  Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.
GetTargetRebarBendNumber |  Gets the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend'. Rebar must be Shape Driven Rebar element.
GetTargetRebarConstraintType |  Gets the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
GetTargetRebarEdgeNumber |  Gets the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge'. Rebar must be Shape Driven Rebar element.
GetTargetRebarHandleBehavior |  Gets the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
GetTargetRebarHookBarEnd |  Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'HookBend'. Rebar must be Shape Driven Rebar element.
HasAnEdgeNumber |  Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
IsBindingHandleWithTarget |  Gets the relationship between two RebarConstrainedHandles.
IsEqual |  Checks if the specified RebarConstraint is the same as 'this'. The method can be used to determine which of the RebarConstraint candidates offered by the RebarConstraintsManager is currently active.
IsFixedDistanceToHostFace |  Checks if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace'.
IsReferenceAValidEdgeForConstraint |  Checks if the reference provided can be used in creating 'ToHostEdge' or 'ToHostEdgeCover' constraint.
IsReferenceAValidFaceForConstraint |  Checks if the reference provided can be used in creating 'ToFace' or 'ToCover' constraints.
IsReferenceValidForConstraint | Obsolete.
 Checks if the reference provided can be used in creating 'ToFace' or 'ToCover' Rebar constraints
IsToCover |  Checks if the RebarConstraintType of the RebarConstraint is 'ToCover'. Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover', false otherwise.
IsToCustomTarget |  Checks if the RebarConstraintType of the RebarConstraint is 'ToCustomTarget'.
IsToHostEdge |  Checks if the RebarConstraintType of the RebarConstraint is 'ToHostEdge'.
IsToHostEdgeCover |  Checks if the RebarConstraintType of the RebarConstraint is 'ToHostEdgeCover'.
IsToHostFaceOrCover |  Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover'.
IsToOtherRebar |  Checks if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar'.
IsToSurface |  Checks if the RebarConstraintType of the RebarConstraint is 'ToSurface'.
IsUsingClearBarSpacing |  Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
IsValid |  Checks that the RebarConstraint still has access to valid Rebar constraint data and that its RebarConstraintsManager is still valid.
IsValidSurfaceToConstraintHandleTo |  Checks if the surface can be used to create a constraint to it for the input handle.
ReplaceReferenceTargets(IList<Reference>, RebarConstraintType) |  Replaces the current set of references, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar.
ReplaceReferenceTargets(RebarConstrainedHandle, IList<Reference>, Boolean, Double) | Obsolete.
 Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar.
SetConstraintToRebarEdgeProperties |  Sets the properties of the constraint to target rebar edges.
SetDistanceToCustomTarget |  Sets the distance from the RebarConstrainedHandle to the custom target.
SetDistanceToTargetCover |  Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover'.
SetDistanceToTargetHostEdge |  Sets the distance from the RebarConstrainedHandle to the target host edge. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' and must allow offset value.
SetDistanceToTargetHostEdgeCover |  Sets the distance from the RebarConstrainedHandle to the target host edge cover. The RebarConstraintType of the RebarConstraint must be 'ToHostEdgeCover'.
SetDistanceToTargetHostFace |  Sets the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'.
SetDistanceToTargetRebar |  Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface.
SetToBindHandleWithTarget |  Sets the relationship between two RebarConstrainedHandles.
SetToUseClearBarSpacing |  Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers.
TargetIsBarBend |  Returns true if the TargetRebarConstraintType of the RebarConstraint is 'BarBend'.
TargetIsHookBend |  Returns true if the TargetRebarConstraintType of the RebarConstraint is 'HookBend'.
TargetRebarConstraintTypeIsEdge |  Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,' and the RebarConstraint is attached to an edge of the other Rebar Element.
Top
Remarks
For Shape Driven Rebar Constraints:
Each handle on a rebar is defined by a plane, and can be constrained along the direction perpendicular to a surface. Rebar constraints work by locking the handle planes to targets. These targets can be: surfaces of host elements (faces or cover), the handle planes of other Rebar element or any generic surface.
A special case is for of a straight, standard style bar, running perpendicular to the plane of the stirrup bar. This bar can constrain itself to distinct locations along bends in stirrup bars - points located at 0 degrees, 45 degrees, 90 degrees, etc. around each bend. This is done by simultaneously locking both the straight bar's edge handle and its planar position handle to one or both of the stirrup edges adjacent to the bend in the stirrup.
Usually, to form a constraint, the handle plane and the reference plane must be parallel. However, bar end or segment handles can be constrained to planes at angles up to 84 degrees. Arc-shaped rebar is a special case, and can form constraints to concentric host surfaces.
For Free Form Rebar Constraints:
Each handle of the Rebar can be constrained to multiple host faces, covers of the host faces, host edges or other Rebar's edges. There are handles that can have have custom constraints which are specific for each [!:Autodesk::Revit::DB::Structure::IRebarUpdateServer].
RebarConstraints for Free Form Rebar should be created using the specific Create methods and then added to the RebarConstraintsManager using the method SetPreferredConstraint.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace