Revit 2027 API
EvaluatedParameter Methods
The EvaluatedParameter type exposes the following members.
Methods
Name | Description
AsValueString(Document) |  Get the parameter value as a string with units.
AsValueString(Document, FormatOptions) |  Get the parameter value as a string with units.
Dispose
Top
See Also
Reference
EvaluatedParameter Class
Autodesk.Revit.DB Namespace