Revit 2027 API
PipeScheduleType Methods
The PipeScheduleType type exposes the following members.
Methods
Name | Description
Create |  Creates a new pipe schedule type with the given name.
GetPipeScheduleId |  Returns an existing pipe schedule type with the same name.
Top
See Also
Reference
PipeScheduleType Class
Autodesk.Revit.DB.Plumbing Namespace