Revit 2027 API
FabricationServiceSettings Properties
The FabricationServiceSettings type exposes the following members.
Properties
Name | Description
AirFluidType |  A special fluid type for fabrication HVAC services.
Top
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace