Revit 2027 API
PhaseArray Properties
The PhaseArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a phase at a specified index within the array.
Size | Returns the number of phases that are in the array.
Top
See Also
Reference
PhaseArray Class
Autodesk.Revit.DB Namespace