Revit 2027 API
ElementCategoryFilter Properties
The ElementCategoryFilter type exposes the following members.
Properties
Name | Description
CategoryId |  The category id.
Top
See Also
Reference
ElementCategoryFilter Class
Autodesk.Revit.DB Namespace