Revit 2027 API
Toposolid Class
 An object that represents a Toposolid within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CeilingAndFloor
 Autodesk.Revit.DB.Toposolid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Toposolid : CeilingAndFloor
Public Class Toposolid
	Inherits CeilingAndFloor
public ref class Toposolid : public CeilingAndFloor
type Toposolid =
    class
        inherit CeilingAndFloor
    end
The Toposolid type exposes the following members.
Properties
Name | Description
HostTopoId |  The host Toposolid id of the current Toposolid subdivision. If the object is not a Toposolid subdivision, hostTopoId will be InvalidElementId.
SketchId |  Returns id of the sketch.
Top
Methods
Name | Description
CanBeExcavatedBy |  Checks if the given element can be used to excavate the Toposolid.
Create(Document, IList<CurveLoop>, ElementId, ElementId) |  Creates a new instance of Toposolid within the project.
Create(Document, IList<XYZ>, ElementId, ElementId) |  Creates a new instance of Toposolid within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, ElementId, ElementId) |  Creates a new instance of Toposolid within the project.
CreateFromTopographySurface |  Creates a Toposolid element from a host TopographySurface, and Toposolid sub-divisions from its subregions.
CreateSubDivision(Document, IList<CurveLoop>) |  Creates a Toposolid subdivision element with the current Toposolid as its host, using the default Toposolid type as the type of the new subdivision.
CreateSubDivision(Document, ElementId, IList<CurveLoop>) |  Creates a Toposolid subdivision element with the current Toposolid as its host.
ExcavateBy |  Excavates the Toposolid by a given element.
GetIntersectingElementData |  Gets intersection data of all intersecting elements.
GetSlabShapeEditor |  Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid.
GetSubDivisionIds |  Gets all element ids of Toposolid subdivisions with the current Toposolid as its host.
IsCutVoidStabilityEnabled |  Identifies if the setting for stability of Boolean operations for Toposolid elements is enabled or disabled.
IsSmoothedSurfaceEnabled |  Gets smoothed surface setting of Toposolid.
RemoveExcavationBy |  Removes the excavation between the given element and the Toposolid.
SetCutVoidStability |  Enables or disables the setting for stability of Boolean operations for Toposolid elements.
SetSmoothedSurface |  Sets smoothed surface setting of Toposolid.
Simplify |  Simplifies the Toposolid by reducing the number of inner vertices to the given percentage.
Split |  Splits the Toposolid by the given curve loops.
Top
See Also
Reference
Autodesk.Revit.DB Namespace