Revit 2027 API
FailureMessageAccessor Class
 Restricted accessor for FailureMessage.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureMessageAccessor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FailureMessageAccessor : IDisposable
Public Class FailureMessageAccessor
	Implements IDisposable
public ref class FailureMessageAccessor : IDisposable
type FailureMessageAccessor =
    class
        interface IDisposable
    end
The FailureMessageAccessor type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
CloneFailureMessage |  Creates a copy of the FailureMessage.
Dispose | Releases all resources used by the FailureMessageAccessor
GetAdditionalElementIds |  Retrieves Ids of Elements that have not caused the failure but are related to it Checks if the failure has resolution of a given resolution type.
GetCurrentResolutionType |  Retrieves the type of resolution to be used to resolve the failure.
GetDefaultResolutionCaption |  Retrieves the caption of default resolution of the failure.
GetDescriptionText |  Retrieves the description of the failure.
GetFailingElementIds |  Retrieves Ids of Elements that have caused the failure.
GetFailureDefinitionId |  Retrieves the Id of the FailureDefinition of the failure.
GetNumberOfResolutions |  Retrieves number of resolutions that can be used to resolve failure.
GetSeverity |  Retrieves the severity of the failure.
HasResolutionOfType |  Checks if failure has a resolution of a given type.
HasResolutions |  Checks if the failure has any resolutions.
SetCurrentResolutionType |  Sets the type of a resolution to be used to resolve the failure.
ShouldMergeWithMessage |  Checks if the FailureMessage should be merged with the other FailureMessage for better user experience.
Top
Remarks
 Provides access to a FailureMessage stored in a Document. Reading of the information from the FailureMessage is allowed, changing of information is generally not allowed, except setting of the current resolution type.
See Also
Reference
Autodesk.Revit.DB Namespace