Revit 2027 API
GeomCombination Class
An element created by Join and Cut operations applied to combinable elements in an Autodesk Revit family document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GeomCombination
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GeomCombination : CombinableElement
Public Class GeomCombination
	Inherits CombinableElement
public ref class GeomCombination : public CombinableElement
type GeomCombination =
    class
        inherit CombinableElement
    end
The GeomCombination type exposes the following members.
Properties
Name | Description
AllMembers | All elements that are joined in this geometry combination.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace