Revit 2027 API
BaseImportOptions Class
 A base class containing import options used during import of several formats.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BaseImportOptions : IDisposable
Public Class BaseImportOptions
	Implements IDisposable
public ref class BaseImportOptions : IDisposable
type BaseImportOptions =
    class
        interface IDisposable
    end
The BaseImportOptions type exposes the following members.
Properties
Name | Description
AutoCorrectAlmostVHLines |  Correct almost-vertical lines and almost-horizontal lines for import model if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.
ColorMode |  Color mode for the import. Three modes are supported. Black and White, Preserve Colors, and Invert Colors.
CustomScale |  Scaling the import. If this is defined and a valid value (> 0.0), it takes priority over units.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OrientToView |  Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
Placement |  Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates.
ReferencePoint |  The 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
ThisViewOnly |  Imports drawings into the view that was passed into the import method. This option is not available in 3D views.
Unit |  The unit of measure for imported geometry.
VisibleLayersOnly |  Only import the visible layers.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BaseImportOptions
GetDefaultLengthUnit |  Get the default length unit used for importing unitless files.
GetLayerSelection |  Get all set layers name which user want to import into Revit.
SetDefaultLengthUnit |  Set the default length unit used for importing unitless files.
SetLayerSelection |  Set the layers name which user want to import into Revit.
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.AXMImportOptions
 Autodesk.Revit.DB.DGNImportOptions
 Autodesk.Revit.DB.DWGImportOptions
 Autodesk.Revit.DB.ImportOptions3DM
 Autodesk.Revit.DB.OBJImportOptions
 Autodesk.Revit.DB.SATImportOptions
 Autodesk.Revit.DB.SKPImportOptions
 Autodesk.Revit.DB.STEPImportOptions
 Autodesk.Revit.DB.STLImportOptions