Revit 2027 API
ExternallyTaggedNonBReps Class
 Holds a collection of ExternallyTaggedNonBRep instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternallyTaggedNonBReps
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternallyTaggedNonBReps : IDisposable
Public Class ExternallyTaggedNonBReps
	Implements IDisposable
public ref class ExternallyTaggedNonBReps : IDisposable
type ExternallyTaggedNonBReps =
    class
        interface IDisposable
    end
The ExternallyTaggedNonBReps type exposes the following members.
Constructors
Name | Description
ExternallyTaggedNonBReps |  Make a new empty collection of ExternallyTaggedNonBRep instances.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Add |  Adds a copy of the input ExternallyTaggedNonBRep to this collection.
CanAddExternallyTaggedNonBRep |  Checks if the input geometry could be added to this collection or not.
Dispose | Releases all resources used by the ExternallyTaggedNonBReps
Top
See Also
Reference
Autodesk.Revit.DB Namespace