Revit 2027 API
ExtendedPropertiesBindings Class
 Establishes the bindings for a given extended property. Supports the same style of binding as shared/project parameters - category and type vs instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindings
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtendedPropertiesBindings : IDisposable
Public Class ExtendedPropertiesBindings
	Implements IDisposable
public ref class ExtendedPropertiesBindings : IDisposable
type ExtendedPropertiesBindings =
    class
        interface IDisposable
    end
The ExtendedPropertiesBindings type exposes the following members.
Constructors
Name | Description
ExtendedPropertiesBindings() |  Creates a new ExtendedPropertiesBindings
ExtendedPropertiesBindings(ExtendedPropertiesBindingType, ISet<ForgeTypeId>) |  Creates a new ExtendedPropertiesBindings
Top
Properties
Name | Description
BindingType |  Indicates type vs instance bindings. Defaults to Instance.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddCategories |  Adds multiple categories to the bindings.
AddCategory |  Adds a category id to the bindings.
Dispose | Releases all resources used by the ExtendedPropertiesBindings
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace