Revit 2027 API
Room Class
Provides access to the room topology in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElement
 Autodesk.Revit.DB.Architecture.Room
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Room : SpatialElement
Public Class Room
	Inherits SpatialElement
public ref class Room : public SpatialElement
type Room =
    class
        inherit SpatialElement
    end
The Room type exposes the following members.
Properties
Name | Description
BaseOffset | Get or Set the Base Offset of the Room.
ClosedShell | Return the closedShell of the Room.
LimitOffset | Get or Set the Limit Offset of the Room.
UnboundedHeight | Get the Unbounded Height of the Room.
UpperLimit | Get or Set the Upper Limit of the Room.
Volume | Get the Volume of the Room.
Top
Methods
Name | Description
IsPointInRoom | Determines if a point lies within the volume of the room.
Unplace |  Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.
Top
Remarks
The room object can be queried for its boundary for use in space planning tools.
Example
private void Getinfo_Room(Room room)
{
    string message = "Room: ";
    //get the name of the room
    message += "\nRoom Name: " + room.Name;
    //get the room position
    LocationPoint location = room.Location as LocationPoint;
    XYZ point = location.Point;
    message += "\nRoom position: " + XYZToString(point);
    //get the room number
    message += "\nRoom number: " + room.Number;
    IList<IList<Autodesk.Revit.DB.BoundarySegment>> segments = room.GetBoundarySegments(new SpatialElementBoundaryOptions());
    if (null != segments)  //the room may not be bound
    {
        foreach (IList<Autodesk.Revit.DB.BoundarySegment> segmentList in segments)
        {
            message += "\nBoundarySegment of the room: ";
            foreach (Autodesk.Revit.DB.BoundarySegment boundarySegment in segmentList)
            {
                // Get curve start point
                XYZ start = boundarySegment.GetCurve().GetEndPoint(0);
                message += "\nCurve start point: " + XYZToString(start);
                // Get curve end point
                XYZ end = boundarySegment.GetCurve().GetEndPoint(1);
                message += " Curve end point: " + XYZToString(end);
                // Show the boundary elements
                message += "\nBoundary element id: " + boundarySegment.ElementId.ToString();
            }
        }
    }
    TaskDialog.Show("Revit",message);
}
// output the point's three coordinates
string XYZToString(XYZ point)
{
    return "(" + point.X + ", " + point.Y + ", " + point.Z + ")";
}
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace