Revit 2027 API
SolidOptions Class
 A class containing optional information to control the properties of the Solid generated by the GeometryCreationUtilities routines.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SolidOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SolidOptions : IDisposable
Public Class SolidOptions
	Implements IDisposable
public ref class SolidOptions : IDisposable
type SolidOptions =
    class
        interface IDisposable
    end
The SolidOptions type exposes the following members.
Constructors
Name | Description
SolidOptions |  Creates a new SolidOptions class with material and graphics style settings.
Top
Properties
Name | Description
ExtraFaceAndEdgeHistoryKey |  Optional extra key used to create face and edge histories for the Solid. If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.
GraphicsStyleId |  Defines the graphics style id for the Solid.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaterialId |  Defines the material id for the Solid.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SolidOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace