Revit 2027 API
ComboBoxData Properties
The ComboBoxData type exposes the following members.
Properties
Name | Description
Image | The image shown on the ComboBox.
Top
See Also
Reference
ComboBoxData Class
Autodesk.Revit.UI Namespace