Revit 2027 API
ConduitSizes Methods
The ConduitSizes type exposes the following members.
Methods
Name | Description
Contains |  Checks whether a conduit size with the nominal diameter exists.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetConduitSizesIterator |  Returns a ConduitSizeIterator to the conduit sizes.
GetEnumerator | Returns an enumerator that iterates through a collection.
Top
See Also
Reference
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace