Revit 2027 API
MEPAnalyticalSystem Methods
The MEPAnalyticalSystem type exposes the following members.
Methods
Name | Description
Create |  Creates a new analytical system
GetAirSystemData |  Returns the air system data, null if not available.
GetWaterLoopData |  Returns the water loop data, null if not available.
Top
See Also
Reference
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace