Revit 2027 API
SunAndShadowSettings Methods
The SunAndShadowSettings type exposes the following members.
Methods
Name | Description
CalculateTimeZone |  Use Revit's utilities to calculate the time zone for a given longitude and latitude.
FitToModel |  Adjust SunAndShadowSettings to fit around the current model geometry.
GetActiveSunAndShadowSettings |  Returns the current SunAndShadowSettings element assigned to the active view for the supplied document.
GetFrameAltitude |  Identifies the altitude of the sun (angle in radians) for a specific frame.
GetFrameAzimuth |  Identifies the azimuth of the sun (angle in radians) for a specific frame.
GetFrameTime |  Identifies the date and time of the SunAndShadowSettings element for a given frame.
GetMatchingPreset |  Finds the name of the 'per-document' SunAndShadowSettings that matches the properties of this per-view element.
GetSunrise |  Identifies the sunrise time for the SunAndShadowSettings element at its current location and indicated date.
GetSunset |  Identifies the sunset time for the SunAndShadowSettings element at its current location and indicated date.
IsAfterStartDateAndTime |  Checks whether the end date and time is valid.
IsBeforeEndDateAndTime |  Checks whether the start date and time is valid.
IsFrameValid |  Checks whether the frame is valid for the supplied SunAndShadowSettings.
IsGroundPlaneLevelValid |  Checks whether the element represents a valid Ground Plane level.
IsTimeIntervalValid |  Checks whether the time interval is valid for the SunAndShadowType.
Top
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace