Revit 2027 API
PipePressureDropData Methods
The PipePressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace