Revit 2027 API
PhotometricWebLightDistribution Properties
The PhotometricWebLightDistribution type exposes the following members.
Properties
Name | Description
PhotometricWebFile |  The filename of an IES photometric web file.
TiltAngle |  The tilt angle.
Top
See Also
Reference
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace