Revit 2027 API
PathReinforcementType Methods
The PathReinforcementType type exposes the following members.
Methods
Name | Description
CreateDefaultPathReinforcementType |  Creates a new PathReinforcementType object with a default name.
Top
See Also
Reference
PathReinforcementType Class
Autodesk.Revit.DB.Structure Namespace