Revit 2027 API
PipeFittingAndAccessoryPressureDropUIDataItem Methods
The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Methods
Name | Description
Dispose
GetEntity |  Returns the entity set by UI server. or an invalid entity otherwise.
GetPipeFittingAndAccessoryData |  Gets the fitting data stored in the UI data item.
SetEntity |  Stores the entity in the UI data item.
Top
See Also
Reference
PipeFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Plumbing Namespace