Revit 2027 API
LinePatternSegment Methods
The LinePatternSegment type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
LinePatternSegment Class
Autodesk.Revit.DB Namespace