Revit 2027 API
NumberedReferenceInfo Class
 Numbering info for a reference.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberedReferenceInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NumberedReferenceInfo : IDisposable
Public Class NumberedReferenceInfo
	Implements IDisposable
public ref class NumberedReferenceInfo : IDisposable
type NumberedReferenceInfo =
    class
        interface IDisposable
    end
The NumberedReferenceInfo type exposes the following members.
Constructors
Name | Description
NumberedReferenceInfo |  Creates a copy of the NumberedReferenceInfo.
Top
Properties
Name | Description
FormattedNumber |  The formated number associated with this reference.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberingParameterId |  The parameter id associated with this reference that is used for numbering.
NumberingSchemaId |  The numbering schema associated with this reference.
NumberingSchemaName |  The name of the numbering schema associated with this reference.
PartitionName |  The partition associated with this reference.
Value |  The integer representation of number associated with this reference.
Top
Methods
Name | Description
Dispose | Releases all resources used by the NumberedReferenceInfo
GetReference |  The target reference for this object.
Top
See Also
Reference
Autodesk.Revit.DB Namespace