Revit 2027 API
IDirectContext3DServer Interface
 The interface to be implemented by a server of the DirectContext3D external service.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IDirectContext3DServer : IExternalServer
Public Interface IDirectContext3DServer
	Inherits IExternalServer
public interface class IDirectContext3DServer : IExternalServer
type IDirectContext3DServer =
    interface
        interface IExternalServer
    end
The IDirectContext3DServer type exposes the following members.
Methods
Name | Description
CanExecute |  Can be used to allow the server to execute only in certain views.
GetApplicationId |  Reports this server's application ID.
GetBoundingBox |  Reports a bounding box of the geometry that this server submits for drawing.
GetSourceId |  Reports this server's source ID.
RenderScene |  Performs rendering of the scene that the server creates.
UseInTransparentPass |  Indicates whether this server will submit geometry during the rendering pass for transparent geometry.
UsesHandles |  Tests whether this server uses DirectContext3D handle elements.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace