Revit 2027 API
TopographyLinkType Class
 This class represents the site file brought into the current Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.TopographyLinkType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TopographyLinkType : ElementType
Public Class TopographyLinkType
	Inherits ElementType
public ref class TopographyLinkType : public ElementType
type TopographyLinkType =
    class
        inherit ElementType
    end
The TopographyLinkType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Reload |  Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace