Revit 2027 API
ElementIntersectsFilter Methods
The ElementIntersectsFilter type exposes the following members.
Methods
Name | Description
IsCategorySupported |  Identifies if the input element is of a category supported by element intersection filters.
IsElementSupported |  Identifies if the input element is supported by element intersection filters.
Top
See Also
Reference
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace