Revit 2027 API
ElementPhaseStatusFilter Class
 A filter used to match elements that have a given phase status on a given phase.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.ElementPhaseStatusFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementPhaseStatusFilter : ElementSlowFilter
Public Class ElementPhaseStatusFilter
	Inherits ElementSlowFilter
public ref class ElementPhaseStatusFilter : public ElementSlowFilter
type ElementPhaseStatusFilter =
    class
        inherit ElementSlowFilter
    end
The ElementPhaseStatusFilter type exposes the following members.
Constructors
Name | Description
ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus) |  Constructs a new instance of a file to match elements that have a given phase status on the input phase.
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>) |  Constructs a new instance of a file to match elements that have a given phase statuses on the input phase.
ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus, Boolean) |  Constructs a new instance of a file to match elements that have a given phase status on the input phase, with the option to match all elements that have a phase status other than the input status.
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>, Boolean) |  Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option to match all elements that have a phase status other than the input statuses.
Top
Properties
Name | Description
PhaseId |  The phase id.
Top
Methods
Name | Description
GetPhaseStatuses |  Returns the phase statuses assigned to this filter.
Top
Remarks
 This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB Namespace