Revit 2027 API
ViewNode Methods
The ViewNode type exposes the following members.
Methods
Name | Description
GetCameraInfo |  Information about the observation point (the camera) of the view.
Top
See Also
Reference
ViewNode Class
Autodesk.Revit.DB Namespace