Revit 2027 API
GBXMLImportOptions Class
Import options for Green-Building XML format.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GBXMLImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GBXMLImportOptions
Public Class GBXMLImportOptions
public ref class GBXMLImportOptions
type GBXMLImportOptions = class end
The GBXMLImportOptions type exposes the following members.
Constructors
Name | Description
GBXMLImportOptions | Default constructor. Sets all options to their default values.
Top
Methods
Name | Description
Top
Remarks
 Not used currently. Reserved for future use.
See Also
Reference
Autodesk.Revit.DB Namespace