Revit 2027 API
StructuralConnectionType Methods
The StructuralConnectionType type exposes the following members.
Methods
Name | Description
Create |  Create a new StructuralConnectionType, allowing the specified annotation FamilySymbol to be applied to structural members.
GetAllStructuralConnectionTypeIds |  Collects the ids of all StructuralConnectionTypes in the document.
GetFamilySymbolId |  FamilySymbol of the annotation to use for this connection type.
SetFamilySymbolId |  FamilySymbol of the annotation to use for this connection type.
ValidFamilySymbolId |  Checks whether the family symbol id is allowed for StructuralConnectionTypes with the given value for the applyTo property.
Top
See Also
Reference
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace