Revit 2027 API
IFCExternalServiceUIData Methods
The IFCExternalServiceUIData type exposes the following members.
Methods
Name | Description
Dispose
GetParentHwnd |  return the parent handle
GetRevitElementIds |  return the list of revit Element Ids
Top
See Also
Reference
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace