Revit 2027 API
NetworkCommunicationException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.NetworkCommunicationException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class NetworkCommunicationException : ApplicationException
<SerializableAttribute>
Public Class NetworkCommunicationException
	Inherits ApplicationException
[SerializableAttribute]
public ref class NetworkCommunicationException : public ApplicationException
[<SerializableAttribute>]
type NetworkCommunicationException =
    class
        inherit ApplicationException
    end
The NetworkCommunicationException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace