Revit 2027 API
WireSet Properties
The WireSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
See Also
Reference
WireSet Class
Autodesk.Revit.DB.Electrical Namespace