Revit 2027 API
AssemblyDifferenceConfiguration Class
 The two assemblies being compared have different spatial configuration
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 Autodesk.Revit.DB.AssemblyDifferenceConfiguration
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyDifferenceConfiguration : AssemblyDifference
Public Class AssemblyDifferenceConfiguration
	Inherits AssemblyDifference
public ref class AssemblyDifferenceConfiguration : public AssemblyDifference
type AssemblyDifferenceConfiguration =
    class
        inherit AssemblyDifference
    end
The AssemblyDifferenceConfiguration type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 Assemblies resulting in this difference might be made up of identical elements, but the elements are not arranged in space relative to each other in the same way.
See Also
Reference
Autodesk.Revit.DB Namespace