Revit 2027 API
ReferencePointArrayIterator Properties
The ReferencePointArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
ReferencePointArrayIterator Class
Autodesk.Revit.DB Namespace