Revit 2027 API
PropertyLine Class
 Class represents for property line element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.PropertyLine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PropertyLine : Element
Public Class PropertyLine
	Inherits Element
public ref class PropertyLine : public Element
type PropertyLine =
    class
        inherit Element
    end
The PropertyLine type exposes the following members.
Properties
Name | Description
Area |  The area of the PropertyLine element, if it is close loop, the value would be greater than 0, otherwise it will return -1.
SketchId |  Get the sketch Id of the PropertyLine element if it is sketch-based. Otherwise it will return invalidElementId.
Top
Methods
Name | Description
ConvertToTable |  Converts sketch based to table based
Create(Document, IList<CurveLoop>) |  Creates a new Property element with input CurveLoops and adds it to the document.
Create(Document, IList<PropertyTableEntry>) |  Creates a new PropertyLine element from property table and adds it to the document.
GetBoundary |  Gets the boundary of current PropertyLine element.
GetPropertyTable |  Gets the table entries for a table-based PropertyLine element.
GetStart |  Gets the start point of the PropertyLine element.
IsClosedLoop |  Indicates whether the PropertyLine curves form a closed loop.
IsSketchBased |  Indicates if the PropertyLine element is sketch-based.
IsValidBoundary |  Identifies whether the given curve loops compose a valid boundary to create PropertyLine element.
IsValidPropertyTable |  Function used to check the input table is valid to create property line element
IsValidToConvert |  Check whether the sketch contains all valid supported curve type.
SetBoundary |  Set a given curve loops as the boundary of the current PropertyLine element.
SetPropertyTable |  Sets the table entries for a table-based PropertyLine element.
SetStart |  Sets the start of point of a table-based PropertyLine element.
Top
See Also
Reference
Autodesk.Revit.DB Namespace