Revit 2027 API
DetailNurbSpline Class
Represents a DetailNurbSpline within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.DetailNurbSpline
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DetailNurbSpline : DetailCurve
Public Class DetailNurbSpline
	Inherits DetailCurve
public ref class DetailNurbSpline : public DetailCurve
type DetailNurbSpline =
    class
        inherit DetailCurve
    end
The DetailNurbSpline type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.
See Also
Reference
Autodesk.Revit.DB Namespace