Revit 2027 API
DividedSurface Class
 An element that represents a mesh on the surface of another element, a family instance, an import instance or a geometry combination, and a tile pattern built on that mesh.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DividedSurface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DividedSurface : Element
Public Class DividedSurface
	Inherits Element
public ref class DividedSurface : public Element
type DividedSurface =
    class
        inherit Element
    end
The DividedSurface type exposes the following members.
Properties
Name | Description
AllGridRotation | Angle of rotation applied to the U- and V- directions together.
BorderTile | Determines the handling of tiles that overlap the surface's boundary.
ComponentRotation | The rotation of the pattern by a multiple of 90 degrees.
Host | The element whose surface has been divided.
HostReference | A reference to the divided face on the host.
IsComponentFlipped | Whether the pattern is flipped.
IsComponentMirrored | Whether the pattern is mirror-imaged.
NumberOfUGridlines | Get the number of U-gridlines used on the surface.
NumberOfVGridlines | Get the number of V-gridlines used on the surface.
UPatternIndent | The offset applied to the pattern by an integral number of grid nodes in the U-direction.
USpacingRule | Access to the rule for laying out the first series of equidistant parallel lines on the surface.
VPatternIndent | The offset applied to the pattern by an integral number of grid nodes in the V-direction.
VSpacingRule | Access to the rule for laying out the second series of equidistant parallel lines on the surface.
Top
Methods
Name | Description
AddIntersectionElement |  Adds an intersection element to the divided surface.
CanBeDivided |  This returns true if the reference represents a face that can be used to create a divided surface.
CanBeIntersectionElement |  Checks if the element can be an intersection reference.
Create |  Creates a new instance of a divided surface with a default layout.
GetAllIntersectionElements |  Gets all intersection elements which produce division lines.
GetDividedSurfaceForReference |  Get a divided surface for a given reference. Returns null if the reference does not host a divided surface.
GetGridNodeLocation | Specify whether a particular grid node is interior to the surface, on the boundary, or outside the boundary.
GetGridNodeReference | Get a reference to the geometric point associated with a grid node.
GetGridNodeUV | Get the position of a grid node in UV coordinates in the surface.
GetGridSegmentReference | Get a reference to a line segment connecting two adjacent grid nodes.
GetReferencesWithDividedSurfaces |  For a given host element get references to all the faces that host a divided surface
GetTileFamilyInstance | Get a reference to a tile element associated with a given seed node.
GetTileReference | Get a reference to one of the tile surfaces associated with a given seed node.
IsSeedNode | Reports whether a grid node is a "seed node," a node that is associated with one or more tiles.
RemoveAllIntersectionElements |  Removes all the intersection elements from a divided surface.
RemoveIntersectionElement |  Removes an intersection element from a divided surface.
Top
Remarks
 The type of this element may be set to: a TilePattern element, a FamilySymbol element from a Curtain Panel family.
Example
public void TileSurface(Document document, Form form)
{
    // cover surface with OctagonRotate tile pattern
    TilePatterns tilePatterns = document.Settings.TilePatterns;
    foreach (Reference r in DividedSurface.GetReferencesWithDividedSurfaces(form))
    {
        DividedSurface ds = DividedSurface.GetDividedSurfaceForReference(document, r);
        ds.ChangeTypeId(tilePatterns.GetTilePattern(TilePatternsBuiltIn.OctagonRotate).Id);
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace