Revit 2027 API
TableView Properties
The TableView type exposes the following members.
Properties
Name | Description
MaximumColumnWidth |  Gets the maximum column width
MaximumGridWidth |  Gets the allowed maximum grid width
MaximumRowHeight |  Gets the maximum row height
MinimumColumnWidth |  Gets the minimum column width
MinimumRowHeight |  Gets the minimum row height
TargetId |  the element id of the element that is being viewed
Top
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace