Revit 2027 API
StructuralConnectionHandler Class
 An object of Structural Connection Handler.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.StructuralConnectionHandler
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralConnectionHandler : Element
Public Class StructuralConnectionHandler
	Inherits Element
public ref class StructuralConnectionHandler : public Element
type StructuralConnectionHandler =
    class
        inherit Element
    end
The StructuralConnectionHandler type exposes the following members.
Properties
Name | Description
ApprovalTypeId |  Retrieves or changes approval type of the Structural Connection Handler.
CodeCheckingStatus |  Code checking status of the structural connection.
OverrideTypeParams |  Allow or disallow connection's type parameters to be overridden.
SingleElementEndIndex |  Element end index for single element connections (0: start, 1: end).
Top
Methods
Name | Description
AddElementIds |  Adds element ids to the connection. All element ids in an array should be of applicable category.
AddReferences |  Adds references to the connection. All references should be of applicable category.
Create(Document, IList<ElementId>, ElementId) |  Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Create(Document, IList<ElementId>, String) |  Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler.
Create(Document, IList<ElementId>, ElementId, IList<ConnectionInputPoint>) |  Creates a new instance of a Structural Connection Handler, which is defined by the elements to connect and the additional points.
CreateGenericConnection |  Creates a new instance of a Structural Connection Handler with a generic type, which defines the connection between given elements.
GetConnectedElementIds |  Retrieves list of element ids of connected elements.
GetInputPoint |  Returns point with specified id. Returns null if specified point does not exist
GetInputPoints |  Returns a list of additional points defining certain connections.
GetInputReferences |  Gets references of input elements.
GetOrigin |  Retrieves origin point of Structural Connection Handler element.
IsCustom |  Checks if Structural Connection Handler has the custom connection style.
IsDetailed |  Checks if Structural Connection Handler has the detailed connection style.
RemoveElementIds |  Removes element ids from the connection. All element ids in an array should belong to the connection.
RemoveReferences |  Removes references from the connection. All references in an array should belong to the connection.
SetDefaultElementOrder |  Sorts the connected elements connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace