Revit 2027 API
RegenerationFailedException Class
The exception that is thrown when a regeneration operation failed.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.RegenerationFailedException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RegenerationFailedException : InvalidOperationException
<SerializableAttribute>
Public Class RegenerationFailedException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class RegenerationFailedException : public InvalidOperationException
[<SerializableAttribute>]
type RegenerationFailedException =
    class
        inherit InvalidOperationException
    end
The RegenerationFailedException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace