Revit 2027 API
MessageBoxData Class
 An object that represents a simple message box that prompts the user for some action.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.UI.Events.DialogBoxData
 Autodesk.Revit.UI.Events.MessageBoxData
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MessageBoxData : DialogBoxData
Public Class MessageBoxData
	Inherits DialogBoxData
public ref class MessageBoxData : public DialogBoxData
type MessageBoxData =
    class
        inherit DialogBoxData
    end
The MessageBoxData type exposes the following members.
Properties
Name | Description
DialogType |  An integer that describes the standard windows type of the dialog box.
Message |  The message that has been displayed in the dialog box.
Top
Methods
Name | Description
Top
Remarks
 When the application receives this object, a simple message box is displayed in Revit that requires user interaction. The OverrideResult function can be used to cause the dialog to be dismissed and return a desired result code.
See Also
Reference
Autodesk.Revit.UI.Events Namespace