Revit 2027 API
FabricationVersionInfo Class
 The object contains versioning information about fabrication data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationVersionInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationVersionInfo : IDisposable
Public Class FabricationVersionInfo
	Implements IDisposable
public ref class FabricationVersionInfo : IDisposable
type FabricationVersionInfo =
    class
        interface IDisposable
    end
The FabricationVersionInfo type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Reason |  The user-specified reason for the change.
Version |  The version number of the change.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationVersionInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace