Revit 2027 API
ElectricalDemandFactorValue Methods
The ElectricalDemandFactorValue type exposes the following members.
Methods
Name | Description
Dispose
SetMaxRangeToUnlimited |  Sets the max range on the value to unlimited
Top
See Also
Reference
ElectricalDemandFactorValue Class
Autodesk.Revit.DB.Electrical Namespace