Revit 2027 API
MEPCurveType Properties
The MEPCurveType type exposes the following members.
Properties
Name | Description
Cross | The default cross fitting of the MEP curve type.
Elbow | The default elbow fitting of the MEP curve type.
MultiShapeTransition | The default multi shape transition fitting of the MEP curve type.
PreferredJunctionType | The preferred junction type of the MEP curve type.
Roughness | The roughness of the MEP curve type. For PipeTypes, please use Segment::Roughness
RoutingPreferenceManager |  The RoutingPreferenceManager for the MEPCurveType
Shape |  The shape of the profile.
Tap | The default tap fitting of the MEP curve type.
Tee | The default tee fitting of the MEP curve type.
Transition | The default transition fitting of the MEP curve type.
Union | The default union fitting of the MEP curve type.
Top
See Also
Reference
MEPCurveType Class
Autodesk.Revit.DB Namespace