Revit 2027 API
ExportLayerInfo Methods
The ExportLayerInfo type exposes the following members.
Methods
Name | Description
AddCutLayerModifier |  Adds a cut layer modifier to the layer info.
AddLayerModifier |  Adds a project layer modifier to the layer info.
ClearCutLayerModifiers |  Clears all the cut layer modifiers stored in the layer info.
ClearLayerModifiers |  Clears all the project layer modifiers stored in the layer info.
Dispose
GetCutLayerModifiers |  Gets all the cut layer modifiers from the layer info.
GetLayerModifiers |  Gets all the project layer modifiers from the layer info.
RemoveCutLayerModifier |  Removes a cut layer modifier from the layer info.
RemoveLayerModifier |  Removes a project layer modifier from the layer info.
SetCutLayerModifiers |  Sets a cut layer modifier array to the layer info.
SetLayerModifiers |  Sets a project layer modifier array to the layer info.
Top
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace