Revit 2027 API
VendorIdAttribute Class
 The custom VendorId attribute for Macros macros use only.
Inheritance Hierarchy
System.Object
 System.Attribute
 Autodesk.Revit.DB.Macros.VendorIdAttribute
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VendorIdAttribute : Attribute
Public Class VendorIdAttribute
	Inherits Attribute
public ref class VendorIdAttribute : public Attribute
type VendorIdAttribute =
    class
        inherit Attribute
    end
The VendorIdAttribute type exposes the following members.
Constructors
Name | Description
VendorIdAttribute | Constructs a new VendorIdAttribute.
Top
Properties
Name | Description
Value | AddInId VendorId value.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace