Revit 2027 API
ExternalResourceLoadData Methods
The ExternalResourceLoadData type exposes the following members.
Methods
Name | Description
Dispose
GetExternalResourceReference |  Returns the ExternalResourceReference that identifies which resource should be loaded.
GetLoadContent |  Returns the ExternalResourceLoadContent resulting from this load operation.
GetLoadContext |  Returns an object containing information about the context of the load operation.
GetLoadRequestId |  Returns the load operation GUID.
Top
See Also
Reference
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace