Revit 2027 API
FileNotFoundException Methods
The FileNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
FileNotFoundException Class
Autodesk.Revit.Exceptions Namespace