Revit 2027 API
AreaTagType Class
An object that represents an Area Tag style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.AreaTagType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaTagType : FamilySymbol
Public Class AreaTagType
	Inherits FamilySymbol
public ref class AreaTagType : public FamilySymbol
type AreaTagType =
    class
        inherit FamilySymbol
    end
The AreaTagType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace