Revit 2027 API
Profile Properties
The Profile type exposes the following members.
Properties
Name | Description
Curves | Retrieve the curves that make up the boundary of the profile.
Filled | Get or set whether the profile is filled.
Transformed | Transforms this profile and returns the result.
Top
See Also
Reference
Profile Class
Autodesk.Revit.DB Namespace