Revit 2027 API
RevitLinkType Properties
The RevitLinkType type exposes the following members.
Properties
Name | Description
AttachmentType |  The attachment/overlay status of this link.
IsNestedLink |  Indicates whether this link is a nested or top-level link.
LocallyUnloaded |  Checks whether a Revit link in a local model is unloaded only for the current user.
PathType |  The type of path the link uses.
Top
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace