Revit 2027 API
RoofBase Properties
The RoofBase type exposes the following members.
Properties
Name | Description
EaveCuts | Retrieve or set the EaveCutterType.
FasciaDepth | Retrieve or set the FasciaDepth.
RoofType | Retrieve or set the Type.
Top
See Also
Reference
RoofBase Class
Autodesk.Revit.DB Namespace