Revit 2027 API
StructuralSectionColdFormed Properties
The StructuralSectionColdFormed type exposes the following members.
Properties
Name | Description
InnerFillet |  Inner Fillet - Corner fillet inner radius.
WallDesignThickness |  Represents wall design thickness of rectangle.
WallNominalThickness |  Represents wall nominal thickness of rectangle.
Top
See Also
Reference
StructuralSectionColdFormed Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace