Revit 2027 API
MechanicalFitting Class
A mechanical fitting in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.MEPModel
 Autodesk.Revit.DB.Mechanical.MechanicalFitting
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalFitting : MEPModel
Public Class MechanicalFitting
	Inherits MEPModel
public ref class MechanicalFitting : public MEPModel
type MechanicalFitting =
    class
        inherit MEPModel
    end
The MechanicalFitting type exposes the following members.
Properties
Name | Description
PartType | The part type of the mechanical fitting.
Top
Methods
Name | Description
Top
Remarks
The mechanical fitting is only available in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace