Revit 2027 API
RibbonItem Class
The RibbonItem object represents an item on RibbonPanel, can be a push-button or a pull-down which should contain the information for creating one RibbonItem.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 More
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RibbonItem
Public Class RibbonItem
public ref class RibbonItem
type RibbonItem = class end
The RibbonItem type exposes the following members.
Properties
Name | Description
Enabled | Gets or sets a value indicating whether the item is enabled.
ItemText | Gets or sets the text displayed on the item.
ItemType | Gets the item type.
LongDescription |  Long description of the command tooltip
Name | The name of the item.
ToolTip | The description that appears as a ToolTip for the item.
ToolTipImage | The image to show as a part of the button extended tooltip
Visible | Gets or sets a value indicating whether the item is visible.
Top
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetContextualHelp | Gets the contextual help bound with this control.
SetContextualHelp | Sets the contextual help bound with this button.
Top
Remarks
This class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.ComboBox
 Autodesk.Revit.UI.ComboBoxMember
 Autodesk.Revit.UI.RadioButtonGroup
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.TextBox