Revit 2027 API
MacroManager Methods
The MacroManager type exposes the following members.
Methods
Name | Description
AddModule |  Adds a MacroModule to the application.
Contains |  Indicates the given module is a member of this collection.
Dispose
GetApplicationMacroSecurityOptions |  Gets the application macro security options.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetMacroManager |  Gets the Macro manager from the application.
GetMacroManagerIterator |  Returns a Macro manager iterator that iterates through the collection.
RemoveModule |  Removes a MacroModule.
SetApplicationMacroSecurityOptions |  Sets the application macro security options.
Top
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace