Revit 2027 API
RevisionSettings Properties
The RevisionSettings type exposes the following members.
Properties
Name | Description
RevisionCloudSpacing |  Determines the size in paper space of revision clouds drawn in a project.
RevisionNumbering |  Determines how the revision number values will display on sheets.
Top
See Also
Reference
RevisionSettings Class
Autodesk.Revit.DB Namespace