Revit 2027 API
BrowserOrganization Methods
The BrowserOrganization type exposes the following members.
Methods
Name | Description
AreFiltersSatisfied |  Determines if the given element satisfies the filters defined by the browser organization.
GetCurrentBrowserOrganizationForPanelSchedules |  Gets the BrowserOrganization that applies to the Panel Schedules section of the project browser.
GetCurrentBrowserOrganizationForSchedules |  Gets the BrowserOrganization that applies to the Schedules section of the project browser.
GetCurrentBrowserOrganizationForSheets |  Gets the BrowserOrganization that applies to the Sheets section of the project browser.
GetCurrentBrowserOrganizationForViews |  Gets the BrowserOrganization that applies to the Views section of the project browser.
GetFolderItems |  Returns a collection of leaf FolderItemInfo objects each containing the given element Id.
GetSortingParameterIdPath |  The parameter Id path used to determine the sorting order of items in the browser.
Top
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace