Revit 2027 API
CurveLoopIterator Methods
The CurveLoopIterator type exposes the following members.
Methods
Name | Description
Dispose
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
CurveLoopIterator Class
Autodesk.Revit.DB Namespace