Revit 2027 API
StructuralSectionISlopedFlange Properties
The StructuralSectionISlopedFlange type exposes the following members.
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
Top
See Also
Reference
StructuralSectionISlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace