Revit 2027 API
RebarShapeConstraint180DegreeDefaultBend Class
 A constraint which can be applied to a RebarShapeSegment, and causes the segment to be replaced with a 180-degree arc. The arc's radius is not specified by the shape; instead it is a "default bend radius," taken from the RebarBarType associated with the Rebar instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraint180DegreeDefaultBend : RebarShapeConstraint
Public Class RebarShapeConstraint180DegreeDefaultBend
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraint180DegreeDefaultBend : public RebarShapeConstraint
type RebarShapeConstraint180DegreeDefaultBend =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraint180DegreeDefaultBend type exposes the following members.
Constructors
Name | Description
RebarShapeConstraint180DegreeDefaultBend |  Create a 180-degree bend constraint.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace