Revit 2027 API
ProjectPosition Methods
The ProjectPosition type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ProjectPosition Class
Autodesk.Revit.DB Namespace