Revit 2027 API
SKPImportOptions Class
 The import options used to import SKP format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.SKPImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SKPImportOptions : BaseImportOptions
Public Class SKPImportOptions
	Inherits BaseImportOptions
public ref class SKPImportOptions : public BaseImportOptions
type SKPImportOptions =
    class
        inherit BaseImportOptions
    end
The SKPImportOptions type exposes the following members.
Constructors
Name | Description
SKPImportOptions() |  Constructs a new instance of SKPImportOptions with default values of all properties.
SKPImportOptions(SKPImportOptions) |  Constructs a new instance of SKPImportOptions as a copy of the import options.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace