Revit 2027 API
Solid Class
A 3d solid.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Solid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Solid : GeometryObject
Public Class Solid
	Inherits GeometryObject
public ref class Solid : public GeometryObject
type Solid =
    class
        inherit GeometryObject
    end
The Solid type exposes the following members.
Properties
Name | Description
Edges | The edges that belong to the solid.
Faces | The faces that belong to the solid.
SurfaceArea | Returns the total surface area of this solid.
Volume | Returns the signed volume of this solid.
Top
Methods
Name | Description
ComputeCentroid | Returns the Centroid of this solid.
GetBoundingBox |  Retrieves a box that circumscribes the solid geometry.
IntersectWithCurve |  Calculates and returns the intersection between a curve and this solid.
Top
Remarks
A solid is defined by the faces and edges that form its boundary.
Example
private void GetAndTransformSolidInfo(Application application, Element element, Options geoOptions)
{
    // Get geometry element of the selected element
    Autodesk.Revit.DB.GeometryElement geoElement = element.get_Geometry(geoOptions);
    // Get geometry object
    foreach (GeometryObject geoObject in geoElement)
    {
        // Get the geometry instance which contains the geometry information
        Autodesk.Revit.DB.GeometryInstance instance = geoObject as Autodesk.Revit.DB.GeometryInstance;
        if (null != instance)
        {
            foreach (GeometryObject instObj in instance.SymbolGeometry)
            {
                Solid solid = instObj as Solid;
                if (null == solid || 0 == solid.Faces.Size || 0 == solid.Edges.Size)
                {
                    continue;
                }
                Transform instTransform = instance.Transform;
                // Get the faces and edges from solid, and transform the formed points
                foreach (Face face in solid.Faces)
                {
                    Mesh mesh = face.Triangulate();
                    foreach (XYZ ii in mesh.Vertices)
                    {
                       XYZ point = ii;
                        XYZ transformedPoint = instTransform.OfPoint(point);
                    }
                }
                foreach (Edge edge in solid.Edges)
                {
                   foreach (XYZ ii in edge.Tessellate())
                    {
                       XYZ point = ii;
                        XYZ transformedPoint = instTransform.OfPoint(point);
                    }
                }
            }
        }
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace