Revit 2027 API
RebarContainer Properties
The RebarContainer type exposes the following members.
Properties
Name | Description
ItemsCount |  The count of Items in this Rebar Container.
PresentItemsAsSubelements |  Identifies if Items should be presented in schedules and tags as separate subelements.
ScheduleMark |  The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
Top
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace