Revit 2027 API
IFCGeometryInfo Methods
The IFCGeometryInfo type exposes the following members.
Methods
Name | Description
CreateCurveGeometryInfo |  Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(Double, Boolean) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateFaceGeometryInfo(ExporterIFC, Plane, XYZ, Double, Boolean) |  Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
CreateSurfaceGeometryInfo |  Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.
Dispose
GetCurves |  Gets the IfcCurve handles created representing the processed geometry and stored in this object.
GetFaces |  Gets the IfcFace handles created representing the processed geometry and stored in this object.
GetRepresentations |  Gets the representation handles created representing the processed geometry and stored in this object.
GetSurfaces |  Gets the IfcSurface handles created representing the processed geometry and stored in this object.
Top
See Also
Reference
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace