Revit 2027 API
AnnotationLabel Class
 Represents the label elements in annotation families. Labels are used to display parameter values as text.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.TextElement
 Autodesk.Revit.DB.AnnotationLabel
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnnotationLabel : TextElement
Public Class AnnotationLabel
	Inherits TextElement
public ref class AnnotationLabel : public TextElement
type AnnotationLabel =
    class
        inherit TextElement
    end
The AnnotationLabel type exposes the following members.
Properties
Name | Description
UseNonBreakingSpaces |  If non-breaking spaces should be used in the label text.
Top
Methods
Name | Description
GetParameterFormatting |  Gets the collection of parameter formatting objects for the parameters seen in the label.
Top
See Also
Reference
Autodesk.Revit.DB Namespace