Revit 2027 API
ComboBox Methods
The ComboBox type exposes the following members.
Methods
Name | Description
AddItem | Adds a new item to the ComboBox.
AddItems | Adds a new items to the ComboBox.
AddSeparator | Adds a separator to the drop-down list.
GetItems | Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox.
Top
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace