Revit 2027 API
FileImportingEventArgs Properties
The FileImportingEventArgs type exposes the following members.
Properties
Name | Description
Format |  Identifies the import format, e.g. DWG or image.
Path |  Path of the source file which is about to be imported.
Top
See Also
Reference
FileImportingEventArgs Class
Autodesk.Revit.DB.Events Namespace