Revit 2027 API
ComponentRepeaterSlot Properties
The ComponentRepeaterSlot type exposes the following members.
Properties
Name | Description
FamilyType |  The id of the family type of the component in the slot, or invalid id if the slot is empty.
IsDefault |  A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.
IsEmpty |  A flag indicating whether the slot is currently empty.
Top
See Also
Reference
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace