Revit 2027 API
StructuralConnectionApprovalType Methods
The StructuralConnectionApprovalType type exposes the following members.
Methods
Name | Description
Create |  Creates a new StructuralConnectionApprovalType.
GetAllStructuralConnectionApprovalTypes |  Collects the ids of all StructuralConnectionApprovalTypes in the document.
IsValidApprovalTypeName |  Verifies if the provided approval name is unique in the document.
Top
See Also
Reference
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace