Revit 2027 API
IndexTriangle Properties
The IndexTriangle type exposes the following members.
Properties
Name | Description
Index0 |  The index of the triangle's first vertex.
Index1 |  The index of the triangle's second vertex.
Index2 |  The index of the triangle's third vertex.
Top
See Also
Reference
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace