Revit 2027 API
ArgumentException Properties
The ArgumentException type exposes the following members.
Properties
Name | Description
Message | Gets the error message and the parameter name, or only the error message if no parameter name is set.
(Overrides Exception.Message)
ParamName | Gets the name of the parameter that causes this exception.
Top
See Also
Reference
ArgumentException Class
Autodesk.Revit.Exceptions Namespace