Revit 2027 API
FabricWireType Methods
The FabricWireType type exposes the following members.
Methods
Name | Description
CreateDefaultFabricWireType |  Creates a new FabricWireType object with a default name.
Top
See Also
Reference
FabricWireType Class
Autodesk.Revit.DB.Structure Namespace