Revit 2027 API
TextNote Properties
The TextNote type exposes the following members.
Properties
Name | Description
LeaderCount |  Number of leader objects currently attached to the text note.
LeaderLeftAttachment |  Attachment position of leaders on the left side of the text note.
LeaderRightAttachment |  Attachment position of leaders on the right side of the text note.
TextNoteType | Access the type of the TextNote object.
Top
See Also
Reference
TextNote Class
Autodesk.Revit.DB Namespace