Revit 2027 API
SweptBlend Methods
The SweptBlend type exposes the following members.
Methods
Name | Description
GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles.
SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles.
Top
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace