Revit 2027 API
ReinforcementAbbreviationTag Methods
The ReinforcementAbbreviationTag type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ReinforcementAbbreviationTag Class
Autodesk.Revit.DB.Structure Namespace