Revit 2027 API
RegenerationFailedException Methods
The RegenerationFailedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RegenerationFailedException Class
Autodesk.Revit.Exceptions Namespace