Revit 2027 API
FilterIntegerRule Properties
The FilterIntegerRule type exposes the following members.
Properties
Name | Description
RuleValue |  The user-supplied value against which values from a Revit document will be tested.
Top
See Also
Reference
FilterIntegerRule Class
Autodesk.Revit.DB Namespace