Revit 2027 API
SpotDimension Methods
The SpotDimension type exposes the following members.
Methods
Name | Description
CanFlip |  Verifies that the direction of the dimension can be flipped.
Flip |  Flips dimension to the other side of the host.
Top
See Also
Reference
SpotDimension Class
Autodesk.Revit.DB Namespace