Revit 2027 API
AppearanceAssetEditScope Methods
The AppearanceAssetEditScope type exposes the following members.
Methods
Name | Description
Cancel |  Cancels the edit scope.
Commit |  Finishes the edit scope.
Dispose
Start |  Starts the edit scope.
Top
See Also
Reference
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace