Revit 2027 API
ExternalDataManagerDataItemId Class
 Unique identifier of an external data manager data item.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalDataManagerDataItemId
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalDataManagerDataItemId : IDisposable
Public Class ExternalDataManagerDataItemId
	Implements IDisposable
public ref class ExternalDataManagerDataItemId : IDisposable
type ExternalDataManagerDataItemId =
    class
        interface IDisposable
    end
The ExternalDataManagerDataItemId type exposes the following members.
Constructors
Name | Description
ExternalDataManagerDataItemId(ExternalDataManagerDataItemId) |  Create a copy of the object.
ExternalDataManagerDataItemId(Int64) |  Constructor
Top
Properties
Name | Description
Id |  The identity of the data item.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalDataManagerDataItemId
Top
Remarks
 Each external data manager data item must have a unique 64-bit integer ID. Unique ID should be created using appropriate generation mechanism.
See Also
Reference
Autodesk.Revit.UI Namespace