Revit 2027 API
DocumentSavedEventArgs Class
 The event arguments used by the DocumentSaved event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSavedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSavedEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentSavedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentSavedEventArgs : public RevitAPIPostDocEventArgs
type DocumentSavedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentSavedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace