Revit 2027 API
AssetProperty Class
 Represents a property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 More
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetProperty : IDisposable
Public Class AssetProperty
	Implements IDisposable
public ref class AssetProperty : IDisposable
type AssetProperty =
    class
        interface IDisposable
    end
The AssetProperty type exposes the following members.
Properties
Name | Description
IsReadOnly |  Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name | Get the name of the AssetProperty
NumberOfConnectedProperties |  The number of currently connected properties.
Type | Returns the type of the AssetProperty
Top
Methods
Name | Description
AddConnectedAsset |  Adds a new connected asset attached to this asset property, if it allows it.
AddCopyAsConnectedAsset |  Makes a copy of the asset and connects it to this property.
Dispose | Releases all resources used by the AssetProperty
GetAllConnectedProperties |  Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
GetConnectedProperty |  Gets one connected property with specified index.
GetSingleConnectedAsset |  Gets the single connected asset attached to this asset property, if it exists.
GetTypeName | Get the name of the AssetProperty
IsEditable |  Check if property can be edited.
IsValidSchemaIdentifier |  Check that schema name is valid
RemoveConnectedAsset |  Removes the connected asset attached to this asset property if any.
Top
Remarks
 AssetProperty is the base class or all other AssetProperty sub classes.
See Also
Reference
Autodesk.Revit.DB.Visual Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetProperties
 Autodesk.Revit.DB.Visual.AssetPropertyBoolean
 Autodesk.Revit.DB.Visual.AssetPropertyDistance
 Autodesk.Revit.DB.Visual.AssetPropertyDouble
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
 Autodesk.Revit.DB.Visual.AssetPropertyEnum
 Autodesk.Revit.DB.Visual.AssetPropertyFloat
 Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
 Autodesk.Revit.DB.Visual.AssetPropertyInt64
 Autodesk.Revit.DB.Visual.AssetPropertyInteger
 Autodesk.Revit.DB.Visual.AssetPropertyList
 Autodesk.Revit.DB.Visual.AssetPropertyReference
 Autodesk.Revit.DB.Visual.AssetPropertyString
 Autodesk.Revit.DB.Visual.AssetPropertyTime
 Autodesk.Revit.DB.Visual.AssetPropertyUInt64