Revit 2027 API
MenuItem Class
 An abstract base class that represent a context menu item.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.MenuItem
 Autodesk.Revit.UI.CommandMenuItem
 Autodesk.Revit.UI.SeparatorItem
 Autodesk.Revit.UI.SubMenuItem
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MenuItem : IDisposable
Public Class MenuItem
	Implements IDisposable
public ref class MenuItem : IDisposable
type MenuItem =
    class
        interface IDisposable
    end
The MenuItem type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MenuItem
Top
See Also
Reference
Autodesk.Revit.UI Namespace