Revit 2027 API
FamilyElementVisibility Properties
The FamilyElementVisibility type exposes the following members.
Properties
Name | Description
IsShownInCoarse | Indicates if the instance is display with Coarse detail level in the view of project document.
IsShownInFine | Indicates if the instance is display with Fine detail level in the view of project document.
IsShownInFrontBack | Indicates if the instance is display in Front/Back view of project document.
IsShownInLeftRight | Indicates if the instance is display in Left/Right view of project document.
IsShownInMedium | Indicates if the instance is display with Medium detail level in the view of project document.
IsShownInPlanRCPCut | Indicates if the instance is displayed when cut in Plan/RCP (if the category permits).
IsShownInTopBottom | Indicates if the instance is display in Plan/RCP view of project document.
IsShownOnlyWhenCut | Indicates if the instance is displayed only if it has been cut.
VisibilityType | Indicates if the instance is Model or View specific.
Top
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace