Revit 2027 API
Part Methods
The Part type exposes the following members.
Methods
Name | Description
CanOffsetFace |  Checks if it is possible to offset the given face.
GetFaceOffset |  Get face offset of the given part face.
GetSourceElementIds |  Gets a collection of elements from which this Part is created by the PartMaker. May return more than one source only if there is merge involved somewhere in the history of this Part.
GetSourceElementOriginalCategoryIds |  Gets the category ids of the source elements which were used to form this part.
ResetFaceOffset |  Resets the offset applied to the given part face.
ResetPartShape |  Resets all face offsets applied to part faces.
SetFaceOffset |  Offsets the given part face in the direction that points out of the solid shape with the specified amount. Negative value will offset the face into the solid shape.
Top
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace