Revit 2027 API
CurtainGridSet Properties
The CurtainGridSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
See Also
Reference
CurtainGridSet Class
Autodesk.Revit.DB Namespace