Revit 2027 API
RevitAPIEventArgs Class
 The class is used as base class for all event argument classes.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitAPIEventArgs : EventArgs,
	IDisposable
Public Class RevitAPIEventArgs
	Inherits EventArgs
	Implements IDisposable
public ref class RevitAPIEventArgs : public EventArgs,
	IDisposable
type RevitAPIEventArgs =
    class
        inherit EventArgs
        interface IDisposable
    end
The RevitAPIEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RevitAPIEventArgs
IsCancelled |  Indicates whether the event is being cancelled.
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace