Revit 2027 API
ViewNode Class
 A render node that represents a view.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ViewNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewNode : RenderNode
Public Class ViewNode
	Inherits RenderNode
public ref class ViewNode : public RenderNode
type ViewNode =
    class
        inherit RenderNode
    end
The ViewNode type exposes the following members.
Properties
Name | Description
LevelOfDetail |  The level of detail the view is going to be rendered at.
ViewId |  The Id of the view element.
Top
Methods
Name | Description
GetCameraInfo |  Information about the observation point (the camera) of the view.
Top
Remarks
 See also: OnViewBegin(ViewNode).
See Also
Reference
Autodesk.Revit.DB Namespace