Revit 2027 API
DuctFittingAndAccessoryPressureDropUIData Class
 The input and output data used by external UI servers for storing UI settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIData
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctFittingAndAccessoryPressureDropUIData : IDisposable
Public Class DuctFittingAndAccessoryPressureDropUIData
	Implements IDisposable
public ref class DuctFittingAndAccessoryPressureDropUIData : IDisposable
type DuctFittingAndAccessoryPressureDropUIData =
    class
        interface IDisposable
    end
The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctFittingAndAccessoryPressureDropUIData
GetUIDataItems |  Gets all UI data items stored in the UI data.
GetUnits |  Gets units.
Top
See Also
Reference
Autodesk.Revit.UI.Mechanical Namespace