Revit 2027 API
ViewExportedEventArgs Properties
The ViewExportedEventArgs type exposes the following members.
Properties
Name | Description
ViewId |  Identifies the view that was exported.
Top
See Also
Reference
ViewExportedEventArgs Class
Autodesk.Revit.DB.Events Namespace