Revit 2027 API
FamilySymbol Properties
The FamilySymbol type exposes the following members.
Properties
Name | Description
Family |  The Family object to which the symbol belongs.
IsActive |  Identifies whether the symbol is active.
Origin |  The point in the symbol's space corresponding to the insertion point/origin as seen from outside the symbol.
StructuralMaterialType | This property returns the physical material from which the type is made.
Top
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace