Revit 2027 API
DefinitionBindingMap Methods
The DefinitionBindingMap type exposes the following members.
Methods
Name | Description
Clear | Removes every binding from the map, rendering it empty.
Contains
Erase
ForwardIterator | Retrieve a forward moving iterator to the map.
GetEnumerator | Retrieve a forward moving iterator to the map.
Insert
ReverseIterator | Retrieve a backward moving iterator to the map.
Top
See Also
Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace