Revit 2027 API
AnalyticalLinkType Properties
The AnalyticalLinkType type exposes the following members.
Properties
Name | Description
RotationX |  Fixity of rotation around X.
RotationY |  Fixity of rotation around Y.
RotationZ |  Fixity of rotation around Z.
TranslationX |  Fixity of translation along X.
TranslationY |  Fixity of translation along Y.
TranslationZ |  Fixity of translation along Z.
Top
See Also
Reference
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace