Revit 2027 API
PipeType Class
 A pipe type element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Plumbing.PipeType
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeType : MEPCurveType
Public Class PipeType
	Inherits MEPCurveType
public ref class PipeType : public MEPCurveType
type PipeType =
    class
        inherit MEPCurveType
    end
The PipeType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace