Revit 2027 API
RevitAPIPostDocEventArgs Class
 The base class used for post events where the arguments must supply access to the document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 More
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitAPIPostDocEventArgs : RevitAPIPostEventArgs
Public Class RevitAPIPostDocEventArgs
	Inherits RevitAPIPostEventArgs
public ref class RevitAPIPostDocEventArgs : public RevitAPIPostEventArgs
type RevitAPIPostDocEventArgs =
    class
        inherit RevitAPIPostEventArgs
    end
The RevitAPIPostDocEventArgs type exposes the following members.
Properties
Name | Description
Document |  The document associated with the event.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentCreatedEventArgs
 Autodesk.Revit.DB.Events.DocumentOpenedEventArgs
 Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadedLatestEventArgs
 Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs
 Autodesk.Revit.DB.Events.DocumentSavedEventArgs
 Autodesk.Revit.DB.Events.DocumentSynchronizedWithCentralEventArgs
 Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs
 Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs
 Autodesk.Revit.DB.Events.FileExportedEventArgs
 Autodesk.Revit.DB.Events.FileImportedEventArgs
 Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs
 Autodesk.Revit.DB.Events.ViewExportedEventArgs
 Autodesk.Revit.DB.Events.ViewPrintedEventArgs
 Autodesk.Revit.DB.Events.ViewsExportedByContextEventArgs
 Autodesk.Revit.UI.Events.ViewActivatedEventArgs