Revit 2027 API
SpaceTagType Class
An object that represents a Space Tag style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.Mechanical.SpaceTagType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpaceTagType : FamilySymbol
Public Class SpaceTagType
	Inherits FamilySymbol
public ref class SpaceTagType : public FamilySymbol
type SpaceTagType =
    class
        inherit FamilySymbol
    end
The SpaceTagType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace