Revit 2027 API
AnnotationLabelParameterFormatting Methods
The AnnotationLabelParameterFormatting type exposes the following members.
Methods
Name | Description
Dispose
GetParameterDefinition |  The definition of the parameter shown in the label.
Top
See Also
Reference
AnnotationLabelParameterFormatting Class
Autodesk.Revit.DB Namespace