Revit 2027 API
ObjectAccessException Class
The exception that is thrown when an operation is denied, e.g. an attempt was made to set a read-only property.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.ObjectAccessException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ObjectAccessException : InvalidOperationException
<SerializableAttribute>
Public Class ObjectAccessException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class ObjectAccessException : public InvalidOperationException
[<SerializableAttribute>]
type ObjectAccessException =
    class
        inherit InvalidOperationException
    end
The ObjectAccessException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace