Revit 2027 API
InvalidPathArgumentException Methods
The InvalidPathArgumentException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
InvalidPathArgumentException Class
Autodesk.Revit.Exceptions Namespace