Revit 2027 API
DuctFittingAndAccessoryData Class
 The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctFittingAndAccessoryData : IDisposable
Public Class DuctFittingAndAccessoryData
	Implements IDisposable
public ref class DuctFittingAndAccessoryData : IDisposable
type DuctFittingAndAccessoryData =
    class
        interface IDisposable
    end
The DuctFittingAndAccessoryData type exposes the following members.
Properties
Name | Description
Density |  The air density for the duct fitting or duct accessory, Units: kg/ft^3.
DynamicViscosity |  The dynamic viscosity of air for the duct fitting or duct accessory, Units: (kg/(ft·s)).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Origin |  The origin position of the duct fitting or duct accessory.
PartType |  The part type of the duct fitting or duct accessory.
ServerGUID |  The GUID of the duct fitting or duct accessory.
SystemClassification |  The system classification of the duct fitting or duct accessory.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctFittingAndAccessoryData
GetAllConnectorData |  Gets the connector data of the pipe fitting or pipe accessory.
GetEntity |  Returns an Entity of the Schema of the serverGUID. or an invalid entity otherwise.
GetFamilyInstanceId |  Gets the Id of the fiting or accessory instance
Top
Remarks
 A FamilyInstance is the input data for the calculation,
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace