Revit 2027 API
Camera Class
 A collection of camera settings for the current view.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Camera
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Camera : IDisposable
Public Class Camera
	Implements IDisposable
public ref class Camera : IDisposable
type Camera =
    class
        interface IDisposable
    end
The Camera type exposes the following members.
Constructors
Name | Description
Camera |  Camera
Top
Properties
Name | Description
EyePosition |  Camera's position in the world
FarDistance |  Distance to far clipping plane
HorizontalExtent |  Horizontal extent of the camera's view, measured at target distance.
HorizontalOffset |  Horizontal offset of the camera's view center from target, measured at target distance.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NearDistance |  Distance to near clipping plane
ProjectionMethod |  Projection method
TargetDistance |  Distance from camera to its target
UpDirection |  Up direction of the camera
VerticalExtent |  Vertical extent of the camera's view, measured at target distance.
VerticalOffset |  Vertical offset of the camera's view center from target, measured at target distance.
ViewDirection |  Direction that the camera is facing
Top
Methods
Name | Description
Dispose | Releases all resources used by the Camera
Transform |  Transforms the camera
Top
Remarks
 The current Camera can be obtained from DrawContext
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace