Revit 2027 API
IFCGuidKey Class
 IFCGuidKey is used for case-sensitive comparison of GUID values for maps and sets.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCGuidKey
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCGuidKey : IDisposable
Public Class IFCGuidKey
	Implements IDisposable
public ref class IFCGuidKey : IDisposable
type IFCGuidKey =
    class
        interface IDisposable
    end
The IFCGuidKey type exposes the following members.
Constructors
Name | Description
IFCGuidKey(IFCGuidKey) |  IFCGuidKey can be used in managed code as well as unmanaged.
IFCGuidKey(String) |  Constructs a new IFCHybridGuid
Top
Properties
Name | Description
IFCGlobalId |  IFC GlobalId for map.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCGuidKey
Equals |  Determines whether this IFCGuidKey is equal to another.
(Overrides Object.Equals(Object))
GetHashCode |  Returns the hash code for this IFCGuidKey
(Overrides Object.GetHashCode())
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace