Revit 2027 API
ElementIdParameterValue Class
 A class that holds a ElementId value of a parameter element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.ElementIdParameterValue
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementIdParameterValue : ParameterValue
Public Class ElementIdParameterValue
	Inherits ParameterValue
public ref class ElementIdParameterValue : public ParameterValue
type ElementIdParameterValue =
    class
        inherit ParameterValue
    end
The ElementIdParameterValue type exposes the following members.
Constructors
Name | Description
ElementIdParameterValue() |  Default constructor
ElementIdParameterValue(ElementId) |  Value constructor
Top
Properties
Name | Description
Value |  The stored value
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace