Revit 2027 API
FilterCategoryRule Class
 A filter rule that matches elements of a set of categories.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterCategoryRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterCategoryRule : FilterRule
Public Class FilterCategoryRule
	Inherits FilterRule
public ref class FilterCategoryRule : public FilterRule
type FilterCategoryRule =
    class
        inherit FilterRule
    end
The FilterCategoryRule type exposes the following members.
Constructors
Name | Description
FilterCategoryRule |  Constructs a new instance of FilterCategoryRule.
Top
Properties
Name | Description
Top
Methods
Name | Description
AllCategoriesFilterable |  Checks that all of the given categories are filterable.
GetCategories |  Gets the rule's categories.
SetCategories |  Sets the rule's categories.
Top
See Also
Reference
Autodesk.Revit.DB Namespace