Revit 2027 API
StructuralConnectionApprovalType Class
 A type element that represents a connection approval type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralConnectionApprovalType : ElementType
Public Class StructuralConnectionApprovalType
	Inherits ElementType
public ref class StructuralConnectionApprovalType : public ElementType
type StructuralConnectionApprovalType =
    class
        inherit ElementType
    end
The StructuralConnectionApprovalType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new StructuralConnectionApprovalType.
GetAllStructuralConnectionApprovalTypes |  Collects the ids of all StructuralConnectionApprovalTypes in the document.
IsValidApprovalTypeName |  Verifies if the provided approval name is unique in the document.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace