Revit 2027 API
FilterNumericValueRule Methods
The FilterNumericValueRule type exposes the following members.
Methods
Name | Description
GetEvaluator |  Gets the evaluator that implements the test for this rule.
SetEvaluator |  Sets the evaluator that implements the test for this rule.
Top
See Also
Reference
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace