Revit 2027 API
Point Properties
The Point type exposes the following members.
Properties
Name | Description
Coord |  Returns the coordinates of the point.
Reference | Returns a stable reference to the point.
Top
See Also
Reference
Point Class
Autodesk.Revit.DB Namespace