Revit 2027 API
RailingType Class
 An object supporting management of baluster and post placement within the railing type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.RailingType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RailingType : ElementType
Public Class RailingType
	Inherits ElementType
public ref class RailingType : public ElementType
type RailingType =
    class
        inherit ElementType
    end
The RailingType type exposes the following members.
Properties
Name | Description
BalusterPlacement |  Accesses the object containing properties related to the baluster placement.
PrimaryHandrailHeight |  The height of the primary handrail.
PrimaryHandrailLateralOffset |  The lateral offset of the primary handrail.
PrimaryHandRailPosition |  The position of the primary handrail.
PrimaryHandrailType |  The type of the primary handrail.
RailStructure |  The NonContinuousRailStructure.
SecondaryHandrailHeight |  The height of the secondary handrail.
SecondaryHandrailLateralOffset |  The lateral offset of the secondary handrail.
SecondaryHandRailPosition |  The position of the secondary handrail.
SecondaryHandrailType |  The type of the secondary handrail.
TopRailHeight |  The height of the top rail in the railing system.
TopRailType |  The type of the top rail in the railing system.
Top
Methods
Name | Description
Top
Example
private void GetRailingType(Stairs stairs)
{
    ICollection<ElementId> railingIds = stairs.GetAssociatedRailings();
    foreach (ElementId railingId in railingIds)
    {
        Railing railing = stairs.Document.GetElement(railingId) as Railing;
        RailingType railingType = stairs.Document.GetElement(railing.GetTypeId()) as RailingType;
        // Format railing type info for display
        string info = "Railing Type:  " + railingType.Name;
        info += "\nPrimary Handrail Height:  " + railingType.PrimaryHandrailHeight;
        info += "\nTop Rail Height:  " + railingType.TopRailHeight;
        TaskDialog.Show("Revit", info);
    }
}
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace