Revit 2027 API
Space Methods
The Space type exposes the following members.
Methods
Name | Description
IsPointInSpace | Determines if a point lies within the volume of the Space.
Top
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace