Revit 2027 API
ElementTypeDuplicatedEventArgs Class
 The event arguments used by the ElementTypeDuplicated event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementTypeDuplicatedEventArgs : RevitAPIPostDocEventArgs
Public Class ElementTypeDuplicatedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ElementTypeDuplicatedEventArgs : public RevitAPIPostDocEventArgs
type ElementTypeDuplicatedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ElementTypeDuplicatedEventArgs type exposes the following members.
Properties
Name | Description
NewElementTypeId |  The id of the newly duplicated ElementType.
NewName |  The name of the newly duplicated ElementType.
OriginalElementTypeId |  The id of the element type that is duplicated.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace