Revit 2027 API
FamilyType Class
The family type object provides read access to the values of family parameters for this type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyType : APIObject
Public Class FamilyType
	Inherits APIObject
public ref class FamilyType : public APIObject
type FamilyType =
    class
        inherit APIObject
    end
The FamilyType type exposes the following members.
Properties
Name | Description
Name | The name of the family type.
Top
Methods
Name | Description
AsDouble | Provides access to the double precision number of the given family parameter.
AsElementId | Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter.
AsInteger | Provides access to the integer number of the given family parameter.
AsString | Provides access to the string contents of the given family parameter.
AsValueString | Provides access to value as a string with unit in the given family parameter.
HasValue | Indicates if this family parameter has an assigned value or not.
Top
See Also
Reference
Autodesk.Revit.DB Namespace