Revit 2027 API
ExportLinetypeKey Class
 A key used to represent an item stored in an ExportLinetypeTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLinetypeKey
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLinetypeKey : IDisposable
Public Class ExportLinetypeKey
	Implements IDisposable
public ref class ExportLinetypeKey : IDisposable
type ExportLinetypeKey =
    class
        interface IDisposable
    end
The ExportLinetypeKey type exposes the following members.
Constructors
Name | Description
ExportLinetypeKey() |  Constructs a new default ExportLinetypeKey.
ExportLinetypeKey(ExportLinetypeKey) |  Constructs a new copy of the input ExportLinetypeKey object.
ExportLinetypeKey(String) |  Constructs a new default ExportLinetypeKey using the original line type name as input.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OriginalLinetypeName |  The original linetype name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLinetypeKey
Top
See Also
Reference
Autodesk.Revit.DB Namespace