Revit 2027 API
FaceSilhouetteNode Class
 An output node that represents a Face edge.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceSilhouetteNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceSilhouetteNode : FaceDetailNode
Public Class FaceSilhouetteNode
	Inherits FaceDetailNode
public ref class FaceSilhouetteNode : public FaceDetailNode
type FaceSilhouetteNode =
    class
        inherit FaceDetailNode
    end
The FaceSilhouetteNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetFace |  Returns the Face object corresponding to the node.
Top
Remarks
 See also: OnFaceSilhouette2D(FaceSilhouetteNode).
See Also
Reference
Autodesk.Revit.DB Namespace