Revit 2027 API
WorksetConfiguration Methods
The WorksetConfiguration type exposes the following members.
Methods
Name | Description
Close |  Sets a group of user-created worksets to close.
Dispose
Open |  Sets a group of user-created worksets to open.
Top
See Also
Reference
WorksetConfiguration Class
Autodesk.Revit.DB Namespace