Revit 2027 API
Asset Properties
The Asset type exposes the following members.
Properties
Name | Description
AssetType |  The type of RenderingAsset
LibraryName |  Library name
Title |  Asset title
Top
See Also
Reference
Asset Class
Autodesk.Revit.DB.Visual Namespace