Revit 2027 API
MEPModel Properties
The MEPModel type exposes the following members.
Properties
Name | Description
ConnectorManager |  Retrieves the Connector Manager from this MEPModel.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
MEPModel Class
Autodesk.Revit.DB Namespace