Revit 2027 API
SpatialElementDomainData Methods
The SpatialElementDomainData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SpatialElementDomainData Class
Autodesk.Revit.DB Namespace