Revit 2027 API
ApplicationEntryPoint Class
For Revit Macros use only.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIApplication
 Autodesk.Revit.UI.Macros.ApplicationEntryPoint
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ApplicationEntryPoint : UIApplication,
	IEntryPoint
Public MustInherit Class ApplicationEntryPoint
	Inherits UIApplication
	Implements IEntryPoint
public ref class ApplicationEntryPoint abstract : public UIApplication,
	IEntryPoint
[<AbstractClassAttribute>]
type ApplicationEntryPoint =
    class
        inherit UIApplication
        interface IEntryPoint
    end
The ApplicationEntryPoint type exposes the following members.
Constructors
Name | Description
ApplicationEntryPoint | Initializes a new instance of the ApplicationEntryPoint class
Top
Properties
Name | Description
AddinFolder |  The full path to the Revit Macros module.
Top
Methods
Name | Description
CreateRibbonPanel(String)
(Overrides UIApplication.CreateRibbonPanel(String))
CreateRibbonPanel(String, String)
(Overrides UIApplication.CreateRibbonPanel(String, String))
CreateRibbonPanel(Tab, String)
(Overrides UIApplication.CreateRibbonPanel(Tab, String))
CreateRibbonTab
(Overrides UIApplication.CreateRibbonTab(String))
FinishInitializationEO |  For Revit Macros internal use only.
GetRibbonPanels()
(Overrides UIApplication.GetRibbonPanels())
GetRibbonPanels(String)
(Overrides UIApplication.GetRibbonPanels(String))
GetRibbonPanels(Tab)
(Overrides UIApplication.GetRibbonPanels(Tab))
Initialize |  For Revit Macros internal use only.
OnShutdownEO |  For Revit Macros internal use only.
Top
Events
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Macros Namespace