Revit 2027 API
CableTrayType Class
 This class represents a cable tray type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Electrical.CableTrayType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTrayType : MEPCurveType
Public Class CableTrayType
	Inherits MEPCurveType
public ref class CableTrayType : public MEPCurveType
type CableTrayType =
    class
        inherit MEPCurveType
    end
The CableTrayType type exposes the following members.
Properties
Name | Description
BendMultiplier |  Bend multiplier.
IsWithFitting |  Whether this cable tray type is with fitting
ShapeType |  Shape of this cable tray type.
Top
Methods
Name | Description
IsValidBendMultiplier |  Identifies if the input bend multiplier is valid.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace