Revit 2027 API
ElectricalAnalyticalLoadSet Methods
The ElectricalAnalyticalLoadSet type exposes the following members.
Methods
Name | Description
Create |  Creates an electrical analytical load set.
GetLoadIds |  Gets Equipment Load ids in the LoadSet.
Top
See Also
Reference
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace