Revit 2027 API
DividedPath Class
 An element that consists of a set of points distributed along a path which consists of a connected set of curves and edges.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DividedPath
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DividedPath : Element
Public Class DividedPath
	Inherits Element
public ref class DividedPath : public Element
type DividedPath =
    class
        inherit Element
    end
The DividedPath type exposes the following members.
Properties
Name | Description
BeginningIndent |  The beginningIndent is an offset distance from the beginning of the first curve that determines the beginning of the range over which the layout is applied. The measurement type determines how the distance is measured.
DisplayNodeNumbers |  Controls whether the node numbers are shown when the divided path is selected
DisplayNodes |  Controls whether the points of the divided path are visible
DisplayReferenceCurves |  Controls whether the curves in the path are visible
Distance |  The distance between points that are distributed along the path according to the selected layout. When the layout is set to 'FixedDistance' this value can be set to desired distance. The measurement type determines how the distance is measured.
EndIndent |  The endIndent is an offset distance from the end of the last curve that determines the end of the range over which the layout is applied. The measurement type determines how the distance is measured.
FixedNumberOfPoints |  The number of points used when the layout is set to 'FixedNumber'.
Flipped |  If the divided path is flipped the nodes are numbered in the reverse order. It also switches the ends from which beginningIndent and endIndent are measured from.
IsClosedLoop |  Whether or not the path forms a closed loop.
IsCyclical |  True if the first and last point coincide False otherwise.
MaximumDistance |  The maximum distance is used when the layout is set to 'MaximumSpacing'. When that layout rule is used the distance between points will not exceed this value. The measurement type determines how the distance is measured.
MeasurementType |  The measurement type determines how distances are calculated. Either along a straight line between two points ('ChordLength') or along the segment of the path that connects them. ('SegmentLength').
MinimumDistance |  The minimum distance is used when the layout is set to 'MinimumSpacing'. When that layout rule is used the distance between points will not fall below this value. The measurement type determines how the distance is measured.
NumberOfPoints |  The total number of points of the divided surface. This combines the layout points and the intersection points.
SpacingRuleJustification |  When the layout is set to 'FixedDistance' the points may not cover the entire range of the path. The justification determines whether the points are centered on the range, or shifted towards the start or end of the range.
SpacingRuleLayout |  The layout determines how points are distributed along the path.
TotalPathLength |  The sum of the curve lengths.
Top
Methods
Name | Description
AreCurveReferencesConnected |  This checks if the references represent a connected set of curves as required by the divided path.
Create(Document, IList<Reference>) |  Creates a new instance of a divided path with a default layout.
Create(Document, IList<Reference>, ICollection<ElementId>) |  Creates a new instance of a divided path whose points are determined by the intersecting elements.
Flip |  Toggle the flipped value
GetIntersectingElements |  Get the elements whose intersection with path produces points.
IsCurveReferenceValid |  This returns true if the reference represents a curve or edge that can be used to create a divided path.
IsIntersectorValidForCreation |  This returns true if the intersector is an element that can be used to intersect with a newly created divided path.
IsIntersectorValidForDividedPath |  This returns true if the intersector is an element that can be used to intersect with the divided path.
IsValidBeginningIndent |  Checks that the indent value does not cause the beginningIndent and endIndent to overlop
IsValidEndIndent |  Checks that the indent value does not cause the beginningIndent and endIndent to overlop
IsValidFixedNumberOfPoints |  Identifies if the indicated number of points is valid for assignment to a DividedPath with a layout type 'FixedNumber'.
IsValidMeasurementType |  Checks that the measurement type enumeration value is valid
IsValidSpacingRuleJustification |  Checks that the justification enumeration value is valid
IsValidSpacingRuleLayout |  Checks that the spacing rule layout enumeration value is valid
SeparateReferencesIntoConnectedReferences |  This function separates the input curve references into groups of connected curve references. Each group of connected curve references can be used to create a divided path.
SetIntersectingElements |  Set the elements whose intersection with path produces points.
Top
Remarks
 The points can be the result of a uniform distribution along the path. The type of the distribution is determined by a selected 'layout'. The distance between the layout points depends on the path, the layout, and layout specific settings. In addition, points can also be the result of intersecting the path with other elements.
See Also
Reference
Autodesk.Revit.DB Namespace