Revit 2027 API
UIControlledApplication Methods
The UIControlledApplication type exposes the following members.
Methods
Name | Description
CreateAddInCommandBinding | Creates a new AddInCommandBinding.
CreateRibbonPanel(String) |  Create a new RibbonPanel on the Add-Ins tab.
CreateRibbonPanel(String, String) |  Create a new RibbonPanel on the specified tab.
CreateRibbonPanel(Tab, String) |  Create a new RibbonPanel on the designated standard Revit tab.
CreateRibbonTab |  Creates a new tab on the Revit user interface.
GetDockablePane | Gets a DockablePane object by its ID.
GetRibbonPanels() |  Get all the custom Panels on Add-Ins tab of Revit.
GetRibbonPanels(String) |  Get all the custom Panels on a designated Revit tab.
GetRibbonPanels(Tab) |  Get all the custom Panels on a designated standard Revit tab.
LoadAddIn | Loads add-ins from the given manifest file.
LoadPackageContents | Loads add-ins from the given packageContents.xml file.
RegisterContextMenu | Adds a new context menu creator.
RegisterDockablePane | Adds a new dockable pane to the Revit user interface.
RemoveAddInCommandBinding | Removes an AddInCommandBinding.
Top
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace