Revit 2027 API
FailureResolution Class
 Defines a resolution for a failure.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureResolution
 Autodesk.Revit.DB.DeleteElements
 Autodesk.Revit.DB.DisableAnalyticalModelCB
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FailureResolution : IDisposable
Public Class FailureResolution
	Implements IDisposable
public ref class FailureResolution : IDisposable
type FailureResolution =
    class
        interface IDisposable
    end
The FailureResolution type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FailureResolution
Top
Remarks
 A failure could have several permitted resolutions. List of applicable resolution types for the specific failure is defined by the FailureDefinition, actual FailureResolutions are instantiated with the FailureMessage before it is posted. Multiple resolutions per failure are allowed, although Revit UI only uses default resolution.
See Also
Reference
Autodesk.Revit.DB Namespace