Revit 2027 API
DoubleArrayIterator Properties
The DoubleArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
DoubleArrayIterator Class
Autodesk.Revit.DB Namespace