Revit 2027 API
MEPBuildingConstructionSet Properties
The MEPBuildingConstructionSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of MEPBuildingConstructions that are in the set.
Top
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace