Revit 2027 API
InvalidObjectException Class
The exception that is thrown when referencing an object that is no longer valid.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.InvalidObjectException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InvalidObjectException : InvalidOperationException
<SerializableAttribute>
Public Class InvalidObjectException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class InvalidObjectException : public InvalidOperationException
[<SerializableAttribute>]
type InvalidObjectException =
    class
        inherit InvalidOperationException
    end
The InvalidObjectException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
Remarks
The object may no longer exist for many reasons:
 The object was explicitly deleted from the database.
 A change to other database items caused the item to be automatically deleted from the database.
 The object no longer exists as its creation was undone (by rolling a transaction back).
See Also
Reference
Autodesk.Revit.Exceptions Namespace