Revit 2027 API
CurveLoopsProfile Properties
The CurveLoopsProfile type exposes the following members.
Properties
Name | Description
Profile | Returns the curve loops of the profile.
Top
See Also
Reference
CurveLoopsProfile Class
Autodesk.Revit.DB Namespace