Revit 2027 API
Toposolid Properties
The Toposolid type exposes the following members.
Properties
Name | Description
HostTopoId |  The host Toposolid id of the current Toposolid subdivision. If the object is not a Toposolid subdivision, hostTopoId will be InvalidElementId.
SketchId |  Returns id of the sketch.
Top
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace