Revit 2027 API
ViewsExportedByContextEventArgs Methods
The ViewsExportedByContextEventArgs type exposes the following members.
Methods
Name | Description
GetViewIds |  Gets the views that were exported by CustomExporter.
Top
See Also
Reference
ViewsExportedByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace