Revit 2027 API
ArgumentsInconsistentException Methods
The ArgumentsInconsistentException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ArgumentsInconsistentException Class
Autodesk.Revit.Exceptions Namespace