Revit 2027 API
ElementId Methods
The ElementId type exposes the following members.
Methods
Name | Description
Compare | Compares two element ids.
CompareTo | Compares two element ids. Implementation of System.IComparable interface
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the value of the id as hash code
(Overrides Object.GetHashCode())
Parse |  Parse the string representation of the id into a corresponding ElementId.
ToString |  Gets a String representation of the value of the id.
(Overrides Object.ToString())
TryParse |  Parse the string representation of the id into a corresponding ElementId.
Top
See Also
Reference
ElementId Class
Autodesk.Revit.DB Namespace