Revit 2027 API
RebarShapeParameters Class
 Class containing functions that create and retrieve shared parameters for RebarShapes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeParameters
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeParameters : IDisposable
Public Class RebarShapeParameters
	Implements IDisposable
public ref class RebarShapeParameters : IDisposable
type RebarShapeParameters =
    class
        interface IDisposable
    end
The RebarShapeParameters type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarShapeParameters
GetAllRebarShapeParameters |  List all shape parameters used by all the existing RebarShapes in the specified document.
GetElementIdForExternalDefinition |  Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, return InvalidElementId.
GetExternalDefinitionForElementId |  Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document.
GetOrCreateElementIdForExternalDefinition |  Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, add the parameter to the document and generate a new ElementId.
IsValidExternalDefinition |  Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace