Revit 2027 API
NumberingParameter Class
 Defines a parameter and its source based on associations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingParameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NumberingParameter : IDisposable
Public Class NumberingParameter
	Implements IDisposable
public ref class NumberingParameter : IDisposable
type NumberingParameter =
    class
        interface IDisposable
    end
The NumberingParameter type exposes the following members.
Constructors
Name | Description
NumberingParameter |  Create a new parameter with association based on a parameter id and an association type.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberingParameterType |  The type for numbering parameter association.
ParameterId |  The id of the parameter.
Top
Methods
Name | Description
Dispose | Releases all resources used by the NumberingParameter
Top
See Also
Reference
Autodesk.Revit.DB Namespace