Revit 2027 API
ColorFillLegend Class
 Represents color fill legend.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ColorFillLegend
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ColorFillLegend : Element
Public Class ColorFillLegend
	Inherits Element
public ref class ColorFillLegend : public Element
type ColorFillLegend =
    class
        inherit Element
    end
The ColorFillLegend type exposes the following members.
Properties
Name | Description
ColorFillCategoryId |  Returns the id of color fill category that this legend is created for.
Height |  The height of the legend.
Origin |  The top left corner of the color fill legend.
Top
Methods
Name | Description
Create |  Creates new instance of ColorFillLegend.
GetColumnWidths |  Returns array of column widths in the legend.
SetColumnWidths |  Sets array of column widths.
Top
Remarks
Color fill legend is a 2D annotation element, it can be created through Create(Document, ElementId, ElementId, XYZ) with specified category of color fill scheme, if there exists a valid color fill scheme activated for the category in the view. After a legend is created, its content and layout will keep consistent with the active color fill scheme of the view. You can adjust its position through Origin property, or manually maintain its layout through Height property andGetColumnWidths()/[M:Autodesk.Revit.DB.ColorFillLegend.SetColumnWidths(System.Collections.Generic.IList`1{System.Double})] methods.
Notes:
GetColorFillSchemeId(ElementId) could be used to retrieve the corresponding color fill scheme of this legend, through the [!:Autodesk::Revit::DB::View::ColorFillCategoryId] and OwnerViewId properties. Note that there could only exist one active scheme for all spatial categories (rooms, areas, and zones) in one view.
Once the height and column widths are explicitly set, they will be fixed even if the contents of the legend change.
To retrieve correct height and column widths, it's better to manually retrieve the geometry of legend for nonvisible views. (Because color fill legend is a view specific element.)
The value of Height property does not contain the line that displays "Calculating...".
See Also
Reference
Autodesk.Revit.DB Namespace