Revit 2027 API
SymbolicCurve Properties
The SymbolicCurve type exposes the following members.
Properties
Name | Description
IsDrawnInForeground | Indicates if this curve will be drawn in the foreground of the family instance.
ReferenceType | Indicates the type of reference.
Subcategory | The subcategory.
Top
See Also
Reference
SymbolicCurve Class
Autodesk.Revit.DB Namespace