Revit 2027 API
DGNImportOptions Class
 The import options used to import DGN format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.DGNImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DGNImportOptions : BaseImportOptions
Public Class DGNImportOptions
	Inherits BaseImportOptions
public ref class DGNImportOptions : public BaseImportOptions
type DGNImportOptions =
    class
        inherit BaseImportOptions
    end
The DGNImportOptions type exposes the following members.
Constructors
Name | Description
DGNImportOptions() |  Constructs a new instance of DGNImportOptions with default values of all properties.
DGNImportOptions(DGNImportOptions) |  Constructs a new instance of DGNImportOptions as a copy of the import options.
Top
Properties
Name | Description
DGNModelViewName |  The model view name to be imported. Need user give a model view name to specify which model view need to be imported into Revit
IgnoreUnsupportedElementWarning |  If true, ignore warning messages about unsupported elements in the DGN file. If false, the import process is aborted if imported dgn files have unsupported elements.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace