Revit 2027 API
EnergyAnalysisConstruction Class
 Represent an analytical construction as a composite of layered materials.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyAnalysisConstruction : Element
Public Class EnergyAnalysisConstruction
	Inherits Element
public ref class EnergyAnalysisConstruction : public Element
type EnergyAnalysisConstruction =
    class
        inherit Element
    end
The EnergyAnalysisConstruction type exposes the following members.
Properties
Name | Description
Absorptance |  The absorptance value of the construction.
ConstructionName |  The name of the construction
Description |  The description of the construction.
HeatTransferCoefficient | Obsolete.
 The heat transfer coefficient value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).
IsSchematic |  Indicates if this originates from a schematic or analytical construction.
Roughness |  The roughness value of the construction, from 1 (Very Rough) to 6 (Very Smooth) and -1 when unset.
ThermalMass |  The thermal mass value (Cth-value) of the construction, in J/(m^2*k) (equivalent to kg/(k*s^2)).
ThermalResistance |  The thermal resistance value (R-value) of the construction, in K*s^3/kg.
ThermalTransmittance |  The thermal transmittance value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).
Top
Methods
Name | Description
GetMaterialIds() |  Returns a list of ids of the associated materials to analytical construction.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace