Revit 2027 API
AnalyticalLinkType Methods
The AnalyticalLinkType type exposes the following members.
Methods
Name | Description
IsValidAnalyticalFixityState |  Returns whether the input fixity state is valid for Analytical Link Type parameters.
Top
See Also
Reference
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace