Revit 2027 API
AssetSetIterator Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Visual.AssetSetIterator
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class AssetSetIterator : APIObject,
	IEnumerator
Public MustInherit Class AssetSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class AssetSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type AssetSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The AssetSetIterator type exposes the following members.
Constructors
Name | Description
AssetSetIterator | Initializes a new instance of the AssetSetIterator class
Top
Properties
Name | Description
Current
Top
Methods
Name | Description
MoveNext
Reset
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace