Revit 2027 API
KeynoteEntries Methods
The KeynoteEntries type exposes the following members.
Methods
Name | Description
LoadKeynoteEntriesFromFile |  Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent.
Top
See Also
Reference
KeynoteEntries Class
Autodesk.Revit.DB Namespace