Revit 2027 API
EnergyAnalysisOpening Class
 Analytical opening.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyAnalysisOpening : Element
Public Class EnergyAnalysisOpening
	Inherits Element
public ref class EnergyAnalysisOpening : public Element
type EnergyAnalysisOpening =
    class
        inherit Element
    end
The EnergyAnalysisOpening type exposes the following members.
Properties
Name | Description
CADLinkUniqueId |  The unique id of the originating CAD object's link (linked document) associated with this opening.
CADObjectUniqueId |  The unique id of the originating CAD object (model element) associated with this opening.
Corner |  The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Height |  The height of the analytical rectangular geometry.
OpeningId |  The unique identifier for the opening.
OpeningName |  The unique name identifier for the opening.
OpeningType |  The analytical opening type.
OriginatingElementDescription |  The description for the originating Revit element.
OriginatingElementId |  The element id for the originating Revit element.
OriginatingElementName |  The name for the originating Revit element.
Type |  The gbXML opening type attribute.
Width |  The width of the analytical rectangular geometry.
Top
Methods
Name | Description
GetAnalyticalSurface |  Gets the associative analytical parent surface element.
GetConstruction |  Gets the analytic construction this opening is associated with. Null when this opening is a window.
GetPolyloops |  Gets the collection of planar polygons describing the opening geometry.
GetWindowType |  Gets the analytic window type this opening is associated with. Null when this opening is not a window.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace