Revit 2027 API
SpatialElementBoundaryOptions Methods
The SpatialElementBoundaryOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace