Revit 2027 API
LoadCombination Class
 An object that represents a load combination.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadCombination
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LoadCombination : Element
Public Class LoadCombination
	Inherits Element
public ref class LoadCombination : public Element
type LoadCombination =
    class
        inherit Element
    end
The LoadCombination type exposes the following members.
Properties
Name | Description
IsThirdPartyGenerated |  Indicates if the load combination was created by API.
State |  The state of the load combination.
Type |  The type of the load combination.
Top
Methods
Name | Description
Create(Document, String) |  Creates a new default LoadCombination.
Create(Document, String, LoadCombinationType, LoadCombinationState) |  Creates a new LoadCombination.
GetCaseAndCombinationIds |  Returns collection of the load combination case and combination IDs.
GetComponents |  Returns collection of the load combination components.
GetUsageIds |  Returns collection of the load combination usage IDs.
SetComponents |  Sets a collection of the load combination components.
SetUsageIds |  Sets a collection of the load combination usage IDs.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace