Revit 2027 API
TargetRebarEdge Methods
The TargetRebarEdge type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
TargetRebarEdge Class
Autodesk.Revit.DB.Structure Namespace