Revit 2027 API
GeomCombination Properties
The GeomCombination type exposes the following members.
Properties
Name | Description
AllMembers | All elements that are joined in this geometry combination.
Top
See Also
Reference
GeomCombination Class
Autodesk.Revit.DB Namespace