Revit 2027 API
ViewSetIterator Properties
The ViewSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
ViewSetIterator Class
Autodesk.Revit.DB Namespace