Revit 2027 API
BoundaryValidation Class
 Curve loop validators.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BoundaryValidation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BoundaryValidation : IDisposable
Public Class BoundaryValidation
	Implements IDisposable
public ref class BoundaryValidation : IDisposable
type BoundaryValidation =
    class
        interface IDisposable
    end
The BoundaryValidation type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BoundaryValidation
IsValidBoundaryOnSketchPlane |  Indicates if the given curve loops compose a valid boundary on the sketch plane.
IsValidBoundaryOnView |  Indicates if the given curve loops compose a valid boundary on the view's detail sketch plane.
IsValidHorizontalBoundary |  Identifies whether the given curve loops compose a valid horizontal boundary.
Top
See Also
Reference
Autodesk.Revit.DB Namespace