Revit 2027 API
StructuralSectionConcreteRectangleCut Properties
The StructuralSectionConcreteRectangleCut type exposes the following members.
Properties
Name | Description
BottomCutHeight |  Section height left Cut.
BottomCutWidth |  Section width left Cut.
TopCutHeight |  Section height right Cut.
TopCutWidth |  Section width right Cut.
Top
See Also
Reference
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace