Revit 2027 API
PointLoad Methods
The PointLoad type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) |  Creates a new hosted point load within the project.
Create(Document, ElementId, XYZ, XYZ, XYZ, PointLoadType) |  Creates a new custom hosted point load within the project using data at point.
IsPointInsideHostBoundaries |  Indicates if the point is inside panel's boundaries or if the point is on the member's curve..
IsValidHostId |  Indicates if the provided host id can host point loads.
Top
See Also
Reference
PointLoad Class
Autodesk.Revit.DB.Structure Namespace