Revit 2027 API
FilterStringRule Methods
The FilterStringRule type exposes the following members.
Methods
Name | Description
GetEvaluator |  Gets the evaluator that implements the test for this rule.
SetEvaluator |  Sets the evaluator that implements the test for this rule.
Top
See Also
Reference
FilterStringRule Class
Autodesk.Revit.DB Namespace