Revit 2027 API
IExternalDataManagerServer Interface
 Interface class for external server of ExternalServices.BuiltInExternalServices.ExternalDataManagerService. Implementation guidelines: Each method is called on the Revit API thread to avoid blocking the UI for prolonged periods. Heavy work should be off-loaded to background threads whenever possible. All strings returned by functions must be localized.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExternalDataManagerServer : IExternalServer
Public Interface IExternalDataManagerServer
	Inherits IExternalServer
public interface class IExternalDataManagerServer : IExternalServer
type IExternalDataManagerServer =
    interface
        interface IExternalServer
    end
The IExternalDataManagerServer type exposes the following members.
Methods
Name | Description
GetCommandsForAdd |  Retrieves commands in the Add menu.
GetContentTools |  Obtains the content tool items of the selected data
GetData |  Obtains the data.
GetPreviewImage |  Retrieves the handle of preview image.
GetPreviewImageFile |  Retrieves the handle of preview image.
GetTitle |  Obtains the title for the external data.
IsCommandEnabled |  Checks if the command is enabled.
IsEnabledInFamilyDocuments |  Checks if the data type enabled in family documents.
OnCommand |  Handles user command.
Top
See Also
Reference
Autodesk.Revit.UI Namespace