Revit 2027 API
PipeFittingAndAccessoryPressureDropData Class
 The input and output data used by external servers for calculation of the pipe fitting and pipe accessory pressure drop.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeFittingAndAccessoryPressureDropData : IDisposable
Public Class PipeFittingAndAccessoryPressureDropData
	Implements IDisposable
public ref class PipeFittingAndAccessoryPressureDropData : IDisposable
type PipeFittingAndAccessoryPressureDropData =
    class
        interface IDisposable
    end
The PipeFittingAndAccessoryPressureDropData type exposes the following members.
Properties
Name | Description
CalculationType |  The calculation type, a bitmask of FittingAndAccessoryCalculationType.
IsCurrentEntityValid |  True if the current settings stored in the entity is valid.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipeFittingAndAccessoryPressureDropData
GetPipeFittingAndAccessoryData |  Returns the fitting and accessory information
GetPresureDropItems |  Returns the pressure drop items
SetDefaultEntity |  Stores the default entity in the data.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace