Revit 2027 API
DirectShapeOptions Methods
The DirectShapeOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
DirectShapeOptions Class
Autodesk.Revit.DB Namespace