Revit 2027 API
PreviewControl Methods
The PreviewControl type exposes the following members.
Methods
Name | Description
Dispose |  This method is called if the user explicitly disposes of the object (by calling the Dispose method in other managed languages, or the destructor in C++).
Top
See Also
Reference
PreviewControl Class
Autodesk.Revit.UI Namespace