Revit 2027 API
RoofType Properties
The RoofType type exposes the following members.
Properties
Name | Description
ThermalProperties |  The calculated and settable thermal properties of the RoofType
Top
See Also
Reference
RoofType Class
Autodesk.Revit.DB Namespace