Revit 2027 API
AnalyticalOpening Methods
The AnalyticalOpening type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of an Analytical Opening within the project.
IsCurveLoopValidForAnalyticalOpening |  Checks if curve loop is valid for Analytical Opening.
Top
See Also
Reference
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace