Revit 2027 API
PlanCircuitSet Class
A set that can contain any number of plan circuit objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PlanCircuitSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PlanCircuitSet : APIObject,
	IEnumerable
Public Class PlanCircuitSet
	Inherits APIObject
	Implements IEnumerable
public ref class PlanCircuitSet : public APIObject,
	IEnumerable
type PlanCircuitSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The PlanCircuitSet type exposes the following members.
Constructors
Name | Description
PlanCircuitSet | Initializes a new instance of the PlanCircuitSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains | Tests for the existence of an item within the set.
Erase | Removes a specified object from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified item into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace