Revit 2027 API
MullionTypeSet Class
A set that contains mullion types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.MullionTypeSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MullionTypeSet : APIObject,
	IEnumerable
Public Class MullionTypeSet
	Inherits APIObject
	Implements IEnumerable
public ref class MullionTypeSet : public APIObject,
	IEnumerable
type MullionTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The MullionTypeSet type exposes the following members.
Constructors
Name | Description
MullionTypeSet | Initializes a new instance of the MullionTypeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of mullion types that are in the set.
Top
Methods
Name | Description
Clear | Removes every mullion type from the set, rendering it empty.
Contains | Tests for the existence of a mullion type within the set.
Erase | Removes a specified mullion type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified mullion type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace