Revit 2027 API
DocumentSynchronizingWithCentralEventArgs Properties
The DocumentSynchronizingWithCentralEventArgs type exposes the following members.
Properties
Name | Description
Comments |  User's comments for synchronization.
Location |  Full path of the central model which is to be synchronized.
Options |  User's options associated with the synchronization operation.
Top
See Also
Reference
DocumentSynchronizingWithCentralEventArgs Class
Autodesk.Revit.DB.Events Namespace