Revit 2027 API
PointCloudInstance Properties
The PointCloudInstance type exposes the following members.
Properties
Name | Description
FilterAction |  The action taken based on the results of the selection filter applied to this point cloud.
SupportsOverrides |  Identifies whether the instance can have graphic overrides.
Top
See Also
Reference
PointCloudInstance Class
Autodesk.Revit.DB Namespace