Revit 2027 API
AnalyticalPowerSourceData Class
 Represents the data and parameters of analytical power source node.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalPowerSourceData : AnalyticalPowerDistributableNodeData
Public Class AnalyticalPowerSourceData
	Inherits AnalyticalPowerDistributableNodeData
public ref class AnalyticalPowerSourceData : public AnalyticalPowerDistributableNodeData
type AnalyticalPowerSourceData =
    class
        inherit AnalyticalPowerDistributableNodeData
    end
The AnalyticalPowerSourceData type exposes the following members.
Properties
Name | Description
ApparentPowerRating |  The apparent power rating value of the analytical power source.
TotalConnectedCurrent |  The total connected current of the analytical power source.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace