Revit 2027 API
ElementLevelFilter Class
 A filter used to match elements by their associated level.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.ElementLevelFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementLevelFilter : ElementSlowFilter
Public Class ElementLevelFilter
	Inherits ElementSlowFilter
public ref class ElementLevelFilter : public ElementSlowFilter
type ElementLevelFilter =
    class
        inherit ElementSlowFilter
    end
The ElementLevelFilter type exposes the following members.
Constructors
Name | Description
ElementLevelFilter(ElementId) |  Constructs a new instance of an ElementLevelFilter.
ElementLevelFilter(ElementId, Boolean) |  Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id.
Top
Properties
Name | Description
LevelId |  The id of the level that will be matched to elements' associated level.
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.
Example
// Use ElementLevel filter to find elements by their associated level in the document
// Find the level whose Name is "Level 1"
FilteredElementCollector collector = new FilteredElementCollector(document);
ICollection<Element> levels = collector.OfClass(typeof(Level)).ToElements();
var query = from element in collector where element.Name == "Level 1" select element;// Linq query
// Get the level id which will be used to match elements
List<Element> level1 = query.ToList<Element>();
ElementId levelId = level1[0].Id;
// Find all walls on level one
ElementLevelFilter level1Filter = new ElementLevelFilter(levelId);
collector = new FilteredElementCollector(document);
ICollection<Element> allWallsOnLevel1 = collector.OfClass(typeof(Wall)).WherePasses(level1Filter).ToElements();
// Find all rooms not on level one: use an inverted ElementLevelFilter to match all elements not on the target level
ElementLevelFilter notOnLevel1Filter = new ElementLevelFilter(levelId, true); // Inverted filter
collector = new FilteredElementCollector(document);
IList<Element> allRoomsNotOnLevel1 = collector.WherePasses(new RoomFilter()).WherePasses(notOnLevel1Filter).ToElements();
See Also
Reference
Autodesk.Revit.DB Namespace