Revit 2027 API
DWFImportOptions Class
 The import options used by importing DWF or DWFx format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DWFImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DWFImportOptions : IDisposable
Public Class DWFImportOptions
	Implements IDisposable
public ref class DWFImportOptions : IDisposable
type DWFImportOptions =
    class
        interface IDisposable
    end
The DWFImportOptions type exposes the following members.
Constructors
Name | Description
DWFImportOptions(DWFImportOptions) |  Constructs a new instance of DWFImportOptions as a copy of the import options.
DWFImportOptions(IList<ElementId>) |  Constructs a new instance of DWFImportOptions with an array of imported sheet views.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DWFImportOptions
GetSheetViews |  Get sheet views where DWF markups are imported.
SetSheetViews |  Set sheet views where DWF markups are imported.
Top
See Also
Reference
Autodesk.Revit.DB Namespace