Revit 2027 API
SpatialElementBoundarySubface Methods
The SpatialElementBoundarySubface type exposes the following members.
Methods
Name | Description
Dispose
GetBoundingElementFace |  Returns the face of the bounding element.
GetSpatialElementFace |  Returns the face of the spatial element's 3D geometry.
GetSubface |  Returns a face that represents the portion of the room face bounded by the boundary element.
Top
See Also
Reference
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace