Revit 2027 API
DocumentClosedEventArgs Properties
The DocumentClosedEventArgs type exposes the following members.
Properties
Name | Description
DocumentId |  Id of the document that has just been closed.
Top
See Also
Reference
DocumentClosedEventArgs Class
Autodesk.Revit.DB.Events Namespace