Revit 2027 API
FabricationServiceButton Methods
The FabricationServiceButton type exposes the following members.
Methods
Name | Description
ContainsFabricationPartType |  Checks to see if the fabrication part type exists on one of the button conditions.
Dispose
GetConditionDescription |  Gets the description for the condition size range.
GetConditionImage | Gets the image for the specified fabrication service button condition.
GetConditionLowerValue |  Gets the condition lower value (valid if greater or equal) for a given condition index.
GetConditionName |  Gets the name of the specified condition on the fabrication service button.
GetConditionUpperValue |  Gets the condition upper value (valid if less) for a given condition index.
GetImage | Gets the image for fabrication service button.
IsExcluded |  Gets if the button's fabrication part content associated with the button is to be excluded from Route and Fill, Design to Fabrication, or Multi-Point Routing commands.
IsUnrestrictedCondition |  Checks if the condition is unrestricted.
IsValid |  Checks if the button contains only valid fittings.
IsValidConditionIndex |  Validates if the given condition index is valid or not.
Top
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace