Revit 2027 API
MultiSegmentGrid Class
 This element acts as a multi-segmented Grid. The individual grids associated to the MultiSegmentGrid behave as a single unit and all share the same text. They inherit their type (GridType) from the MultiSegmentGrid.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MultiSegmentGrid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MultiSegmentGrid : Element
Public Class MultiSegmentGrid
	Inherits Element
public ref class MultiSegmentGrid : public Element
type MultiSegmentGrid =
    class
        inherit Element
    end
The MultiSegmentGrid type exposes the following members.
Properties
Name | Description
Text |  name shared by grids in this MultiSegmentGrid
Top
Methods
Name | Description
AreGridsInSameMultiSegmentGrid |  Determine whether two Grids are members of the same GridChain.
Create |  Create a MultiSegmentGrid element from the specified curve loop.
GetGridIds |  Get the element ids of the Grids that make up this MultiSegmentGrid.
GetMultiSegementGridId |  Retrieve the element id of the MultiSegmentGrid of which the specified Grid is a member.
IsValidCurveLoop |  Identifies whether the specified curve loop is valid for creation of a MultiSegmentGrid.
IsValidSketchPlaneId |  Identifies whether provided element id corresponds to a SketchPlane that is valid for GridChain creation.
Top
See Also
Reference
Autodesk.Revit.DB Namespace