Revit 2027 API
SingleServerService Class
 This class represents a single-server service inside Revit application. It is created when an instance of ISingleServerService is registered with Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalService.ExternalService
 Autodesk.Revit.DB.ExternalService.SingleServerService
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SingleServerService : ExternalService
Public Class SingleServerService
	Inherits ExternalService
public ref class SingleServerService : public ExternalService
type SingleServerService =
    class
        inherit ExternalService
    end
The SingleServerService type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetActiveServerId() |  Returns the Id of the currently active application-level server of the service.
GetActiveServerId(Document) |  Returns the Id of the server currently associated with the given document for the service.
SetActiveServer(Guid) |  Set an active server applicable application-wide for the service.
SetActiveServer(Guid, Document) |  Change the active server for a specific document.
UnsetActiveServer |  Unset the active server for the particular document.
Top
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace