Revit 2027 API
ExtendedPropertiesLink Class
 Represents a collection of extended properties linked to a Revit model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLink
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtendedPropertiesLink : Element
Public Class ExtendedPropertiesLink
	Inherits Element
public ref class ExtendedPropertiesLink : public Element
type ExtendedPropertiesLink =
    class
        inherit Element
    end
The ExtendedPropertiesLink type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates the ExtendedPropertiesLink in the given document.
CreateFromCloudDataset |  Creates the ExtendedPropertiesLink in the given document from a cloud dataset.
GetAllAssociatedPropertyIds |  Retrieves all ids, each corresponding to a [!:Autodesk::Revit::DB::ExternalData::ExtendedParameterElement] associated with this link.
LoadFrom |  Reloads the ExtendedPropertiesLink with the latest information from the server using the specified ExternalResourceReference.
Reload |  Reloads the linked extended properties with the latest information.
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace