Revit 2027 API
ExportLineweightTableIterator Class
 An iterator to a set of line weight table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLineweightTableIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLineweightTableIterator : IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
Public Class ExportLineweightTableIterator
	Implements IEnumerator(Of KeyValuePair(Of ExportLineweightKey, ExportLineweightInfo))
public ref class ExportLineweightTableIterator : IEnumerator<KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^>>
type ExportLineweightTableIterator =
    class
        interface IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>>
    end
The ExportLineweightTableIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLineweightTableIterator
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace