Revit 2027 API
TextElementType Class
An object that represents a text style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.TextElementType
 Autodesk.Revit.DB.TextNoteType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextElementType : LineAndTextAttrSymbol
Public Class TextElementType
	Inherits LineAndTextAttrSymbol
public ref class TextElementType : public LineAndTextAttrSymbol
type TextElementType =
    class
        inherit LineAndTextAttrSymbol
    end
The TextElementType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace