Revit 2027 API
SchedulableField Class
 A non-calculated field eligible to be included in a schedule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SchedulableField
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SchedulableField : IDisposable
Public Class SchedulableField
	Implements IDisposable
public ref class SchedulableField : IDisposable
type SchedulableField =
    class
        interface IDisposable
    end
The SchedulableField type exposes the following members.
Constructors
Name | Description
SchedulableField() |  Creates a new SchedulableField.
SchedulableField(Guid) |  Creates a new SchedulableField.
SchedulableField(ScheduleFieldType) |  Creates a new SchedulableField.
SchedulableField(ScheduleFieldType, ElementId) |  Creates a new SchedulableField.
Top
Properties
Name | Description
FieldType |  The type of data displayed by the field.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParameterId |  The ID of the parameter displayed by the field.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SchedulableField
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetCustomFieldData |  Gets the data associated with this custom field. If this field isn't a CustomField will return null.
GetHashCode |  Gets the integer value of the SchedulableField as hash code
(Overrides Object.GetHashCode())
GetName |  Gets the name of the field.
Top
Operators
Name | Description
Equality(SchedulableField, SchedulableField) | Determines whether two SchedulableField are the same.
Inequality(SchedulableField, SchedulableField) | Determines whether two SchedulableField are different.
Top
Remarks
 The SchedulableField class represents a non-calculated field that is eligible to be included in a schedule. A list of fields that can be included in a schedule can be obtained from ScheduleDefinition.GetSchedulableFields.
See Also
Reference
Autodesk.Revit.DB Namespace