Revit 2027 API
Segment Class
 This element represents a segment of an MEP curve object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Segment
 Autodesk.Revit.DB.Plumbing.PipeSegment
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Segment : Element
Public Class Segment
	Inherits Element
public ref class Segment : public Element
type Segment =
    class
        inherit Element
    end
The Segment type exposes the following members.
Properties
Name | Description
Description |  The description of the segment.
MaterialId |  The ElementId of the MaterialElem.
Roughness |  The roughness value for given material.
SizeCount |  The number of size objects in the segment.
Top
Methods
Name | Description
AddSize |  Adds a new MEPSize to the segment.
GetSizes |  Gets the defined sizes of the segment.
RemoveSize |  Remove the existing MEPSize with this nominal diameter from the segment.
Top
Remarks
 Currently, only pipe curves can be broken into separate segment elements.
Example
private void GetPipeSegmentSizesFromDocument(Document document)
{
    FilteredElementCollector collectorPipeType = new FilteredElementCollector(document);
    collectorPipeType.OfClass(typeof(Segment));
    IEnumerable<Segment> segments = collectorPipeType.ToElements().Cast<Segment>();
    foreach (Segment segment in segments)
    {
        StringBuilder strPipeInfo = new StringBuilder();
        strPipeInfo.AppendLine("Segment: " + segment.Name);
        strPipeInfo.AppendLine("Roughness: " + segment.Roughness);
        strPipeInfo.AppendLine("Pipe Sizes:");
        double dLengthFac = 304.8;  // used to convert stored units from ft to mm for display
        foreach (MEPSize size in segment.GetSizes())
        {
            strPipeInfo.AppendLine(string.Format("Nominal: {0:F3}, ID: {1:F3}, OD: {2:F3}",
                                        size.NominalDiameter * dLengthFac, size.InnerDiameter * dLengthFac, size.OuterDiameter * dLengthFac));
        }
        Autodesk.Revit.UI.TaskDialog.Show("PipeSetting Data", strPipeInfo.ToString());
        break;
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace