Revit 2027 API
FilledRegionType Class
 A filled region attributes element. Note, the forground pattern color is stored in the parent class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.FilledRegionType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilledRegionType : LineAndTextAttrSymbol
Public Class FilledRegionType
	Inherits LineAndTextAttrSymbol
public ref class FilledRegionType : public LineAndTextAttrSymbol
type FilledRegionType =
    class
        inherit LineAndTextAttrSymbol
    end
The FilledRegionType type exposes the following members.
Properties
Name | Description
BackgroundPatternColor |  The background fill pattern color.
BackgroundPatternId |  The background fill pattern Id.
ForegroundPatternColor |  The foreground fill pattern color.
ForegroundPatternId |  The foreground fill pattern Id.
IsMasking |  If true then the FilledRegion will cover the lines and edges of objects behind it. If false then lines and edges will remain visible.
LineWeight |  The line weight of the fill pattern.
Top
Methods
Name | Description
IsValidBackgroundPatternId |  Check if the id is valid for a background pattern
IsValidFillPatternId |  Check if the id is a FillPatternElement or an invalidElementId
IsValidForegroundPatternId |  Check if the id is valid for a foreground pattern
IsValidLineWeight |  Indicates whether the given line weight value is valid.
IsValidMasking |  Check that in a family the FillRegionType is always masking.
IsValidSolidFillPatternId |  Checks if the id is valid for a background pattern
Top
See Also
Reference
Autodesk.Revit.DB Namespace