Revit 2027 API
ITemporaryGraphicsHandler Methods
The ITemporaryGraphicsHandler type exposes the following members.
Methods
Name | Description
OnClick |  Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager.
Top
See Also
Reference
ITemporaryGraphicsHandler Interface
Autodesk.Revit.UI Namespace