Revit 2027 API
CableTray Methods
The CableTray type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of cable tray.
GetShapeType |  Returns the shape type for the cable tray.
IsValidCableTrayType |  Identifies if a cable tray type is valid.
IsValidRungSpace |  Identifies if the input rung space is valid.
Top
See Also
Reference
CableTray Class
Autodesk.Revit.DB.Electrical Namespace