Revit 2027 API
GeomCombinationSet Class
A set that contains GeomCombination objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeomCombinationSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GeomCombinationSet : APIObject,
	IEnumerable
Public Class GeomCombinationSet
	Inherits APIObject
	Implements IEnumerable
public ref class GeomCombinationSet : public APIObject,
	IEnumerable
type GeomCombinationSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The GeomCombinationSet type exposes the following members.
Constructors
Name | Description
GeomCombinationSet | Initializes a new instance of the GeomCombinationSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of GeomCombinations that are in the set.
Top
Methods
Name | Description
Clear | Removes every item GeomCombination the set, rendering it empty.
Contains | Tests for the existence of an GeomCombination within the set.
Erase | Removes a specified GeomCombination from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified element into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace