Revit 2027 API
PulldownButtonData Class
This class contains information necessary to construct a pulldown button in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PulldownButtonData
 Autodesk.Revit.UI.SplitButtonData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PulldownButtonData : ButtonData
Public Class PulldownButtonData
	Inherits ButtonData
public ref class PulldownButtonData : public ButtonData
type PulldownButtonData =
    class
        inherit ButtonData
    end
The PulldownButtonData type exposes the following members.
Constructors
Name | Description
PulldownButtonData | Constructs a new instance of PulldownButtonData.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace