Revit 2027 API
DocumentDifference Class
 DocumentDifference represents the difference (including added elements, modified elements and deleted elements) of a Revit model between different DocumentVersion of the model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DocumentDifference
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentDifference : IDisposable
Public Class DocumentDifference
	Implements IDisposable
public ref class DocumentDifference : IDisposable
type DocumentDifference =
    class
        interface IDisposable
    end
The DocumentDifference type exposes the following members.
Properties
Name | Description
AreDeletedElementIdsAvailable |  Whether or the deleted elements were retrieved.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DocumentDifference
GetCreatedElementIds |  Created element id collection.
GetDeletedElementIds |  Deleted element id collection. For non-worksharing models, this will always be an empty collection.
GetModifiedElementIds |  Modified element id collection.
Top
Remarks
 For workshared models, DocumentDifference may contain all the added elements, modified elements and deleted elements. For non-workshared models, deleted elements are not tracked, so this object may only contain added elements and modified elements.
See Also
Reference
Autodesk.Revit.DB Namespace