Revit 2027 API
SlabShapeCrease Class
 Represents a crease of a slab shape edited element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SlabShapeCrease
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SlabShapeCrease : IDisposable
Public Class SlabShapeCrease
	Implements IDisposable
public ref class SlabShapeCrease : IDisposable
type SlabShapeCrease =
    class
        interface IDisposable
    end
The SlabShapeCrease type exposes the following members.
Properties
Name | Description
CreaseType |  The type of the crease.
Curve | The geometry of the crease.
EndPoints | The vertices of the crease.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SlabShapeCrease
Top
See Also
Reference
Autodesk.Revit.DB Namespace