Revit 2027 API
BalusterInfo Methods
The BalusterInfo type exposes the following members.
Methods
Name | Description
Dispose
GetReferenceNameForHost |  Gets the name string to be used as a reference to Host in the current language.
GetReferenceNameForTopRail |  Gets the name string to be used as a reference to Top Rail in the current language.
Top
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace