Revit 2027 API
PlanCircuit Methods
The PlanCircuit type exposes the following members.
Methods
Name | Description
GetPointInside | Returns a point inside the circuit.
Top
See Also
Reference
PlanCircuit Class
Autodesk.Revit.DB Namespace