Revit 2027 API
PointOnEdgeEdgeIntersection Class
Define a ReferencePoint at the intersection of two referenceable lines.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointElementReference
 Autodesk.Revit.DB.PointOnEdgeEdgeIntersection
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointOnEdgeEdgeIntersection : PointElementReference
Public Class PointOnEdgeEdgeIntersection
	Inherits PointElementReference
public ref class PointOnEdgeEdgeIntersection : public PointElementReference
type PointOnEdgeEdgeIntersection =
    class
        inherit PointElementReference
    end
The PointOnEdgeEdgeIntersection type exposes the following members.
Methods
Name | Description
GetEdgeReference1 | Get a copy of the first edge or curve reference.
GetEdgeReference2 | Get a copy of the second edge or curve reference.
SetEdgeReference1 | Change the first edge or curve reference.
SetEdgeReference2 | Change the second edge or curve reference.
Top
Remarks
The ReferencePoint is actually placed on the first line (Edge1) at the closest point to the second line (Edge2). Its X basis vector is constrained to be parallel to the first line.
See Also
Reference
Autodesk.Revit.DB Namespace