Revit 2027 API
FileExportingEventArgs Properties
The FileExportingEventArgs type exposes the following members.
Properties
Name | Description
BackgroundOperation |  Identifies whether the event belongs to a background export operation.
Format |  Identifies the export format, e.g. DWG or image.
Path |  The target path for the export.
Top
See Also
Reference
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace