Revit 2027 API
PanelTypeSet Methods
The PanelTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every panel type from the set, rendering it empty.
Contains | Tests for the existence of a panel type within the set.
Erase | Removes a specified panel type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified panel type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
PanelTypeSet Class
Autodesk.Revit.DB Namespace