Revit 2027 API
CriticalPathCollector Methods
The CriticalPathCollector type exposes the following members.
Methods
Name | Description
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetCalculatedFlow |  Gets the calculated flow of the network.
GetCalculatedPressureDrop |  Gets the calculated pressure drop of the network.
GetCriticalPathCollectorIterator |  Gets the critical path iterator to traverse individual segment.
GetEnumerator | Returns an enumerator that iterates through a collection.
ToNetworkSegmentIds |  Returns the list of analytical segment ids on the network critical path.
Top
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace