Revit 2027 API
ButtonData Properties
The ButtonData type exposes the following members.
Properties
Name | Description
Image | The image of the button.
LargeImage | The large image of the button.
Text | The user-visible text of the button.
Top
See Also
Reference
ButtonData Class
Autodesk.Revit.UI Namespace