Revit 2027 API
StartingViewSettings Properties
The StartingViewSettings type exposes the following members.
Properties
Name | Description
ViewId |  Indicates the specific view that will be opened when the model is loaded. InvalidElementId indicates that no view has been specified. In that case, Revit will open the last views that were open at the time the file was saved.
Top
See Also
Reference
StartingViewSettings Class
Autodesk.Revit.DB Namespace