Revit 2027 API
MultiReferenceAnnotation Methods
The MultiReferenceAnnotation type exposes the following members.
Methods
Name | Description
AreElementsValidForMultiReferenceAnnotation |  The method validates if the input elements match the element category id for the MultiReferenceAnnotationType.
AreReferencesValidForLinearDimension |  If the DimensionStyleType is Linear, validates that the references are valid for an aligned multi-reference annotation.
AreReferencesValidForLinearFixedDimension |  If the DimensionStyleType is LinearFixed, validates that the references are valid for an aligned multi-reference annotation.
Create |  Creates a new MultiReferenceAnnotation.
Is3DViewValidForDimension |  If the DimensionStyle is LinearFixed, it cannot be created in a 3D View. If the DimensionStyle is Linear, it cannot be created in a 3D View if the view direction is perpendicular to the current work plane normal. Returns true if the ownerViewId is not a 3D view.
IsLinearFixedDimensionDirectionValid |  If the DimensionStyleType is LinearFixed, this function verifies that the dimension line direction matches either the view's vertical or horizontal direction.
Top
See Also
Reference
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace