Revit 2027 API
ContentNode Methods
The ContentNode type exposes the following members.
Methods
Name | Description
GetAsset |  Returns an an instance of an Asset object, which contains definitions of the content node.
GetTransform |  A transformation matrix associated with the node.
Top
See Also
Reference
ContentNode Class
Autodesk.Revit.DB Namespace