Revit 2027 API
ExportLayerTable Methods
The ExportLayerTable type exposes the following members.
Methods
Name | Description
Add |  Inserts a (key,info) pair into Export layer table.
Clear |  Removes all contents stored in the table.
ContainsKey |  Checks whether a layer key exists in the table.
Dispose
GetAvaliableLayerModifierTypes |  Gets all the avaliable layer modifier types for the layer key.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetExportLayerInfo |  Gets a copy of the layer info associated to the input pattern key.
GetKeys |  Gets all the keys stored in the map.
GetLayerTableIterator | Returns a LayerTableIterator that iterates through the collection.
GetValues |  Returns all the values stored in the map.
Remove |  Removes the pair (key, info) by pattern key.
Top
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace