Revit 2027 API
ParameterMapIterator Class
An iterator to a map relating a parameter name (the key, a String) to a parameter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ParameterMapIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ParameterMapIterator : APIObject,
	IEnumerator
Public MustInherit Class ParameterMapIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ParameterMapIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ParameterMapIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ParameterMapIterator type exposes the following members.
Constructors
Name | Description
ParameterMapIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Key | Retrieves the key that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the map.
Top
See Also
Reference
Autodesk.Revit.DB Namespace