Revit 2027 API
FaceArray Class
An array that contains faces.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FaceArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceArray : APIObject, IEnumerable
Public Class FaceArray
	Inherits APIObject
	Implements IEnumerable
public ref class FaceArray : public APIObject,
	IEnumerable
type FaceArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The FaceArray type exposes the following members.
Constructors
Name | Description
FaceArray | Initializes a new instance of the FaceArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a face at a specified index within the array.
Size | Returns the number of faces that are in the array.
Top
Methods
Name | Description
Append | Add the face to the end of the array.
Clear | Removes every face from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified face into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace