Revit 2027 API
IndexStreamPoint Methods
The IndexStreamPoint type exposes the following members.
Methods
Name | Description
AddPoint |  Inserts a IndexPoint into the stream and associated buffer.
AddPoints |  Inserts multiple IndexPoint instances into the stream and associated buffer.
Top
See Also
Reference
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace