Revit 2027 API
ViewExportingEventArgs Properties
The ViewExportingEventArgs type exposes the following members.
Properties
Name | Description
ViewId |  Identifies the view about to be exported.
Top
See Also
Reference
ViewExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace