Revit 2027 API
SpatialElement Properties
The SpatialElement type exposes the following members.
Properties
Name | Description
Area | The area.
Level | Gets the level of the room.
Location | The location of the element.
(Overrides Element.Location)
Name | A human readable name for the Element.
(Overrides Element.Name)
Number | The number.
Perimeter | The perimeter.
SpatialElementType |  The spatial element type.
Top
See Also
Reference
SpatialElement Class
Autodesk.Revit.DB Namespace