Revit 2027 API
CableTray Class
 This class represents a cable tray in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Electrical.CableTrayConduitBase
 Autodesk.Revit.DB.Electrical.CableTray
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTray : CableTrayConduitBase
Public Class CableTray
	Inherits CableTrayConduitBase
public ref class CableTray : public CableTrayConduitBase
type CableTray =
    class
        inherit CableTrayConduitBase
    end
The CableTray type exposes the following members.
Properties
Name | Description
CurveNormal |  The up-direction vector of the cable tray.
RungSpace |  Distance between two rungs for the ladder cable tray.
Top
Methods
Name | Description
Create |  Creates a new instance of cable tray.
GetShapeType |  Returns the shape type for the cable tray.
IsValidCableTrayType |  Identifies if a cable tray type is valid.
IsValidRungSpace |  Identifies if the input rung space is valid.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace