Revit 2027 API
SubMenuItem Class
 A class representing a menu flyout.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.MenuItem
 Autodesk.Revit.UI.SubMenuItem
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SubMenuItem : MenuItem
Public Class SubMenuItem
	Inherits MenuItem
public ref class SubMenuItem : public MenuItem
type SubMenuItem =
    class
        inherit MenuItem
    end
The SubMenuItem type exposes the following members.
Constructors
Name | Description
SubMenuItem |  Initialize the item data.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 To add a child menu, create a new ContextMenu object and add MenuItem on it, pass the child ContextMenu object to SubMenuItem constructor and create SubMenuItem object, use AddItem() method to add the SubMenuItem object to parent ContextMenu.
See Also
Reference
Autodesk.Revit.UI Namespace