Revit 2027 API
CategorySet Class
A set that can contains Category objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CategorySet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CategorySet : APIObject,
	IEnumerable
Public Class CategorySet
	Inherits APIObject
	Implements IEnumerable
public ref class CategorySet : public APIObject,
	IEnumerable
type CategorySet =
    class
        inherit APIObject
        interface IEnumerable
    end
The CategorySet type exposes the following members.
Constructors
Name | Description
CategorySet | Initializes a new instance of the CategorySet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of categories that are in the set.
Top
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains | Tests for the existence of a category within the set.
Erase | Removes a specified category from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified category into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace