Revit 2027 API
StairsPath Methods
The StairsPath type exposes the following members.
Methods
Name | Description
CanCreateOnMultistoryStairs |  Checks if more stairs paths can be added on the plan views of a multistory stairs.
Create |  Creates a new stairs path for the specified stairs with the specified stairs path type only in the plan view.
CreateOnMultistoryStairs |  Creates a new stairs path for the stairs in a multistory stairs with the specified stairs path type only in the plan view.
Top
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace