Revit 2027 API
Family Methods
The Family type exposes the following members.
Methods
Name | Description
CanHaveStructuralSection |  Identifies if this Family can have a structural section.
CanLoadFamilies |  Checks whether the document is in a state that allows the loading of families.
ExtractPartAtom |  Writes a PartAtom XML from the contents of a family object.
GetFamilySymbolIds |  Gets the ids of the FamilySymbols owned by this Family.
GetFamilyTypeParameterValues |  Returns all applicable values for a FamilyType parameter of this family.
HasLargeSketches |  Checks whether the family contains sketches with a large number of elements.
IsAppropriateCategoryId |  Identifies if the input category id can be assigned as the new category for this family.
Top
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace