Revit 2027 API
FamilySizeTableManager Methods
The FamilySizeTableManager type exposes the following members.
Methods
Name | Description
CreateFamilySizeTableManager |  Adds FamilySizeTableManager to a Family. A FamilySizeTableManager and FamilySizeTables are only needed when importing, exporting, or removing size data previously stored in CSV files.
Dispose
ExportSizeTable |  Exports the size table to aCSV file.
GetAllSizeTableNames |  Get the FamilySizeTable names in a family.
GetFamilySizeTableManager |  Gets a FamilySizeTableManager from a Family
GetSizeTable |  Get a FamilySizeTable by name.
HasSizeTable |  Checks if a FamilySizeTable of a given name exists.
ImportSizeTable |  Imports a FamilySizeTable from a CSV file.
RemoveSizeTable |  Removes the FamilySizeTable of a given name.
Top
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace