Revit 2027 API
DataTransferProgressChangedEventArgs Properties
The DataTransferProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
FinishedSize |  The transferred data size, in bytes, since the last time this event was raised.
Speed |  Speed(bytes/second) in this event.
TotalSize |  Total expected data size to transfer, in bytes.
TransferMode |  Data transfer mode in this event.
Top
See Also
Reference
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace