Revit 2027 API
IFCOpeningDimensions Methods
The IFCOpeningDimensions type exposes the following members.
Methods
Name | Description
Dispose
GetOpeningHandle |  Gets the IFC opening element handle.
Top
See Also
Reference
IFCOpeningDimensions Class
Autodesk.Revit.DB.IFC Namespace