Revit 2027 API
MultiSegmentGrid Methods
The MultiSegmentGrid type exposes the following members.
Methods
Name | Description
AreGridsInSameMultiSegmentGrid |  Determine whether two Grids are members of the same GridChain.
Create |  Create a MultiSegmentGrid element from the specified curve loop.
GetGridIds |  Get the element ids of the Grids that make up this MultiSegmentGrid.
GetMultiSegementGridId |  Retrieve the element id of the MultiSegmentGrid of which the specified Grid is a member.
IsValidCurveLoop |  Identifies whether the specified curve loop is valid for creation of a MultiSegmentGrid.
IsValidSketchPlaneId |  Identifies whether provided element id corresponds to a SketchPlane that is valid for GridChain creation.
Top
See Also
Reference
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace