Revit 2027 API
ElementType Properties
The ElementType type exposes the following members.
Properties
Name | Description
CanBeCopied |  Determine if this ElementType can create a copy
CanBeDeleted |  Determine if this ElementType can be deleted
CanBeRenamed |  Determine if this ElementType can be renamed
FamilyName |  Gets the family name of this element type.
Name | Set the name for the ElementType.
(Overrides Element.Name)
Top
See Also
Reference
ElementType Class
Autodesk.Revit.DB Namespace