Revit 2027 API
TransferredProjectStandardsEventArgs Properties
The TransferredProjectStandardsEventArgs type exposes the following members.
Properties
Name | Description
SourceDocument |  Source document.
TargetDocument |  Target document.
Top
See Also
Reference
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace