Revit 2027 API
VoltageType Methods
The VoltageType type exposes the following members.
Methods
Name | Description
SetVoltageValue |  Assign new values to modify voltage type, all of the unit are volt.
Top
See Also
Reference
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace