Revit 2027 API
ParameterFilterElement Methods
The ParameterFilterElement type exposes the following members.
Methods
Name | Description
AllRuleParametersApplicable(ElementFilter) |  Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.
AllRuleParametersApplicable(Document, ICollection<ElementId>, ElementFilter) |  Checks that the parameters of the given ElementFilter (representing a combination of rules) are valid for the given set of categories.
ClearRules |  Removes all rules from this filter.
Create(Document, String, ICollection<ElementId>) |  Creates a new ParameterFilterElement in the given document.
Create(Document, String, ICollection<ElementId>, ElementFilter) |  Creates a new ParameterFilterElement in the given document.
ElementFilterIsAcceptableForParameterFilterElement(ElementFilter) |  Checks that an ElementFilter is acceptable for use in defining the filtering rules for a ParameterFilterElement (i.e., for view filtering).
ElementFilterIsAcceptableForParameterFilterElement(Document, ISet<ElementId>, ElementFilter) |  Checks that an ElementFilter is acceptable for use in defining the filtering rules for a given list of categories (i.e., for view filtering).
GetCategories |  Gets the categories admitted by this filter.
GetElementFilter |  Returns an ElementFilter representing the combination of rules used by this filter.
GetElementFilterParameters |  Retrieves a list of the parameters associated with each rule in the filter.
GetElementFilterParametersForCategory |  Retrieves a list of the parameters associated with all rules in the filter that are combined (using logical AND) with a FilterCategoryRule corresponding to single %categoryId%.
SetCategories |  Sets the categories admitted by this filter.
SetElementFilter |  Sets the rules that must be satisfied for a given element to pass this filter.
Top
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace