Revit 2027 API
FileImportedEventArgs Class
 The event arguments used by the FileImported event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.FileImportedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FileImportedEventArgs : RevitAPIPostDocEventArgs
Public Class FileImportedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class FileImportedEventArgs : public RevitAPIPostDocEventArgs
type FileImportedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The FileImportedEventArgs type exposes the following members.
Properties
Name | Description
Format |  Identifies the import format, e.g. DWG or image.
ImportedInstanceId |  The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance.
Path |  Path of the source file that was imported.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace