Revit 2027 API
AssetPropertyInteger Class
 Represents a property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyInteger
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyInteger : AssetProperty
Public Class AssetPropertyInteger
	Inherits AssetProperty
public ref class AssetPropertyInteger : public AssetProperty
type AssetPropertyInteger =
    class
        inherit AssetProperty
    end
The AssetPropertyInteger type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace