Revit 2027 API
LinkOperations Class
 This class is used to extend the IExternalResourceServer interface with methods to support operations for elements that are LinkTypes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkOperations
 Autodesk.Revit.DB.CADLinkOperations
 Autodesk.Revit.DB.RevitLinkOperations
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkOperations : IDisposable
Public Class LinkOperations
	Implements IDisposable
public ref class LinkOperations : IDisposable
type LinkOperations =
    class
        interface IDisposable
    end
The LinkOperations type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LinkOperations
SetOnLocalLinkSharedCoordinatesSavedCallback |  Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
Top
See Also
Reference
Autodesk.Revit.DB Namespace