Revit 2027 API
ItemData Class
 Base class used to contain information necessary to construct RibbonItem and ContextMenuItem
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ItemData : IDisposable
Public Class ItemData
	Implements IDisposable
public ref class ItemData : IDisposable
type ItemData =
    class
        interface IDisposable
    end
The ItemData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The internal name of the item.
ToolTip |  The tooltip of item.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ItemData
Top
See Also
Reference
Autodesk.Revit.UI Namespace