Revit 2027 API
StructuralSectionConcreteT Class
 Defines parameters for parameterized concrete T structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcreteT : StructuralSectionRectangular
Public Class StructuralSectionConcreteT
	Inherits StructuralSectionRectangular
public ref class StructuralSectionConcreteT : public StructuralSectionRectangular
type StructuralSectionConcreteT =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionConcreteT type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteT |  Creates a new instance of Structural Section Concrete T shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
CantileverHeight |  Flange cantilever thickness.
CantileverLength |  Flange cantilever length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace