Revit 2027 API
ReinforcementData Class
 Abstract class for various reinforcement data
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReinforcementData
 Autodesk.Revit.DB.Structure.RebarReinforcementData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReinforcementData : IDisposable
Public Class ReinforcementData
	Implements IDisposable
public ref class ReinforcementData : IDisposable
type ReinforcementData =
    class
        interface IDisposable
    end
The ReinforcementData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReinforcementData
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace