Revit 2027 API
RebarReinforcementData Methods
The RebarReinforcementData type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of RebarReinforcementData, or null if the operation fails.
Top
See Also
Reference
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace