Revit 2027 API
AreaReinforcement Class
 An object that represents an Area Reinforcement within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AreaReinforcement
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaReinforcement : Element
Public Class AreaReinforcement
	Inherits Element
public ref class AreaReinforcement : public Element
type AreaReinforcement =
    class
        inherit Element
    end
The AreaReinforcement type exposes the following members.
Properties
Name | Description
AdditionalBottomCoverOffset |  Additional offset from the bottom or interior cover reference.
AdditionalTopCoverOffset |  Additional offset from the top or exterior cover reference.
AreaReinforcementType |  Retrieves the type of the Area Reinforcement.
Direction |  Retrieve the Major Direction of the Area Reinforcement.
Top
Methods
Name | Description
ConvertRebarInSystemToRebars |  Converts all RebarInSystem elements owned by the input AreaReinforcement to equivalent Rebar elements.
Create(Document, Element, XYZ, ElementId, ElementId, ElementId) |  Creates a new AreaReinforcement object based on a host boundary.
Create(Document, Element, IList<Curve>, XYZ, ElementId, ElementId, ElementId) |  Creates a new AreaReinforcement object from an array of curves. This method replaces the NewAreaReinforcement method, which has been deprecated.
GetBoundaryCurveIds |  Retrieves the set of curves forming the boundary of the Area Reinforcement.
GetHostId |  The element that contains the Area Reinforcement.
GetLayerDirection |  Gets the direction of the layer. The lines are distributed along this direction.
GetLineFromLayerAtIndex |  Gets the line from the desired layer at the specified index.
GetMovedLineTransform |  Returns a transform representing the movement of the line relative to its default position along the direction of the desired layer.
GetNumberOfLines |  Gets the number of lines on the specified layer. It also counts the excluded ones.
GetRebarInSystemIds |  Returns the ids of the RebarInSystem elements owned by the AreaReinforcement element.
IsLayerActive |  Identifies if the layer is active or not.
IsLineIncluded |  Checks whether the line from the desired layer at the specified position is included or not.
IsUnobscuredInView |  Checks if Area Reinforcement is shown unobscured in a view.
MoveLine |  This method applies the translation to the line from the desired layer, at the specified position. If the line was already moved, the method will concatenate the translation with the existing movement. The line will be translated only along the direction of the specified layer.
RemoveAreaReinforcementSystem |  Deletes the specified AreaReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
ResetMovedLineTransform |  Reset the transformation representing the movement of the line relative to its default position along the direction of the specified layer. The moved line transform will be set to Identity.
SetLayerActive |  Sets if the desired layer is active or not.
SetLineIncluded |  Sets if the line from desired layer at the specified position is included or not.
SetUnobscuredInView |  Sets Area Reinforcement to be shown unobscured in a view.
Top
Remarks
 This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object. The Area Reinforcement element is available only in the Autodesk Revit Structure product.
Example
public void GetInfo_AreaReinforcement(AreaReinforcement areaReinforcement)
{
    string message = "AreaReinforcement : ";
    // Show the AreaReinforcement Type information
    //message += "\nType : " + areaReinforcement.AreaReinforcementType.Name;
    // Show the AreaReinforcement bar information
    IList<ElementId> rebarInSystemIds = areaReinforcement.GetRebarInSystemIds();
    message += "\nNumber of distinct bar shapes : " + rebarInSystemIds.Count;
    for (int i = 0; i < rebarInSystemIds.Count; i++)
    {
        RebarInSystem ris = doc.GetElement(rebarInSystemIds[0]) as RebarInSystem;
        message += "\nBar count : " + ris.Quantity;
        message += "\nBar type name : " + ris.Name;
        message += "\nBar length : " + ris.LookupParameter("Bar Length").AsDouble();
    }
    // Show the AreaReinforcement Curves information
    IList<ElementId> curveIds = areaReinforcement.GetBoundaryCurveIds();
    message += "\nArea Reinforcement has " + curveIds.Count + " boundary curves.";
    foreach (Autodesk.Revit.DB.ElementId ii in curveIds)
    {
        AreaReinforcementCurve reinCurve = doc.GetElement(ii) as AreaReinforcementCurve;
        if (null == reinCurve)
        {
            continue;
        }
        Curve curve = reinCurve.Curve; // get the location curve
        XYZ start = curve.GetEndPoint(0);  // get the start point of the curve
        XYZ end = curve.GetEndPoint(1);    // get the end point of the curve
        message += "\nCurve: Start point (" + start.X + ", " + start.Y + ", " + start.Z + ")";
        message += "\n       End point (" + end.X + ", " + end.Y + ", " + end.Z + ")";
    }
    TaskDialog.Show("Revit", message);
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace