Revit 2027 API
ExportLayerInfo Class
 A value used to represent the info stored in the ExportLayerTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLayerInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLayerInfo : IDisposable
Public Class ExportLayerInfo
	Implements IDisposable
public ref class ExportLayerInfo : IDisposable
type ExportLayerInfo =
    class
        interface IDisposable
    end
The ExportLayerInfo type exposes the following members.
Constructors
Name | Description
ExportLayerInfo |  Constructs a new ExportLayerInfo with default values.
Top
Properties
Name | Description
CategoryType |  The category type which this layer belongs to.
ColorName |  The color name stored in value. For IFC export, the naming is to match the "colornumber" setting -- really, this stores a string that generates the colorNumber (for formats that don't use the color but need a second entry.)
ColorNumber |  The color number stored in value.
CutColorNumber |  The cut color number stored in value.
CutLayerName |  The cut layer name stored in value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LayerName |  The layer name stored in value.
Top
Methods
Name | Description
AddCutLayerModifier |  Adds a cut layer modifier to the layer info.
AddLayerModifier |  Adds a project layer modifier to the layer info.
ClearCutLayerModifiers |  Clears all the cut layer modifiers stored in the layer info.
ClearLayerModifiers |  Clears all the project layer modifiers stored in the layer info.
Dispose | Releases all resources used by the ExportLayerInfo
GetCutLayerModifiers |  Gets all the cut layer modifiers from the layer info.
GetLayerModifiers |  Gets all the project layer modifiers from the layer info.
RemoveCutLayerModifier |  Removes a cut layer modifier from the layer info.
RemoveLayerModifier |  Removes a project layer modifier from the layer info.
SetCutLayerModifiers |  Sets a cut layer modifier array to the layer info.
SetLayerModifiers |  Sets a project layer modifier array to the layer info.
Top
Example
public bool ExportDWGModifyLayerTable(Document document, View view)
{
    bool exported = false;
    IList<string> setupNames = BaseExportOptions.GetPredefinedSetupNames(document);
    if (setupNames.Count > 0)
    {
        // Get the export options for the first predefined setup
        DWGExportOptions dwgOptions = DWGExportOptions.GetPredefinedOptions(document, setupNames[0]);
        // Get the export layer table
        ExportLayerTable layerTable = dwgOptions.GetExportLayerTable();
        // Find the first mapping for the Ceilings category
        string category = "Ceilings";
        ExportLayerKey targetKey = layerTable.GetKeys().First<ExportLayerKey>(layerKey => layerKey.CategoryName == category);
        ExportLayerInfo targetInfo = layerTable[targetKey];
        // change the color name and cut color number for this mapping
        targetInfo.ColorName = "31";
        targetInfo.CutColorNumber = 31;
        // Set the change back to the map
        layerTable[targetKey] = targetInfo;
        // Set the modified table back to the options
        dwgOptions.SetExportLayerTable(layerTable);
        ICollection<ElementId> views = new List<ElementId>();
        views.Add(view.Id);
        exported = document.Export(Path.GetDirectoryName(document.PathName),
            Path.GetFileNameWithoutExtension(document.PathName), views, dwgOptions);
    }
    return exported;
}
See Also
Reference
Autodesk.Revit.DB Namespace