Revit 2027 API
Mullion Class
Represents a CurtainGrid within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 Autodesk.Revit.DB.FamilyInstance
 Autodesk.Revit.DB.Mullion
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Mullion : FamilyInstance
Public Class Mullion
	Inherits FamilyInstance
public ref class Mullion : public FamilyInstance
type Mullion =
    class
        inherit FamilyInstance
    end
The Mullion type exposes the following members.
Properties
Name | Description
LocationCurve |  This method get the curve location of the current Mullion.
Lock | Get - to get whether the Mullion line is locked. Set - Lock/unlock the Mullion.
Lockable | Get - to get whether the Mullion can be lock or unlock.
MullionType |  The MullionType style of this Mullion. Get - to access type of mullion Set - change type of mullion. If the mullion is locked, InvalidOperationException exception will be thrown.
Top
Methods
Name | Description
BreakMullion |  This method is used to break the current Mullion at ends with its neighboring mullions.
JoinMullion |  This method is used to control the join condition the current Mullion with its neighboring mullions.
Top
See Also
Reference
Autodesk.Revit.DB Namespace