Revit 2027 API
RectangleLightShape Properties
The RectangleLightShape type exposes the following members.
Properties
Name | Description
EmitLength |  The emit length.
EmitWidth |  The emit width.
Top
See Also
Reference
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace