Revit 2027 API
FabricationDimensionDefinition Methods
The FabricationDimensionDefinition type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace