Revit 2027 API
NumberSystemType Class
 An object represents the stairs treads/risers numbering type. for serialization
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.NumberSystemType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NumberSystemType : ElementType
Public Class NumberSystemType
	Inherits ElementType
public ref class NumberSystemType : public ElementType
type NumberSystemType =
    class
        inherit ElementType
    end
The NumberSystemType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace