Revit 2027 API
AppearanceAssetElement Methods
The AppearanceAssetElement type exposes the following members.
Methods
Name | Description
Create |  Creates a new AppearanceAssetElement from an existing rendering asset.
Duplicate |  Duplicates the appearance asset element.
GetAppearanceAssetElementByName |  Gets an AppearanceAssetElement by name.
GetRenderingAsset |  Gets the rendering asset for the appearance asset element.
SetRenderingAsset |  Sets the rendering asset for the appearance asset element.
Top
See Also
Reference
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace