Revit 2027 API
StructuralSectionSigmaProfile Class
 Defines parameters for Sigma Profile structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionSigmaProfile : StructuralSectionColdFormed
Public Class StructuralSectionSigmaProfile
	Inherits StructuralSectionColdFormed
public ref class StructuralSectionSigmaProfile : public StructuralSectionColdFormed
type StructuralSectionSigmaProfile =
    class
        inherit StructuralSectionColdFormed
    end
The StructuralSectionSigmaProfile type exposes the following members.
Constructors
Name | Description
StructuralSectionSigmaProfile |  Creates a new instance of Structural Section Sigma Profile shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BendWidth |  Bend segment width.
MiddleBendLength |  Middle Bend segment length.
TopBendLength |  Top Bend segment length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace