Revit 2027 API
ViewDisplayBackground Class
 Set of values that control how background is drawn in a view. Background can only be set for a 3d view or for a section or elevation view.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewDisplayBackground
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewDisplayBackground : IDisposable
Public Class ViewDisplayBackground
	Implements IDisposable
public ref class ViewDisplayBackground : IDisposable
type ViewDisplayBackground =
    class
        interface IDisposable
    end
The ViewDisplayBackground type exposes the following members.
Properties
Name | Description
BackgroundColor |  The color of the horizon when the type is 'Gradient'.
GroundColor |  The color of the ground when the type is 'Gradient' or 'SunAndClouds'.
HorizontalImageOffset |  The distance between the left viewport boundary and the left edge of the background image.
HorizontalImageScale |  The horizontal scale of the background image; the scale of 1.0 puts the image pixel-to-pixel.
ImageFlags |  The image alignment indicators when the type is 'Image'.
ImagePath |  The path to the image file when the type is 'Image'.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SkyColor |  The color of the sky when the type is 'Gradient'.
Type |  The type of the background.
VerticalImageOffset |  The distance between the bottom viewport boundary and the bottom edge of the background image.
VerticalImageScale |  The vertical scale of the background image; the scale of 1.0 puts the image pixel-to-pixel.
Top
Methods
Name | Description
CreateGradient |  Creates an object that can be passed to View.SetBackground method to set the background of the Gradient type.
CreateImage |  Creates an object that can be passed to View.SetBackground method to set the background of the Image type.
CreateSky |  Creates an object that can be passed to View.SetBackground method to set the background of the SunAndClouds type.
Dispose | Releases all resources used by the ViewDisplayBackground
Top
See Also
Reference
Autodesk.Revit.DB Namespace