Revit 2027 API
IntegerRange Class
 A class to define a range of a sequence of consecutive integer numbers
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IntegerRange
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IntegerRange : IDisposable
Public Class IntegerRange
	Implements IDisposable
public ref class IntegerRange : IDisposable
type IntegerRange =
    class
        interface IDisposable
    end
The IntegerRange type exposes the following members.
Properties
Name | Description
High |  The upper limit of the range
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Low |  The lower limit of the range
Top
Methods
Name | Description
Dispose | Releases all resources used by the IntegerRange
Top
See Also
Reference
Autodesk.Revit.DB Namespace