Revit 2027 API
FlexPipeType Class
A flex pipe type in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Plumbing.FlexPipeType
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FlexPipeType : MEPCurveType
Public Class FlexPipeType
	Inherits MEPCurveType
public ref class FlexPipeType : public MEPCurveType
type FlexPipeType =
    class
        inherit MEPCurveType
    end
The FlexPipeType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
The flex pipe type is only available in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace