Revit 2027 API
TextRange Class
 An object that is used to identify a range of characters in a FormattedText.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TextRange
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextRange : IDisposable
Public Class TextRange
	Implements IDisposable
public ref class TextRange : IDisposable
type TextRange =
    class
        interface IDisposable
    end
The TextRange type exposes the following members.
Constructors
Name | Description
TextRange() |  Constructs a TextRange with default values for start and length.
TextRange(TextRange) |  Constructs a copy of the input TextRange object.
TextRange(Int32, Int32) |  Constructs a TextRange with input start and length.
Top
Properties
Name | Description
End |  The index of the first character after the end of the range
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Length |  The length of the range.
Start |  The start index of a range within the FormattedText.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TextRange
Top
Remarks
 A TextRange consists of a start, which is a zero-based index into the text, and a length, which is the number of characters in the range. The length can be zero.
See Also
Reference
Autodesk.Revit.DB Namespace