Revit 2027 API
KeyBasedTreeEntriesLoadResults Methods
The KeyBasedTreeEntriesLoadResults type exposes the following members.
Methods
Name | Description
Dispose
GetFailureMessages |  Get all error or warnings created while attempting to load KeyBasedTreeEntries.
GetFileReadErrors |  Gets the names of any files which could not be read due to access errors.
GetFileSyntaxErrors |  Gets all the records in the key-based tree data text file that could not be parsed into KeyBasedTreeEntries.
GetKeyBasedTreeEntryErrors() |  Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors.
GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType) |  Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors of a particular type.
Top
See Also
Reference
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace