Revit 2027 API
BrowserOrganization Properties
The BrowserOrganization type exposes the following members.
Properties
Name | Description
SortingOrder |  The sorting order if sorting of items is applicable in the browser.
SortingParameterId | Obsolete.
 The Id of the parameter used to determine the sorting order of items in the browser.
Type |  Get BrowserOrganizationType.
Top
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace