Revit 2027 API
StructuralSectionIWideFlange Class
 Defines parameters for I-shape Wide Flange structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionIWideFlange : StructuralSectionHotRolled
Public Class StructuralSectionIWideFlange
	Inherits StructuralSectionHotRolled
public ref class StructuralSectionIWideFlange : public StructuralSectionHotRolled
type StructuralSectionIWideFlange =
    class
        inherit StructuralSectionHotRolled
    end
The StructuralSectionIWideFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionIWideFlange |  Creates a new instance of Structural Section I Wide Flange shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
BoltSpacingBetweenRows |  Standard bolt spacing between rows, in. (mm)
BoltSpacingTwoRows |  Standard bolt spacing for two rows , in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
FlangeToeOfFillet |  Detailing distance from center of web to flange toe of fillet, in. (mm)
WebToeOfFillet |  Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace