Revit 2027 API
IdlingEventArgs Methods
The IdlingEventArgs type exposes the following members.
Methods
Name | Description
SetRaiseWithoutDelay |  Sets the next invocation of the idling event to be called promptly, rather than relying on the default recurrence of idling from the Revit application. For more details see the remarks describing the Idling event.
Top
See Also
Reference
IdlingEventArgs Class
Autodesk.Revit.UI.Events Namespace