Revit 2027 API
CableTrayConduitBase Class
 The CableTrayConduitBase class is implemented as the base class for cable tray or conduit
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Electrical.CableTrayConduitBase
 Autodesk.Revit.DB.Electrical.CableTray
 Autodesk.Revit.DB.Electrical.Conduit
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTrayConduitBase : MEPCurve
Public Class CableTrayConduitBase
	Inherits MEPCurve
public ref class CableTrayConduitBase : public MEPCurve
type CableTrayConduitBase =
    class
        inherit MEPCurve
    end
The CableTrayConduitBase type exposes the following members.
Properties
Name | Description
RunId |  The id of the run to which this element belongs.
Top
Methods
Name | Description
IsValidEndPoints |  Identifies if two end points are valid.
IsValidLevelId |  Identifies if a level id is valid.
IsWithFitting |  Return whether its cable tray/conduit type is with fitting
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace