Revit 2027 API
WorksetDefaultVisibilitySettings Class
 An object that manages default visibility of worksets in a document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.WorksetDefaultVisibilitySettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksetDefaultVisibilitySettings : Element
Public Class WorksetDefaultVisibilitySettings
	Inherits Element
public ref class WorksetDefaultVisibilitySettings : public Element
type WorksetDefaultVisibilitySettings =
    class
        inherit Element
    end
The WorksetDefaultVisibilitySettings type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetWorksetDefaultVisibilitySettings |  Get the WorksetDefaultVisibilitySettings of the document.
IsWorksetVisible |  Indicates whether the workset is visible by default.
SetWorksetVisibility |  Set the default visibility of a workset.
Top
Remarks
 WorksetDefaultVisibilitySettings does not exist for family documents. In case worksharing is disabled in a document, all elements are moved into a single workset; that workset, and any worksets (re)created if worksharing is re-enabled, is visible by default regardless of any current settings.
See Also
Reference
Autodesk.Revit.DB Namespace