Revit 2027 API
SelectionChangedEventArgs Class
 The event arguments used by the SelectionChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.SelectionChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SelectionChangedEventArgs : RevitAPISingleEventArgs
Public Class SelectionChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class SelectionChangedEventArgs : public RevitAPISingleEventArgs
type SelectionChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The SelectionChangedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetDocument |  Returns the document associated with this event.
GetReferences |  Returns the references that are currently selected.
GetSelectedElements |  Returns ElementIds of selected elements.
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace