Revit 2027 API
ViewPosition Properties
The ViewPosition type exposes the following members.
Properties
Name | Description
Position |  Specifies view's position.
ViewAnchor |  Specifies the method by which the view will be positioned on the sheet. Default is set to ViewAnchor.ViewOrigin.
Top
See Also
Reference
ViewPosition Class
Autodesk.Revit.DB Namespace