Revit 2027 API
IRevisionsOnSheetUIServer Methods
The IRevisionsOnSheetUIServer type exposes the following members.
Methods
Name | Description
ShowDialog | Obsolete.
 Shows dialog on managing RevisionsOnSheetUI.
Top
See Also
Reference
IRevisionsOnSheetUIServer Interface
Autodesk.Revit.UI Namespace