Revit 2027 API
ElectricalDemandFactorDefinition Class
 The ElectricalDemandFactorDef class represents a serialized version of an instance of demand factor definition. It has a name, rule type, and values for the rules that are serialized.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalDemandFactorDefinition : Element
Public Class ElectricalDemandFactorDefinition
	Inherits Element
public ref class ElectricalDemandFactorDefinition : public Element
type ElectricalDemandFactorDefinition =
    class
        inherit Element
    end
The ElectricalDemandFactorDefinition type exposes the following members.
Constructors
Name | Description
ElectricalDemandFactorDefinition |  Constructs a new ElectricalDemandFactorDefinition with default settings.
Top
Properties
Name | Description
AdditionalLoad |  Additional load to be included during demand load calculation.
IncludeAdditionalLoad |  Should the additional load (if set) be included in demand load calculations.
RuleType |  The rule type for this demand factor definition.
Top
Methods
Name | Description
AddValue |  Adds a value to the value set for this demand factor definition
ClearValues |  Clears all the values stored for this demand factor definition.
Create |  Creates a new instance of a demand factor definition.
GetApplicableDemandFactor |  This method will return the applicable demand factor for the specified number of devices or load.
GetValues |  Provides access to the value set stored with this demand factor definition
GetValuesCount |  Returns the number of values in the set.
RemoveValue |  Removes a value to the value set for this demand factor definition
SetValues |  Sets the value set to the demand factor definition.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace