Revit 2027 API
AnnotationMultipleAlignmentUtils Class
 A helper providing functionality related to elements that can be aligned to one another. An element that wants to be able to align to other alignable elements using the Multiple Alignment buttons should implement this helper class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnnotationMultipleAlignmentUtils : IDisposable
Public Class AnnotationMultipleAlignmentUtils
	Implements IDisposable
public ref class AnnotationMultipleAlignmentUtils : IDisposable
type AnnotationMultipleAlignmentUtils =
    class
        interface IDisposable
    end
The AnnotationMultipleAlignmentUtils type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnnotationMultipleAlignmentUtils
ElementSupportsMultiAlign |  Returns true if element can be aligned to other similar elements.
GetAnnotationCenter |  Gets the center of the alignable element in model space.
GetAnnotationOutlineWithoutLeaders |  Gets the four corners of the alignable element in model space without its leaders.
MoveWithAnchoredLeaders |  Moves the element while keeping the leader end points anchored.
Top
See Also
Reference
Autodesk.Revit.DB Namespace