Revit 2027 API
MultistoryStairs Class
 Represents a multistory stairs element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.MultistoryStairs
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MultistoryStairs : Element
Public Class MultistoryStairs
	Inherits Element
public ref class MultistoryStairs : public Element
type MultistoryStairs =
    class
        inherit Element
    end
The MultistoryStairs type exposes the following members.
Properties
Name | Description
ActualTreadDepth |  The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
StandardStairsId |  Id of the stair associated with the Reference Level for the multistory stairs. The standard stair is regarded as a definition to generate new stairs when extending multistory stairs to a different level height.
Top
Methods
Name | Description
CanConnectLevel |  Checks if the given level can be connected into multistory stairs. You cannot connect levels between standard stairs top and bottom or already connected.
CanDisconnectLevel |  Checks if the given level can be disconnected from multistory stairs. You cannot disconnect the levels of standard stair (the stair associated with the Reference Level for the multistory stairs) or already disconnected.
ConnectLevels |  Extends the multistory stairs by connecting input levels.
Create |  Creates a multistory stairs from an existing component-based stairs.
DisconnectLevels |  Shrinks the multistory stairs by disconnecting input levels.
GetAllConnectedLevels |  Gets all connected level ids of this multistory stairs.
GetAllStairsIds |  Gets the ids of all the stairs in this multistory stairs.
GetStairsOnLevel |  Gets the individual stairs or stairs group on the given base level.
GetStairsPlacementLevels |  Gets all the levels the given stairs group placed on.
IsAcceptableForMultistoryStairs |  Checks if the given stairs can be used to create a multistory stairs.
IsPinned |  Checks if a stair is pinned.
Pin |  Restores an unpinned stairs element back into the group of stairs governed by level height.
Unpin |  Removes a particular story of the stairs (identified by its base level id) from a stairs group.
Top
Remarks
A multistory stairs element may contain multiple stairs whose extents are governed by base and top levels. Use [M:Autodesk.Revit.DB.Architecture.MultistoryStairs.ConnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})] and [M:Autodesk.Revit.DB.Architecture.MultistoryStairs.DisconnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})] to add and remove connected levels to a multistory stairs element.
This element will contain one or more Stairs elements. These can be obtained via GetAllStairsIds() and GetStairsOnLevel(ElementId). Stairs elements are either a reference instance which is copied to each level covered by groups of identical stairs instances which share the same level height, or individual Stairs instances which are not connected to a group with the same level height. By default, when adding new levels to the multistory stair, new stairs will be added to the group (shown in the Revit user interface with a 'Pin' icon).
For groups of duplicate stairs at different levels, the instances can be found as Subelements of the Stairs element (see GetSubelements().
Stairs in a connected group can be edited together by modifying the associated Stairs instance. For specific floors that need special designs, stairs can be separated from a group by unpinning the element, changes made to this Stairs will not affect other any other instance in the element. Use Unpin(ElementId) for this.
You can add the stairs back into the group via Pin(ElementId) if needed. However, any changes made to the stair will be lost since the stair's properties will be overridden by the group specifications.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace