Revit 2027 API
GroupNode Class
 A node that represents set of individual elements grouped together in some form, such as an instance of a family or linked Revit file, or an instance of a part of symbol's geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.InstanceNode
 Autodesk.Revit.DB.LinkNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GroupNode : RenderNode
Public Class GroupNode
	Inherits RenderNode
public ref class GroupNode : public RenderNode
type GroupNode =
    class
        inherit RenderNode
    end
The GroupNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetTransform |  A transformation matrix associated with the node.
Top
See Also
Reference
Autodesk.Revit.DB Namespace