Revit 2027 API
IFCUserDefinedPropertySet Properties
The IFCUserDefinedPropertySet type exposes the following members.
Properties
Name | Description
PropertySetType |  The user-defined property set type.
Top
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace