Revit 2027 API
DialogBoxShowingEventArgs Class
 The base class for the event arguments used by the DialogBoxShowing event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
 Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs
 Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DialogBoxShowingEventArgs : RevitAPIPreEventArgs
Public Class DialogBoxShowingEventArgs
	Inherits RevitAPIPreEventArgs
public ref class DialogBoxShowingEventArgs : public RevitAPIPreEventArgs
type DialogBoxShowingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The DialogBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
DialogId |  A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
Top
Methods
Name | Description
OverrideResult |  Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Top
Remarks
 The actual type of the event arguments will be different depending upon the type of dialog shown. When the application receives this object, a dialog is to be displayed in Revit that requires user interaction. The OverrideResult function can be used to cause the dialog to be dismissed and return a desired result code.
See Also
Reference
Autodesk.Revit.UI.Events Namespace