Revit 2027 API
IFCAnyHandle Class
 A handle representing an item in an IFC file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCAnyHandle
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCAnyHandle : IDisposable
Public Class IFCAnyHandle
	Implements IDisposable
public ref class IFCAnyHandle : IDisposable
type IFCAnyHandle =
    class
        interface IDisposable
    end
The IFCAnyHandle type exposes the following members.
Properties
Name | Description
HasValue |  Identifies if the handle is empty or contains a value.
Id |  The integer identifier for the handle.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StepId |  The step id of the handle. Valid only for import.
TypeName |  The name of the type of the handle.
Top
Methods
Name | Description
CreateAggregateAttribute |  Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef
Delete |  Deletes the handle.
Dispose | Releases all resources used by the IFCAnyHandle
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetAttribute |  Gets the attribute by name.
GetHashCode |  Gets the integer value of the id as hash code
(Overrides Object.GetHashCode())
IsSubTypeOf |  Determines whether the instance is an instance of the specified instance type or a subtype of this instance type.
IsTypeOf |  Determines whether the instance is an instance of exactly the specified instance type.
SetAttribute(String, IFCAnyHandle) |  Sets the attribute value.
SetAttribute(String, IFCData) |  Sets the attribute value.
SetAttribute(String, Boolean) |  Sets the attribute value.
SetAttribute(String, IList<IFCAnyHandle>)
SetAttribute(String, IList<Boolean>)
SetAttribute(String, IList<Double>)
SetAttribute(String, IList<Int32>)
SetAttribute(String, IList<String>)
SetAttribute(String, ISet<IFCAnyHandle>)
SetAttribute(String, ISet<Boolean>)
SetAttribute(String, ISet<Double>)
SetAttribute(String, ISet<Int32>)
SetAttribute(String, ISet<String>)
SetAttribute(String, Double) |  Sets the attribute value.
SetAttribute(String, Int32) |  Sets the attribute value.
SetAttribute(String, String) |  Sets the attribute value.
UnsetAttribute |  Unsets the attribute value.
Top
Operators
Name | Description
Equality(IFCAnyHandle, IFCAnyHandle) | Determines whether two IFCAnyHandles are the same.
Inequality(IFCAnyHandle, IFCAnyHandle) | Determines whether two IFCAnyHandles are different.
Top
Remarks
 Handles are used to populate each line item in an IFC file. Each handle is assigned a unique identifier (an integer) which can be seen in the file contents at the start of the line.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace