Revit 2027 API
ElectricalEquipment Properties
The ElectricalEquipment type exposes the following members.
Properties
Name | Description
CircuitNamingSchemeId |  The CircuitNamingSchemeId used in the Electrical Equipment. The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.
DistributionSystem |  get or set the Distribution System for the Electrical Equipment.
IsSwitchboard |  The electrical equipment is a switchboard or not. This property returns true if the electrical equipment is a switchboard.
MaxNumberOfCircuits |  The maximum number of circuits for switchboard. The quantity of circuits can be assigned to switchboard through breaker.
Top
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace