Revit 2027 API
ScheduleSortGroupField Methods
The ScheduleSortGroupField type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace