Revit 2027 API
Wire Properties
The Wire type exposes the following members.
Properties
Name | Description
GroundConductorNum |  The ground conductor number. Its default value is zero after created.
HotConductorNum |  The hot conductor number. Its default value is zero after created.
NeutralConductorNum |  The neutral conductor number. Its default value is zero after created.
NumberOfVertices |  The number of vertices of the wire, including the start and end point.
WiringType |  The wiring type(arc or chamfer) for the wire.
Top
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace