Revit 2027 API
AreaTag Class
Provides access to the area topology in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementTag
 Autodesk.Revit.DB.AreaTag
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaTag : SpatialElementTag
Public Class AreaTag
	Inherits SpatialElementTag
public ref class AreaTag : public SpatialElementTag
type AreaTag =
    class
        inherit SpatialElementTag
    end
The AreaTag type exposes the following members.
Properties
Name | Description
Area | The area that the tag is associated with.
AreaTagType | The tag type.
Top
Methods
Name | Description
Top
Remarks
The areaTag object can be queried for its boundary for use in space planning tools.
See Also
Reference
Autodesk.Revit.DB Namespace