Revit 2027 API
InstanceNode Methods
The InstanceNode type exposes the following members.
Methods
Name | Description
GetSymbolGeometryId |  Gets the SymbolGeometryId associated with the node.
Top
See Also
Reference
InstanceNode Class
Autodesk.Revit.DB Namespace