Revit 2027 API
MullionTypeSet Methods
The MullionTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every mullion type from the set, rendering it empty.
Contains | Tests for the existence of a mullion type within the set.
Erase | Removes a specified mullion type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified mullion type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
MullionTypeSet Class
Autodesk.Revit.DB Namespace