Revit 2027 API
DirectContext3DHandleOverrides Class
 A set of DirectContext3DHandleSettings that are stored by a view.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DirectContext3DHandleOverrides : IDisposable
Public Class DirectContext3DHandleOverrides
	Implements IDisposable
public ref class DirectContext3DHandleOverrides : IDisposable
type DirectContext3DHandleOverrides =
    class
        interface IDisposable
    end
The DirectContext3DHandleOverrides type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Assign |  Assigns values of the source overrides to this object.
Dispose | Releases all resources used by the DirectContext3DHandleOverrides
GetDirectContext3DHandleSettings |  Gets override settings associated with a DirectContext3D handle instance or type.
IsEqual |  Check if the contents of two overrides are equal.
SetDirectContext3DHandleSettings |  Assigns override settings associated with a DirectContext3D handle instance or type.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace