Revit 2027 API
ClassificationEntries Class
 A collection of ClassificationEntry objects that make up the classification table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntries
 Autodesk.Revit.DB.ClassificationEntries
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ClassificationEntries : KeyBasedTreeEntries
Public Class ClassificationEntries
	Inherits KeyBasedTreeEntries
public ref class ClassificationEntries : public KeyBasedTreeEntries
type ClassificationEntries =
    class
        inherit KeyBasedTreeEntries
    end
The ClassificationEntries type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
LoadClassificationEntriesFromFile |  Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent.
Top
See Also
Reference
Autodesk.Revit.DB Namespace