Revit 2027 API
ClosestPointsPairBetweenTwoCurves Methods
The ClosestPointsPairBetweenTwoCurves type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace