Revit 2027 API
SlabShapeVertex Class
 Represents a vertex of a slab shape edited element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SlabShapeVertex
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SlabShapeVertex : IDisposable
Public Class SlabShapeVertex
	Implements IDisposable
public ref class SlabShapeVertex : IDisposable
type SlabShapeVertex =
    class
        interface IDisposable
    end
The SlabShapeVertex type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Position |  The vertex position
VertexType |  The vertex type
Top
Methods
Name | Description
Dispose | Releases all resources used by the SlabShapeVertex
Top
See Also
Reference
Autodesk.Revit.DB Namespace