Revit 2027 API
AssetPropertyFloatArray Class
 Represents a property consisting of an array of float values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyFloatArray : AssetProperty
Public Class AssetPropertyFloatArray
	Inherits AssetProperty
public ref class AssetPropertyFloatArray : public AssetProperty
type AssetPropertyFloatArray =
    class
        inherit AssetProperty
    end
The AssetPropertyFloatArray type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetValue | Get the value of the property.
Top
Remarks
 In virtually all cases, the array will contain exactly 3 values.
See Also
Reference
Autodesk.Revit.DB.Visual Namespace