Revit 2027 API
LinearDimension Methods
The LinearDimension type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of an Linear Dimension element within the project.
Top
See Also
Reference
LinearDimension Class
Autodesk.Revit.DB Namespace