Revit 2027 API
SlabEdge Class
An object that represents a slab edge within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.HostedSweep
 Autodesk.Revit.DB.SlabEdge
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SlabEdge : HostedSweep
Public Class SlabEdge
	Inherits HostedSweep
public ref class SlabEdge : public HostedSweep
type SlabEdge =
    class
        inherit HostedSweep
    end
The SlabEdge type exposes the following members.
Properties
Name | Description
SlabEdgeType | Retrieves/set an object that represents the type of the SlabEdge.
Top
Methods
Name | Description
AddSegment | Add segments to the slab edge.
(Overrides HostedSweep.AddSegment(Reference))
Top
Remarks
This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.
See Also
Reference
Autodesk.Revit.DB Namespace