Revit 2027 API
ReferenceArrayArrayIterator Methods
The ReferenceArrayArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
ReferenceArrayArrayIterator Class
Autodesk.Revit.DB Namespace