Revit 2027 API
FluidTemperatureSetIterator Methods
The FluidTemperatureSetIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  Returns the current FluidTemperature.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace