Revit 2027 API
ColorWithTransparency Methods
The ColorWithTransparency type exposes the following members.
Methods
Name | Description
Dispose
GetBlue |  get blue
GetColor |  get color
GetGreen |  get green
GetRed |  get red
GetTransparency |  get transparency
SetBlue |  set blue
SetColor |  set color
SetGreen |  set green
SetRed |  set red
SetTransparency |  set transparency
Top
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace