Revit 2027 API
LoadCombination Properties
The LoadCombination type exposes the following members.
Properties
Name | Description
IsThirdPartyGenerated |  Indicates if the load combination was created by API.
State |  The state of the load combination.
Type |  The type of the load combination.
Top
See Also
Reference
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace