Revit 2027 API
InitialLuminousIntensity Class
 This class encapsulates initial luminous intensity calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialLuminousIntensity : InitialIntensity
Public Class InitialLuminousIntensity
	Inherits InitialIntensity
public ref class InitialLuminousIntensity : public InitialIntensity
type InitialLuminousIntensity =
    class
        inherit InitialIntensity
    end
The InitialLuminousIntensity type exposes the following members.
Constructors
Name | Description
InitialLuminousIntensity(Double) |  Creates an initial luminous intensity object with the given document and luminosity values.
InitialLuminousIntensity(InitialLuminousIntensity) |  Creates a copy of the given initial luminous intensity object
Top
Properties
Name | Description
Luminosity |  The luminosity value.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace