Revit 2027 API
FabricationItemFolder Methods
The FabricationItemFolder type exposes the following members.
Methods
Name | Description
Dispose
GetItemFiles |  Gets the item files in this item folder.
GetSubFolders |  Gets the item folder's sub folders.
Top
See Also
Reference
FabricationItemFolder Class
Autodesk.Revit.DB Namespace