Revit 2027 API
DirectoryNotFoundException Methods
The DirectoryNotFoundException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
DirectoryNotFoundException Class
Autodesk.Revit.Exceptions Namespace