Revit 2027 API
FormatValueOptions Class
 Options for formatting numbers with units into strings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormatValueOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FormatValueOptions : IDisposable
Public Class FormatValueOptions
	Implements IDisposable
public ref class FormatValueOptions : IDisposable
type FormatValueOptions =
    class
        interface IDisposable
    end
The FormatValueOptions type exposes the following members.
Constructors
Name | Description
FormatValueOptions |  Creates a new FormatValueOptions object with default settings.
Top
Properties
Name | Description
AppendUnitSymbol |  Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FormatValueOptions
GetFormatOptions |  Gets the FormatOptions to optionally override the default settings in the Units class.
SetFormatOptions |  Sets the FormatOptions to optionally override the default settings in the Units class.
Top
See Also
Reference
Autodesk.Revit.DB Namespace