Revit 2027 API
MechanicalSystem Properties
The MechanicalSystem type exposes the following members.
Properties
Name | Description
BaseEquipmentConnector | The connector within the base equipment which is used to connect with the system.
DuctNetwork |  The ducts and fittings contained within the system.
IsWellConnected |  Indicates if the system is well connected or not.
SystemType | The type of this duct system.
Top
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace