Revit 2027 API
Area Properties
The Area type exposes the following members.
Properties
Name | Description
AreaScheme | The area scheme.
IsGrossInterior | The boolean value that indicates whether the area is gross interior.
Top
See Also
Reference
Area Class
Autodesk.Revit.DB Namespace