Revit 2027 API
AssetPropertyUInt64 Class
 Represents a property of UInt64 value.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyUInt64
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyUInt64 : AssetProperty
Public Class AssetPropertyUInt64
	Inherits AssetProperty
public ref class AssetPropertyUInt64 : public AssetProperty
type AssetPropertyUInt64 =
    class
        inherit AssetProperty
    end
The AssetPropertyUInt64 type exposes the following members.
Properties
Name | Description
Value | Get the value of the property.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace