Revit 2027 API
ViewPrintedEventArgs Class
 The event arguments used by the ViewPrinted event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ViewPrintedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewPrintedEventArgs : RevitAPIPostDocEventArgs
Public Class ViewPrintedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ViewPrintedEventArgs : public RevitAPIPostDocEventArgs
type ViewPrintedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ViewPrintedEventArgs type exposes the following members.
Properties
Name | Description
Index |  The index of the view being printed out of the set of all views being printed.
TotalViews |  The number of all views being printed.
View |  The view that was printed.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace