Revit 2027 API
SystemsAnalysisOptions Class
 Contains the options for systems analysis.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SystemsAnalysisOptions : IDisposable
Public Class SystemsAnalysisOptions
	Implements IDisposable
public ref class SystemsAnalysisOptions : IDisposable
type SystemsAnalysisOptions =
    class
        interface IDisposable
    end
The SystemsAnalysisOptions type exposes the following members.
Constructors
Name | Description
SystemsAnalysisOptions |  Constructs a new instance of the options.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OutputFolder |  The path of the output folder for systems analysis.
WeatherFile |  The file name of the EnergyPlus weather (*.epw).
WorkflowFile |  The file name of the EnergyPlus workflow script.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SystemsAnalysisOptions
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace