Revit 2027 API
ConnectorElement Properties
The ConnectorElement type exposes the following members.
Properties
Name | Description
CoordinateSystem | The coordinate system of the connector.
Direction |  Gets the direction of the connector element.
Domain | The domain of the connector.
Height | The height of the connector.
IsPrimary |  Identifies if this is the primary connector in the family.
Origin | The location of the connector in family document.
Radius | The radius of the connector.
Shape | The shape of the connector.
SystemClassification |  The system classification of the connector.
Width | The width of the connector.
Top
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace