Revit 2027 API
ScheduleHeightsOnSheet Methods
The ScheduleHeightsOnSheet type exposes the following members.
Methods
Name | Description
Dispose
GetBodyRowHeights |  Returns each row's height of schedule body on sheet view.
Top
See Also
Reference
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace