Revit 2027 API
CodeCheckingParameterServiceData Methods
The CodeCheckingParameterServiceData type exposes the following members.
Methods
Name | Description
Dispose
GetCurrentElements |  Returns the list of Ids of the current elements.
Top
See Also
Reference
CodeCheckingParameterServiceData Class
Autodesk.Revit.DB.Structure Namespace