Revit 2027 API
HandRailType Class
 A rail type object that is used in the generation of hand rail.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.ContinuousRailType
 Autodesk.Revit.DB.Architecture.HandRailType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HandRailType : ContinuousRailType
Public Class HandRailType
	Inherits ContinuousRailType
public ref class HandRailType : public ContinuousRailType
type HandRailType =
    class
        inherit ContinuousRailType
    end
The HandRailType type exposes the following members.
Properties
Name | Description
Height |  The height of the handrail.
SupportJustification |  The support justification method of the handrail.
SupportLayout |  The support layout method of the handrail.
SupportNumber |  The number of supports of the handrail.
SupportSpacing |  The support spacing of the handrail.
SupportTypeId |  The support type of the handrail.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace