Revit 2027 API
OverrideGraphicSettings Methods
The OverrideGraphicSettings type exposes the following members.
Methods
Name | Description
Dispose
SetCutBackgroundPatternColor |  Sets the override color of the background pattern of cut faces.
SetCutBackgroundPatternId |  Sets the ElementId of the cut face background pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetCutBackgroundPatternVisible |  Sets the visibility of the cut face background fill pattern.
SetCutForegroundPatternColor |  Sets the override color of the foreground pattern of cut faces.
SetCutForegroundPatternId |  Sets the ElementId of the cut face foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetCutForegroundPatternVisible |  Sets the visibility of the cut face foreground fill pattern.
SetCutLineColor |  Sets the cut surface line color.
SetCutLinePatternId |  Sets the ElementId of the cut surface line pattern.
SetCutLineWeight |  Sets the cut surface line weight.
SetDetailLevel |  Sets the detail level.
SetHalftone |  Sets the halftone value.
SetProjectionLineColor |  Sets the projection surface line color.
SetProjectionLinePatternId |  Sets the ElementId of the projection surface line pattern.
SetProjectionLineWeight |  Sets the projection surface line weight.
SetSurfaceBackgroundPatternColor |  Sets the override color of the surface background pattern.
SetSurfaceBackgroundPatternId |  Sets the ElementId of the surface background pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetSurfaceBackgroundPatternVisible |  Sets the visibility of the surface background fill pattern.
SetSurfaceForegroundPatternColor |  Sets the override color of the surface foreground pattern.
SetSurfaceForegroundPatternId |  Sets the ElementId of the surface foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
SetSurfaceForegroundPatternVisible |  Sets the visibility of the surface foreground fill pattern.
SetSurfaceTransparency |  Sets the projection surface transparency.
Top
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace