Revit 2027 API
MaterialNode Methods
The MaterialNode type exposes the following members.
Methods
Name | Description
GetAppearance |  Appearance properties associated with the material.
GetAppearanceOverride |  Returns appearance properties that override the preset appearance of the material.
Top
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace