Revit 2027 API
VertexIndexPair Class
Represents a connection between vertices in the top and bottom profile of a blend.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.VertexIndexPair
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexIndexPair
Public Class VertexIndexPair
public ref class VertexIndexPair
type VertexIndexPair = class end
The VertexIndexPair type exposes the following members.
Constructors
Name | Description
VertexIndexPair | Initializes a new instance of the VertexIndexPair class
Top
Properties
Name | Description
Bottom | The index of the vertex pair from the bottom profile.
Top | The index of the vertex pair from the top profile.
Top
Methods
Name | Description
Top
Remarks
Use objects of this type in GetVertexConnectionMap(), SetVertexConnectionMap(VertexIndexPairArray), GetVertexConnectionMap() and SetVertexConnectionMap(VertexIndexPairArray) to get/set the vertex connection map.
See Also
Reference
Autodesk.Revit.DB Namespace