Revit 2027 API
Macro Class
 An individual Autodesk Revit Macro which can be executed.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.Macro
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Macro : IDisposable
Public Class Macro
	Implements IDisposable
public ref class Macro : IDisposable
type Macro =
    class
        interface IDisposable
    end
The Macro type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MacroModule |  The Macro module.
Name |  The macro name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the Macro
Execute |  Executes the macro.
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace