Revit 2027 API
StructuralSectionCProfile Class
 Defines parameters for C Profile structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionCProfile : StructuralSectionGeneralC
Public Class StructuralSectionCProfile
	Inherits StructuralSectionGeneralC
public ref class StructuralSectionCProfile : public StructuralSectionGeneralC
type StructuralSectionCProfile =
    class
        inherit StructuralSectionGeneralC
    end
The StructuralSectionCProfile type exposes the following members.
Constructors
Name | Description
StructuralSectionCProfile |  Creates a new instance of Structural Section C Profile shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace