Revit 2027 API
SweptBlend Class
A swept blend solid or void form.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.SweptBlend
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SweptBlend : GenericForm
Public Class SweptBlend
	Inherits GenericForm
public ref class SweptBlend : public GenericForm
type SweptBlend =
    class
        inherit GenericForm
    end
The SweptBlend type exposes the following members.
Properties
Name | Description
BottomProfile | The curves which make up the bottom profile of the sketch.
BottomProfileSymbol | The bottom family symbol profile of the swept blend.
BottomSketch | The bottom profile sketch of the swept blend.
PathSketch | The sketched path for the swept blend.
SelectedPath | The selected curve used for the swept blend path.
TopProfile | The curves which make up the top profile of the sketch.
TopProfileSymbol | The top family symbol profile of the swept blend.
TopSketch | The top profile sketch of the swept blend.
Top
Methods
Name | Description
GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles.
SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles.
Top
See Also
Reference
Autodesk.Revit.DB Namespace