Revit 2027 API
ExportPatternKey Class
 A key used to represent an item stored in an ExportPatternTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportPatternKey
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportPatternKey : IDisposable
Public Class ExportPatternKey
	Implements IDisposable
public ref class ExportPatternKey : IDisposable
type ExportPatternKey =
    class
        interface IDisposable
    end
The ExportPatternKey type exposes the following members.
Constructors
Name | Description
ExportPatternKey() |  Constructs a new default ExportPatternKey.
ExportPatternKey(ExportPatternKey) |  Constructs a new copy of the input ExportPatternKey object.
ExportPatternKey(FillPatternTarget, String) |  Constructs a new ExportPatternKey using the original fill pattern type and name as input.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OriginalFillPatternName |  The original FillPattern name.
OriginalFillPatternType |  The original FillPattern type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportPatternKey
Top
See Also
Reference
Autodesk.Revit.DB Namespace