Revit 2027 API
ViewPrintingEventArgs Class
 The event arguments used by the ViewPrinting event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ViewPrintingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewPrintingEventArgs : RevitAPIPreDocEventArgs
Public Class ViewPrintingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ViewPrintingEventArgs : public RevitAPIPreDocEventArgs
type ViewPrintingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ViewPrintingEventArgs type exposes the following members.
Properties
Name | Description
Index |  The index of the view being printed out of the set of all views being printed.
TotalViews |  The number of all views being printed.
View |  The view to be printed.
Top
Methods
Name | Description
GetSettings |  Get the print settings of the active printing session.
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace