Revit 2027 API
ClassificationEntries Methods
The ClassificationEntries type exposes the following members.
Methods
Name | Description
LoadClassificationEntriesFromFile |  Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent.
Top
See Also
Reference
ClassificationEntries Class
Autodesk.Revit.DB Namespace