Revit 2027 API
ExportIFCCategoryKey Class
 Represents a Revit category item stored in a template.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportIFCCategoryKey
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportIFCCategoryKey : IDisposable
Public Class ExportIFCCategoryKey
	Implements IDisposable
public ref class ExportIFCCategoryKey : IDisposable
type ExportIFCCategoryKey =
    class
        interface IDisposable
    end
The ExportIFCCategoryKey type exposes the following members.
Constructors
Name | Description
ExportIFCCategoryKey() |  Constructs a new ExportIFCCategoryKey with default values.
ExportIFCCategoryKey(String, String, CustomSubCategoryId) |  Constructs a new ExportIFCCategoryKey with category, subcategory names and special id.
Top
Properties
Name | Description
CategoryName |  The Revit category name.
CustomSubCategoryId |  The Revit custom subcategory id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SubCategoryName |  The Revit subcategrory name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportIFCCategoryKey
Top
See Also
Reference
Autodesk.Revit.DB Namespace