Revit 2027 API
WallSweep Class
 Represents a wall sweep or reveal.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.WallSweep
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WallSweep : HostObject
Public Class WallSweep
	Inherits HostObject
public ref class WallSweep : public HostObject
type WallSweep =
    class
        inherit HostObject
    end
The WallSweep type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new wall sweep or reveal.
GetHostIds |  Gets a list of all host walls on which the sweep resides.
GetWallSweepInfo |  Gets the information of the wall sweep or reveal.
WallAllowsWallSweep |  Validates that the wall is of a type that may be a host for a wall sweep or reveal.
Top
Remarks
 This element may represent either a standalone sweep or reveal element created by the Revit user interface or API, or a "fixed" wall sweep or reveal that was created by the contents of a wall's compound structure.
See Also
Reference
Autodesk.Revit.DB Namespace