Revit 2027 API
GroupType Methods
The GroupType type exposes the following members.
Methods
Name | Description
GetAvailableAttachedDetailGroupTypeIds |  Returns the attached detail groups available for this element group type.
LoadFrom |  Replaces the group with the contents of the input file.
Top
See Also
Reference
GroupType Class
Autodesk.Revit.DB Namespace