Revit 2027 API
ModificationOutsideTransactionException Class
The exception that is thrown by the undo transaction framework when the modification operation to the model is outside of a transaction.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ModificationOutsideTransactionException : InvalidOperationException
<SerializableAttribute>
Public Class ModificationOutsideTransactionException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class ModificationOutsideTransactionException : public InvalidOperationException
[<SerializableAttribute>]
type ModificationOutsideTransactionException =
    class
        inherit InvalidOperationException
    end
The ModificationOutsideTransactionException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace