Revit 2027 API
AssetPropertyList Class
 Represents a list of AssetProperty(s).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyList
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyList : AssetProperty
Public Class AssetPropertyList
	Inherits AssetProperty
public ref class AssetPropertyList : public AssetProperty
type AssetPropertyList =
    class
        inherit AssetProperty
    end
The AssetPropertyList type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddNewAssetAsColor |  Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color.
AddNewAssetPropertyDouble |  Adds a new AssetPropertyDouble containing the input value to this list.
AddNewAssetPropertyInteger |  Adds a new AssetPropertyInteger containing the input value to this list.
GetValue |  Gets a collection of properties stored in this property list. These properties are copied.
InsertNewAssetAsColor |  Insert a new AssetPropertyDouble4 containing the input value to this list.
InsertNewAssetPropertyDouble |  Inserts a new AssetPropertyDouble containing the input value to this list.
InsertNewAssetPropertyInteger |  Insert a new AssetPropertyInteger containing the input value to this list.
IsValidValue |  Check that value is valid.
RemoveAssetProperty |  Remove the AssetProperty from the list.
SetValue |  Sets collection of properties stored in this property list.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace