Revit 2027 API
StructuralMaterialTypeFilter Class
 A filter used to match family instances that have the given structural material type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralMaterialTypeFilter : ElementSlowFilter
Public Class StructuralMaterialTypeFilter
	Inherits ElementSlowFilter
public ref class StructuralMaterialTypeFilter : public ElementSlowFilter
type StructuralMaterialTypeFilter =
    class
        inherit ElementSlowFilter
    end
The StructuralMaterialTypeFilter type exposes the following members.
Constructors
Name | Description
StructuralMaterialTypeFilter(StructuralMaterialType) |  Constructs a new instance of a filter to match family instances that have the given structural material type.
StructuralMaterialTypeFilter(StructuralMaterialType, Boolean) |  Constructs a new instance of a filter to match family instances by structural material type, with the option to match all families which are not of the given structural material type.
Top
Properties
Name | Description
StructuralMaterialType |  The structural material type.
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace