Revit 2027 API
LinePatternElement Class
 An element that represents a line pattern.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.LinePatternElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinePatternElement : Element
Public Class LinePatternElement
	Inherits Element
public ref class LinePatternElement : public Element
type LinePatternElement =
    class
        inherit Element
    end
The LinePatternElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new LinePatternElement.
GetLinePattern() |  Gets the LinePattern associated to this element.
GetLinePattern(Document, ElementId) |  Gets the LinePattern associated to an element or from a built-in line pattern.
GetLinePatternElementByName |  Retrieves the LinePatternElement by its name.
GetSolidPatternId |  Gets the solid line pattern element id.
SetLinePattern |  Sets the LinePattern associated to this element.
Top
Remarks
 The LinePatternElement represents a line pattern in a project. It enables the user to retrieve, modify or create a line pattern in a project.
See Also
Reference
Autodesk.Revit.DB Namespace