Revit 2027 API
MEPSection Methods
The MEPSection type exposes the following members.
Methods
Name | Description
Dispose
GetCoefficient |  Gets the loss coefficient for the specified element id in this section.
GetElementIds |  Gets all element ids that are contained in the section.
GetPressureDrop |  Gets the pressure drop for the specified element id in this section.
GetSegmentLength |  Get the length for the specified segment id in this section.
IsMain |  Check whether the type of fitting in this section is main.
Top
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace