Revit 2027 API
MEPConnectorInfo Class
 MEP connector information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPConnectorInfo
 Autodesk.Revit.DB.MEPFamilyConnectorInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPConnectorInfo : IDisposable
Public Class MEPConnectorInfo
	Implements IDisposable
public ref class MEPConnectorInfo : IDisposable
type MEPConnectorInfo =
    class
        interface IDisposable
    end
The MEPConnectorInfo type exposes the following members.
Properties
Name | Description
IsPrimary |  True if this is the primary connector.
IsSecondary |  True if this is the secondary connector.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LinkedConnector |  The linked connector or null if there is no linked connector
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPConnectorInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace