Revit 2027 API
FileExportedEventArgs Class
 The event arguments used by the FileExported event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.FileExportedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FileExportedEventArgs : RevitAPIPostDocEventArgs
Public Class FileExportedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class FileExportedEventArgs : public RevitAPIPostDocEventArgs
type FileExportedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The FileExportedEventArgs type exposes the following members.
Properties
Name | Description
BackgroundOperation |  Identifies whether the event belongs to a background export operation.
Format |  Identifies the export format, e.g. DWG or image.
Path |  Target path for the exported file (or files).
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace