Revit 2027 API
EditScope Methods
The EditScope type exposes the following members.
Methods
Name | Description
Cancel |  Cancels the edit scope.
Commit |  Finishes the edit scope.
Dispose
Top
See Also
Reference
EditScope Class
Autodesk.Revit.DB Namespace