Revit 2027 API
ExternalDataManagerDataItem Methods
The ExternalDataManagerDataItem type exposes the following members.
Methods
Name | Description
Dispose
GetId |  Gets the id of the data item.
SetId |  Sets the id of the data item.
Top
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace