Revit 2027 API
CurtainSystemType Class
An object that represents CurtainSystem type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.CurtainSystemType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurtainSystemType : HostObjAttributes
Public Class CurtainSystemType
	Inherits HostObjAttributes
public ref class CurtainSystemType : public HostObjAttributes
type CurtainSystemType =
    class
        inherit HostObjAttributes
    end
The CurtainSystemType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace