Revit 2027 API
FabricArea Methods
The FabricArea type exposes the following members.
Methods
Name | Description
CopyCurveLoopsInSketch |  Creates copies of the CurveLoops in the FabricArea sketch.
Create(Document, Element, XYZ, ElementId, ElementId) |  Creates a FabricArea based on a host boundary.
Create(Document, Element, IList<CurveLoop>, XYZ, XYZ, ElementId, ElementId) |  Creates a FabricArea from an array of curves.
GetBoundaryCurveIds |  Retrieves the identifiers of the set of curves forming the boundary of the Fabric Area.
GetFabricSheetElementIds |  Retrieves the identifiers of all the FabricSheet Elements in the FabricArea.
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetTotalSheetMass |  Calculates the total sheet mass: Volume of Wire * Unit Weight.
GetValidViewsForTags |  Gets ids of the views where tags and symbols can be placed for the FabricArea and/or FabricSheets
IsCoverOffsetValid |  Identifies if the specified value is valid for use as a cover offset.
IsValidMajorLapSplice |  Identifies if the specified value is valid for use as a major lap splice.
IsValidMinorLapSplice |  Identifies if the specified value is valid for use as a minor lap splice.
RemoveFabricReinforcementSystem |  Deletes the specified FabricArea, and converts its FabricSheet elements to equivalent Single Fabric Sheet elements.
Top
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace