Revit 2027 API
DocumentChangedEventArgs Class
 The event arguments used by the DocumentChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.DocumentChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentChangedEventArgs : RevitAPISingleEventArgs
Public Class DocumentChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class DocumentChangedEventArgs : public RevitAPISingleEventArgs
type DocumentChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The DocumentChangedEventArgs type exposes the following members.
Properties
Name | Description
Operation |  The operation associated with this event
Top
Methods
Name | Description
GetAddedElementIds() |  Returns set of elements newly added to the document.
GetAddedElementIds(ElementFilter) |  Returns set of newly added elements that pass the filter.
GetDeletedElementIds |  Returns set of elements that were deleted from the document.
GetDocument |  Returns document associated with this event
GetModifiedElementIds() |  Returns set of elements that were modified.
GetModifiedElementIds(ElementFilter) |  Returns set of elements that were modified according to the given element filter.
GetTransactionNames |  Returns names of the transactions associated with this event
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace