Revit 2027 API
FaceSplitter Methods
The FaceSplitter type exposes the following members.
Methods
Name | Description
GetBoundaries |  Gets the boundaries.
Top
See Also
Reference
FaceSplitter Class
Autodesk.Revit.DB Namespace