Revit 2027 API
SATExportOptions Methods
The SATExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SATExportOptions Class
Autodesk.Revit.DB Namespace