Revit 2027 API
SpatialElementCalculationPoint Properties
The SpatialElementCalculationPoint type exposes the following members.
Properties
Name | Description
Position |  The position of the "in" spatial element calculation point.
Top
See Also
Reference
SpatialElementCalculationPoint Class
Autodesk.Revit.DB Namespace