Revit 2027 API
StructuralSectionRectangularBar Class
 Defines parameters for Rectangular Bar structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionRectangularBar : StructuralSectionGeneralF
Public Class StructuralSectionRectangularBar
	Inherits StructuralSectionGeneralF
public ref class StructuralSectionRectangularBar : public StructuralSectionGeneralF
type StructuralSectionRectangularBar =
    class
        inherit StructuralSectionGeneralF
    end
The StructuralSectionRectangularBar type exposes the following members.
Constructors
Name | Description
StructuralSectionRectangularBar |  Creates a new instance of Structural Section Rectangular Bar shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace