Revit 2027 API
ExportLinetypeTableIterator Class
 An iterator to a set of line type table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLinetypeTableIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLinetypeTableIterator : IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
Public Class ExportLinetypeTableIterator
	Implements IEnumerator(Of KeyValuePair(Of ExportLinetypeKey, ExportLinetypeInfo))
public ref class ExportLinetypeTableIterator : IEnumerator<KeyValuePair<ExportLinetypeKey^, ExportLinetypeInfo^>>
type ExportLinetypeTableIterator =
    class
        interface IEnumerator<KeyValuePair<ExportLinetypeKey, ExportLinetypeInfo>>
    end
The ExportLinetypeTableIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLinetypeTableIterator
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace