Revit 2027 API
MEPModel Methods
The MEPModel type exposes the following members.
Methods
Name | Description
GetAssignedElectricalSystems |  Retrieves the electrical systems this electrical panel currently is assigned to.
GetElectricalSystems |  Retrieves the electrical systems that are currently created using this MEPModel.
Top
See Also
Reference
MEPModel Class
Autodesk.Revit.DB Namespace