Revit 2027 API
RoofComponents Methods
The RoofComponents type exposes the following members.
Methods
Name | Description
Dispose
GetAreasOfCurveLoops |  The areas of CurveLoops of roof slabs.
GetCurveLoops |  The CurveLoops of roof slabs.
GetLoopFaces |  The faces of the loops of roof slabs.
GetPlaneDirections |  The plane directions of roof slabs.
GetPlaneOrigins |  The plane origins of roof slabs.
Top
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace