Revit 2027 API
ElementMulticategoryFilter Methods
The ElementMulticategoryFilter type exposes the following members.
Methods
Name | Description
GetCategoryIds |  Gets the category ids assigned to this filter.
Top
See Also
Reference
ElementMulticategoryFilter Class
Autodesk.Revit.DB Namespace