Revit 2027 API
FilterElement Class
 The base class for filter elements in the document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FilterElement
 Autodesk.Revit.DB.ParameterFilterElement
 Autodesk.Revit.DB.SelectionFilterElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterElement : Element
Public Class FilterElement
	Inherits Element
public ref class FilterElement : public Element
type FilterElement =
    class
        inherit Element
    end
The FilterElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
IsNameUnique(String) |  Determines whether a potential filter element name is unique.
IsNameUnique(Document, String) |  Determines whether the given name could be applied to a new FilterElement, or if it could not be applied because the name is already in use.
Top
See Also
Reference
Autodesk.Revit.DB Namespace