Revit 2027 API
AnalysisResultSchema Class
 Contains all information about one analysis result. Each result may contain several measurements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisResultSchema
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisResultSchema : IDisposable
Public Class AnalysisResultSchema
	Implements IDisposable
public ref class AnalysisResultSchema : IDisposable
type AnalysisResultSchema =
    class
        interface IDisposable
    end
The AnalysisResultSchema type exposes the following members.
Constructors
Name | Description
AnalysisResultSchema(AnalysisResultSchema) |  Constructs a new copy of the input AnalysisResultSchema object.
AnalysisResultSchema(String, String) |  Creates object and assigns name and description
Top
Properties
Name | Description
AnalysisDisplayStyleId |  ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden
CurrentUnits |  Stores the index in the array of applicable units
Description |  Description of analysis result in view
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
IsVisible |  If true analysis result is visible in view
Name |  Name of analysis result in view
Scale |  Multiplier used for displaying diagram or vector values in view.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisResultSchema
GetNumberOfUnits |  returns number of possible units
GetUnitsMultiplier |  returns units multiplier by index
GetUnitsName |  returns units name by index
IsEqual |  Determines if the input object is equivalent to this AnalysisResultSchema.
SetUnits |  Sets names and multipliers of all units for result visualization
Top
Remarks
 In order to take effect, the AnalysisResultSchema object has to be registered by calling SpatialFieldManager::RegisterResult, which returns result index for future references; to make changes to the properties of an already registered object, use method SpatialFieldManager::SetResultSchema and supply result index and replacing object.
Example
// By default, each analysis result uses the Analysis Display Style assigned to the view.
// To display different types of results (colored surface, markers, diagram, vector) simultaneously in a single view
// the Analysis Display Style for each result must be set to a style that matches result's type
foreach (int result in spatialFieldManager.GetRegisteredResults()) // get all results for this SpatialFieldManager
{
   AnalysisResultSchema schema = spatialFieldManager.GetResultSchema(result);
   switch (schema.Name)  // check the name of the schema
   {
      case "Reactions": // based on the schema name, set the schema's Analysis Display Style
         schema.AnalysisDisplayStyleId = AnalysisDisplayStyle.FindByName(doc, "Vector");
         break;
      case "Shear":
         schema.AnalysisDisplayStyleId = AnalysisDisplayStyle.FindByName(doc, "Diagram");
         break;
      case "Plate Shear":
         schema.AnalysisDisplayStyleId = AnalysisDisplayStyle.FindByName(doc, "Surface");
         break;
   }
   spatialFieldManager.SetResultSchema(result, schema); // update the schema
}
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace