Revit 2027 API
TriOrQuadFacet Methods
The TriOrQuadFacet type exposes the following members.
Methods
Name | Description
Dispose
GetVertexIndex |  Returns the index of the specified vertex of this facet (as an index into the external array of vertices in the TriangulationInterface that was used to create the list of TriOrQuadFacets).
Top
See Also
Reference
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace