Revit 2027 API
HVACLoadType Class
 The base class for building type and space type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.HVACLoadType
 Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
 Autodesk.Revit.DB.Analysis.HVACLoadSpaceType
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HVACLoadType : Element
Public Class HVACLoadType
	Inherits Element
public ref class HVACLoadType : public Element
type HVACLoadType =
    class
        inherit Element
    end
The HVACLoadType type exposes the following members.
Properties
Name | Description
AirChangesPerHour |  The air changes per hour.
AreaPerPerson |  The area per person.
CoolingSetPoint |  The cooling temperature set point in unit Kelvin (K).
DehumidificationSetPoint |  The dehumidification set point as a number between 0 and 1.
HeatingSetPoint |  The heating temperature set point in unit Kelvin (K).
HumidificationSetPoint |  The humidification set point as a number between 0 and 1.
LatentHeatGainPerPerson |  The latent heat gain per person.
LightingLoadDensity |  The lighting load density.
OutdoorAirFlowStandard |  The outdoor airflow standard.
OutdoorAirPerArea |  The outdoor air per area.
OutdoorAirPerPerson |  The outdoor air per person.
PlenumLighting |  The percentage of plenum lighting contribution.
PowerLoadDensity |  The power load density.
SensibleHeatGainPerPerson |  The sensible heat gain per person.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace