Revit 2027 API
RebarShapeConstraintProjectedSegmentLength Methods
The RebarShapeConstraintProjectedSegmentLength type exposes the following members.
Methods
Name | Description
GetSegmentEndReferenceType |  Choice of two possibilities for the start and end references of the length constraint.
Top
See Also
Reference
RebarShapeConstraintProjectedSegmentLength Class
Autodesk.Revit.DB.Structure Namespace