Revit 2027 API
FilterOperatorAndTextString Class
 An instance of this class holds a filter operator and a text string that denotes the operator in a particular context. For example, the text string for ScheduleFilterType::LessThan may be "is less than" for a filter rule based on a parameter with numerical values or "is below" for a filter rule based on a parameter representing a Level.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterOperatorAndTextString
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterOperatorAndTextString : IDisposable
Public Class FilterOperatorAndTextString
	Implements IDisposable
public ref class FilterOperatorAndTextString : IDisposable
type FilterOperatorAndTextString =
    class
        interface IDisposable
    end
The FilterOperatorAndTextString type exposes the following members.
Properties
Name | Description
FilterOperatorStr |  A text string denoting the filter operator.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OperatorType |  The filter operator.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilterOperatorAndTextString
Top
See Also
Reference
Autodesk.Revit.DB Namespace