Revit 2027 API
DoubleClickOptions Class
 Provides access to settings that control what happens when the current user double-clicks on an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.DoubleClickOptions
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DoubleClickOptions : IDisposable
Public Class DoubleClickOptions
	Implements IDisposable
public ref class DoubleClickOptions : IDisposable
type DoubleClickOptions =
    class
        interface IDisposable
    end
The DoubleClickOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DoubleClickOptions
GetAction |  Returns the active user's desired action for a particular double-click target.
GetDoubleClickOptions |  Returns the current user's DoubleClickOptions.
IsSupportedAction |  Checks whether the specified double-click target supports the specified action.
SetAction |  Changes the double-click action associated with a specified target.
Top
Remarks
 These settings are stored on a per-user basis. Revit will follow these settings for all projects and families for this user.
See Also
Reference
Autodesk.Revit.UI Namespace