Revit 2027 API
LightGroup Methods
The LightGroup type exposes the following members.
Methods
Name | Description
AddLight |  Add a new light instance to the group
Dispose
GetLights |  Get the set of contained light instances The set of light instances
RemoveLight |  Remove the given light instance from the set of light instances in this group
Top
See Also
Reference
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace