Revit 2027 API
SteelElementProperties Class
 This class is used to attach steel fabrication information to various Revit elements. extensions at both element ends
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Steel.SteelElementProperties
Namespace: Autodesk.Revit.DB.Steel
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SteelElementProperties : APIObject
Public Class SteelElementProperties
	Inherits APIObject
public ref class SteelElementProperties : public APIObject
type SteelElementProperties =
    class
        inherit APIObject
    end
The SteelElementProperties type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
UniqueID |  This method will return the fabrication id. This represents the link between the Revit and the Steel Core element.
Top
Methods
Name | Description
AddFabricationInformationForRevitElements |  This method adds fabrication information to the given elements.
GetFabricationUniqueID |  This method will return the fabrication id for the given reference.
GetReference |  This method will return the reference for the given fabrication id.
GetSteelElementProperties |  Get SteelElementProperties for the input element if they exist.
Top
Remarks
 Revit elements which can have fabrication information are:
FamilyInstance (structural beams and columns).
StructuralConnectionHandler elements associated to the connection.
Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWelds
OST_StructConnectionHoles
OST_StructConnectionModifiers
OST_StructConnectionShearStuds
OST_StructConnectionBolts
OST_StructConnectionAnchors
OST_StructConnectionPlates
Some concrete elements (walls, floors, concrete beams, ...) when they are input elements to detailed steel connections.
 The class also holds the link to the Steel Core elements.
See Also
Reference
Autodesk.Revit.DB.Steel Namespace