Revit 2027 API
LinkNode Class
 An output node that represents a linked Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.LinkNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkNode : GroupNode
Public Class LinkNode
	Inherits GroupNode
public ref class LinkNode : public GroupNode
type LinkNode =
    class
        inherit GroupNode
    end
The LinkNode type exposes the following members.
Properties
Name | Description
SymbolId |  Identifies the Id of the symbol associated with the node.
Top
Methods
Name | Description
GetDocument |  Returns the document associated with the link.
Top
Remarks
 See also: OnLinkBegin(LinkNode).
See Also
Reference
Autodesk.Revit.DB Namespace