Revit 2027 API
PlanCircuitSet Methods
The PlanCircuitSet type exposes the following members.
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains | Tests for the existence of an item within the set.
Erase | Removes a specified object from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified item into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
PlanCircuitSet Class
Autodesk.Revit.DB Namespace