Revit 2027 API
PipeFittingAndAccessoryPressureDropItem Methods
The PipeFittingAndAccessoryPressureDropItem type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
PipeFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Plumbing Namespace