Revit 2027 API
DuctFittingAndAccessoryPressureDropUIData Methods
The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.
Methods
Name | Description
Dispose
GetUIDataItems |  Gets all UI data items stored in the UI data.
GetUnits |  Gets units.
Top
See Also
Reference
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace