Revit 2027 API
ExtendedPropertiesLink Methods
The ExtendedPropertiesLink type exposes the following members.
Methods
Name | Description
Create |  Creates the ExtendedPropertiesLink in the given document.
CreateFromCloudDataset |  Creates the ExtendedPropertiesLink in the given document from a cloud dataset.
GetAllAssociatedPropertyIds |  Retrieves all ids, each corresponding to a [!:Autodesk::Revit::DB::ExternalData::ExtendedParameterElement] associated with this link.
LoadFrom |  Reloads the ExtendedPropertiesLink with the latest information from the server using the specified ExternalResourceReference.
Reload |  Reloads the linked extended properties with the latest information.
Top
See Also
Reference
ExtendedPropertiesLink Class
Autodesk.Revit.DB.ExternalData Namespace