Revit 2027 API
StructuralSectionGeneralI Methods
The StructuralSectionGeneralI type exposes the following members.
Methods
Name | Description
GetFlangeThicknessInFlangeCenter |  Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
GetFlangeThicknessInQuarterWidth |  Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm.
Top
See Also
Reference
StructuralSectionGeneralI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace