Revit 2027 API
FabricationPartBrowserChangedEventArgs Properties
The FabricationPartBrowserChangedEventArgs type exposes the following members.
Properties
Name | Description
NumberOfSolutions |  The number of active solutions in routing solution mode.
Operation |  The operation associated with this event
ServiceId |  The identifier for the fabrication service.
Top
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace