Revit 2027 API
ElectricalAnalyticalNode Properties
The ElectricalAnalyticalNode type exposes the following members.
Properties
Name | Description
NodeType |  The type of electrical analytical node.
TotalLoad |  The Total Connected Load.
Top
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace