Revit 2027 API
ElevationMarker Properties
The ElevationMarker type exposes the following members.
Properties
Name | Description
CurrentViewCount |  The current number of views hosted by this ElevationMarker.
IsReference |  Indicates if this is a reference ElevationMarker. Only reference elevations can be hosted by reference ElevationMarkers.
MaximumViewCount |  The maximum number of views that can be hosted by this ElevationMarker.
Top
See Also
Reference
ElevationMarker Class
Autodesk.Revit.DB Namespace