Revit 2027 API
AnalyticalModelSelector Methods
The AnalyticalModelSelector type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
AnalyticalModelSelector Class
Autodesk.Revit.DB.Structure Namespace