Revit 2027 API
FamilyPointPlacementReference Properties
The FamilyPointPlacementReference type exposes the following members.
Properties
Name | Description
Location |  The location of the point.
Name |  The name of the corresponding reference point in the Family document.
PointReference |  The reference on which the point depends on.
Top
See Also
Reference
FamilyPointPlacementReference Class
Autodesk.Revit.DB Namespace