Revit 2027 API
ApplicationEntryPoint Methods
The ApplicationEntryPoint type exposes the following members.
Methods
Name | Description
FinishInitializationEO |  For Revit Macros internal use only.
Initialize |  For Revit Macros internal use only.
OnShutdownEO |  For Revit Macros internal use only.
Top
See Also
Reference
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace