Revit 2027 API
CurveIntersectResult Methods
The CurveIntersectResult type exposes the following members.
Methods
Name | Description
Dispose
GetOverlaps |  Gets information about the points shared between the two curves.
Top
See Also
Reference
CurveIntersectResult Class
Autodesk.Revit.DB Namespace