Revit 2027 API
AnalysisDisplayStyle Class
 Exposes API for manipulation of analysis display style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayStyle : Element
Public Class AnalysisDisplayStyle
	Inherits Element
public ref class AnalysisDisplayStyle : public Element
type AnalysisDisplayStyle =
    class
        inherit Element
    end
The AnalysisDisplayStyle type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayColoredSurfaceSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Colored Surface for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayDeformedShapeSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Deformed Shape for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayDiagramSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Diagram for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayMarkersAndTextSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Markers and Text for the given document.
CreateAnalysisDisplayStyle(Document, String, AnalysisDisplayVectorSettings, AnalysisDisplayColorSettings, AnalysisDisplayLegendSettings) |  Factory method - creates analysis display style object of type Vectors for the given document.
FindByName |  Finds analysis display style by name.
GetColoredSurfaceSettings |  Get colored surface settings object from the style.
GetColorSettings |  Get color settings object from the style.
GetDeformedShapeSettings |  Get deformed shape settings object from the style.
GetDiagramSettings |  Get diagram settings object from the style.
GetElements |  Returns set of all analysis display styles elements in the given document.
GetLegendSettings |  Get legend settings object from the style.
GetMarkersAndTextSettings |  Get markers and text settings object from the style.
GetVectorSettings |  Get vector settings object from the style.
HasColoredSurfaceSettings |  If true style has colored surface settings.
HasDeformedShapeSettings |  If true style has deformed shape settings.
HasDiagramSettings |  If true style has diagram settings.
HasMarkersAndTextSettings |  If true style has markers and text settings.
HasVectorSettings |  If true style has vector settings.
IsNameUnique |  Verify the uniqueness of the name among all analysis display style elements of the document.
IsTextTypeIdValid |  Verify if text type id is valid.
SetColoredSurfaceSettings |  Set colored surface settings object for the style.
SetColorSettings |  Set color settings object for the style.
SetDeformedShapeSettings |  Set deformed shape settings object for the style.
SetDiagramSettings |  Set diagram settings object for the style.
SetLegendSettings |  Set legend settings object for the style.
SetMarkersAndTextSettings |  Set markers and text settings object for the style.
SetName |  Set name of analysis display style element.
SetVectorSettings |  Set vector settings object for the style.
Top
Example
Document doc = commandData.Application.ActiveUIDocument.Document;
AnalysisDisplayStyle analysisDisplayStyle = null;
// Look for an existing analysis display style with a specific name
FilteredElementCollector collector1 = new FilteredElementCollector(doc);
ICollection<Element> collection = collector1.OfClass(typeof(AnalysisDisplayStyle)).ToElements();
var displayStyle = from element in collection
                   where element.Name == "Display Style 1"
                   select element;
// If display style does not already exist in the document, create it
if (displayStyle.Count() == 0)
{
    AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings =
        new AnalysisDisplayColoredSurfaceSettings();
    coloredSurfaceSettings.ShowGridLines = true;
    AnalysisDisplayColorSettings colorSettings = new AnalysisDisplayColorSettings();
    Color orange = new Color(255, 205, 0);
    Color purple = new Color(200, 0, 200);
    colorSettings.MaxColor = orange;
    colorSettings.MinColor = purple;
    AnalysisDisplayLegendSettings legendSettings = new AnalysisDisplayLegendSettings();
    legendSettings.NumberOfSteps = 10;
    legendSettings.Rounding = 0.05;
    legendSettings.ShowDataDescription = false;
    legendSettings.ShowLegend = true;
    analysisDisplayStyle = AnalysisDisplayStyle.CreateAnalysisDisplayStyle(doc,
        "Display Style 1", coloredSurfaceSettings, colorSettings, legendSettings);
}
else
{
    analysisDisplayStyle = displayStyle.Cast<AnalysisDisplayStyle>().ElementAt<AnalysisDisplayStyle>(0);
}
// now assign the display style to the view
doc.ActiveView.AnalysisDisplayStyleId = analysisDisplayStyle.Id;
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace