Revit 2027 API
SubTransaction Methods
The SubTransaction type exposes the following members.
Methods
Name | Description
Commit |  Commits all changes made to the model made during the sub-transaction.
Dispose
GetStatus |  Returns the current status of the sub-transaction.
HasEnded |  Determines whether the sub-transaction has ended already.
HasStarted |  Determines whether the sub-transaction has been started yet.
RollBack |  Discards all changes made to the model during the sub-transaction.
Start |  Starts the sub-transaction.
Top
See Also
Reference
SubTransaction Class
Autodesk.Revit.DB Namespace