Revit 2027 API
IdlingEventArgs Class
 The event arguments used by the Idling event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.IdlingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IdlingEventArgs : RevitAPIPreEventArgs
Public Class IdlingEventArgs
	Inherits RevitAPIPreEventArgs
public ref class IdlingEventArgs : public RevitAPIPreEventArgs
type IdlingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The IdlingEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
SetRaiseWithoutDelay |  Sets the next invocation of the idling event to be called promptly, rather than relying on the default recurrence of idling from the Revit application. For more details see the remarks describing the Idling event.
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace