Revit 2027 API
SSEPointVisibilitySettings Methods
The SSEPointVisibilitySettings type exposes the following members.
Methods
Name | Description
GetVisibility |  Gets the SSE point visibility for the given category.
SetVisibility |  Sets the SSE point visibility for the given category.
Top
See Also
Reference
SSEPointVisibilitySettings Class
Autodesk.Revit.DB Namespace