Revit 2027 API
FamilyInstance Methods
The FamilyInstance type exposes the following members.
Methods
Name | Description
AddCoping | Adds a coping (cut) to a steel beam.
flipFacing | The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
FlipFromToRoom |  Flips the settings of "From Room" and "To Room" for the door or window instance.
flipHand | The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
GetCopingIds | Lists the elements currently used as coping cutters for this element.
GetFamilyPointPlacementReferences | Returns the Point Placement References for the Family Instance.
GetOriginalGeometry |  Returns the original geometry of the instance, before the instance is modified by joins, cuts, coping, extensions, or other post-processing.
GetReferenceByName |  Gets the family instance reference corresponding to the named reference plane in the instance's family.
GetReferenceName |  Gets the name of the reference plane in the family corresponding to the given family instance reference.
GetReferences |  Gets family instance references corresponding to the reference planes or reference lines of the given reference type in the instance's family.
GetReferenceType |  Gets the type of the reference plane or reference line in the instance's family corresponding to the given family instance reference.
GetSpatialElementCalculationPoint | Gets the location of the calculation point for this instance.
GetSpatialElementFromToCalculationPoints | Gets the locations for the calculation points for this instance.
GetSubComponentIds | Gets the sub component ElementIds of the current family instance.
GetSweptProfile | Gets the object that describes the profile that is swept along the driving curve for this instance.
HasModifiedGeometry | Identifies if the geometry of this FamilyInstance has been modified from the automatically generated default.
HasSweptProfile | Indicates if this instance can be represented as a swept profile.
RemoveCoping | Removes a coping (cut) from a steel beam.
rotate | The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
SetCopingIds | Specifies the set of coping cutters on this element.
Split | Splits the family instance element at a point on its defining curve.
Top
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace