Revit 2027 API
IFCFileWriteOptions Class
 This class contains options to write an IFC file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCFileWriteOptions
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCFileWriteOptions : IDisposable
Public Class IFCFileWriteOptions
	Implements IDisposable
public ref class IFCFileWriteOptions : IDisposable
type IFCFileWriteOptions =
    class
        interface IDisposable
    end
The IFCFileWriteOptions type exposes the following members.
Constructors
Name | Description
IFCFileWriteOptions |  Creates a default IFCFileWriteOptions. The default file format is ifc.
Top
Properties
Name | Description
FileFormat |  The file format of the IFC file.
FileName |  The full file name of the IFC file to be written.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCFileWriteOptions
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace