Revit 2027 API
RevitAPIPostEventArgs Class
 The class is used as a base class for arguments of any post-event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.DocumentClosedEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitAPIPostEventArgs : RevitAPIEventArgs
Public Class RevitAPIPostEventArgs
	Inherits RevitAPIEventArgs
public ref class RevitAPIPostEventArgs : public RevitAPIEventArgs
type RevitAPIPostEventArgs =
    class
        inherit RevitAPIEventArgs
    end
The RevitAPIPostEventArgs type exposes the following members.
Properties
Name | Description
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
Top
Methods
Name | Description
Top
Remarks
 A post-event is the event raised after execution of the process that was related with the event.
See Also
Reference
Autodesk.Revit.DB.Events Namespace