Revit 2027 API
AnalyticalLinkType Class
 An object that specifies the analysis properties for an AnalyticalLink element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.AnalyticalLinkType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalLinkType : ElementType
Public Class AnalyticalLinkType
	Inherits ElementType
public ref class AnalyticalLinkType : public ElementType
type AnalyticalLinkType =
    class
        inherit ElementType
    end
The AnalyticalLinkType type exposes the following members.
Properties
Name | Description
RotationX |  Fixity of rotation around X.
RotationY |  Fixity of rotation around Y.
RotationZ |  Fixity of rotation around Z.
TranslationX |  Fixity of translation along X.
TranslationY |  Fixity of translation along Y.
TranslationZ |  Fixity of translation along Z.
Top
Methods
Name | Description
IsValidAnalyticalFixityState |  Returns whether the input fixity state is valid for Analytical Link Type parameters.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace