Revit 2027 API
PaperSizeSet Class
A set that can contain any number of paper size objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PaperSizeSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PaperSizeSet : APIObject,
	IEnumerable
Public Class PaperSizeSet
	Inherits APIObject
	Implements IEnumerable
public ref class PaperSizeSet : public APIObject,
	IEnumerable
type PaperSizeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The PaperSizeSet type exposes the following members.
Constructors
Name | Description
PaperSizeSet | Initializes a new instance of the PaperSizeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains | Tests for the existence of an item within the set.
Erase | Removes a specified object from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified item into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace