Revit 2027 API
InsulationLiningBase Class
 Acts as the base class for duct insulation, pipe insulation and duct lining elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Mechanical.DuctInsulation
 Autodesk.Revit.DB.Mechanical.DuctLining
 Autodesk.Revit.DB.Plumbing.PipeInsulation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InsulationLiningBase : MEPCurve
Public Class InsulationLiningBase
	Inherits MEPCurve
public ref class InsulationLiningBase : public MEPCurve
type InsulationLiningBase =
    class
        inherit MEPCurve
    end
The InsulationLiningBase type exposes the following members.
Properties
Name | Description
HostElementId |  The id of the host element for the insulation or lining element.
Thickness |  Thickness of the insulation or lining element.
Top
Methods
Name | Description
GetInsulationIds |  Returns the ids of the insulation elements associated to a given element.
GetLiningIds |  Returns the ids of the lining elements associated to a given element.
IsValidThickness |  Identifies if the given thickness value is valid for assignment to insulation or lining elements.
Top
See Also
Reference
Autodesk.Revit.DB Namespace