Revit 2027 API
CombinableElement Properties
The CombinableElement type exposes the following members.
Properties
Name | Description
Combinations | The geometry combinations that this element belongs to.
Top
See Also
Reference
CombinableElement Class
Autodesk.Revit.DB Namespace