Revit 2027 API
DuplicateTypeNamesHandlerArgs Class
 A structure that provides information about an attempt to copy types with names that already exist in the destination document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuplicateTypeNamesHandlerArgs : IDisposable
Public Class DuplicateTypeNamesHandlerArgs
	Implements IDisposable
public ref class DuplicateTypeNamesHandlerArgs : IDisposable
type DuplicateTypeNamesHandlerArgs =
    class
        interface IDisposable
    end
The DuplicateTypeNamesHandlerArgs type exposes the following members.
Properties
Name | Description
Document |  The document that contains the types with duplicate names.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuplicateTypeNamesHandlerArgs
GetTypeIds |  Returns ids of the types with duplicate names.
Top
See Also
Reference
Autodesk.Revit.DB Namespace