Revit 2027 API
DocumentClosingEventArgs Class
 The event arguments used by the DocumentClosing event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentClosingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentClosingEventArgs : RevitAPIPreDocEventArgs
Public Class DocumentClosingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class DocumentClosingEventArgs : public RevitAPIPreDocEventArgs
type DocumentClosingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The DocumentClosingEventArgs type exposes the following members.
Properties
Name | Description
DocumentId |  Id of the document that is about to be closed.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace