Revit 2027 API
NumberSystem Properties
The NumberSystem type exposes the following members.
Properties
Name | Description
JustifyOffset |  The offset to the justification curve.
JustifyOption |  The number justify option of number system.
NumberDisplayRule |  The display rule of the number system.
NumberedElementId |  The LinkElementId of the numbered host element.
NumberOrientation |  The number orientation of number system.
PlacementLevelId |  The id of the base level of stairs on which the NumberSystem is placed.
ReferenceOffset |  The offset to the reference curve.
Top
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace