Revit 2027 API
FabricationOptionDefinition Methods
The FabricationOptionDefinition type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FabricationOptionDefinition Class
Autodesk.Revit.DB Namespace