Revit 2027 API
BaseArray Methods
The BaseArray type exposes the following members.
Methods
Name | Description
GetCopiedMemberIds | Retrieves the copied member Ids of the Array.
GetOriginalMemberIds | Retrieves the original member Ids of the Array.
Top
See Also
Reference
BaseArray Class
Autodesk.Revit.DB Namespace