Revit 2027 API
LinePatternSegment Class
 Represents a segment in a line pattern.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinePatternSegment
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinePatternSegment : IDisposable
Public Class LinePatternSegment
	Implements IDisposable
public ref class LinePatternSegment : IDisposable
type LinePatternSegment =
    class
        interface IDisposable
    end
The LinePatternSegment type exposes the following members.
Constructors
Name | Description
LinePatternSegment() |  Creates a line pattern segment.
LinePatternSegment(LinePatternSegmentType, Double) |  Creates a line pattern segment with given type and length.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Length |  Gets and sets the length of the segment.
Type |  Gets and sets the type of the segment.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LinePatternSegment
Top
See Also
Reference
Autodesk.Revit.DB Namespace