Revit 2027 API
TessellatedShapeBuilderResult Methods
The TessellatedShapeBuilderResult type exposes the following members.
Methods
Name | Description
Dispose
GetGeometricalObjects |  When called the first time, returns geometrical objects which were built. Later calls will throw exceptions.
GetIssuesForFaceSet |  Returns the array of issues encountered while processing a face set with index 'setIndex'.
GetNumberOfFaceSets |  Gets number of face sets for which 'this' result was obtained.
Top
See Also
Reference
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace