Revit 2027 API
StructuralSectionConcreteRound Class
 Creates a new instance of Structural Section Concrete Round shape with the associated set of parameters, used to attach to structural element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRound
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcreteRound : StructuralSectionRound
Public Class StructuralSectionConcreteRound
	Inherits StructuralSectionRound
public ref class StructuralSectionConcreteRound : public StructuralSectionRound
type StructuralSectionConcreteRound =
    class
        inherit StructuralSectionRound
    end
The StructuralSectionConcreteRound type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteRound |  Creates a new instance of Structural Section Concrete Round shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace