Revit 2027 API
DocumentClosingEventArgs Properties
The DocumentClosingEventArgs type exposes the following members.
Properties
Name | Description
DocumentId |  Id of the document that is about to be closed.
Top
See Also
Reference
DocumentClosingEventArgs Class
Autodesk.Revit.DB.Events Namespace