Revit 2027 API
RebarContainerType Class
 Represents a Rebar Container Type, used in the generation of Rebar Container.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarContainerType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarContainerType : ElementType
Public Class RebarContainerType
	Inherits ElementType
public ref class RebarContainerType : public ElementType
type RebarContainerType =
    class
        inherit ElementType
    end
The RebarContainerType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CreateDefaultRebarContainerType |  Creates a new RebarContainerType object with a default name.
GetOrCreateRebarContainerType |  Creates or returns a RebarContainerType object with a given name.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace