Revit 2027 API
StructuralSectionConcreteL Properties
The StructuralSectionConcreteL type exposes the following members.
Properties
Name | Description
CutHeight |  Cut Height: the height of the cut in a rectangle-cut section shape.
CutWidth |  Cut Width: the width of the cut in a rectangle-cut section shape.
Top
See Also
Reference
StructuralSectionConcreteL Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace