Revit 2027 API
FamilyThermalProperties Methods
The FamilyThermalProperties type exposes the following members.
Methods
Name | Description
Dispose
Find |  Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml.
IsValid |  Confirms that the thermal properties are correctly set for assignment to a FamilySymbol.
Top
See Also
Reference
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace