Revit 2027 API
FormulaEditingEventArgs Methods
The FormulaEditingEventArgs type exposes the following members.
Methods
Name | Description
Apply |  Applies formula to the parameter
Top
See Also
Reference
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace