Revit 2027 API
CreateRelatedFileProgressChangedEventArgs Class
 The event arguments used during creating related file phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged] in model open operation.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CreateRelatedFileProgressChangedEventArgs : DataTransferProgressChangedEventArgs
Public Class CreateRelatedFileProgressChangedEventArgs
	Inherits DataTransferProgressChangedEventArgs
public ref class CreateRelatedFileProgressChangedEventArgs : public DataTransferProgressChangedEventArgs
type CreateRelatedFileProgressChangedEventArgs =
    class
        inherit DataTransferProgressChangedEventArgs
    end
The CreateRelatedFileProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
CreatingCloudSharedLocal |  Indicates if it is creating cloud shared local model.
DownloadFinished |  Indicates if all data downloads are finished.
FullDownload |  Indicates if download the full data of the document, which will take longer than subsequent downloads.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace