Revit 2027 API
FieldDomainPoints Methods
The FieldDomainPoints type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FieldDomainPoints Class
Autodesk.Revit.DB.Analysis Namespace