Revit 2027 API
DefinitionBindingMapIterator Methods
The DefinitionBindingMapIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the map.
Top
See Also
Reference
DefinitionBindingMapIterator Class
Autodesk.Revit.DB Namespace