Revit 2027 API
DividedSurface Methods
The DividedSurface type exposes the following members.
Methods
Name | Description
AddIntersectionElement |  Adds an intersection element to the divided surface.
CanBeDivided |  This returns true if the reference represents a face that can be used to create a divided surface.
CanBeIntersectionElement |  Checks if the element can be an intersection reference.
Create |  Creates a new instance of a divided surface with a default layout.
GetAllIntersectionElements |  Gets all intersection elements which produce division lines.
GetDividedSurfaceForReference |  Get a divided surface for a given reference. Returns null if the reference does not host a divided surface.
GetGridNodeLocation | Specify whether a particular grid node is interior to the surface, on the boundary, or outside the boundary.
GetGridNodeReference | Get a reference to the geometric point associated with a grid node.
GetGridNodeUV | Get the position of a grid node in UV coordinates in the surface.
GetGridSegmentReference | Get a reference to a line segment connecting two adjacent grid nodes.
GetReferencesWithDividedSurfaces |  For a given host element get references to all the faces that host a divided surface
GetTileFamilyInstance | Get a reference to a tile element associated with a given seed node.
GetTileReference | Get a reference to one of the tile surfaces associated with a given seed node.
IsSeedNode | Reports whether a grid node is a "seed node," a node that is associated with one or more tiles.
RemoveAllIntersectionElements |  Removes all the intersection elements from a divided surface.
RemoveIntersectionElement |  Removes an intersection element from a divided surface.
Top
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace