Revit 2027 API
AssetPropertyFloatArray Methods
The AssetPropertyFloatArray type exposes the following members.
Methods
Name | Description
GetValue | Get the value of the property.
Top
See Also
Reference
AssetPropertyFloatArray Class
Autodesk.Revit.DB.Visual Namespace