Revit 2027 API
IndexStream Methods
The IndexStream type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IndexStream Class
Autodesk.Revit.DB.DirectContext3D Namespace