Revit 2027 API
InternalOrigin Properties
The InternalOrigin type exposes the following members.
Properties
Name | Description
Position |  The position of the InternalOrigin.
SharedPosition |  The position of the InternalOrigin relative to the active ProjectLocation set for the document.
Top
See Also
Reference
InternalOrigin Class
Autodesk.Revit.DB Namespace