Revit 2027 API
RenderingImageExposureSettings Class
 Represents the exposure settings of rendering.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderingImageExposureSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RenderingImageExposureSettings : IDisposable
Public Class RenderingImageExposureSettings
	Implements IDisposable
public ref class RenderingImageExposureSettings : IDisposable
type RenderingImageExposureSettings =
    class
        interface IDisposable
    end
The RenderingImageExposureSettings type exposes the following members.
Properties
Name | Description
ExposureValue |  The value of rendering image exposure.
Highlights |  The highlights value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Saturation |  The value of rendering image saturation.
Shadows |  The shadows value.
WhitePoint |  The white point value.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RenderingImageExposureSettings
Top
See Also
Reference
Autodesk.Revit.DB Namespace