Revit 2027 API
FluidTemperatureSetIterator Class
 An iterator to a set of FluidTemperature from FluidType.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FluidTemperatureSetIterator : IEnumerator<FluidTemperature>
Public Class FluidTemperatureSetIterator
	Implements IEnumerator(Of FluidTemperature)
public ref class FluidTemperatureSetIterator : IEnumerator<FluidTemperature^>
type FluidTemperatureSetIterator =
    class
        interface IEnumerator<FluidTemperature>
    end
The FluidTemperatureSetIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FluidTemperatureSetIterator
GetCurrent |  Returns the current FluidTemperature.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace