Revit 2027 API
ExternalDefinition Methods
The ExternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
GetGroupTypeId |  Returns the identifier of the parameter definition's parameter group.
(Overrides Definition.GetGroupTypeId())
Top
See Also
Reference
ExternalDefinition Class
Autodesk.Revit.DB Namespace