Revit 2027 API
AnalysisDisplayColorEntry Methods
The AnalysisDisplayColorEntry type exposes the following members.
Methods
Name | Description
Dispose
HasValue |  Check if color entry has associated value.
IsEqual |  Compare color entries.
Top
See Also
Reference
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace