Revit 2027 API
TargetRebarEdge Class
 This class is used to identify the target edge of a 'ToOtherRebar' RebarConstraint.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.TargetRebarEdge
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TargetRebarEdge : IDisposable
Public Class TargetRebarEdge
	Implements IDisposable
public ref class TargetRebarEdge : IDisposable
type TargetRebarEdge =
    class
        interface IDisposable
    end
The TargetRebarEdge type exposes the following members.
Constructors
Name | Description
TargetRebarEdge |  Constructs a new instance of TargetRebarEdge.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TargetEdgeIndex |  Identifies the index of the target Rebar's edge. The index is a number between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
TargetRebarId |  Identifies the id of the target Rebar.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TargetRebarEdge
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace