Revit 2027 API
SlabShapeCreaseArrayIterator Properties
The SlabShapeCreaseArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
SlabShapeCreaseArrayIterator Class
Autodesk.Revit.DB Namespace