Revit 2027 API
IPipePressureDropServer Methods
The IPipePressureDropServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the pipe pressure drop.
GetHtmlDescription |  The method that Revit will invoke to get an HTML formatted description of the server.
GetInformationLink |  The method that Revit will invoke to obtain a URL address which provides more information about the server.
Top
See Also
Reference
IPipePressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace