Revit 2027 API
CylindricalSurface Class
 A cylindrical surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.CylindricalSurface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CylindricalSurface : Surface
Public Class CylindricalSurface
	Inherits Surface
public ref class CylindricalSurface : public Surface
type CylindricalSurface =
    class
        inherit Surface
    end
The CylindricalSurface type exposes the following members.
Properties
Name | Description
Axis |  Axis of the cylinder. This is the Z axis of the local coordinate system associated with this cylinder.
Origin |  Center of the circle that defines the base of the cylinder. This is the origin of the local coordinate system associated with this cylinder.
Radius |  Radius of the circle that defines the base of this cylinder.
XDir |  X axis of the local coordinate system associated with this cylinder.
YDir |  Y axis of the local coordinate system associated with this cylinder.
Top
Methods
Name | Description
Create |  Construct a cylindrical surface defined by a local coordinate system and a radius.
GetFrameOfReference |  Returns frame of reference associated with this CylindricalSurface.
Top
Remarks
 The parametric equation of the cylinder is S(u, v) = center + radius*cos(u)*xVec + radius*sin(u)*yVec + v*zVec.
See Also
Reference
Autodesk.Revit.DB Namespace