Revit 2027 API
RevisionCloud Properties
The RevisionCloud type exposes the following members.
Properties
Name | Description
RevisionId |  The Revision associated with this RevisionCloud.
Top
See Also
Reference
RevisionCloud Class
Autodesk.Revit.DB Namespace