Revit 2027 API
RevitAPIPreDocEventArgs Properties
The RevitAPIPreDocEventArgs type exposes the following members.
Properties
Name | Description
Document |  The document associated with the event.
Top
See Also
Reference
RevitAPIPreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace