Revit 2027 API
DirectoryNotEmptyException Class
The exception that is thrown when a method received a directory as an argument and requires that the directory be empty but the directory is not empty.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.DirectoryNotEmptyException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class DirectoryNotEmptyException : ArgumentException
<SerializableAttribute>
Public Class DirectoryNotEmptyException
	Inherits ArgumentException
[SerializableAttribute]
public ref class DirectoryNotEmptyException : public ArgumentException
[<SerializableAttribute>]
type DirectoryNotEmptyException =
    class
        inherit ArgumentException
    end
The DirectoryNotEmptyException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace