Revit 2027 API
DockablePaneId Class
 Identifier for a pane that participates in the Revit docking window system.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.UI.DockablePaneId
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DockablePaneId : GuidEnum
Public Class DockablePaneId
	Inherits GuidEnum
public ref class DockablePaneId : public GuidEnum
type DockablePaneId =
    class
        inherit GuidEnum
    end
The DockablePaneId type exposes the following members.
Constructors
Name | Description
DockablePaneId | Creates a new DockablePaneId instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Operators
Name | Description
Equality(DockablePaneId, DockablePaneId) | Compares two DockablePaneId instances.
Inequality(DockablePaneId, DockablePaneId) | Compares two DockablePaneId instances.
Top
See Also
Reference
Autodesk.Revit.UI Namespace