Revit 2027 API
ElectricalLoadAreaData Methods
The ElectricalLoadAreaData type exposes the following members.
Methods
Name | Description
CreateElectricalLoadAreas |  Creates electrical load areas on all the empty plan circuits of the given level.
GetAreaBasedLoadIds |  Gets the area based load ids of the electrical load area to be included.
HasCircuitsWithoutElectricalLoadAreas |  Checks whether there are any empty plan circuits in which there are no electrical load areas.
Top
See Also
Reference
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace