Revit 2027 API
FamilyStructuralMaterialTypeFilter Class
 A filter used to match families that have the given structural material type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyStructuralMaterialTypeFilter : ElementSlowFilter
Public Class FamilyStructuralMaterialTypeFilter
	Inherits ElementSlowFilter
public ref class FamilyStructuralMaterialTypeFilter : public ElementSlowFilter
type FamilyStructuralMaterialTypeFilter =
    class
        inherit ElementSlowFilter
    end
The FamilyStructuralMaterialTypeFilter type exposes the following members.
Constructors
Name | Description
FamilyStructuralMaterialTypeFilter(StructuralMaterialType) |  Constructs a new instance of a filter to match families that have the given structural material type.
FamilyStructuralMaterialTypeFilter(StructuralMaterialType, Boolean) |  Constructs a new instance of a filter to match families by structural material type, with the option to match all families which are not of the given structural material type.
Top
Properties
Name | Description
StructuralMaterialType |  The family structural material type.
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
Example
// Use FamilyStructuralMaterialType filter to find families whose material type is Wood
FamilyStructuralMaterialTypeFilter filter = new FamilyStructuralMaterialTypeFilter(StructuralMaterialType.Wood);
// Apply the filter to the elements in the active document
FilteredElementCollector collector = new FilteredElementCollector(document);
ICollection<Element> woodFamiles = collector.WherePasses(filter).ToElements();
// Find families are not Wood: Use inverted filter to match families
FamilyStructuralMaterialTypeFilter notWoodFilter =
    new FamilyStructuralMaterialTypeFilter(StructuralMaterialType.Wood, true); // inverted filter
collector = new FilteredElementCollector(document);
ICollection<Element> notWoodFamilies = collector.WherePasses(notWoodFilter).ToElements();
See Also
Reference
Autodesk.Revit.DB.Structure Namespace