Revit 2027 API
PanelScheduleSheetInstance Properties
The PanelScheduleSheetInstance type exposes the following members.
Properties
Name | Description
Origin |  The sheet instance offset in drawing sheet coordinates.
ScheduleId |  The panel schedule id.
Top
See Also
Reference
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace