Revit 2027 API
VoltageType Properties
The VoltageType type exposes the following members.
Properties
Name | Description
ActualValue |  Get actual voltage value of this voltage definition, the unit is volt.
IsInUse |  Indicates whether this voltage type is in service now, such as by other distribution system.
MaxValue |  Get upper boundary of voltage value of this voltage definition, the unit is volt.
MinValue |  Get lower boundary of voltage value of this voltage definition, the unit is volt.
Top
See Also
Reference
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace