Revit 2027 API
RebarCoupler Properties
The RebarCoupler type exposes the following members.
Properties
Name | Description
CouplerMark |  gets and sets the coupler mark
RotationAngle |  Indetifies the rotation angle of the coupler around its axis.
Top
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace