Revit 2027 API
VoltageTypeSet Methods
The VoltageTypeSet type exposes the following members.
Methods
Name | Description
Clear | Removes every voltage type from the set, rendering it empty.
Contains | Tests for the existence of a voltage type within the set.
Erase | Removes a specified voltage type from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified voltage type into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace