Revit 2027 API
DuctInsulationType Class
 This class represents a duct insulation type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Mechanical.DuctInsulationType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctInsulationType : ElementType
Public Class DuctInsulationType
	Inherits ElementType
public ref class DuctInsulationType : public ElementType
type DuctInsulationType =
    class
        inherit ElementType
    end
The DuctInsulationType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace