Revit 2027 API
BalusterInfo Class
 The class represents an instance of a railing baluster or post.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.BalusterInfo
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BalusterInfo : IDisposable
Public Class BalusterInfo
	Implements IDisposable
public ref class BalusterInfo : IDisposable
type BalusterInfo =
    class
        interface IDisposable
    end
The BalusterInfo type exposes the following members.
Properties
Name | Description
BalusterFamilyId |  The id of the family used for the baluster or post.
BaseOffset |  The offset from the base reference.
BaseReferenceName |  Represents the name of the reference for the bottom of this baluster or post.
DistanceFromPreviousOrSpace |  The length, in case of balusters, it is a distance from a previous one. For a post, it is a space from the original position of the post.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the baluster.
Offset |  The side offset of the baluster/post from the railing path.
TopOffset |  The offset from the top reference.
TopReferenceName |  Represents the name of the reference for the top of this baluster or post.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BalusterInfo
GetReferenceNameForHost |  Gets the name string to be used as a reference to Host in the current language.
GetReferenceNameForTopRail |  Gets the name string to be used as a reference to Top Rail in the current language.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace