Revit 2027 API
TaskDialogShowingEventArgs Class
 The event arguments used by the DialogBoxShowing event when a Revit task dialog that prompts the user for some action is shown.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
 Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TaskDialogShowingEventArgs : DialogBoxShowingEventArgs
Public Class TaskDialogShowingEventArgs
	Inherits DialogBoxShowingEventArgs
public ref class TaskDialogShowingEventArgs : public DialogBoxShowingEventArgs
type TaskDialogShowingEventArgs =
    class
        inherit DialogBoxShowingEventArgs
    end
The TaskDialogShowingEventArgs type exposes the following members.
Properties
Name | Description
Message |  The message that has been displayed in the dialog box.
Top
Methods
Name | Description
Top
Remarks
 When the application receives this object, a task dialog is about to be displayed in Revit that requires user interaction. The OverrideResult function can be used to cause the dialog to be dismissed and return a desired result code.
See Also
Reference
Autodesk.Revit.UI.Events Namespace