Revit 2027 API
IndexTriangle Class
 A triangle primitive consisting of three indices.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
 Autodesk.Revit.DB.DirectContext3D.IndexTriangle
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IndexTriangle : IndexPrimitive
Public Class IndexTriangle
	Inherits IndexPrimitive
public ref class IndexTriangle : public IndexPrimitive
type IndexTriangle =
    class
        inherit IndexPrimitive
    end
The IndexTriangle type exposes the following members.
Constructors
Name | Description
IndexTriangle |  Constructs the triangle primitive.
Top
Properties
Name | Description
Index0 |  The index of the triangle's first vertex.
Index1 |  The index of the triangle's second vertex.
Index2 |  The index of the triangle's third vertex.
Top
Methods
Name | Description
GetSizeInShortInts |  Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Top
Remarks
 Indices of a triangle's vertices can be listed in either the clockwise or counterclockwise winding order, according to the triangle's orientation in space. A DirectContext3D triangle faces the viewer if its vertices are in counterclockwise order from the viewer's point of view.
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace