Revit 2027 API
SynchronizeWithCentralOptions Class
 Options to control behavior of synchronization with central.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SynchronizeWithCentralOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SynchronizeWithCentralOptions : IDisposable
Public Class SynchronizeWithCentralOptions
	Implements IDisposable
public ref class SynchronizeWithCentralOptions : IDisposable
type SynchronizeWithCentralOptions =
    class
        interface IDisposable
    end
The SynchronizeWithCentralOptions type exposes the following members.
Constructors
Name | Description
SynchronizeWithCentralOptions |  Constructs a new instance of SynchronizeWithCentralOptions initialized with default options.
Top
Properties
Name | Description
Comment |  User description of changes made since the last Sync with Central. Empty by default.
Compact |  Indicates whether Revit should compact the central model while synchronizing with central. This option reduces the size of the central model but many increase the time it takes to perform the save. False by default.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RelinquishBorrowedElements |  Indicates whether Revit should relinquish borrowed elements after synchronizing with central.
RelinquishFamilyWorksets |  Indicates whether Revit should relinquish Family worksets after synchronizing with central.
RelinquishProjectStandardWorksets |  Indicates whether Revit should relinquish Project Standard worksets after synchronizing with central.
RelinquishUserCreatedWorksets |  Indicates whether Revit should relinquish user-created Standard worksets after synchronizing with central.
RelinquishViewWorksets |  Indicates whether Revit should relinquish View worksets after synchronizing with central.
SaveLocalAfter |  True means to save local after saving changes to central. True by default. Silently ignored if the model in the current session is central rather than local.
SaveLocalBefore |  True means to save local before the first reload latest if there are changes not yet saved to local. True by default. Silently ignored if the model in the current session is central rather than local.
SaveLocalFile |  Indicates whether Revit will save the local file at least once while synchronizing with central.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SynchronizeWithCentralOptions
GetRelinquishOptions |  Gets the options which govern whether or not to relinquish elements and workset types.
SetRelinquishOptions |  Sets the options which govern whether or not to relinquish elements and workset types.
Top
See Also
Reference
Autodesk.Revit.DB Namespace