Revit 2027 API
InitialColor Methods
The InitialColor type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the InitialColor derived object.
Dispose
Top
See Also
Reference
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace