Revit 2027 API
AssetPropertyInt64 Properties
The AssetPropertyInt64 type exposes the following members.
Properties
Name | Description
Value | Get the value of the property.
Top
See Also
Reference
AssetPropertyInt64 Class
Autodesk.Revit.DB.Visual Namespace