Revit 2027 API
Definitions Methods
The Definitions type exposes the following members.
Methods
Name | Description
Contains | Tests for the existence of a definition within the set.
Create | Creates a new parameter definition using specified options.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Retrieves an enumerator to the collection.
Top
See Also
Reference
Definitions Class
Autodesk.Revit.DB Namespace