Revit 2027 API
ViewSheetSetting Properties
The ViewSheetSetting type exposes the following members.
Properties
Name | Description
AvailableViews | All views that can be printed.
CurrentViewSheetSet | The current view sheet set of PrintSetup.
InSession | The in-session view sheet set of Print Setup.
Top
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace