Revit 2027 API
StructuralSectionLAngle Class
 Defines parameters for L-angle Flange structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionLAngle : StructuralSectionGeneralW
Public Class StructuralSectionLAngle
	Inherits StructuralSectionGeneralW
public ref class StructuralSectionLAngle : public StructuralSectionGeneralW
type StructuralSectionLAngle =
    class
        inherit StructuralSectionGeneralW
    end
The StructuralSectionLAngle type exposes the following members.
Constructors
Name | Description
StructuralSectionLAngle |  Creates a new instance of Structural Section L Angle shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameterLongerFlange |  Maximum bolt hole diameter in the longer flange, in. (mm)
BoltDiameterShorterFlange |  Maximum bolt hole diameter in the shorter flange, in. (mm)
BoltSpacing1LongerFlange |  Standard bolt spacing first row in the longer flange, in. (mm)
BoltSpacing2LongerFlange |  Standard bolt spacing second row in the longer flange, in. (mm)
BoltSpacingShorterFlange |  Standard bolt spacing in the shorter flange, in. (mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace