Revit 2027 API
SphericalLightDistribution Class
 This class encapsulates a spherical light distribution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.SphericalLightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SphericalLightDistribution : LightDistribution
Public Class SphericalLightDistribution
	Inherits LightDistribution
public ref class SphericalLightDistribution : public LightDistribution
type SphericalLightDistribution =
    class
        inherit LightDistribution
    end
The SphericalLightDistribution type exposes the following members.
Constructors
Name | Description
SphericalLightDistribution() |  Creates a spherical light distribution object.
SphericalLightDistribution(SphericalLightDistribution) |  Creates a copy of the given spherical light distribution
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace