Revit 2027 API
MEPCurveType Class
 The base type class for MEP curves, such as ducts, pipes, cable trays and conduits.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPCurveType : HostObjAttributes
Public Class MEPCurveType
	Inherits HostObjAttributes
public ref class MEPCurveType : public HostObjAttributes
type MEPCurveType =
    class
        inherit HostObjAttributes
    end
The MEPCurveType type exposes the following members.
Properties
Name | Description
Cross | The default cross fitting of the MEP curve type.
Elbow | The default elbow fitting of the MEP curve type.
MultiShapeTransition | The default multi shape transition fitting of the MEP curve type.
PreferredJunctionType | The preferred junction type of the MEP curve type.
Roughness | The roughness of the MEP curve type. For PipeTypes, please use Segment::Roughness
RoutingPreferenceManager |  The RoutingPreferenceManager for the MEPCurveType
Shape |  The shape of the profile.
Tap | The default tap fitting of the MEP curve type.
Tee | The default tee fitting of the MEP curve type.
Transition | The default transition fitting of the MEP curve type.
Union | The default union fitting of the MEP curve type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Electrical.CableTrayType
 Autodesk.Revit.DB.Electrical.ConduitType
 Autodesk.Revit.DB.Mechanical.DuctType
 Autodesk.Revit.DB.Mechanical.FlexDuctType
 Autodesk.Revit.DB.Plumbing.FlexPipeType
 Autodesk.Revit.DB.Plumbing.PipeType