Revit 2027 API
IFCImportOptions Methods
The IFCImportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetConversionData |  Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
GetExtraOptions |  Get the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value.
SetExtraOptions |  Set the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value. Note that any value here will overwrite the other values in the IFCImportOptions, if it has the same name.
Top
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace