Revit 2027 API
BuildingPad Methods
The BuildingPad type exposes the following members.
Methods
Name | Description
Create |  Creates a new BuildingPad element and adds it to the document.
GetBoundary |  Gets the boundary of current BuildingPad element.
SetBoundary |  Set a given curve loops as the boundary of the current BuildingPad element.
Top
See Also
Reference
BuildingPad Class
Autodesk.Revit.DB.Architecture Namespace