Revit 2027 API
FootPrintRoof Class
Represents kinds of FootPrintRoofs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.RoofBase
 Autodesk.Revit.DB.FootPrintRoof
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FootPrintRoof : RoofBase
Public Class FootPrintRoof
	Inherits RoofBase
public ref class FootPrintRoof : public RoofBase
type FootPrintRoof =
    class
        inherit RoofBase
    end
The FootPrintRoof type exposes the following members.
Properties
Name | Description
CurtainGrids | Retrieve all the CurtainGrid objects of a FootPrintRoof.
DefinesSlope | Retrieve or set the DefinesSlope of the curve.
ExtendIntoWall | Retrieve or set whether extend into wall the curve.
Offset | Retrieve or set the Offset of the curve.
Overhang | Retrieve or set the Overhang of the curve.
SlopeAngle | Retrieve or set the SlopeAngle of the curve.
Top
Methods
Name | Description
GetProfiles | Retrieve all the curveLoops of FootPrintRoof.
Top
Remarks
The FootPrintRoof object represents some kinds of FootPrintRoof in Revit. The RoofType property is used to distinguish the type of the roof.
See Also
Reference
Autodesk.Revit.DB Namespace