Revit 2027 API
InternalDefinition Class
 This object represents a parameter definition in an Autodesk Revit model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definition
 Autodesk.Revit.DB.InternalDefinition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InternalDefinition : Definition,
	IDisposable
Public Class InternalDefinition
	Inherits Definition
	Implements IDisposable
public ref class InternalDefinition : public Definition,
	IDisposable
type InternalDefinition =
    class
        inherit Definition
        interface IDisposable
    end
The InternalDefinition type exposes the following members.
Properties
Name | Description
BuiltInParameter |  Tests whether this definition identifies a built-in parameter or not.
Id |  The id of the parameter.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name | The user-visible name for the parameter.
(Overrides Definition.Name)
VariesAcrossGroups | Whether or not the parameter values can vary across group members.
Visible | Indicates if the parameter is visible in the Autodesk Revit user interface.
Top
Methods
Name | Description
Dispose | Releases all resources used by the InternalDefinition
GetGroupTypeId |  Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs.
(Overrides Definition.GetGroupTypeId())
GetParameterTypeId |  Tests whether this definition identifies a built-in parameter or not.
GetTypeId |  Gets the identifier of the parameter.
SetAllowVaryBetweenGroups |  Whether or not the parameter values can vary across group members.
SetGroupTypeId |  Sets the built-in parameter group to which the parameter defined by this definition belongs.
Top
See Also
Reference
Autodesk.Revit.DB Namespace