Revit 2027 API
StructuralMaterialTypeFilter Properties
The StructuralMaterialTypeFilter type exposes the following members.
Properties
Name | Description
StructuralMaterialType |  The structural material type.
Top
See Also
Reference
StructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace