Revit 2027 API
GenericForm Methods
The GenericForm type exposes the following members.
Methods
Name | Description
GetVisibility | Gets the visibility for the generic form.
SetVisibility | Sets the visibility for the generic form.
Top
See Also
Reference
GenericForm Class
Autodesk.Revit.DB Namespace