Revit 2027 API
ExternalResourceServerExtensions Class
 An object that contains overrides for external resource-specific methods.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceServerExtensions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalResourceServerExtensions : IDisposable
Public Class ExternalResourceServerExtensions
	Implements IDisposable
public ref class ExternalResourceServerExtensions : IDisposable
type ExternalResourceServerExtensions =
    class
        interface IDisposable
    end
The ExternalResourceServerExtensions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalResourceServerExtensions
GetCADLinkOperations |  Gets the specific methods supported by external resource CAD Links.
GetRevitLinkOperations |  Gets the specific methods supported by the external resource of Revit Links.
Top
Remarks
This class permits assignment of some specific operations related to a type of external resource, such as what to do when "Open (and Unload)" happens, or when "Shared Coordinates update" happens for Revit or CAD links.
There is no feedback to the UI server for ExternalResourceServerExtensions. Revit will use standard, common message dialogs to handle any error conditions.
See Also
Reference
Autodesk.Revit.DB Namespace