Revit 2027 API
ViewDisplayModel Class
 Represents the settings for displaying model graphics. version 2: m_showHiddenLines type changed bool -> ShowHiddenLinesValues::Enum
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewDisplayModel
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewDisplayModel : IDisposable
Public Class ViewDisplayModel
	Implements IDisposable
public ref class ViewDisplayModel : IDisposable
type ViewDisplayModel =
    class
        interface IDisposable
    end
The ViewDisplayModel type exposes the following members.
Properties
Name | Description
EnableSilhouettes |  True to show silhouettes edges. False to disable showing them.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowHiddenLines |  True to enable hidden lines. False to disable showing them.
SilhouetteEdgesGStyleId |  Style ID for silhouette edges
SmoothEdges |  True to enable "smooth edge" (anti-aliasing) effect. False to disable it.
Transparency |  The percentage (0..100) of surface transparency 0 means the surfaces are opaque, 100 means they are fully transparent
Top
Methods
Name | Description
Dispose | Releases all resources used by the ViewDisplayModel
Top
See Also
Reference
Autodesk.Revit.DB Namespace