Revit 2027 API
SizingOptions Class
 Contains the options for MEP sizing parameters, such as profile type, material roughness, fluid density and viscosity, minimal and maximal sizes, and etc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.SizingOptions
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SizingOptions : IDisposable
Public Class SizingOptions
	Implements IDisposable
public ref class SizingOptions : IDisposable
type SizingOptions =
    class
        interface IDisposable
    end
The SizingOptions type exposes the following members.
Constructors
Name | Description
SizingOptions() |  Constructs a new instance of the SizingOptions with default parameters.
SizingOptions(Element) |  Constructs a new instance of the SizingOptions with specified parameters.
SizingOptions(SizingOptions) |  Constructs a new copy of the SizingOptions object.
Top
Properties
Name | Description
Area |  The area of the specified sizing profile and dimension.
Density |  The air or fluid density in kg/ft^3, defaults to the dry air density at 20ºC.
Diameter |  The diameter of round duct or pipe in feet.
DomainType |  The domain type of the options, such as HVAC or Plumbing.
Height |  The height of the duct or pipe in feet.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaxSize |  The maximal size in feet, defaults to 2 feet.
MinSize |  The minimal size in feet, defaults to 0.041666 ft (0.5 inch).
ProfileType |  The profile type of the options, such as round, rectangular or oval.
Roughness |  The material roughness in ft, defaults to 0.0003 ft.
Viscosity |  The air or fluid viscosity in kg/(ft*s), defaults to the air dynamic viscosity at 20ºC.
Width |  The width of the duct or pipe in feet.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SizingOptions
IsValid |  Checks if the options are valid and ready for sizing operation.
SetEquivalentHeight |  Sets the equivalent height based on the specified width.
SetEquivalentWidth |  Sets the equivalent width based on the specified height.
SetNextAvailableSize(Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
SetNextAvailableSize(ConnectorProfileType, Double, Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace