Revit 2027 API
SiteSubRegion Class
 Represents a proxy class exposing the interfaces needed to access details of a subregion.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.SiteSubRegion
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SiteSubRegion : IDisposable
Public Class SiteSubRegion
	Implements IDisposable
public ref class SiteSubRegion : IDisposable
type SiteSubRegion =
    class
        interface IDisposable
    end
The SiteSubRegion type exposes the following members.
Properties
Name | Description
HostId |  The element id of the topography surface hosting this SiteSubRegion.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TopographySurface |  The TopographySurface element which this SiteSubRegion represents.
Top
Methods
Name | Description
Create(Document, IList<CurveLoop>) | Obsolete.
 Creates a new SiteSubRegion element and adds it to the document.
Create(Document, IList<CurveLoop>, ElementId) | Obsolete.
 Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
Dispose | Releases all resources used by the SiteSubRegion
GetBoundary |  Gets the boundary of current subregion.
IsValidBoundary |  Identifies whether the given curve loops compose a valid boundary.
SetBoundary | Obsolete.
 Set the given curve loops as the boundary of an existing SiteSubRegion.
Top
Remarks
 In the Revit database, both TopographySurface elements and subregion elements are represented by the same TopographySurface element subclass. In the Revit API, this SiteSubRegion class exists to separate the interfaces for subregions from those of topography surfaces.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace