Revit 2027 API
StructuralSectionGeneralC Properties
The StructuralSectionGeneralC type exposes the following members.
Properties
Name | Description
LipLength |  Lip segment length.
Top
See Also
Reference
StructuralSectionGeneralC Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace