Revit 2027 API
SketchPlane Properties
The SketchPlane type exposes the following members.
Properties
Name | Description
IsSuitableForModelElements |  Identifies if the sketch plane can be assigned to model elements.
Top
See Also
Reference
SketchPlane Class
Autodesk.Revit.DB Namespace