Revit 2027 API
ControlledApplication Methods
The ControlledApplication type exposes the following members.
Methods
Name | Description
GetExtendedApiService<TService>
GetFailureDefinitionRegistry |  Returns the instance of FailureDefinitionRegistry.
GetLibraryPaths |  Returns path information identifying where Revit searches for content.
IsJournalPlaying |  Determines if the application is currently in journal playback mode.
OpenSharedParameterFile | Enables access to shared parameter groups and definitions that are maintained on disk.
RegisterFailuresProcessor |  Replaces Revit's default user interface (if present) with alternative handling for all warnings and errors (including those not generated by your application) for the rest of the Revit session; if your application is not prepared to respond to all warnings and errors, consider use of IFailuresPreprocessor (in your opened Transaction) or the FailuresProcessing event instead of this interface.
SetLibraryPaths |  Sets path information identifying where Revit searches for content.
WriteJournalComment |  Writes a comment to the Revit journal file.
Top
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace