Revit 2027 API
FabricationPartSizeMap Methods
The FabricationPartSizeMap type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace