Revit 2027 API
RenderNode Class
 This is the base class of all render nodes in a model-exporting process.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RenderNode : IDisposable
Public Class RenderNode
	Implements IDisposable
public ref class RenderNode : IDisposable
type RenderNode =
    class
        interface IDisposable
    end
The RenderNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NodeName |  A readable name of the output node.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RenderNode
Top
Remarks
 A node can be both geometric (such as an element, light, etc.) or non-geometric (e.g. material). Some types of nodes are container modes, which include other render nodes.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.ElementNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.MaterialNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.TextNode
 Autodesk.Revit.DB.ViewNode