Revit 2027 API
AssetPropertyDistance Class
 Represents a property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDistance
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyDistance : AssetProperty
Public Class AssetPropertyDistance
	Inherits AssetProperty
public ref class AssetPropertyDistance : public AssetProperty
type AssetPropertyDistance =
    class
        inherit AssetProperty
    end
The AssetPropertyDistance type exposes the following members.
Properties
Name | Description
Value |  Value of the property.
Top
Methods
Name | Description
GetUnitTypeId |  Gets the identifier of the unit quantifying the distance property.
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace