Revit 2027 API
IModelExportContext Methods
The IModelExportContext type exposes the following members.
Methods
Name | Description
OnPoint |  This method is called when a Point is being output.
Top
See Also
Reference
IModelExportContext Interface
Autodesk.Revit.DB Namespace