Revit 2027 API
AssetPropertyDoubleArray3d Methods
The AssetPropertyDoubleArray3d type exposes the following members.
Methods
Name | Description
GetValueAsDoubles |  Get the value property as doubles.
GetValueAsXYZ |  Get the value property as a vector or point XYZ.
IsValidValue |  Checks that the value is a valid value for this property.
SetValueAsXYZ |  Sets the value property as a vector or point XYZ.
Top
See Also
Reference
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace