Revit 2027 API
ElementSetIterator Methods
The ElementSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
ElementSetIterator Class
Autodesk.Revit.DB Namespace