Revit 2027 API
WorksharingDisplayGraphicSettings Class
 Represents the graphical settings that can be assigned to elements in the worksharing display modes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksharingDisplayGraphicSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksharingDisplayGraphicSettings : IDisposable
Public Class WorksharingDisplayGraphicSettings
	Implements IDisposable
public ref class WorksharingDisplayGraphicSettings : IDisposable
type WorksharingDisplayGraphicSettings =
    class
        interface IDisposable
    end
The WorksharingDisplayGraphicSettings type exposes the following members.
Constructors
Name | Description
WorksharingDisplayGraphicSettings |  Creates a new instance.
Top
Properties
Name | Description
FillColor |  The fill color that will be applied to elements when these settings are applied. Note that this is automatically set by increasing the luma of the specified line color by 65%.
IsApplied |  Indicates whether this set of graphic overrides will be applied.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LineColor |  The line color that will be applied to elements when these settings are applied.
Top
Methods
Name | Description
Dispose | Releases all resources used by the WorksharingDisplayGraphicSettings
Top
Example
public WorksharingDisplayGraphicSettings GetWorksharingDisplaySettings(Document doc, String userName, WorksetId worksetId, bool ownedbyCurrentUser)
{
    WorksharingDisplayGraphicSettings graphicSettings;
    // get or create a WorksharingDisplaySettings current active document
    WorksharingDisplaySettings displaySettings = WorksharingDisplaySettings.GetOrCreateWorksharingDisplaySettings(doc);
    // get graphic settings for a user, if specified
    if (!String.IsNullOrEmpty(userName))
        graphicSettings = displaySettings.GetGraphicOverrides(userName);
    // get graphicSettings for a workset, if specified
    else if (worksetId != WorksetId.InvalidWorksetId)
        graphicSettings = displaySettings.GetGraphicOverrides(worksetId);
    // get graphic settings for the OwnedByCurrentUser status
    else if (ownedbyCurrentUser)
        graphicSettings = displaySettings.GetGraphicOverrides(CheckoutStatus.OwnedByCurrentUser);
    // otherwise get graphic settings for the CurrentWithCentral status
    else
        graphicSettings = displaySettings.GetGraphicOverrides(ModelUpdatesStatus.CurrentWithCentral);
    return graphicSettings;
}
See Also
Reference
Autodesk.Revit.DB Namespace