Revit 2027 API
PrimarySizeCriterion Class
 This class contains a size criterion for a RoutingPreferenceRule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingCriterionBase
 Autodesk.Revit.DB.PrimarySizeCriterion
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrimarySizeCriterion : RoutingCriterionBase
Public Class PrimarySizeCriterion
	Inherits RoutingCriterionBase
public ref class PrimarySizeCriterion : public RoutingCriterionBase
type PrimarySizeCriterion =
    class
        inherit RoutingCriterionBase
    end
The PrimarySizeCriterion type exposes the following members.
Constructors
Name | Description
PrimarySizeCriterion |  Constructs a PrimarySizeCriterion with a minimum and maximum size.
Top
Properties
Name | Description
MaximumSize |  The maximum size of this criterion.
MinimumSize |  The minimum size of this criterion.
Top
Methods
Name | Description
All |  Creates a criterion with a range of all sizes.
None |  Creates a criterion with a range of no sizes.
Top
See Also
Reference
Autodesk.Revit.DB Namespace