Revit 2027 API
StructuralSectionRectangular Properties
The StructuralSectionRectangular type exposes the following members.
Properties
Name | Description
CentroidHorizontal |  Distance from centroid to the left extremites along horizontal axis.
CentroidVertical |  Distance from centroid to the upper extremites along vertical axis.
Height |  Section height, depth.
NameKey |  Name Key
Width |  Section width.
Top
See Also
Reference
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace