Revit 2027 API
ConduitRun Class
 This class represents a conduit run in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase
 Autodesk.Revit.DB.Electrical.ConduitRun
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConduitRun : CableTrayConduitRunBase
Public Class ConduitRun
	Inherits CableTrayConduitRunBase
public ref class ConduitRun : public CableTrayConduitRunBase
type ConduitRun =
    class
        inherit CableTrayConduitRunBase
    end
The ConduitRun type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This class is mainly for calculating length of a conduit run. A conduit run contains connected straight conduit segments and bends between the straight segments with same type and size.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace