Revit 2027 API
TopographyLinkType Methods
The TopographyLinkType type exposes the following members.
Methods
Name | Description
Reload |  Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Top
See Also
Reference
TopographyLinkType Class
Autodesk.Revit.DB.Architecture Namespace