Revit 2027 API
FileDialog Class
 Base class supporting display of the dialog used to navigate to and select a file from Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.FileDialog
 Autodesk.Revit.UI.FileOpenDialog
 Autodesk.Revit.UI.FileSaveDialog
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FileDialog : IDisposable
Public Class FileDialog
	Implements IDisposable
public ref class FileDialog : IDisposable
type FileDialog =
    class
        interface IDisposable
    end
The FileDialog type exposes the following members.
Properties
Name | Description
DefaultFilterEntry |  The default entry (from the filter) to be selected in the dialog.
Filter |  The filter string representing a collection of extensions allowed by the dialog.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Title |  The title to show on the dialog.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FileDialog
GetSelectedModelPath |  Returns the selected file path chosen by the user.
IsValidFilterString |  Determines if the input string is acceptable as input for a FileDialog filter string.
Show |  Shows the dialog using the stored settings.
Top
See Also
Reference
Autodesk.Revit.UI Namespace