Revit 2027 API
RepeaterBounds Class
 Represents bounds of the array of repeating references in 0, 1, or 2 dimensions. (See RepeatingReferenceSource).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RepeaterBounds
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RepeaterBounds : IDisposable
Public Class RepeaterBounds
	Implements IDisposable
public ref class RepeaterBounds : IDisposable
type RepeaterBounds =
    class
        interface IDisposable
    end
The RepeaterBounds type exposes the following members.
Properties
Name | Description
DimensionCount |  The number of dimensions of the bounds (0, 1 or 2 for zero, one or two dimensional arrays.)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AdjustForCyclicalBounds |  Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
AreCoordinatesInBounds |  Determines whether given coordinates are within the bounds.
Dispose | Releases all resources used by the RepeaterBounds
GetLowerBound |  Returns the smallest index of the array in the given dimension.
GetUpperBound |  Returns the highest index of the array in the given dimension.
IsCyclical |  True if the array doesn't have finite bounds in the given dimension. Cyclical bounds indicate that the array forms a closed loop in the given dimension.
Top
See Also
Reference
Autodesk.Revit.DB Namespace