Revit 2027 API
PathOfTravel Class
 An element which holds a graphical representation of the shortest route between two points in the plane of a floor plan view. The shortest route is calculated to go around model geometry visible in the view. Route calculation is affected by properties of the RouteAnalysisSettings element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.PathOfTravel
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PathOfTravel : Element
Public Class PathOfTravel
	Inherits Element
public ref class PathOfTravel : public Element
type PathOfTravel =
    class
        inherit Element
    end
The PathOfTravel type exposes the following members.
Properties
Name | Description
LineStyle |  The line style of the path.
PathEnd |  The end point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update.
PathMidpoint |  The midpoint of the path. The Z coordinate will equal the view's level elevation.
PathStart |  The start point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update.
Top
Methods
Name | Description
Create(View, XYZ, XYZ) |  Creates a new path of travel between two points.
Create(View, XYZ, XYZ, PathOfTravelCalculationStatus) |  Creates a new path of travel between two points and provides creation result status.
CreateMapped(View, IList<XYZ>, IList<XYZ>) |  Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points.
CreateMapped(View, IList<XYZ>, IList<XYZ>, IList<PathOfTravelCalculationStatus>) |  Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points and provides creation result statuses.
CreateMultiple(View, IList<XYZ>, IList<XYZ>) |  Creates multiple new paths of travel between same size sets of start and end points.
CreateMultiple(View, IList<XYZ>, IList<XYZ>, IList<PathOfTravelCalculationStatus>) |  Creates multiple new paths of travel between same size sets of start and end points and provides creation result statuses.
FindEndsOfShortestPaths |  For a floor plan view, calculates the paths from each start point to its closest destination and return the path end points.
FindShortestPaths |  For a floor plan view, calculates paths from each start point to its closest destinations. Returns the path, represented by an array of XYZ points.
FindStartsOfLongestPathsFromRooms |  For a floor plan view, calculates paths from points inside rooms to the closests of the destinations. Returns the start points of the longest path(s). If multiple paths have the same longest length, returns multiple start points.
GetCurves |  Gets the array of curves representing the path of travel.
GetWaypoints |  return the waypoints set for the Path of Travel
InsertWaypoint |  Insert a waypoint at the specified index
IsInRevealObstaclesMode |  Returns current state of Reveal Obstacles mode for the given view.
RemoveWaypoint |  Remove a waypoint.
SetRevealObstaclesMode |  Sets Reveal Obstacles mode for the given view.
SetWaypoint |  Updates the specified waypoint.
Update |  Updates the path of travel by recalculating the path between the original start and end points.
UpdateMultiple(Document, IList<ElementId>) |  Updates the specified paths of travel by recalculating each path using their original start and end points.
UpdateMultiple(Document, IList<ElementId>, IList<PathOfTravelCalculationStatus>) |  Updates the specified paths of travel by recalculating each path using their original start and end points and provides creation result statuses.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace