Revit 2027 API
CircuitNamingScheme Class
 This class represents a circuit naming scheme in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CircuitNamingScheme
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CircuitNamingScheme : Element
Public Class CircuitNamingScheme
	Inherits Element
public ref class CircuitNamingScheme : public Element
type CircuitNamingScheme =
    class
        inherit Element
    end
The CircuitNamingScheme type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new CircuitNamingScheme.
GetCombinedParameters |  Gets the combined parameters.
IsNameUnique |  Validates whether the CircuitNamingScheme name is unique in document.
IsValidCombinedParameters |  Validates whether the combined parameters is valid.
SetCombinedParameters |  Sets combined parameters array.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace