Revit 2027 API
CableTraySettings Class
 The cable tray settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CableTraySettings
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTraySettings : Element
Public Class CableTraySettings
	Inherits Element
public ref class CableTraySettings : public Element
type CableTraySettings =
    class
        inherit Element
    end
The CableTraySettings type exposes the following members.
Properties
Name | Description
ConnectorSeparator |  The cable tray connector separator string.
FittingAnnotationSize |  The value of fitting annotation size.
RiseDropAnnotationSize |  The rise drop annotation size.
SizeSeparator |  The cable tray size separator string.
SizeSuffix |  The cable tray size suffix string.
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
Top
Methods
Name | Description
GetCableTraySettings |  Gets the cable tray settings of the project.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace