Revit 2027 API
FamilySymbolProfile Class
Represents a family symbol based profile for sweep or swept blend elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SweepProfile
 Autodesk.Revit.DB.FamilySymbolProfile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilySymbolProfile : SweepProfile
Public Class FamilySymbolProfile
	Inherits SweepProfile
public ref class FamilySymbolProfile : public SweepProfile
type FamilySymbolProfile =
    class
        inherit SweepProfile
    end
The FamilySymbolProfile type exposes the following members.
Properties
Name | Description
Angle | The angle of the rotation of the profile in radians.
IsFlipped | Indicates if the symbol profile is flipped or not.
Profile | Returns the family symbol of the profile.
XOffset | The offset of the profile to the origin of the sketch plane in the X direction.
YOffset | The offset of the profile to the origin of the sketch plane in the Y direction.
Top
Methods
Name | Description
Top
Remarks
Use objects of this type in methods as NewSweep() and NewSweptBlend() in FamilyItemFactory to create the profile.
See Also
Reference
Autodesk.Revit.DB Namespace