Revit 2027 API
FilterStringEquals Class
 Tests whether string values from the document match a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringEquals
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringEquals : FilterStringRuleEvaluator
Public Class FilterStringEquals
	Inherits FilterStringRuleEvaluator
public ref class FilterStringEquals : public FilterStringRuleEvaluator
type FilterStringEquals =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringEquals type exposes the following members.
Constructors
Name | Description
FilterStringEquals |  Constructs an instance of FilterStringEquals.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace