Revit 2027 API
FileDialog Methods
The FileDialog type exposes the following members.
Methods
Name | Description
Dispose
GetSelectedModelPath |  Returns the selected file path chosen by the user.
IsValidFilterString |  Determines if the input string is acceptable as input for a FileDialog filter string.
Show |  Shows the dialog using the stored settings.
Top
See Also
Reference
FileDialog Class
Autodesk.Revit.UI Namespace