Revit 2027 API
MEPSystemType Class
 A system type in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.MEPSystemType
 Autodesk.Revit.DB.Mechanical.MechanicalSystemType
 Autodesk.Revit.DB.Plumbing.PipingSystemType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPSystemType : ElementType
Public Class MEPSystemType
	Inherits ElementType
public ref class MEPSystemType : public ElementType
type MEPSystemType =
    class
        inherit ElementType
    end
The MEPSystemType type exposes the following members.
Properties
Name | Description
Abbreviation |  Identifies the abbreviation, the short name, for the system type
CalculationLevel |  Identifies the calculation level for the system type.
FillColor |  Indicates the color that should override the fill color for all components in the system.
FillPatternId |  Indicates the fill pattern id that should override the fill pattern id for all components in the system.
FillVisible |  Indicates the visibility of the fill pattern for all components in the system.
LineColor |  Indicates the color that should override the line color for all components in the system.
LinePatternId |  Indicates the line pattern id that should override the line pattern id for all components in the system.
LineWeight |  Indicates the weight that should override the line weight for all components in the system.
MaterialId |  Indicates the material id that should override the material for all components in the system.
SystemClassification |  Identifies the classification for the system type
Top
Methods
Name | Description
Top
Remarks
 This is the base class for mechanical and piping system types, available only in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB Namespace