Revit 2027 API
CategoryNameMap Properties
The CategoryNameMap type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the map is empty.
Item | Gets or sets a category at a specified name within the map.
Size | Returns the number of categories that are in the map.
Top
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace