Revit 2027 API
StructuralSectionRectangleHSS Class
 Defines parameters for parameterized rectangle HSS structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionRectangleHSS : StructuralSectionGeneralH
Public Class StructuralSectionRectangleHSS
	Inherits StructuralSectionGeneralH
public ref class StructuralSectionRectangleHSS : public StructuralSectionGeneralH
type StructuralSectionRectangleHSS =
    class
        inherit StructuralSectionGeneralH
    end
The StructuralSectionRectangleHSS type exposes the following members.
Constructors
Name | Description
StructuralSectionRectangleHSS |  Creates a new instance of Structural Section Rectangle HSS shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace