Revit 2027 API
ValidateCurveLoopsOptions Class
 Options for array of curve loops validation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValidateCurveLoopsOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ValidateCurveLoopsOptions : IDisposable
Public Class ValidateCurveLoopsOptions
	Implements IDisposable
public ref class ValidateCurveLoopsOptions : IDisposable
type ValidateCurveLoopsOptions =
    class
        interface IDisposable
    end
The ValidateCurveLoopsOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ValidateCurveLoopsOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace