Revit 2027 API
LayoutRuleMaximumSpacing Properties
The LayoutRuleMaximumSpacing type exposes the following members.
Properties
Name | Description
Spacing | Get or set the spacing of the beam system.
Top
See Also
Reference
LayoutRuleMaximumSpacing Class
Autodesk.Revit.DB Namespace