Revit 2027 API
StairsRun Properties
The StairsRun type exposes the following members.
Properties
Name | Description
ActualRisersNumber |  The actual number of stairs risers in the stairs run.
ActualRunWidth |  Specifies the value of the tread width excluding the width of independent side supports.
ActualTreadsNumber |  The actual number of stairs treads in the stairs run.
BaseElevation |  The base elevation of the stairs run.
BeginsWithRiser |  True if the stairs run begins with a riser, false otherwise.
EndsWithRiser |  True if the stairs run ends with a riser, false otherwise.
ExtensionBelowRiserBase |  Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a riser.
ExtensionBelowTreadBase |  Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a tread.
Height |  The calculated height of the stairs run.
LocationLineJustification |  The position of the run relative to the Up-direction path used to create the run.
StairsRunStyle |  The style of the stairs run such as straight, winder, etc.
TopElevation |  The top elevation of the stairs run.
Top
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace