Revit 2027 API
Point Class
A 3D point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Point
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Point : GeometryObject
Public Class Point
	Inherits GeometryObject
public ref class Point : public GeometryObject
type Point =
    class
        inherit GeometryObject
    end
The Point type exposes the following members.
Properties
Name | Description
Coord |  Returns the coordinates of the point.
Reference | Returns a stable reference to the point.
Top
Methods
Name | Description
Create(XYZ) |  Creates a point at the given coordinates.
Create(XYZ, ElementId) |  Creates a point at the given coordinates and assigns it the specified GraphicsStyle.
Top
Remarks
The point lies at a given XYZ coordinate location.
See Also
Reference
Autodesk.Revit.DB Namespace