Revit 2027 API
IndexPrimitive Methods
The IndexPrimitive type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IndexPrimitive Class
Autodesk.Revit.DB.DirectContext3D Namespace