Revit 2027 API
ViewsExportingByContextEventArgs Methods
The ViewsExportingByContextEventArgs type exposes the following members.
Methods
Name | Description
GetViewIds |  Gets the views about to be exported by CustomExporter.
Top
See Also
Reference
ViewsExportingByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace