Revit 2027 API
RegenerationAttribute Properties
The RegenerationAttribute type exposes the following members.
Properties
Name | Description
Option | Regeneration option.
Top
See Also
Reference
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace