Revit 2027 API
AreaScheme Class
The area scheme associated with a particular area plan.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.AreaScheme
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaScheme : Element
Public Class AreaScheme
	Inherits Element
public ref class AreaScheme : public Element
type AreaScheme =
    class
        inherit Element
    end
The AreaScheme type exposes the following members.
Properties
Name | Description
IsGrossBuildingArea | Indicates if the area scheme is a Gross Building Area scheme.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace