Revit 2027 API
AnnotationLabel Methods
The AnnotationLabel type exposes the following members.
Methods
Name | Description
GetParameterFormatting |  Gets the collection of parameter formatting objects for the parameters seen in the label.
Top
See Also
Reference
AnnotationLabel Class
Autodesk.Revit.DB Namespace