Revit 2027 API
DefaultDivideSettings Properties
The DefaultDivideSettings type exposes the following members.
Properties
Name | Description
PathDistance |  A default Divided Path distance for a fixed, minimum, or maximum distance layout.
PathLayout |  A default Divided Path layout.
PathMeasurementType |  A default Divided Path measurement type for distance layouts.
PathNumber |  A default Divided Path number for a fixed number layout.
Top
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace