Revit 2027 API
MEPAnalyticalModelData Class
 Represents the MEP analytical model data attached to individual element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPAnalyticalModelData : IDisposable
Public Class MEPAnalyticalModelData
	Implements IDisposable
public ref class MEPAnalyticalModelData : IDisposable
type MEPAnalyticalModelData =
    class
        interface IDisposable
    end
The MEPAnalyticalModelData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPAnalyticalModelData
GetMEPAnalyticalModelData |  Gets the MEP analytical model data of the specified element.
GetNodeById |  Gets the analytical node with the specified id.
GetNodeByIndex |  Gets the specified analytical node.
GetNumberOfNodes |  Returns the number of analytical nodes.
GetNumberOfSegments |  Returns the number of analytical segments.
GetSegmentById |  Gets the analytical segment with the specified id.
GetSegmentByIndex |  Gets the analytical segment at the specified position.
GetSegmentData |  Gets the analysis data on the specified segment.
IsValidNodeId |  Verifies if a valid analytical node id.
IsValidSegmentId |  Verifies if a valid segment id.
Top
Remarks
 The MEP analytical model is composed of generic analytical segments and nodes. Each Revit element may have one or more analytical segments. Connected together, these data form a network that is used in the flow and pressure drop calculation.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace