Revit 2027 API
PolylineNode Methods
The PolylineNode type exposes the following members.
Methods
Name | Description
GetPolyline |  Returns the polyline object corresponding to the node.
Top
See Also
Reference
PolylineNode Class
Autodesk.Revit.DB Namespace