Revit 2027 API
Conduit Class
 This class represents a conduit in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Electrical.CableTrayConduitBase
 Autodesk.Revit.DB.Electrical.Conduit
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Conduit : CableTrayConduitBase
Public Class Conduit
	Inherits CableTrayConduitBase
public ref class Conduit : public CableTrayConduitBase
type Conduit =
    class
        inherit CableTrayConduitBase
    end
The Conduit type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of conduit.
IsValidConduitType |  Identifies if a conduit type is valid.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace