Revit 2027 API
NavisworksExportOptions Methods
The NavisworksExportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetSelectedElementIds |  Returns the element ids of the elements to export. Empty by default.
SetSelectedElementIds |  Sets the element ids of the elements to export. Used only when ExportScope = SelectedElements.
Top
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace