Revit 2027 API
WallFoundation Properties
The WallFoundation type exposes the following members.
Properties
Name | Description
WallId |  Returns the id of the host wall.
Top
See Also
Reference
WallFoundation Class
Autodesk.Revit.DB Namespace