Revit 2027 API
InitialFluxIntensity Class
 This class encapsulates initial flux intensity calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialFluxIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialFluxIntensity : InitialIntensity
Public Class InitialFluxIntensity
	Inherits InitialIntensity
public ref class InitialFluxIntensity : public InitialIntensity
type InitialFluxIntensity =
    class
        inherit InitialIntensity
    end
The InitialFluxIntensity type exposes the following members.
Constructors
Name | Description
InitialFluxIntensity(Double) |  Creates an initial flux intensity object with the given document and flux values.
InitialFluxIntensity(InitialFluxIntensity) |  Creates a copy of the given initial flux intensity object
Top
Properties
Name | Description
Flux |  The flux intensity value.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace