Revit 2027 API
IFCTransaction Methods
The IFCTransaction type exposes the following members.
Methods
Name | Description
Commit |  Commits all changes made to the IFC file during the transaction.
Dispose
RollBack |  Rolls back all changes made to the IFC file during the transaction.
Top
See Also
Reference
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace