Revit 2027 API
AnalyticalSurfaceBase Class
 This is the base class for analytical surface elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalElement
 Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
 Autodesk.Revit.DB.Structure.AnalyticalOpening
 Autodesk.Revit.DB.Structure.AnalyticalPanel
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalSurfaceBase : AnalyticalElement
Public Class AnalyticalSurfaceBase
	Inherits AnalyticalElement
public ref class AnalyticalSurfaceBase : public AnalyticalElement
type AnalyticalSurfaceBase =
    class
        inherit AnalyticalElement
    end
The AnalyticalSurfaceBase type exposes the following members.
Properties
Name | Description
SketchId |  Sketch associated to this Revit element.
Top
Methods
Name | Description
GetOuterContour |  Returns the Curve Loop that defines the geometry of the Analytical Surface element.
IsOuterContourValid |  Checks if contour is valid for this Analytical Surface.
SetOuterContour |  Sets the Curve Loop that defines the geometry of the Analytical Surface element.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace