Revit 2027 API
PipeFittingAndAccessoryConnectorData Methods
The PipeFittingAndAccessoryConnectorData type exposes the following members.
Methods
Name | Description
Dispose
GetCoordination |  Gets the coordination of the connector
Top
See Also
Reference
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace