Revit 2027 API
IFCFileModelOptions Class
 This class contains options to create an IFC file model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCFileModelOptions
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCFileModelOptions : IDisposable
Public Class IFCFileModelOptions
	Implements IDisposable
public ref class IFCFileModelOptions : IDisposable
type IFCFileModelOptions =
    class
        interface IDisposable
    end
The IFCFileModelOptions type exposes the following members.
Constructors
Name | Description
IFCFileModelOptions |  Creates a default IFCFileModelOptions. The default schema file is empty and cache size is 8192.
Top
Properties
Name | Description
CacheSize |  The cache size of the file.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SchemaFile |  The full name of an IFC schema file.
SchemaName |  The name of the schema.
UserControlledInverses |  Indicates if the inverses are controlled by Revit or users. True by users, false by Revit.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCFileModelOptions
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace