Revit 2027 API
DisplayingOptionsDialogEventArgs Methods
The DisplayingOptionsDialogEventArgs type exposes the following members.
Methods
Name | Description
AddTab | Add tab to option dialog with tab name and handler information.
Top
See Also
Reference
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace