Revit 2027 API
ViewActivatedEventArgs Properties
The ViewActivatedEventArgs type exposes the following members.
Properties
Name | Description
CurrentActiveView |  The view that has just become active.
PreviousActiveView |  The previously active view.
Top
See Also
Reference
ViewActivatedEventArgs Class
Autodesk.Revit.UI.Events Namespace