Revit 2027 API
SiteLocation Class
 Contains the geographical location information for the project's site.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.SiteLocation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SiteLocation : ElementType
Public Class SiteLocation
	Inherits ElementType
public ref class SiteLocation : public ElementType
type SiteLocation =
    class
        inherit ElementType
    end
The SiteLocation type exposes the following members.
Properties
Name | Description
Elevation |  The elevation of the site location.
GeoCoordinateSystemDefinition |  The XML or WKT2 string which describes the geographic coordinate system.
GeoCoordinateSystemId |  The geographic coordinate system ID, such as "AMG-50" and "Beijing1954/a.GK3d-40".
Latitude |  The latitude of the site location.
Longitude |  The longitude of the site location.
PlaceName |  The place name of the site.
TimeZone |  The time-zone for the site.
WeatherStationName |  The name of the weather station at the site location.
Top
Methods
Name | Description
ConvertFromProjectTime | Converts project time to UTC time.
ConvertToProjectTime | Converts local time or UTC time to project time.
IsCompatibleWith |  Checks whether the geographic coordinate system of this site is compatible with the given site . True if he geographic coordinate system of this site is compatible with the given site, false otherwise.
SetGeoCoordinateSystem |  Set the geographic coordinate system for this site. Similar to acquire coordinate system from a link in the UI.
Top
Remarks
 Each project may have one site which dictates where in the world the project is based. On this site there may be several locations of the same project. These are represented by ProjectLocation objects. The site location object can be found by using the SiteLocation property on the Document object. The properties of this object can be changed such that it represents any location on the planet or to a known city. Cities already programmed into Revit can be found from the Cities property on the Application object.
Example
// Get the SiteLocation instance.
Autodesk.Revit.DB.SiteLocation site = document.SiteLocation;
// Angles are in radians when coming from Revit API, so we
// convert to degrees for display
const double angleRatio = Math.PI / 180;   // angle conversion factor
// Format the prompt information.
String prompt = "Current project's Site location information:";
prompt += "\n\t" + "Latitude: " + site.Latitude / angleRatio + " degrees";
prompt += "\n\t" + "Longitude: " + site.Longitude / angleRatio + " degrees";
// Give the user some information.
TaskDialog.Show("Revit",prompt);
// Change the SiteLocation property data.
site.Latitude = 0.5;    // latitude information
site.Longitude = 0.5;   // longitude information
site.TimeZone = -5;     // TimeZone information
See Also
Reference
Autodesk.Revit.DB Namespace