Revit 2027 API
ConduitType Properties
The ConduitType type exposes the following members.
Properties
Name | Description
IsWithFitting |  Whether this conduit type is with fitting
Top
See Also
Reference
ConduitType Class
Autodesk.Revit.DB.Electrical Namespace