Revit 2027 API
CableTrayConduitBase Properties
The CableTrayConduitBase type exposes the following members.
Properties
Name | Description
RunId |  The id of the run to which this element belongs.
Top
See Also
Reference
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace