Revit 2027 API
PrimaryDesignOptionMemberFilter Class
 A filter used to find elements contained in any primary design option of any design option set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrimaryDesignOptionMemberFilter : ElementSlowFilter
Public Class PrimaryDesignOptionMemberFilter
	Inherits ElementSlowFilter
public ref class PrimaryDesignOptionMemberFilter : public ElementSlowFilter
type PrimaryDesignOptionMemberFilter =
    class
        inherit ElementSlowFilter
    end
The PrimaryDesignOptionMemberFilter type exposes the following members.
Constructors
Name | Description
PrimaryDesignOptionMemberFilter() |  Constructs a new instance of a filter to match elements contained in any primary design option of any design option set.
PrimaryDesignOptionMemberFilter(Boolean) |  Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter and find elements not contained in any primary design option of any design option set.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter will only pass elements in a primary design option. It will not pass elements in the main model not associated to any design option. This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.
Example
// Create a PrimaryDesignOptionMember filter to find all Walls contained within all primary design options
PrimaryDesignOptionMemberFilter filter = new PrimaryDesignOptionMemberFilter();
// Apply the filter to the elements in the active document
// Use shortcut command OfClass() to only find wall instances
FilteredElementCollector collector = new FilteredElementCollector(document);
ICollection<Element> wallsOfPrimaryOpt = collector.OfClass(typeof(Wall)).WherePasses(filter).ToElements();
// Find walls not contained within primary design options: Use inverted filter to match walls
PrimaryDesignOptionMemberFilter notPrimaryOptFilter = new PrimaryDesignOptionMemberFilter(true); // inverted filter
collector = new FilteredElementCollector(document);
ICollection<Element> notPrimaryDesignOptFounds =
    collector.OfClass(typeof(Wall)).WherePasses(notPrimaryOptFilter).ToElements();
See Also
Reference
Autodesk.Revit.DB Namespace