Revit 2027 API
ExportDGNSettings Methods
The ExportDGNSettings type exposes the following members.
Methods
Name | Description
Create(Document, String) |  Create a DGN export settings with default values.
Create(Document, String, DGNExportOptions) |  Create DGN export settings with specified values in DGNExportOptions.
FindByName |  Returns the pre-defined non-in-session exporting settings for DGN in the given document with the specified name.
GetActivePredefinedSettings |  Returns the active pre-defined non-in-session exporting settings for DGN in the given document.
GetDGNExportOptions |  Gets the options stored in the these settings.
ListNames |  Returns a list of names of dgn export settings.
SetDGNExportOptions |  Sets the options stored in these settings.
Top
See Also
Reference
ExportDGNSettings Class
Autodesk.Revit.DB Namespace