Revit 2027 API
FamilyThermalProperties Class
 A class that contains thermal properties for specific types of families (doors, windows, and curtain wall panels).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilyThermalProperties
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyThermalProperties : IDisposable
Public Class FamilyThermalProperties
	Implements IDisposable
public ref class FamilyThermalProperties : IDisposable
type FamilyThermalProperties =
    class
        interface IDisposable
    end
The FamilyThermalProperties type exposes the following members.
Constructors
Name | Description
FamilyThermalProperties |  Constructs a new FamilyThermalProperties with default settings.
Top
Properties
Name | Description
AnalyticConstructionName |  The construction gbXML name. This value corresponds to the 'Name' property of a constructionType node in Constructions.xml.
AnalyticConstructionTypeId |  The construction gbXML type. This value corresponds to the 'id' property of a constructionType node in Constructions.xml.
HeatTransferCoefficient | Obsolete.
 The heat transfer coefficient value (U-Value). The units are watts per meter-squared kelvin (W/(m^2*K)).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SolarHeatGainCoefficient |  The solar heat gain coefficient.
ThermalResistance |  The calculated thermal resistance value (R-Value). The units are meter-squared kelvin per watt ((m^2*K)/Watt).
ThermalTransmittance |  The thermal transmittance value (U-Value). The unit is Watt per meter-squared Kelvin (W/(m^2*K)).
VisualLightTransmittance |  The visual light transmittance.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FamilyThermalProperties
Find |  Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml.
IsValid |  Confirms that the thermal properties are correctly set for assignment to a FamilySymbol.
Top
See Also
Reference
Autodesk.Revit.DB Namespace