Revit 2027 API
FootPrintRoof Properties
The FootPrintRoof type exposes the following members.
Properties
Name | Description
CurtainGrids | Retrieve all the CurtainGrid objects of a FootPrintRoof.
DefinesSlope | Retrieve or set the DefinesSlope of the curve.
ExtendIntoWall | Retrieve or set whether extend into wall the curve.
Offset | Retrieve or set the Offset of the curve.
Overhang | Retrieve or set the Overhang of the curve.
SlopeAngle | Retrieve or set the SlopeAngle of the curve.
Top
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace