Revit 2027 API
TriangulatedShellComponent Methods
The TriangulatedShellComponent type exposes the following members.
Methods
Name | Description
Clear |  Empties the contents of this TriangulatedShellComponent.
Dispose
GetTriangle |  Returns the triangle corresponding to the given index.
GetVertex |  Returns the vertex with a given index.
GetVertices |  Returns the vertices of the triangulation.
Top
See Also
Reference
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace