Revit 2027 API
PrintSetup Class
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PrintSetup
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrintSetup : APIObject
Public Class PrintSetup
	Inherits APIObject
public ref class PrintSetup : public APIObject
type PrintSetup =
    class
        inherit APIObject
    end
The PrintSetup type exposes the following members.
Properties
Name | Description
CurrentPrintSetting | The current Print Setting of Print Setup.
InSession | The in-session Print Setting of Print Setup.
Top
Methods
Name | Description
Delete | Delete the current print setting, and make the In-Session setting as the current one.
Rename | Rename the current print setting with the specified name.
Revert | Revert the current print setting.
Save | Save the changes for the current print setting.
SaveAs | Save the current print setting to another print setting with the specified name.
Top
Remarks
The Print Setup object can only get from PrintManager object.
See Also
Reference
Autodesk.Revit.DB Namespace