Revit 2027 API
StructuralSectionsServiceData Methods
The StructuralSectionsServiceData type exposes the following members.
Methods
Name | Description
Dispose
GetCurrentElements |  Returns the list of Ids of the current elements.
Top
See Also
Reference
StructuralSectionsServiceData Class
Autodesk.Revit.DB.Structure Namespace