Revit 2027 API
RebarBendingDetailType Class
 Type for rebar bending detail elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarBendingDetailType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarBendingDetailType : ElementType
Public Class RebarBendingDetailType
	Inherits ElementType
public ref class RebarBendingDetailType : public ElementType
type RebarBendingDetailType =
    class
        inherit ElementType
    end
The RebarBendingDetailType type exposes the following members.
Properties
Name | Description
AngularDimensionsDisplayOption |  Identifies the angular dimensions display options.
AngularDimensionsEnabled |  Identifies if any angular dimensions will be shown or not.
AngularDimensionsForCranksEnabled |  Identifies if the angular dimensions which has a reference set on a crank will be shown or not.
AngularDimensionsForHooksEnabled |  Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
AngularDimensionsMeasurementOptions |  Identifies the measurement option for angular dimensions.
AngularDimensionsOffset |  Identifies the offset of the angular dimensions.
AngularDimensionTextPosition |  Identifies the text position with respect to dimension line.
AngularDimensionTypeId |  Identifies the Id of the angular dimension type which is used to show dimensions.
BendDiameterDimensionsEnabled |  Identifies if any radial or diameter dimensions will be shown or not.
BendDiameterDimensionsForHooksEnabled |  Identifies if radial or diameter dimensions will be shown for hook fillets. This property has a meaning only if BendDiameterDimensionsEnabled is set to true.
BendDiameterDimensionsForSegmentsEnabled |  Identifies if radial or diameter dimensions will be shown for the bends between segments. Radial or diameter dimesions for arc segments will be shown by default. This property has a menaning only if BendDiameterDimensionsEnabled is set to true.
BendDiameterDimensionType |  Identifies what type of bend diameter dimensions will be shown (radial or diameter).
DetailLevel |  Identifies the level of detail in which the Bending Detail will be represented.
DiameterDimensionTypeId |  Identifies the Id of the diameter dimension type which is used to show dimensions.
DisplayMode |  The display mode for the bending detail.
MultipleValuesIndicatorOption |  Identifies the option of how multiple values will be represented.
OrthogonalAndOverallDimesionsEnabled |  Identifies if orthogonal and overall dimensions are displayed.
RadialDimensionTypeId |  Identifies the Id of the radial dimension type which is used to show dimensions.
RepresentaionOf3DShapes |  Identifies how the Bending Detail will represent the 3D shapes.
SchematicHeight |  Determine the height of the box where the schematic Bending Detail will be represented.
SchematicWidth |  Determine the width of the box where the schematic Bending Detail will be represented.
SegmentLengthDimensionsEnabled |  Identifies if any segment length dimensions will be shown or not.
SegmentLengthDimensionsForHooksEnabled |  Identifies if segment length dimensions for hooks will be shown or not. If this property is true, the SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.
SegmentLengthDimensionsOffset |  Identifies the offset of the segment length dimensions.
SegmentLengthDimensionTextPosition |  Identifies the text position with respect to dimension line.
SegmentLengthDimensionTypeId |  Identifies the Id of the linear dimension type which is used to show segments length.
SegmentLengthsDisplayOption |  Identifies if the segment lengths are represented using dimensions or just as text.
SegmentLengthsForArcsDisplayOption |  Identifies if the arc segment lengths are represented using dimensions or just as text. Only RebarShapes whose definition is RebarShapeDefinitionByArc are considered that have arc segments.
SegmentsRepresentation |  Identifies how the bending detail will represent the segments of the bar.
TagTypeId |  Identifies the Id of the tag type which is used in the Bending Detail representation.
Top
Methods
Name | Description
CreateRealistic |  Creates a new RebarBendingDetailType object for full representations.
CreateSchematic |  Creates a new RebarBendingDetailType object for schematic representations.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace