Revit 2027 API
InvalidOperationException Class
The exception that is thrown when a method call is invalid for the object's current state.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 More
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InvalidOperationException : ApplicationException
<SerializableAttribute>
Public Class InvalidOperationException
	Inherits ApplicationException
[SerializableAttribute]
public ref class InvalidOperationException : public ApplicationException
[<SerializableAttribute>]
type InvalidOperationException =
    class
        inherit ApplicationException
    end
The InvalidOperationException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.AutoJoinFailedException
 Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException
 Autodesk.Revit.Exceptions.DefaultValueException
 Autodesk.Revit.Exceptions.DisabledDisciplineException
 Autodesk.Revit.Exceptions.FamilyContextException
 Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException
 Autodesk.Revit.Exceptions.InapplicableDataException
 Autodesk.Revit.Exceptions.InsufficientResourcesException
 Autodesk.Revit.Exceptions.InvalidObjectException
 Autodesk.Revit.Exceptions.ModificationForbiddenException
 Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
 Autodesk.Revit.Exceptions.NotTransmittedModelException
 Autodesk.Revit.Exceptions.ObjectAccessException
 Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException
 Autodesk.Revit.Exceptions.RegenerationFailedException
 Autodesk.Revit.Exceptions.SchemaException
 Autodesk.Revit.Exceptions.TransientElementCreationException
 Autodesk.Revit.Exceptions.TransmittedModelException
 Autodesk.Revit.Exceptions.WrongUserException