Revit 2027 API
RevitServerUnauthorizedException Class
The exception that is thrown when a call to the server is unauthorized.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerUnauthorizedException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerUnauthorizedException : RevitServerException
<SerializableAttribute>
Public Class RevitServerUnauthorizedException
	Inherits RevitServerException
[SerializableAttribute]
public ref class RevitServerUnauthorizedException : public RevitServerException
[<SerializableAttribute>]
type RevitServerUnauthorizedException =
    class
        inherit RevitServerException
    end
The RevitServerUnauthorizedException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace