Revit 2027 API
RPCNode Class
 This class represents an RPC content in a model-exporting process.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ContentNode
 Autodesk.Revit.DB.RPCNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RPCNode : ContentNode
Public Class RPCNode
	Inherits ContentNode
public ref class RPCNode : public ContentNode
type RPCNode =
    class
        inherit ContentNode
    end
The RPCNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 See also: OnRPC(RPCNode).
See Also
Reference
Autodesk.Revit.DB Namespace