Revit 2027 API
EnergyAnalysisOpening Methods
The EnergyAnalysisOpening type exposes the following members.
Methods
Name | Description
GetAnalyticalSurface |  Gets the associative analytical parent surface element.
GetConstruction |  Gets the analytic construction this opening is associated with. Null when this opening is a window.
GetPolyloops |  Gets the collection of planar polygons describing the opening geometry.
GetWindowType |  Gets the analytic window type this opening is associated with. Null when this opening is not a window.
Top
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace