Revit 2027 API
ParameterSet Methods
The ParameterSet type exposes the following members.
Methods
Name | Description
Clear | Removes every parameter from the set, rendering it empty.
Contains | Tests for the existence of a parameter within the set.
Erase | Removes a specified parameter from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified parameter into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
ParameterSet Class
Autodesk.Revit.DB Namespace