Revit 2027 API
MultiSegmentGrid Properties
The MultiSegmentGrid type exposes the following members.
Properties
Name | Description
Text |  name shared by grids in this MultiSegmentGrid
Top
See Also
Reference
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace