Revit 2027 API
PostEventArgs Properties
The PostEventArgs type exposes the following members.
Properties
Name | Description
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
Top
See Also
Reference
PostEventArgs Class
Autodesk.Revit.DB.Events Namespace