Revit 2027 API
AreaLoad Methods
The AreaLoad type exposes the following members.
Methods
Name | Description
AreCurveLoopsValid |  Checks if curve loops are valid for creating an area load.
Create(Document, ElementId, XYZ, AreaLoadType) |  Creates a new hosted area load within the project.
Create(Document, ElementId, IList<CurveLoop>, XYZ, AreaLoadType) |  Creates a new custom area load within the project.
Create(Document, ElementId, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType) |  Creates a new custom area load within the project.
GetLoops |  Returns curve loops that define geometry of the area load.
GetRefPoint |  Returns the physical location of the reference point.
IsCurveLoopsInsideHostBoundaries |  Checks if contour loops is inside host boundaries.
IsValidHostId |  Indicates if the provided host id can host area loads.
SetLoops |  Sets curve loops that define geometry of the area load.
Top
See Also
Reference
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace