Revit 2027 API
DocumentSavedAsEventArgs Properties
The DocumentSavedAsEventArgs type exposes the following members.
Properties
Name | Description
IsSavingAsCentralFile |  Indicates whether the document is to be saved as central file.
OriginalPath |  Original path of the document.
Top
See Also
Reference
DocumentSavedAsEventArgs Class
Autodesk.Revit.DB.Events Namespace