Revit 2027 API
CreateRelatedFileProgressChangedEventArgs Properties
The CreateRelatedFileProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
CreatingCloudSharedLocal |  Indicates if it is creating cloud shared local model.
DownloadFinished |  Indicates if all data downloads are finished.
FullDownload |  Indicates if download the full data of the document, which will take longer than subsequent downloads.
Top
See Also
Reference
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace