Revit 2027 API
SchemaException Class
The exception thrown when Revit cannot interpret a data structure described by a schema.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.SchemaException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class SchemaException : InvalidOperationException
<SerializableAttribute>
Public Class SchemaException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class SchemaException : public InvalidOperationException
[<SerializableAttribute>]
type SchemaException =
    class
        inherit InvalidOperationException
    end
The SchemaException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace