Revit 2027 API
ElementWorksetFilter Class
 A filter used to match elements which reside in a given workset.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementWorksetFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementWorksetFilter : ElementQuickFilter
Public Class ElementWorksetFilter
	Inherits ElementQuickFilter
public ref class ElementWorksetFilter : public ElementQuickFilter
type ElementWorksetFilter =
    class
        inherit ElementQuickFilter
    end
The ElementWorksetFilter type exposes the following members.
Constructors
Name | Description
ElementWorksetFilter(WorksetId) |  Constructs a new instance of a filter to match elements in a given workset.
ElementWorksetFilter(WorksetId, Boolean) |  Constructs a new instance of a filter to match elements in a given workset.
Top
Properties
Name | Description
WorksetId |  The workset id.
Top
Methods
Name | Description
Top
Remarks
 This filter is a quick filter.
Example
public void WorksetElements(Document doc, Workset workset)
{
    // filter all elements that belong to the given workset
    FilteredElementCollector elementCollector = new FilteredElementCollector(doc);
    ElementWorksetFilter elementWorksetFilter = new ElementWorksetFilter(workset.Id);
    ICollection<Element> worksetElemsfounds = elementCollector.WherePasses(elementWorksetFilter).ToElements();
    // how many elements were found?
    int elementsCount = worksetElemsfounds.Count;
    String message = "Element count : " + elementsCount;
    // Get name and/or Id of the elements that pass the given filter and show a few of them
    int count = 5;  // show info for 5 elements only
    foreach (Element ele in worksetElemsfounds)
    {
        if (null != ele)
        {
           message += "\nElementId : " + ele.Id;
           message += ", Element Name : " + ele.Name;
          if (0 == --count)
              break;
        }
    }
    Autodesk.Revit.UI.TaskDialog.Show("ElementsOfWorkset", message);
}
See Also
Reference
Autodesk.Revit.DB Namespace