Revit 2027 API
StructuralSectionISplitSlopedFlange Class
 Defines parameters for I-split Sloped Flange structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionISplitSlopedFlange : StructuralSectionGeneralT
Public Class StructuralSectionISplitSlopedFlange
	Inherits StructuralSectionGeneralT
public ref class StructuralSectionISplitSlopedFlange : public StructuralSectionGeneralT
type StructuralSectionISplitSlopedFlange =
    class
        inherit StructuralSectionGeneralT
    end
The StructuralSectionISplitSlopedFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionISplitSlopedFlange |  Creates a new instance of Structural Section I Split Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace