Revit 2027 API
IIFCImporterServer Interface
 Interface for external servers implementing IFC import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IIFCImporterServer : IExternalServer
Public Interface IIFCImporterServer
	Inherits IExternalServer
public interface class IIFCImporterServer : IExternalServer
type IIFCImporterServer =
    interface
        interface IExternalServer
    end
The IIFCImporterServer type exposes the following members.
Methods
Name | Description
ImportIFC |  The method that Revit will invoke to perform an import from IFC.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace