Revit 2027 API
RevitServerCommunicationException Class
The exception that is thrown when there is any network communication error happening.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerCommunicationException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerCommunicationException : RevitServerException
<SerializableAttribute>
Public Class RevitServerCommunicationException
	Inherits RevitServerException
[SerializableAttribute]
public ref class RevitServerCommunicationException : public RevitServerException
[<SerializableAttribute>]
type RevitServerCommunicationException =
    class
        inherit RevitServerException
    end
The RevitServerCommunicationException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace