Revit 2027 API
ExtendedParameterElement Properties
The ExtendedParameterElement type exposes the following members.
Properties
Name | Description
LinkId |  The ID of the [!:Autodesk::Revit::DB::ExternalData::ExtendedPropertiesLink] to which this extended property belongs.
Top
See Also
Reference
ExtendedParameterElement Class
Autodesk.Revit.DB.ExternalData Namespace