Revit 2027 API
LogicalOrFilter Class
 A filter that contains a set of filters. The filter passes when any filter in the set passes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementLogicalFilter
 Autodesk.Revit.DB.LogicalOrFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LogicalOrFilter : ElementLogicalFilter
Public Class LogicalOrFilter
	Inherits ElementLogicalFilter
public ref class LogicalOrFilter : public ElementLogicalFilter
type LogicalOrFilter =
    class
        inherit ElementLogicalFilter
    end
The LogicalOrFilter type exposes the following members.
Constructors
Name | Description
LogicalOrFilter(IList<ElementFilter>) |  Constructs a new instance of the logical filter with any number of input filters.
LogicalOrFilter(ElementFilter, ElementFilter) |  Constructs a new instance of the logical filter with two input filters.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.
See Also
Reference
Autodesk.Revit.DB Namespace