Revit 2027 API
EnergyAnalysisMaterial Class
 A description of a material with thermal properties in a composite construction.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyAnalysisMaterial : Element
Public Class EnergyAnalysisMaterial
	Inherits Element
public ref class EnergyAnalysisMaterial : public Element
type EnergyAnalysisMaterial =
    class
        inherit Element
    end
The EnergyAnalysisMaterial type exposes the following members.
Properties
Name | Description
Density |  The density of the material, in kg/(ft^3).
Description |  The description of the material.
MaterialName |  The name of the material.
SpecificHeatCapacity |  The specific heat capacity of the material, in ft^2/(k*s^2).
ThermalConductivity |  The thermal conductivity of the material, kg*ft/(k*s^3).
ThermalResistance |  The thermal resistance (R-value) of the material, in m^2*K/W (eqivelent to K*s^3/kg).
Thickness |  The thickness of the material, in ft.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace