Revit 2027 API
RebarHookType Methods
The RebarHookType type exposes the following members.
Methods
Name | Description
Create |  Creates a new RebarHookType in a document.
CreateDefaultRebarHookType |  Creates a new RebarHookType object with a default name.
GetDefaultHookExtension |  Computes the default hook length, which is equal to barDiameter * multiplier.
GetHookExtensionLength |  Computes the hook extension length based on current hook length
IsOffsetLengthRequired |  Check whether hook offset length is required. remarks: If hook angle is no more than 90 degree, hook offset length is not meaningful. returns: True if hook offset length is required, otherwise false.
Top
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace