Revit 2027 API
CategoryNameMap Methods
The CategoryNameMap type exposes the following members.
Methods
Name | Description
Clear | Removes every category from the map, rendering it empty.
Contains | Tests for the existence of a category with that name within the map.
Erase | Removes a category with the specified name from the map.
ForwardIterator | Retrieve a forward moving iterator to the map.
GetEnumerator | Retrieve a forward moving iterator to the map.
Insert | Insert the specified category with the specified name into the map.
ReverseIterator | Retrieve a backward moving iterator to the map.
Top
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace