Revit 2027 API
AssetPropertyDoubleMatrix44 Properties
The AssetPropertyDoubleMatrix44 type exposes the following members.
Properties
Name | Description
Value | Get the value of the property
Top
See Also
Reference
AssetPropertyDoubleMatrix44 Class
Autodesk.Revit.DB.Visual Namespace