Revit 2027 API
TaskDialog Properties
The TaskDialog type exposes the following members.
Properties
Name | Description
AllowCancellation |  Whether the task dialog can be cancelled if no cancel button is specified.
CommonButtons |  The push buttons displayed in the task dialog.
DefaultButton |  The default button for the dialog.
EnableMarqueeProgressBar |  Enables a marquee style progress bar to be displayed in the TaskDialog.
ExpandedContent |  ExpandedContent is hidden by default and will display at the bottom of the task dialog when the "Show details" button is pressed.
ExtraCheckBoxText |  ExtraCheckBoxText is used to label the extra checkbox.
FooterText |  FooterText is used in the footer area of the task dialog.
Id |  The Id of the task dialog.
MainContent |  MainContent is the smaller text that appears just below the main instructions.
MainIcon |  The icon shown in the task dialog.
MainInstruction |  The large primary text that appears at the top of a task dialog.
Title |  Title of the task dialog.
TitleAutoPrefix |  Whether the TaskDialog's title will automatically have the add-in name added as a prefix.
VerificationText |  VerificationText is used to label the verification checkbox.
Top
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace