Revit 2027 API
MEPAnalyticalConnectionType Class
 Represents an analytical connection type between mechanical equipment and piping network.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.MEPAnalyticalConnectionType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPAnalyticalConnectionType : ElementType
Public Class MEPAnalyticalConnectionType
	Inherits ElementType
public ref class MEPAnalyticalConnectionType : public ElementType
type MEPAnalyticalConnectionType =
    class
        inherit ElementType
    end
The MEPAnalyticalConnectionType type exposes the following members.
Properties
Name | Description
PressureLoss |  The pressure loss of this analytical connection type.
Top
Methods
Name | Description
Create |  Creates an analytical connection type element.
FindTypeByName |  Finds the analytical connection type by its name.
IsNameUnused |  Checks if this is an unused name.
Top
See Also
Reference
Autodesk.Revit.DB Namespace