Revit 2027 API
RebarInSystem Methods
The RebarInSystem type exposes the following members.
Methods
Name | Description
CanApplyPresentationMode |  Checks if a presentation mode can be applied for this rebar in the given view.
CanEditIndividualBars |  Checks if individual bars can be moved, excluded or included.
ClearPresentationMode |  Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
DoesBarExistAtPosition |  Checks whether a bar is included at the specified position.
FindMatchingPredefinedPresentationMode |  Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetBarIndexFromReference |  Given a reference that represents a part of a bar, this method will return the bar index.
GetBarPositionTransform |  Return a transform representing the relative position of any individual bar in the set.
GetBendData |  Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves |  A chain of curves representing the centerline of the rebar.
GetDistributionPath |  The distribution path of a rebar set.
GetHookTypeId |  Get the id of the RebarHookType to be applied to the rebar.
GetHostId |  The element that contains the rebar.
GetMovedBarTransform |  Returns a transform representing the movement of the bar relative to its default position along the distribution path.
GetPresentationMode |  Gets the presentaion mode for this rebar set when displayed in the given view.
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetTransformedCenterlineCurves |  A chain of curves representing the centerline of the rebar.
HasPresentationOverrides |  Identifies if this RebarInSystem has overridden default presentation settings for the given view.
IsBarHidden |  Identifies if a given bar in this rebar set is hidden in this view.
IsRebarInSection |  Identifies if this RebarInSystem is cut by the view plane of the given view.
IsUnobscuredInView |  Checks if this rebar element is shown unobscured in a view.
MoveBarInSet |  This method applies the transformation matrix to the rebar bar at the desired position in the rebar set. If the bar was already moved, the method will concatenate the transformation matrix with the existing movement.
ResetMovedBarTransform |  Reset the transformation representing the movement of the bar relative to its default position along the distribution path. The moved bar transform will be set to Identity.
SetBarHiddenStatus |  Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetBarIncluded |  Sets if the bar at the desired index is included or not.
SetPresentationMode |  Sets the presentation mode for this rebar set when displayed in the given view.
SetUnobscuredInView |  Sets RebarInSystem element to be shown unobscured in a view.
Top
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace