Revit 2027 API
ExternalDataManagerDataItemId Methods
The ExternalDataManagerDataItemId type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExternalDataManagerDataItemId Class
Autodesk.Revit.UI Namespace