Revit 2027 API
PanelScheduleTemplate Methods
The PanelScheduleTemplate type exposes the following members.
Methods
Name | Description
CopyFrom |  Copies all values from other element to this object.
Create |  Creates a new instance of a panel schedule template.
GetPanelScheduleType |  Returns the panel schedule type.
GetSectionData |  Gets the writable section data object.
GetTableData |  Gets the writable table data object.
HasSameType |  Checks if given template has the same panel schedule type with this template.
IsValidPanelConfiguration |  Checks if given panel configuration is valid for given panel schedule type.
IsValidType(PanelScheduleType) |  Checks if given type is valid for this panel schedule template element.
SetTableData |  Assigns table data to this template
Top
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace