Revit 2027 API
RebarContainerParameterManager Class
 Provides implementation of RebarContainer parameters overrides.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarContainerParameterManager
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarContainerParameterManager : IDisposable
Public Class RebarContainerParameterManager
	Implements IDisposable
public ref class RebarContainerParameterManager : IDisposable
type RebarContainerParameterManager =
    class
        interface IDisposable
    end
The RebarContainerParameterManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddOverride(ElementId, ElementId) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddOverride(ElementId, Double) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddOverride(ElementId, Int32) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddOverride(ElementId, String) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddSharedParameterAsOverride |  Adds a shared parameter as one of the parameter overrides stored by this Rebar Container element.
ClearOverrides |  Clears any overridden values from all parameters of the associated RebarContainer element.
Dispose | Releases all resources used by the RebarContainerParameterManager
GetDoubleOverrideValue |  Get the double value for an overriden parameter.
GetElementIdOverrideValue |  Get the ElementId value for an overriden parameter.
GetIntOverrideValue |  Get the integer value for an overriden parameter.
GetStringOverrideValue |  Get the string value for an overriden parameter.
IsOverriddenParameterModifiable |  Checks if overridden parameter is modifiable.
IsParameterOverridden |  Checks if the parameter has an override
IsRebarContainerParameter |  Checks if the parameter is a Rebar Container parameter
RemoveOverride |  Removes an overridden value from the given parameter.
SetOverriddenParameterModifiable |  Sets this overridden parameter to be modifiable.
SetOverriddenParameterReadonly |  Sets this overridden parameter to be readonly.
Top
Remarks
 When a new override is created, by default, the parameter will show the overridden value as read-only. You can control whether or not the parameter is modifiable using SetOverriddenParameterReadonly(ElementId) and SetOverriddenParameterModifiable(ElementId).a
See Also
Reference
Autodesk.Revit.DB.Structure Namespace