Revit 2027 API
ForbiddenForDynamicUpdateException Methods
The ForbiddenForDynamicUpdateException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ForbiddenForDynamicUpdateException Class
Autodesk.Revit.Exceptions Namespace