Revit 2027 API
ExportLineweightTableIterator Methods
The ExportLineweightTableIterator type exposes the following members.
Methods
Name | Description
Dispose
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
ExportLineweightTableIterator Class
Autodesk.Revit.DB Namespace