Revit 2027 API
CriticalPathCollector Class
 This class is used to search and traverse the network analytical segments on the critical path.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.CriticalPathCollector
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CriticalPathCollector : IEnumerable<MEPNetworkSegmentId>,
	IDisposable
Public Class CriticalPathCollector
	Implements IEnumerable(Of MEPNetworkSegmentId), IDisposable
public ref class CriticalPathCollector : IEnumerable<MEPNetworkSegmentId^>,
	IDisposable
type CriticalPathCollector =
    class
        interface IEnumerable<MEPNetworkSegmentId>
        interface IDisposable
    end
The CriticalPathCollector type exposes the following members.
Constructors
Name | Description
CriticalPathCollector |  Creates a new CriticalPathCollector that visits the analytical segments on the network critical path.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CriticalPathCollector
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetCalculatedFlow |  Gets the calculated flow of the network.
GetCalculatedPressureDrop |  Gets the calculated pressure drop of the network.
GetCriticalPathCollectorIterator |  Gets the critical path iterator to traverse individual segment.
GetEnumerator | Returns an enumerator that iterates through a collection.
ToNetworkSegmentIds |  Returns the list of analytical segment ids on the network critical path.
Top
Remarks
 The critcal path is a connected flow path that has the maximum pressure loss value on the network. The associated flow and pressure loss values are often used to select the equipment size. When this collector is constructed, the network is identified by one analytical segment seed. User may get the CriticalPathIterator from the collector to traverse the analytical segment on the critical path, in the sequence of their flow direction. Note that If the network contains multiple hydraulically separated levels, the critical path traversal is focused on the same hydraulic separation level as the seed segment.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace