Revit 2027 API
ExportDWGSettings Class
 This element contains DWG/DXF export settings which are saved in a Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ExportDWGSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportDWGSettings : Element
Public Class ExportDWGSettings
	Inherits Element
public ref class ExportDWGSettings : public Element
type ExportDWGSettings =
    class
        inherit Element
    end
The ExportDWGSettings type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create(Document, String) |  Create a DWG export settings with default values.
Create(Document, String, DWGExportOptions) |  Create a DWG export settings with default values.
Create(Document, String, DXFExportOptions) |  Create a DWG export settings with default values.
FindByName |  Returns the pre-defined non-in-session exporting settings for DWG in the given document with the specified name.
GetActivePredefinedSettings |  Returns the active pre-defined non-in-session exporting settings for DWG in the given document.
GetDWGExportOptions |  Gets the options stored in the these settings.
GetDXFExportOptions |  Gets the options stored in the these settings.
ListNames |  Returns a list of names of dwg/dxf export settings.
SetDWGExportOptions |  Sets the options stored in these settings.
SetDXFExportOptions |  Sets the options stored in these settings.
Top
See Also
Reference
Autodesk.Revit.DB Namespace