Revit 2027 API
CurtainSystem Methods
The CurtainSystem type exposes the following members.
Methods
Name | Description
AddCurtainGrid | Add CurtainGrid on the specified face for the CurtainSystem.
RemoveCurtainGrid | Remove CurtainGrid from the specified face for the CurtainSystem.
Top
See Also
Reference
CurtainSystem Class
Autodesk.Revit.DB Namespace