Revit 2027 API
PushButtonData Class
This class contains information necessary to construct a push button in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PushButtonData
 Autodesk.Revit.UI.ToggleButtonData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PushButtonData : ButtonData
Public Class PushButtonData
	Inherits ButtonData
public ref class PushButtonData : public ButtonData
type PushButtonData =
    class
        inherit ButtonData
    end
The PushButtonData type exposes the following members.
Constructors
Name | Description
PushButtonData | Constructs a new instance of PushButtonData.
Top
Properties
Name | Description
AssemblyName | The assembly path of the button.
AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button.
ClassName | The name of the class containing the implementation for the command.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace