Revit 2027 API
FamilySymbol Class
 An element that represents a single type with a Family.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilySymbol : InsertableObject
Public Class FamilySymbol
	Inherits InsertableObject
public ref class FamilySymbol : public InsertableObject
type FamilySymbol =
    class
        inherit InsertableObject
    end
The FamilySymbol type exposes the following members.
Properties
Name | Description
Family |  The Family object to which the symbol belongs.
IsActive |  Identifies whether the symbol is active.
Origin |  The point in the symbol's space corresponding to the insertion point/origin as seen from outside the symbol.
StructuralMaterialType | This property returns the physical material from which the type is made.
Top
Methods
Name | Description
Activate |  Activates the symbol to ensure that its geometry is accessible.
CanHaveStructuralSection |  Identifies if this FamilySymbol can have a structural section.
GetFamilyPointLocations | Returns the Point Locations for the Family Symbol.
GetStructuralSection |  Gets the structural section from element.
GetThermalProperties |  Gets the thermal properties for the given FamilySymbol.
HasThermalProperties |  Identifies if this FamilySymbol can include thermal properties.
SetStructuralSection |  Sets the structural section in element.
SetThermalProperties |  Sets the thermal properties for the given FamilySymbol.
Top
Remarks
 Custom families within the Revit API represented by three objects - Family, FamilySymbol and FamilyInstance. Each object plays a significant part in the structure of families. The Family element represents the entire family that consists of a collection of types, such as an 'I Beam'. You can think of that object as representing the entire family file. The Family object contains a number of FamilySymbol elements. The FamilySymbol object represents a specific set of family settings within that Family and represents what is known in the Revit user interface as a Type, such as 'W14x32'. The FamilyInstance object represents an actual instance of that type placed the Autodesk Revit project. For example the FamilyInstance would be a single instance of a W14x32 column within the project.
Example
public void GetInfo_FamilySymbol(FamilySymbol familySymbol)
{
    string message;
    // Get FamilySymbol family name
    message = "Family name is : " + familySymbol.Family.Name;
    // Get FamilySymbol material
    message += "\nFamilySymbol materials are :";
    foreach (ElementId matid in familySymbol.GetMaterialIds(true))
    {
       Material material = familySymbol.Document.GetElement(matid) as Material;
       if (null != material)
       {
          message += "\n" + material.Name;
       }
    }
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.AnnotationSymbolType
 Autodesk.Revit.DB.Architecture.RoomTagType
 Autodesk.Revit.DB.AreaTagType
 Autodesk.Revit.DB.Mechanical.SpaceTagType
 Autodesk.Revit.DB.MullionType
 Autodesk.Revit.DB.PanelType
 Autodesk.Revit.DB.Structure.TrussType