Revit 2027 API
RebarContainerIterator Class
 An iterator to a Rebar Container.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarContainerIterator
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarContainerIterator : IEnumerator<RebarContainerItem>
Public Class RebarContainerIterator
	Implements IEnumerator(Of RebarContainerItem)
public ref class RebarContainerIterator : IEnumerator<RebarContainerItem^>
type RebarContainerIterator =
    class
        interface IEnumerator<RebarContainerItem>
    end
The RebarContainerIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarContainerIterator
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace