Revit 2027 API
FilterIntegerRule Class
 A filter rule that operates on integer values in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterIntegerRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterIntegerRule : FilterNumericValueRule
Public Class FilterIntegerRule
	Inherits FilterNumericValueRule
public ref class FilterIntegerRule : public FilterNumericValueRule
type FilterIntegerRule =
    class
        inherit FilterNumericValueRule
    end
The FilterIntegerRule type exposes the following members.
Constructors
Name | Description
FilterIntegerRule |  Constructs an instance of FilterIntegerRule.
Top
Properties
Name | Description
RuleValue |  The user-supplied value against which values from a Revit document will be tested.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace