Revit 2027 API
IPipePlumbingFixtureFlowServer Methods
The IPipePlumbingFixtureFlowServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the pipe plumbing fixture flow.
GetHtmlDescription |  The method that Revit will invoke to get an HTML formatted description of the server.
GetInformationLink |  The method that Revit will invoke to obtain a URL address which provides more information about the server.
Top
See Also
Reference
IPipePlumbingFixtureFlowServer Interface
Autodesk.Revit.DB.Plumbing Namespace