Revit 2027 API
FilterValueRule Class
 A rule that filters on a particular value of an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterStringRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterValueRule : FilterRule
Public Class FilterValueRule
	Inherits FilterRule
public ref class FilterValueRule : public FilterRule
type FilterValueRule =
    class
        inherit FilterRule
    end
The FilterValueRule type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace