Revit 2027 API
HVACLoadSpaceType Properties
The HVACLoadSpaceType type exposes the following members.
Properties
Name | Description
IsPlenum |  True if the space type is plenum.
SpaceTypeName |  The space type name.
Top
See Also
Reference
HVACLoadSpaceType Class
Autodesk.Revit.DB.Analysis Namespace