Revit 2027 API
RebarHandlePositionData Methods
The RebarHandlePositionData type exposes the following members.
Methods
Name | Description
Dispose
GetBarGeometry |  Returns the geometry for a bar at the specified index currently in the Rebar.
GetDistributionPath |  Gets the distribution path currently stored in the rebar.
GetNumberOfBars |  Gets the number of bars currently in the rebar.
GetRebarElement |  Gets the rebar element that will be updated by the server.
GetView |  Gets the view in which the handles position should be computed.
SetPosition |  Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully.
Top
See Also
Reference
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace