Revit 2027 API
DocumentSet Properties
The DocumentSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
See Also
Reference
DocumentSet Class
Autodesk.Revit.DB Namespace