Revit 2027 API
Arc Properties
The Arc type exposes the following members.
Properties
Name | Description
Center | Returns the center of the arc.
Normal | Returns the normal to the plane in which the arc is defined.
Radius | Returns the radius of the arc.
XDirection | Returns the X direction.
YDirection | Returns the Y direction.
Top
See Also
Reference
Arc Class
Autodesk.Revit.DB Namespace