Revit 2027 API
LayoutRuleFixedDistance Class
This class indicate the layout rule of a Beam System is Fixed-Distance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleFixedDistance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LayoutRuleFixedDistance : LayoutRule
Public Class LayoutRuleFixedDistance
	Inherits LayoutRule
public ref class LayoutRuleFixedDistance : public LayoutRule
type LayoutRuleFixedDistance =
    class
        inherit LayoutRule
    end
The LayoutRuleFixedDistance type exposes the following members.
Constructors
Name | Description
LayoutRuleFixedDistance | Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Top
Properties
Name | Description
JustifyType | Get or set the type of justification.
Spacing | Get or set spacing of the Beam System.
Top
Methods
Name | Description
Top
Remarks
To use this type of LayoutRule, the distance between the beams and the justify-type must be set.
Example
private bool LayoutRuleFixedDistanceInformation(BeamSystem beamSystem)
{
    //get the layoutRule of the beamsystem
    Autodesk.Revit.DB.LayoutRule layoutRule = beamSystem.LayoutRule;
    string message = "BeamSystem layout rule : " + layoutRule;
    //create a new instance of the LayoutRuleClearSpacing class
    LayoutRuleFixedDistance myLayoutRuleFixedDistance =
                new LayoutRuleFixedDistance(10.0, BeamSystemJustifyType.End);
    //set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleFixedDistance;
    LayoutRuleFixedDistance fixedDistance = beamSystem.LayoutRule as LayoutRuleFixedDistance;
    if (null == fixedDistance)
    {
        return false;
    }
    //try to get the property value of the beamsystem LayoutRule
    BeamSystemJustifyType justifyType = fixedDistance.JustifyType;
    double spacing = fixedDistance.Spacing;
    message += "\nNew BeamSystem layout rule: " + fixedDistance;
    message += "\nNew BeamSystem spacing: " + spacing;
    message += "\nNew BeamSystem justification: " + justifyType;
    TaskDialog.Show("Revit",message);
    return true;
}
See Also
Reference
Autodesk.Revit.DB Namespace