Revit 2027 API
PipeSegment Class
 The PipeSegment class represents an instance of pipe segment which has the design data for routing preference.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Segment
 Autodesk.Revit.DB.Plumbing.PipeSegment
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeSegment : Segment
Public Class PipeSegment
	Inherits Segment
public ref class PipeSegment : public Segment
type PipeSegment =
    class
        inherit Segment
    end
The PipeSegment type exposes the following members.
Properties
Name | Description
ScheduleTypeId |  The ElementId of the PipeScheduleType.
Top
Methods
Name | Description
Create |  Creates a new instance of a PipeSegment and adds it to the document.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace