Revit 2027 API
Truss Methods
The Truss type exposes the following members.
Methods
Name | Description
AttachChord | Attach a truss's specific chord to a specified element, the element should be a roof or floor.
Create |  Creates a new Truss.
DetachChord | Detach a truss's specific chord from the element to which it is attached.
DropTruss | Drop truss Family, it will disassociate all members from the truss and delete the truss.
GetTrussMemberInfo | Query if a given element is a member of a truss, its lock status and its usage, etc.
RemoveProfile | Remove the profile of a truss.
SetProfile | Add or modify the profile of a truss.
TogglePinMember | Pin/Unpin a truss member.
Top
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace