Revit 2027 API
ApplicationInitializedEventArgs Class
 The event arguments used by the ApplicationLaunched event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.ApplicationInitializedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ApplicationInitializedEventArgs : RevitAPISingleEventArgs
Public Class ApplicationInitializedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class ApplicationInitializedEventArgs : public RevitAPISingleEventArgs
type ApplicationInitializedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The ApplicationInitializedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace