Revit 2027 API
ExtrusionRoof Methods
The ExtrusionRoof type exposes the following members.
Methods
Name | Description
GetProfile | Retrieve the Profile of ExtrusionRoof.
Top
See Also
Reference
ExtrusionRoof Class
Autodesk.Revit.DB Namespace