Revit 2027 API
InternalDefinitions Class
This object blocks attempts to create new internal definitions as they are not permitted.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Definitions
 Autodesk.Revit.DB.InternalDefinitions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InternalDefinitions : Definitions
Public Class InternalDefinitions
	Inherits Definitions
public ref class InternalDefinitions : public Definitions
type InternalDefinitions =
    class
        inherit Definitions
    end
The InternalDefinitions type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace