Revit 2027 API
FilterNumericValueRule Class
 Base for all classes that use a FilterNumericRuleEvaluator to perform their comparisons
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterDoubleRule
 Autodesk.Revit.DB.FilterElementIdRule
 Autodesk.Revit.DB.FilterGlobalParameterAssociationRule
 Autodesk.Revit.DB.FilterIntegerRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterNumericValueRule : FilterValueRule
Public Class FilterNumericValueRule
	Inherits FilterValueRule
public ref class FilterNumericValueRule : public FilterValueRule
type FilterNumericValueRule =
    class
        inherit FilterValueRule
    end
The FilterNumericValueRule type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetEvaluator |  Gets the evaluator that implements the test for this rule.
SetEvaluator |  Sets the evaluator that implements the test for this rule.
Top
See Also
Reference
Autodesk.Revit.DB Namespace