Revit 2027 API
PrintManager Methods
The PrintManager type exposes the following members.
Methods
Name | Description
Apply |  Apply the local print settings to global for all documents.
SelectNewPrintDriver |  Select a new printer.
SubmitPrint() |  Print the views and sheets defined in the current local PrintManager settings.
SubmitPrint(View) |  Print a view with the current PrintManager settings.
Top
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace