Revit 2027 API
Profile Methods
The Profile type exposes the following members.
Methods
Name | Description
Clone | Returns a copy of this profile.
Top
See Also
Reference
Profile Class
Autodesk.Revit.DB Namespace