Revit 2027 API
DocumentSaveToLocalProgressChangedEventArgs Class
 The event arguments used during the save to local phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSaveToLocalProgressChangedEventArgs : WorksharedOperationProgressChangedEventArgs
Public Class DocumentSaveToLocalProgressChangedEventArgs
	Inherits WorksharedOperationProgressChangedEventArgs
public ref class DocumentSaveToLocalProgressChangedEventArgs : public WorksharedOperationProgressChangedEventArgs
type DocumentSaveToLocalProgressChangedEventArgs =
    class
        inherit WorksharedOperationProgressChangedEventArgs
    end
The DocumentSaveToLocalProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
BeforeSaveToCentral |  True if the "save to local" operation is occurring before "save to central"; false if after.
FinishedStreams |  The number of streams finished since the last time this event was raised.
SaveToLocalFinished |  Indicates if the current "save to local" operation has finished.
TotalStreams |  The total expected number of streams to save to local.
Top
Methods
Name | Description
Top
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time. Name correction - it is renamed from 'DocumentSaveToLocalProgessChangedEventArgs' released since 2017 Subscription Update.
See Also
Reference
Autodesk.Revit.DB.Events Namespace