Revit 2027 API
LevelAssociationData Methods
The LevelAssociationData type exposes the following members.
Methods
Name | Description
Dispose
GetAssociatedLevel |  Returns the Associated Level id.
GetLevelAssociationData |  Returns LevelAssociationData associated with this element, if it exists.
GetLevelOffset |  Returns the offset from the Associated Level.
SetAssociatedLevel |  Sets the Associated Level.
Top
See Also
Reference
LevelAssociationData Class
Autodesk.Revit.DB Namespace