Revit 2027 API
AssetPropertyDouble Properties
The AssetPropertyDouble type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
See Also
Reference
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace