Revit 2027 API
StructuralSectionIWelded Properties
The StructuralSectionIWelded type exposes the following members.
Properties
Name | Description
BottomFlangeThickness |  Bottom Flange Thickness.
BottomFlangeWidth |  Bottom Flange Width.
TopFlangeThickness |  Top Flange Thickness.
TopFlangeWidth |  Top Flange Width.
WebHeight |  Web Height.
WebThickness |  Web Thickness.
Top
See Also
Reference
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace