Revit 2027 API
RebarSplice Class
 A class that can used to access the data between two connected Rebars.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarSplice
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarSplice : IDisposable
Public Class RebarSplice
	Implements IDisposable
public ref class RebarSplice : IDisposable
type RebarSplice =
    class
        interface IDisposable
    end
The RebarSplice type exposes the following members.
Properties
Name | Description
ConnectedRebarEnd |  Identifies the end of the connected rebar which is part of this splice - 0 for start, 1 for end.
ConnectedRebarId |  Identifies the connected rebar id of this rebar splice object.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SourceRebarEnd |  Identifies the end of the source rebar which is part of this rebar splice - 0 for start, 1 for end. The source rebar is the one from which this rebar splice was obtained.
SourceRebarId |  Identifies the source of the target rebar which is part of this rebar splice. The source rebar is the one from which this rebar splice was obtained.
SplicePosition |  Identifies the splice position.
SpliceTypeId |  Identifies the id of the Rebar Splice Type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarSplice
GetRebarSpliceGeometry |  Gets the RebarSpliceGeometry.
MoveRebarSpliceGeometry |  Moves the RebarSpliceGeometry with the specified vector.
RotateRebarSpliceGeometry |  Rotates the RebarSpliceGeometry about the given axis and angle.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace