Revit 2027 API
HostObjAttributes Class
An object that represents characteristics of several kinds of type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HostObjAttributes : ElementType
Public Class HostObjAttributes
	Inherits ElementType
public ref class HostObjAttributes : public ElementType
type HostObjAttributes =
    class
        inherit ElementType
    end
The HostObjAttributes type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetCompoundStructure | Returns an object that represents the compound structure of the element.
SetCompoundStructure | Sets the compound structure of the element.
Top
Remarks
This object provides access to structural layering components for any object derived from it, such as wall types and floor types.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.BuildingPadType
 Autodesk.Revit.DB.CeilingType
 Autodesk.Revit.DB.CurtainSystemType
 Autodesk.Revit.DB.FloorType
 Autodesk.Revit.DB.HostedSweepType
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.RoofType
 Autodesk.Revit.DB.ToposolidType
 Autodesk.Revit.DB.WallFoundationType
 Autodesk.Revit.DB.WallType