Revit 2027 API
ScheduleFieldId Methods
The ScheduleFieldId type exposes the following members.
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the integer value of the id as hash code
(Overrides Object.GetHashCode())
ToString |  Gets a String representation of the integer value of the id.
(Overrides Object.ToString())
Top
See Also
Reference
ScheduleFieldId Class
Autodesk.Revit.DB Namespace