Revit 2027 API
RevitServerModelAlreadyExistsException Class
The exception that is thrown when there is a model with the same name already exist.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerModelAlreadyExistsException : RevitServerException
<SerializableAttribute>
Public Class RevitServerModelAlreadyExistsException
	Inherits RevitServerException
[SerializableAttribute]
public ref class RevitServerModelAlreadyExistsException : public RevitServerException
[<SerializableAttribute>]
type RevitServerModelAlreadyExistsException =
    class
        inherit RevitServerException
    end
The RevitServerModelAlreadyExistsException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace