Revit 2027 API
PickedBox Class
A class that contains two XYZ points representing the pick box on the screen.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Selection.PickedBox
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PickedBox
Public Class PickedBox
public ref class PickedBox
type PickedBox = class end
The PickedBox type exposes the following members.
Properties
Name | Description
Max | Maximum coordinates (upper-right-front corner of the pick box).
Min | Minimum coordinates (lower-left-rear corner of the pick box).
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Selection Namespace