Revit 2027 API
CentralModelException Methods
The CentralModelException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CentralModelException Class
Autodesk.Revit.Exceptions Namespace