Revit 2027 API
RebarShapeConstraintProjectedSegmentLength Class
 A constraint that measures the length of a segment as measured by projecting onto a direction that is not parallel to the segment.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintProjectedSegmentLength : RebarShapeConstraint
Public Class RebarShapeConstraintProjectedSegmentLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintProjectedSegmentLength : public RebarShapeConstraint
type RebarShapeConstraintProjectedSegmentLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintProjectedSegmentLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintProjectedSegmentLength |  Constructs a new instance of a RebarConstraintProjectEdgedLength object using a shape parameter, direction, and reference types.
Top
Properties
Name | Description
Direction |  A vector specifying the direction of the constraint. The direction is fixed, and the shape is always constructed so that the segment direction has a positive dot product with this vector.
TripleProductSign |  Sign of the z-coordinate of the cross product of the Direction property with the segment vector. TripleProductSign is 1 if the segment direction is to be on the left of the constraint direction, or -1 if the segment direction is to be on the right.
Top
Methods
Name | Description
GetSegmentEndReferenceType |  Choice of two possibilities for the start and end references of the length constraint.
Top
Remarks
 The constraint has two references, indexed by 0 and 1, that do not have to correspond to the start and end of the segment. The constraint also specifies a direction as a 2D vector, which is not necessarily parallel to the segment, but must point from the segment's start toward its end.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace