Revit 2027 API
Revision Methods
The Revision type exposes the following members.
Methods
Name | Description
CombineWithNext |  Combines the specified Revision with the next Revision.
CombineWithPrevious |  Combines the specified Revision with the previous Revision.
Create |  Creates a new Revision in the project.
GetAllRevisionIds |  Returns the ids of all Revisions in the project ordered by sequence number.
ReorderRevisionSequence |  Reorders the sequence of Revisions in the project.
Top
See Also
Reference
Revision Class
Autodesk.Revit.DB Namespace