Revit 2027 API
AnalyticalTransformerData Class
 Represents the data and parameters of analytical transformer node.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
 Autodesk.Revit.DB.Electrical.AnalyticalTransformerData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalTransformerData : AnalyticalPowerDistributableNodeData
Public Class AnalyticalTransformerData
	Inherits AnalyticalPowerDistributableNodeData
public ref class AnalyticalTransformerData : public AnalyticalPowerDistributableNodeData
type AnalyticalTransformerData =
    class
        inherit AnalyticalPowerDistributableNodeData
    end
The AnalyticalTransformerData type exposes the following members.
Properties
Name | Description
ApparentPowerRating |  The apparent power rating value of the analytical transformer.
SecondaryDistributionSystem |  The secondary distribution system of the analytical transformer.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace