Revit 2027 API
Solid Properties
The Solid type exposes the following members.
Properties
Name | Description
Edges | The edges that belong to the solid.
Faces | The faces that belong to the solid.
SurfaceArea | Returns the total surface area of this solid.
Volume | Returns the signed volume of this solid.
Top
See Also
Reference
Solid Class
Autodesk.Revit.DB Namespace