Revit 2027 API
AddInCommandBinding Class
 This object represents a binding between a Revit command and one or more handlers which override the behavior of the command in Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.AddInCommandBinding
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AddInCommandBinding
Public Class AddInCommandBinding
public ref class AddInCommandBinding
type AddInCommandBinding = class end
The AddInCommandBinding type exposes the following members.
Properties
Name | Description
RevitCommandId | The Revit command Id.
Top
Methods
Name | Description
Top
Events
Name | Description
BeforeExecuted | Occurs before the command associated with this AddInCommandBinding executes.
CanExecute | Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether the command can be executed on the command target.
Executed | Occurs when the command associated with this AddInCommandBinding executes.
Top
See Also
Reference
Autodesk.Revit.UI Namespace