Revit 2027 API
ContextMenu Class
 A class that owns context menu items.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ContextMenu
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ContextMenu : IDisposable
Public Class ContextMenu
	Implements IDisposable
public ref class ContextMenu : IDisposable
type ContextMenu =
    class
        interface IDisposable
    end
The ContextMenu type exposes the following members.
Constructors
Name | Description
ContextMenu |  Default constructor
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddItem |  Add an item to the Context Menu.
Dispose | Releases all resources used by the ContextMenu
Top
Remarks
 There are three types of menu items (CommandMenuItem, SubMenuItem, SeparatorItem) that can be added to a ContextMenu object.
See Also
Reference
Autodesk.Revit.UI Namespace