Revit 2027 API
NonContinuousRailStructure Class
 A class that represents a collection of Non-Continuous Rails being a part of Railing Type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.NonContinuousRailStructure
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NonContinuousRailStructure : IDisposable
Public Class NonContinuousRailStructure
	Implements IDisposable
public ref class NonContinuousRailStructure : IDisposable
type NonContinuousRailStructure =
    class
        interface IDisposable
    end
The NonContinuousRailStructure type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddNonContinuousRail |  Creates and appends a new Non-Continuous Rail to the Rail Structure. The new Non-Continuous Rail will have the given name, height and offset. It will have default profile and material ElementIds.
Dispose | Releases all resources used by the NonContinuousRailStructure
GetNonContinuousRail |  Gets the Non-Continuous Rail object of specified index from the Rail Structure.
GetNonContinuousRailCount |  Gets number of Non-Continuous Rails.
IsValidNonContinuousRailProfile |  Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
RemoveNonContinuousRail |  Removes Non-Continuous Rail from the Rail Structure.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace