Revit 2027 API
NonContinuousRailStructure Methods
The NonContinuousRailStructure type exposes the following members.
Methods
Name | Description
AddNonContinuousRail |  Creates and appends a new Non-Continuous Rail to the Rail Structure. The new Non-Continuous Rail will have the given name, height and offset. It will have default profile and material ElementIds.
Dispose
GetNonContinuousRail |  Gets the Non-Continuous Rail object of specified index from the Rail Structure.
GetNonContinuousRailCount |  Gets number of Non-Continuous Rails.
IsValidNonContinuousRailProfile |  Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
RemoveNonContinuousRail |  Removes Non-Continuous Rail from the Rail Structure.
Top
See Also
Reference
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace