Revit 2027 API
PropertyTableEntry Class
 Represents a table row in a table-driven PropertyLine element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PropertyTableEntry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PropertyTableEntry : IDisposable
Public Class PropertyTableEntry
	Implements IDisposable
public ref class PropertyTableEntry : IDisposable
type PropertyTableEntry =
    class
        interface IDisposable
    end
The PropertyTableEntry type exposes the following members.
Constructors
Name | Description
PropertyTableEntry |  Constructs a new copy of the input PropertyTable object.
Top
Properties
Name | Description
ArcDirection |  Represent the arc direction, PT_Left means the arc appears to the left of the line segment. Right means the arc appears to the right of the line segment.
Bearing |  The bearing angle value of the PropertyTableEntry
CurveType |  The curve type for this PropertyTableEntry
Distance |  The distance value of the PropertyTableEntry
Id |  Unique identifier for this PropertyTableEntry
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Radius |  The radius for arc type curve The radius value must be greater than half the length of the line segment. The larger the radius, the larger the circle becomes, resulting in a flatter arc.
Top
Methods
Name | Description
Create |  Creates a new PropertyTableEntry object.
Dispose | Releases all resources used by the PropertyTableEntry
IsValidPropertyTableEntry |  Function used to check the input data is valid to create PropertyTableEntry object
Top
See Also
Reference
Autodesk.Revit.DB Namespace