Revit 2027 API
ProgressChangedEventArgs Methods
The ProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Cancel |  Requests to cancel the progress bar's operation.
Top
See Also
Reference
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace