Revit 2027 API
DefaultOpenFromCloudCallback Methods
The DefaultOpenFromCloudCallback type exposes the following members.
Methods
Name | Description
Dispose
OnOpenConflict |  A method called when the conflict is happen during the model opening.
Top
See Also
Reference
DefaultOpenFromCloudCallback Class
Autodesk.Revit.DB Namespace