Revit 2027 API
BalusterPattern Methods
The BalusterPattern type exposes the following members.
Methods
Name | Description
Dispose
DuplicateBaluster |  Duplicates the baluster pointed by given index in the main baluster pattern.
GetBaluster |  Gets information about the given baluster from the main baluster pattern.
GetBalusterCount |  Gets the number of balusters in the main baluster pattern definition.
RemoveBaluster |  Removes a baluster from the main baluster pattern.
Top
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace