Revit 2027 API
ElementTypeDuplicatingEventArgs Class
 The event arguments used by the ElementTypeDuplicating event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementTypeDuplicatingEventArgs : RevitAPIPreDocEventArgs
Public Class ElementTypeDuplicatingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class ElementTypeDuplicatingEventArgs : public RevitAPIPreDocEventArgs
type ElementTypeDuplicatingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The ElementTypeDuplicatingEventArgs type exposes the following members.
Properties
Name | Description
ElementTypeId |  The id of the ElementType to be duplicated.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace