Revit 2027 API
CustomFieldData Class
 A class that offer access to the information about a custom field.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CustomFieldData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CustomFieldData : IDisposable
Public Class CustomFieldData
	Implements IDisposable
public ref class CustomFieldData : IDisposable
type CustomFieldData =
    class
        interface IDisposable
    end
The CustomFieldData type exposes the following members.
Properties
Name | Description
DefaultRowHeightOnSheet |  Identifies the default row height for this field.
FieldName |  The name of this custom field.
FieldTooltip |  The tooltip that will be shown in the schedule properties dialog for this custom field.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CustomFieldData
GetCustomFieldId |  Gets an unique identifier of the custom field.
GetCustomFieldProperties |  Gets an instance of ICustomFieldProperties which represents the properties of this field.
SetCustomFieldProperties |  Sets an instance of ICustomFieldProperties which represents the properties of this field.
ValidateCustomFieldProperties |  Validates the custom field properties.
Top
See Also
Reference
Autodesk.Revit.DB Namespace