Revit 2027 API
BoundaryConditions Properties
The BoundaryConditions type exposes the following members.
Properties
Name | Description
AssociatedLoadId |  The Id of the internal load element associated with a boundary conditions.
HostElementId |  The host element Id for the boundary conditions.
IsConstrainedOnHost |  The boundary conditions is constrained to host or not.
Point |  The position of point boundary conditions.
Preset |  The boundary conditions preset.
SketchId |  Sketch associated to this Revit element.
Top
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace