Revit 2027 API
ImageInstance Properties
The ImageInstance type exposes the following members.
Properties
Name | Description
CanHaveSnaps |  When true the ImageInstance has snaps that can be enabled with the EnableSnaps property
DrawLayer |  The layer the ImageInstance will be drawn in.
EnableSnaps |  When true the ImageInstance will have its snaps enabled, but only if CanHaveSnaps is true
Height |  The height of the ImageInstance.
HeightScale |  The factor applied to the ImageType to calculate the Height of the ImageInstance.
LockProportions |  When true the proportion of Width to Height will be maintained
Width |  The width of the ImageInstance.
WidthScale |  The factor applied to the width of the ImageType to calculate the Width of the ImageInstance.
Top
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace