Revit 2027 API
DataTransferProgressChangedEventArgs Class
 The event arguments used during the data transferring phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DataTransferProgressChangedEventArgs : WorksharedOperationProgressChangedEventArgs
Public Class DataTransferProgressChangedEventArgs
	Inherits WorksharedOperationProgressChangedEventArgs
public ref class DataTransferProgressChangedEventArgs : public WorksharedOperationProgressChangedEventArgs
type DataTransferProgressChangedEventArgs =
    class
        inherit WorksharedOperationProgressChangedEventArgs
    end
The DataTransferProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
FinishedSize |  The transferred data size, in bytes, since the last time this event was raised.
Speed |  Speed(bytes/second) in this event.
TotalSize |  Total expected data size to transfer, in bytes.
TransferMode |  Data transfer mode in this event.
Top
Methods
Name | Description
Top
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
See Also
Reference
Autodesk.Revit.DB.Events Namespace