Revit 2027 API
CADLinkOptions Class
 This class contains the options in use when or reloading a CAD link type (DWG, DXF, etc.)
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CADLinkOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CADLinkOptions : IDisposable
Public Class CADLinkOptions
	Implements IDisposable
public ref class CADLinkOptions : IDisposable
type CADLinkOptions =
    class
        interface IDisposable
    end
The CADLinkOptions type exposes the following members.
Constructors
Name | Description
CADLinkOptions(CADLinkOptions) |  Constructs a new copy of the input CADLinkOptions object.
CADLinkOptions(Boolean, ElementId) |  Creates a CADLinkOptions object, specifying whether to preserve graphic overrides, and what view to use if the link's view has been deleted.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PreserveOverrides |  Whether Revit should preserve the link's graphic overrides on reload.
ViewId |  The id of the view to use as the link's reference view, if the reference view has been deleted.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CADLinkOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace