Revit 2027 API
CADExportOptions Class
Generic CAD Export options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CADExportOptions
 Autodesk.Revit.DB.DWFExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class CADExportOptions
Public MustInherit Class CADExportOptions
public ref class CADExportOptions abstract
[<AbstractClassAttribute>]
type CADExportOptions = class end
The CADExportOptions type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace