Revit 2027 API
ScheduleFilter Class
 A filter in a schedule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ScheduleFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ScheduleFilter : IDisposable
Public Class ScheduleFilter
	Implements IDisposable
public ref class ScheduleFilter : IDisposable
type ScheduleFilter =
    class
        interface IDisposable
    end
The ScheduleFilter type exposes the following members.
Constructors
Name | Description
ScheduleFilter() |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, ElementId) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Double) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, Int32) |  Creates a new ScheduleFilter.
ScheduleFilter(ScheduleFieldId, ScheduleFilterType, String) |  Creates a new ScheduleFilter.
Top
Properties
Name | Description
FieldId |  The ID of the field used to filter the schedule.
FilterType |  The filter type.
IsDoubleValue |  Indicates if the filter has a double value.
IsElementIdValue |  Indicates if the filter has an ElementId value.
IsIntegerValue |  Indicates if the filter has an integer value.
IsNullValue |  Indicates if the filter has no specified value.
IsStringValue |  Indicates if the filter has a string value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ScheduleFilter
GetDoubleValue |  Gets the filter value for a filter using a double value.
GetElementIdValue |  Gets the filter value for a filter using an ElementId value.
GetIntegerValue |  Gets the filter value for a filter using an integer value.
GetStringValue |  Gets the filter value for a filter using a string value.
SetNullValue |  Sets the filter to have no specified value (used for HasParameter filters).
SetValue(Double) |  Set the filter value to a double.
SetValue(ElementId) |  Set the filter value to an ElementId.
SetValue(Int32) |  Set the filter value to an integer.
SetValue(String) |  Set the filter value to a string.
Top
Remarks
The ScheduleFilter class represents a single filter in a schedule. A filter is a condition that must be satisfied for an element to appear in the schedule. All filters must be satisfied for an element to appear in the schedule.
A schedule can be filtered by data that is not displayed in the schedule by marking the field used for filtering as hidden using the ScheduleField.IsHidden property.
See Also
Reference
Autodesk.Revit.DB Namespace