Revit 2027 API
BoundingBoxContainsPointFilter Class
 A filter used to match elements with a bounding box that contains the given point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.BoundingBoxContainsPointFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BoundingBoxContainsPointFilter : ElementQuickFilter
Public Class BoundingBoxContainsPointFilter
	Inherits ElementQuickFilter
public ref class BoundingBoxContainsPointFilter : public ElementQuickFilter
type BoundingBoxContainsPointFilter =
    class
        inherit ElementQuickFilter
    end
The BoundingBoxContainsPointFilter type exposes the following members.
Constructors
Name | Description
BoundingBoxContainsPointFilter(XYZ) |  Constructs a new instance of a filter to match elements with a bounding box that contains the given point.
BoundingBoxContainsPointFilter(XYZ, Boolean) |  Constructs a new instance of a filter to match elements with a bounding box that contains the given point, with the option to invert the filter and match all elements with a bounding box that do not contain the given point.
BoundingBoxContainsPointFilter(XYZ, Double) |  Constructs a new instance of a filter to match elements with a bounding box that contains the given point, while specifying the tolerance to be used in deciding if the point matches the criteria.
BoundingBoxContainsPointFilter(XYZ, Double, Boolean) |  Constructs a new instance of a filter to match elements with a bounding box that contains the given point, while specifying the tolerance to be used in deciding if the point matches the criteria. This constructor includes the option to invert the filter and match all elements with a bounding box that do not contain the given point.
Top
Properties
Name | Description
Point |  The XYZ point to use when matching element bounding boxes.
Tolerance |  Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
Top
Methods
Name | Description
Top
Remarks
 This filter excludes all objects derived from View and objects derived from ElementType. This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
Example
// Use BoundingBoxContainsPoint filter to find elements with a bounding box that contains the
// given point in the document.
// Create a BoundingBoxContainsPoint filter for base point of (0, 0, 0)
XYZ basePnt = new XYZ(0, 0, 0);
BoundingBoxContainsPointFilter filter = new BoundingBoxContainsPointFilter(basePnt);
// Apply the filter to the elements in the active document
// This filter will excludes all objects derived from View and objects derived from ElementType
FilteredElementCollector collector = new FilteredElementCollector(document);
IList<Element> elements = collector.WherePasses(filter).ToElements();
// Find walls that do not contain the given point: use an inverted filter to match elements
// Use shortcut command OfClass() to find walls only
BoundingBoxContainsPointFilter notContainFilter =
    new BoundingBoxContainsPointFilter(basePnt, true); // inverted filter
collector = new FilteredElementCollector(document);
IList<Element> notContainFounds =
    collector.OfClass(typeof(Wall)).WherePasses(notContainFilter).ToElements();
See Also
Reference
Autodesk.Revit.DB Namespace