Revit 2027 API
PhaseArray Class
An array that contains phase objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PhaseArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PhaseArray : APIObject, IEnumerable
Public Class PhaseArray
	Inherits APIObject
	Implements IEnumerable
public ref class PhaseArray : public APIObject,
	IEnumerable
type PhaseArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The PhaseArray type exposes the following members.
Constructors
Name | Description
PhaseArray | Initializes a new instance of the PhaseArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a phase at a specified index within the array.
Size | Returns the number of phases that are in the array.
Top
Methods
Name | Description
Append | Add the phase to the end of the array.
Clear | Removes every phase from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified phase into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace