Revit 2027 API
MEPSection Class
 A section in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.MEPSection
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPSection : IDisposable
Public Class MEPSection
	Implements IDisposable
public ref class MEPSection : IDisposable
type MEPSection =
    class
        interface IDisposable
    end
The MEPSection type exposes the following members.
Properties
Name | Description
FixtureUnit |  The fixture unit of the section.
Flow |  The flow of the section.
Friction |  The friction of the section.
FrictionFactor |  The friction factor of the section.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Number |  The Section number.
ReynoldsNumber |  The Reynolds number of the section.
Roughness |  The roughness of the section.
TotalCoefficient |  The loss coefficient of the section.
TotalCurveLength |  The total length of all segments in the section.
TotalPressureLoss |  The total pressure loss of the section.
Velocity |  The velocity of the section.
VelocityPressure |  The velocity pressure of the section.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPSection
GetCoefficient |  Gets the loss coefficient for the specified element id in this section.
GetElementIds |  Gets all element ids that are contained in the section.
GetPressureDrop |  Gets the pressure drop for the specified element id in this section.
GetSegmentLength |  Get the length for the specified segment id in this section.
IsMain |  Check whether the type of fitting in this section is main.
Top
Remarks
 This is the base class for duct and pipe section. This class is mainly for pressure loss calculation. It is a series of connected elements (segments - ducts or pipes, fittings, terminals and accessories). All section members should have same flow analysis properties: Flow, Size, Velocity, Friction and Roughness. One section member element which contains more than one connector can belongs to multiple section. e.g.: One Tee which has 3 connectors, usually, it belongs 3 sections. One segment which connect to a tap will be divided into 2 sections.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace