Revit 2027 API
FamilyLoadedIntoDocumentEventArgs Class
 The event arguments used by the FamilyLoadedInto event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyLoadedIntoDocumentEventArgs : RevitAPIPostDocEventArgs
Public Class FamilyLoadedIntoDocumentEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class FamilyLoadedIntoDocumentEventArgs : public RevitAPIPostDocEventArgs
type FamilyLoadedIntoDocumentEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The FamilyLoadedIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
FamilyName |  The file name of the family that is loaded into the document.
FamilyPath |  The file path of the family that is loaded into the document.
NewFamilyId |  The newly loaded family id.
OriginalFamilyId |  The original family id that is overridden by the newly loaded family.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace