Revit 2027 API
IFCExtrusionCalculatorOptions Methods
The IFCExtrusionCalculatorOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace