Revit 2027 API
ComponentRepeaterIterator Methods
The ComponentRepeaterIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  Returns the current repeater slot.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
ComponentRepeaterIterator Class
Autodesk.Revit.DB Namespace