Revit 2027 API
ExternalDefinitionCreationOptions Methods
The ExternalDefinitionCreationOptions type exposes the following members.
Methods
Name | Description
Dispose
GetDataType |  Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category.
SetDataType |  Sets the parameter's data type.
Top
See Also
Reference
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace