Revit 2027 API
ModelText Properties
The ModelText type exposes the following members.
Properties
Name | Description
Depth | The depth of the model text.
HorizontalAlignment | The horizontal alignment.
Location | This property is used to find the physical location of an instance within project.
(Overrides Element.Location)
ModelTextType | The type for the model text.
Subcategory | The subcategory.
Text | The text string in the model text.
Top
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace