Revit 2027 API
ReferenceIntersector Methods
The ReferenceIntersector type exposes the following members.
Methods
Name | Description
Dispose
Find |  Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
FindNearest |  Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria.
GetFilter |  Gets the ElementFilter used in intersection testing.
GetTargetElementIds |  Gets the set of ElementIds to test from in intersection testing.
SetFilter |  Sets the ElementFilter used in intersection testing.
SetTargetElementIds |  Sets the set of ElementIds to test from in intersection testing.
Top
See Also
Reference
ReferenceIntersector Class
Autodesk.Revit.DB Namespace