Revit 2027 API
GenericZoneDomainData Methods
The GenericZoneDomainData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
GenericZoneDomainData Class
Autodesk.Revit.DB.Analysis Namespace