Revit 2027 API
CableSize Class
 This class represents the definition of Cable Size data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.CableSize
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableSize : IDisposable
Public Class CableSize
	Implements IDisposable
public ref class CableSize : IDisposable
type CableSize =
    class
        interface IDisposable
    end
The CableSize type exposes the following members.
Properties
Name | Description
Comments |  The comments of this Cable Size.
GroundConductorSize |  The size of a Ground Conductor.
HotConductorSize |  The size of a Hot Conductor.
Id |  The Cable Size id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of this Cable Size.
NeutralConductorSize |  The size of a Neutral Conductor.
NumberOfGroundConductors |  The number of Ground Conductors.
NumberOfHotConductors |  The number of Hot Conductors.
NumberOfNeutralConductors |  The number of Neutral Conductors.
NumberOfOtherConductors |  The number of Other Conductors.
OtherConductorSize |  The size of an Other Conductor.
Top
Methods
Name | Description
Create |  Creates a Cable Size.
Dispose | Releases all resources used by the CableSize
Duplicate |  Duplicates this Cable Size.
GetCableSize |  Gets the Cable Size data by given Cable Size id.
GetCableSizeIdByName |  Gets the Cable Size id by given Cable Size name.
GetCableSizeIds |  Gets all the Cable Size ids in the given document, sorted by name.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace