Revit 2027 API
CommandEventArgs Properties
The CommandEventArgs type exposes the following members.
Properties
Name | Description
ActiveDocument |  The active document.
CommandId |  The command id.
Top
See Also
Reference
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace