Revit 2027 API
SpatialElementFromToCalculationPoints Class
 SpatialElementFromToCalculationPoints is used to specify the search points for a family instance which connects two rooms or spaces, such as a door or window. The points determine which room or space is considered the "from" and which is considered the "to".
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementCalculationLocation
 Autodesk.Revit.DB.SpatialElementFromToCalculationPoints
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialElementFromToCalculationPoints : SpatialElementCalculationLocation
Public Class SpatialElementFromToCalculationPoints
	Inherits SpatialElementCalculationLocation
public ref class SpatialElementFromToCalculationPoints : public SpatialElementCalculationLocation
type SpatialElementFromToCalculationPoints =
    class
        inherit SpatialElementCalculationLocation
    end
The SpatialElementFromToCalculationPoints type exposes the following members.
Properties
Name | Description
FromPosition |  The "from" position of spatial element connecting calculation point.
ToPosition |  The "to" position of spatial element connecting calculation point.
Top
Methods
Name | Description
Flip |  flip the direction of the "from" and "to" points
IsAcceptableFromPosition |  Checks whether a given "from" position is valid.
IsAcceptableToPosition |  Checks whether a given "to" position is valid.
MakeFromPositionAcceptable |  This function takes a potential "from" point and converts it to be a similar point on the opposite side of the family's host from the "to" point if necessary.
MakeToPositionAcceptable |  This function takes a potential "to" point and converts it to be a similar point on the opposite side of the family's host from the "from" point if necessary.
Top
See Also
Reference
Autodesk.Revit.DB Namespace