Revit 2027 API
AssetProperties Properties
The AssetProperties type exposes the following members.
Properties
Name | Description
Item
Size |  The number of the AssetProperty(s) in the object.
Top
See Also
Reference
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace