Revit 2027 API
StructuralSectionSigmaProfileWithFold Class
 Defines parameters for structural Sigma profile section with fold.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionSigmaProfileWithFold : StructuralSectionColdFormed
Public Class StructuralSectionSigmaProfileWithFold
	Inherits StructuralSectionColdFormed
public ref class StructuralSectionSigmaProfileWithFold : public StructuralSectionColdFormed
type StructuralSectionSigmaProfileWithFold =
    class
        inherit StructuralSectionColdFormed
    end
The StructuralSectionSigmaProfileWithFold type exposes the following members.
Constructors
Name | Description
StructuralSectionSigmaProfileWithFold |  Creates a new instance of Structural Section Sigma Profile With Fold shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BendWidth |  Bend segment width.
FoldWidth |  Fold segment width.
LipLength |  Lip segment length.
MiddleBendLength |  Middle Bend segment length.
TopBendLength |  Top Bend segment length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace