Revit 2027 API
PolymeshFacet Class
 A class representing one triangular piece - a facet - in a polymesh topology.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PolymeshFacet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PolymeshFacet
Public Class PolymeshFacet
public ref class PolymeshFacet
type PolymeshFacet = class end
The PolymeshFacet type exposes the following members.
Constructors
Name | Description
PolymeshFacet |  Creates a PolymeshFacet with the supplied vertices.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
V1 |  The first vertex of the facet
V2 |  The second vertex of the facet
V3 |  The third vertex of the facet
Top
Methods
Name | Description
GetVertices |  Returns the three vertices that define this facet
ToString |  Returns formatted string showing (V1, V2, V3) with values formatted as regular integers
(Overrides Object.ToString())
Top
Remarks
 It can also be used to create TopographySurface. Each facet is defined by indices of three vertices of the polymesh.
See Also
Reference
Autodesk.Revit.DB Namespace