Revit 2027 API
DetailCurveArray Methods
The DetailCurveArray type exposes the following members.
Methods
Name | Description
Append
Clear | Removes every item from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
DetailCurveArray Class
Autodesk.Revit.DB Namespace