Revit 2027 API
FormatValueOptions Methods
The FormatValueOptions type exposes the following members.
Methods
Name | Description
Dispose
GetFormatOptions |  Gets the FormatOptions to optionally override the default settings in the Units class.
SetFormatOptions |  Sets the FormatOptions to optionally override the default settings in the Units class.
Top
See Also
Reference
FormatValueOptions Class
Autodesk.Revit.DB Namespace