Revit 2027 API
MacroUpdatedEventArgs Class
 The event arguments used by the MacroUpdated event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.MacroUpdatedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MacroUpdatedEventArgs : RevitAPISingleEventArgs
Public Class MacroUpdatedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class MacroUpdatedEventArgs : public RevitAPISingleEventArgs
type MacroUpdatedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The MacroUpdatedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace