Revit 2027 API
UV Methods
The UV type exposes the following members.
Methods
Name | Description
Add | Adds the specified 2-D vector to this 2-D vector and returns the result.
AngleTo | Returns the angle between this vector and the specified vector.
CrossProduct | The cross product of this 2-D vector and the specified 2-D vector.
DistanceTo | Returns the distance from this 2-D point to the specified 2-D point.
Divide | Divides this 2-D vector by the specified value and returns the result.
DotProduct | The dot product of this 2-D vector and the specified 2-D vector.
GetLength | The length of this 2-D vector.
IsAlmostEqualTo(UV) | Determines whether this 2-D vector and the specified 2-D vector are the same within the tolerance (1.0e-09).
IsAlmostEqualTo(UV, Double) | Determines whether this 2-D vector and the specified 2-D vector are the same within a specified tolerance.
IsUnitLength | The boolean value indicates whether this 2-D vector is of unit length.
IsZeroLength | The boolean value indicates whether this 2-D vector is a zero vector.
Multiply | Multiplies this 2-D vector by the specified value and returns the result.
Negate | Negates this 2-D vector.
Normalize | Returns a new UV whose coordinates are the normalized values from this vector.
Subtract | Subtracts the specified 2-D vector from this 2-D vector and returns the result.
ToString |  Gets formatted string showing (U, V) with values formatted to 9 decimal places.
(Overrides Object.ToString())
Top
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace