Revit 2027 API
IFCConnectedWallData Class
 A class that contains the IFC-specific information about how an element is joined to another element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCConnectedWallData
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCConnectedWallData : IDisposable
Public Class IFCConnectedWallData
	Implements IDisposable
public ref class IFCConnectedWallData : IDisposable
type IFCConnectedWallData =
    class
        interface IDisposable
    end
The IFCConnectedWallData type exposes the following members.
Properties
Name | Description
ElementId |  The element id to which this element is joined.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Location |  The location for the join.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCConnectedWallData
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace