Revit 2027 API
LinkedResourceOpeningEventArgs Class
 The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpening].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkedResourceOpeningEventArgs : RevitAPIPreEventArgs
Public Class LinkedResourceOpeningEventArgs
	Inherits RevitAPIPreEventArgs
public ref class LinkedResourceOpeningEventArgs : public RevitAPIPreEventArgs
type LinkedResourceOpeningEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The LinkedResourceOpeningEventArgs type exposes the following members.
Properties
Name | Description
LinkedResourcePathName |  Path of the linked resource.
ResourceType |  The desired linked resource type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace