Revit 2027 API
VertexStream Class
 The base class for DirectContext3D vertex streams, which are used to write vertex data into buffers.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexStream
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexStream : IDisposable
Public Class VertexStream
	Implements IDisposable
public ref class VertexStream : IDisposable
type VertexStream =
    class
        interface IDisposable
    end
The VertexStream type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the VertexStream
Top
Remarks
 This base class cannot be used directly. Instead, a steam that is specific for each type of vertex must be used.
Use VertexStreamPosition to insert VertexPosition instances.
Use VertexStreamPositionColored to insert VertexPositionColored instances.
Use VertexStreamPositionNormal to insert VertexPositionNormal instances.
Use VertexStreamPositionNormalColored to insert VertexPositionNormalColored instances.
 The process of putting vertex data into a buffer involves using a stream-buffer pair as follows:
Map the vertex buffer.
Get a stream of the appropriate type from the buffer.
Add vertices of the same type to the stream. They will be written into the buffer that was used to create the stream.
Unmap the buffer.
 As an alternative to using streams, it is possible to write data into a buffer using a handle to its mapped memory.
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace