Revit 2027 API
ReloadSwapOutInfo Class
 This object contains information about fabrication parts swapped out during reload.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ReloadSwapOutInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReloadSwapOutInfo : IDisposable
Public Class ReloadSwapOutInfo
	Implements IDisposable
public ref class ReloadSwapOutInfo : IDisposable
type ReloadSwapOutInfo =
    class
        interface IDisposable
    end
The ReloadSwapOutInfo type exposes the following members.
Properties
Name | Description
CurrentVersion |  New version.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Part |  The ElementId of part being swapped.
PreviousVersion |  Previous version.
WasSwapped |  Whether the swap out was successful.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReloadSwapOutInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace