Revit 2027 API
ViewSystemsAnalysisReport Class
 Represents a report instance of the systems analysis.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewSystemsAnalysisReport : View
Public Class ViewSystemsAnalysisReport
	Inherits View
public ref class ViewSystemsAnalysisReport : public View
type ViewSystemsAnalysisReport =
    class
        inherit View
    end
The ViewSystemsAnalysisReport type exposes the following members.
Properties
Name | Description
AnalysisDateAndTime |  Identifies the analysis date and time when it was requested.
ReportStyle |  The report style that specifies the display content.
SystemsAnalysisOutputFolder |  The full path of the output folder for systems analysis.
SystemsAnalysisWorkflowFile |  The full path name of the original system analysis workflow file.
WeatherFile |  The full path name of the weather file used for the systems analysis.
Top
Methods
Name | Description
CancelSystemsAnalysis |  Cancels the systems analysis based on the report element id.
Create |  Creates a new view for the systems analysis report.
GetLatestSystemsAnalysisReport |  Gets the latest report of systems analysis.
GetReportContent |  Gets the report content in this view.
IsAnalysisCompleted |  Indicates if the background systems analysis has completed or not.
RequestSystemsAnalysis |  Requests a new systems analysis to be run in the background.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace