Revit 2027 API
Sketch Class
 Provides access to the Sketch in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SketchBase
 Autodesk.Revit.DB.Sketch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Sketch : SketchBase
Public Class Sketch
	Inherits SketchBase
public ref class Sketch : public SketchBase
type Sketch =
    class
        inherit SketchBase
    end
The Sketch type exposes the following members.
Properties
Name | Description
OwnerId |  Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry.
Profile | Returns the Profile of the Sketch.
SketchPlane |  Returns the Sketch Plane of the Sketch.
Top
Methods
Name | Description
GetAllElements |  Returns all elements which belong to the sketch.
Top
See Also
Reference
Autodesk.Revit.DB Namespace