Revit 2027 API
IExternalDataManagerServer Methods
The IExternalDataManagerServer type exposes the following members.
Methods
Name | Description
GetCommandsForAdd |  Retrieves commands in the Add menu.
GetContentTools |  Obtains the content tool items of the selected data
GetData |  Obtains the data.
GetPreviewImage |  Retrieves the handle of preview image.
GetPreviewImageFile |  Retrieves the handle of preview image.
GetTitle |  Obtains the title for the external data.
IsCommandEnabled |  Checks if the command is enabled.
IsEnabledInFamilyDocuments |  Checks if the data type enabled in family documents.
OnCommand |  Handles user command.
Top
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace