Revit 2027 API
ElementNode Properties
The ElementNode type exposes the following members.
Properties
Name | Description
Document |  Gets the document associated with the element.
ElementId |  The Id of the element.
LinkInstanceId |  The Id of the link instance for the element.
Top
See Also
Reference
ElementNode Class
Autodesk.Revit.DB Namespace