Revit 2027 API
CurveOverlapPoint Class
 A point of overlap of two curves and its type of overlap.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CurveOverlapPoint
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveOverlapPoint : IDisposable
Public Class CurveOverlapPoint
	Implements IDisposable
public ref class CurveOverlapPoint : IDisposable
type CurveOverlapPoint =
    class
        interface IDisposable
    end
The CurveOverlapPoint type exposes the following members.
Properties
Name | Description
FirstParameter |  The point's unnormalized parameter on the first curve.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Point |  The 3D coordinate of the point.
SecondParameter |  The point's unnormalized parameter on the second curve.
Type |  The type of overlap at the point.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CurveOverlapPoint
Top
See Also
Reference
Autodesk.Revit.DB Namespace