Revit 2027 API
RoutingPreferenceManager Class
 Manages default pipe segments, fittings, and selection criteria for a given MEPCurveType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingPreferenceManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoutingPreferenceManager : IDisposable
Public Class RoutingPreferenceManager
	Implements IDisposable
public ref class RoutingPreferenceManager : IDisposable
type RoutingPreferenceManager =
    class
        interface IDisposable
    end
The RoutingPreferenceManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OwnerId |  The Id of the MEPCurveType that owns the RoutingPreferenceManager
PreferredJunctionType |  The preferred junction type.
Top
Methods
Name | Description
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule) |  Adds a new routing preference rule to the rule group.
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32) |  Adds a new routing preference rule to the specified position in the rule group.
Dispose | Releases all resources used by the RoutingPreferenceManager
GetMEPPartId |  Gets a fitting or segment id of given routing preference group that meets the specified routing conditions.
GetNumberOfRules |  The number of RoutingPreference rules in a group.
GetRule |  Gets the specified rule.
GetSharedSizes |  Gets a list of all segments of a given profile shape that define a given size.
RemoveRule |  Removes an existing routing preference rule. Thrown if the index is out of bounds.
Top
Remarks
 MEPCurveTypes contain a RoutingPreferenceManager property. The RoutingPreferenceManager contains rules for selecting segment types and sizes as well as fitting types based on user selection criteria.
See Also
Reference
Autodesk.Revit.DB Namespace