Revit 2027 API
SelectionUIOptions Class
 Provides access to user settings related to how selection will behave in Revit's UI.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.SelectionUIOptions
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SelectionUIOptions : IDisposable
Public Class SelectionUIOptions
	Implements IDisposable
public ref class SelectionUIOptions : IDisposable
type SelectionUIOptions =
    class
        interface IDisposable
    end
The SelectionUIOptions type exposes the following members.
Properties
Name | Description
ActivateControlsAndDimensionsOnMultiSelect |  Indicates whether controls and temporary dimensions are activated on selection of multiple elements.
DragOnSelection |  Indicates whether elements can be dragged immediately when they are selected.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SelectFaces |  Indicates whether elements can be selected by clicking on the interior of a face.
SelectLinks |  Indicates whether Revit and CAD link instances can be selected.
SelectPinned |  Indicates whether pinned elements can be selected.
SelectUnderlay |  Indicates whether elements that are displayed as underlay can be selected.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SelectionUIOptions
ElementSelectsAsPinned |  Checks whether the specified element will be treated as pinned for the purposes of selection.
GetSelectionUIOptions |  Returns the current user's SelectionOptions.
Top
Remarks
 The settings in this class define how selection will behave when the user is selecting one or more elements in a graphical view. These settings do not affect programmatic selection behavior. Some UI commands may override the user's settings while the command is active.
These settings are per user and will affect the selection behavior in all projects and families. The settings are not stored in the project.
See Also
Reference
Autodesk.Revit.UI Namespace