Revit 2027 API
ElectricalLoadClassification Methods
The ElectricalLoadClassification type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of load classification and adds it to the document.
Top
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace