Revit 2027 API
AnnotationSymbolType Class
An object that represents an annotation style.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.AnnotationSymbolType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnnotationSymbolType : FamilySymbol
Public Class AnnotationSymbolType
	Inherits FamilySymbol
public ref class AnnotationSymbolType : public FamilySymbol
type AnnotationSymbolType =
    class
        inherit FamilySymbol
    end
The AnnotationSymbolType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace