Revit 2027 API
GraphicsStyle Properties
The GraphicsStyle type exposes the following members.
Properties
Name | Description
GraphicsStyleCategory | The graphics style category.
GraphicsStyleType | The graphics style type.
Top
See Also
Reference
GraphicsStyle Class
Autodesk.Revit.DB Namespace