Revit 2027 API
FilterRule Class
 Defines a boolean operation that can be used to cull elements from a document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterRule : IDisposable
Public Class FilterRule
	Implements IDisposable
public ref class FilterRule : IDisposable
type FilterRule =
    class
        interface IDisposable
    end
The FilterRule type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilterRule
ElementPasses |  Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
GetRuleParameter |  Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterCategoryRule
 Autodesk.Revit.DB.FilterInverseRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.ParameterValuePresenceRule
 Autodesk.Revit.DB.SharedParameterApplicableRule