Revit 2027 API
TriangulationInterface Methods
The TriangulationInterface type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
TriangulationInterface Class
Autodesk.Revit.DB Namespace