Revit 2027 API
RebarShapeDefinitionByArc Class
 Definition of a shape whose size and position can determined by a single arc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeDefinition
 Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeDefinitionByArc : RebarShapeDefinition
Public Class RebarShapeDefinitionByArc
	Inherits RebarShapeDefinition
public ref class RebarShapeDefinitionByArc : public RebarShapeDefinition
type RebarShapeDefinitionByArc =
    class
        inherit RebarShapeDefinition
    end
The RebarShapeDefinitionByArc type exposes the following members.
Constructors
Name | Description
RebarShapeDefinitionByArc(Document, RebarShapeDefinitionByArcType) |  Create a non-spiral shape definition.
RebarShapeDefinitionByArc(Document, Double, Double, Int32, Int32) |  Create a spiral shape definition.
Top
Properties
Name | Description
Type |  Among those rebar shapes defined by an arc, specify which kind.
Top
Methods
Name | Description
AddConstraintArcLength |  Specify a parameter to drive the arc length of the shape.
AddConstraintChordLength |  Specify a parameter to drive the chord length (the straight-line distance between the endpoints of the arc).
AddConstraintCircumference |  Specify a parameter to drive the circumference of the shape.
AddConstraintDiameter |  Specify a parameter to drive the diameter of the shape.
AddConstraintRadius |  Specify a parameter to drive the radius of the shape.
AddConstraintSagittaLength |  Specify a parameter to drive the sagittal length (the height of the circular segment, measured perpendicular to the chord).
GetConstraints |  Retrieve the list of constraints associated with this definition.
SetArcTypeSpiral |  Set the RebarShapeDefinitionByArc.Type property to Spiral.
SetConstraints |  Assign a new list of constraints to this definition.
Top
Remarks
 In this shape definition, all dimensions are allowed to be driving dimensions.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace