Revit 2027 API
ElectricalEquipment Class
 Provides access to the Electrical Equipment in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.MEPModel
 Autodesk.Revit.DB.Electrical.ElectricalEquipment
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalEquipment : MEPModel
Public Class ElectricalEquipment
	Inherits MEPModel
public ref class ElectricalEquipment : public MEPModel
type ElectricalEquipment =
    class
        inherit MEPModel
    end
The ElectricalEquipment type exposes the following members.
Properties
Name | Description
CircuitNamingSchemeId |  The CircuitNamingSchemeId used in the Electrical Equipment. The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.
DistributionSystem |  get or set the Distribution System for the Electrical Equipment.
IsSwitchboard |  The electrical equipment is a switchboard or not. This property returns true if the electrical equipment is a switchboard.
MaxNumberOfCircuits |  The maximum number of circuits for switchboard. The quantity of circuits can be assigned to switchboard through breaker.
Top
Methods
Name | Description
GetCircuitNamingSchemeType |  Gets enumerated type of the circuit naming scheme used with Electrical Equipment.
IsValidCircuitNamingSchemeId |  Verifies that the circuit naming scheme id can be used with Electrical Equipment.
IsValidDistributionSystem |  Verifies that the Distribution System can be assigned to the Electrical Equipment.
SetCircuitNamingSchemeType |  Sets the circuit naming scheme for Electrical Equipment.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace