Revit 2027 API
VertexFormat Class
 A specification of the format of vertex data contained in a piece of geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexFormat
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexFormat : IDisposable
Public Class VertexFormat
	Implements IDisposable
public ref class VertexFormat : IDisposable
type VertexFormat =
    class
        interface IDisposable
    end
The VertexFormat type exposes the following members.
Constructors
Name | Description
VertexFormat |  Constructs the specification of vertex format from a numerical representation.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the VertexFormat
IsValid |  Tests whether the vertex format specification is valid for rendering.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace