Revit 2027 API
ComboBoxMember Properties
The ComboBoxMember type exposes the following members.
Properties
Name | Description
GroupName | The group to which the ComboBoxMember is assigned.
Image | The image shown on the ComboBoxMember.
Top
See Also
Reference
ComboBoxMember Class
Autodesk.Revit.UI Namespace