Revit 2027 API
ConnectorSet Class
A set that can contain any type of object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ConnectorSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConnectorSet : APIObject,
	IEnumerable
Public Class ConnectorSet
	Inherits APIObject
	Implements IEnumerable
public ref class ConnectorSet : public APIObject,
	IEnumerable
type ConnectorSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The ConnectorSet type exposes the following members.
Constructors
Name | Description
ConnectorSet | Initializes a new instance of the ConnectorSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains
Erase
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace