Revit 2027 API
PostDocEventArgs Class
 The class is used as base class for arguments of any post-event that is associated to a particular Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PostEventArgs
 Autodesk.Revit.DB.Events.PostDocEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PostDocEventArgs : PostEventArgs
Public Class PostDocEventArgs
	Inherits PostEventArgs
public ref class PostDocEventArgs : public PostEventArgs
type PostDocEventArgs =
    class
        inherit PostEventArgs
    end
The PostDocEventArgs type exposes the following members.
Properties
Name | Description
Document |  The document associated with the event.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace