Revit 2027 API
DuctSizes Methods
The DuctSizes type exposes the following members.
Methods
Name | Description
Contains |  Checks whether a duct size with the nominal diameter exists.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetDuctSizeIterator | Returns a DuctSizeIterator that iterates through the collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
Top
See Also
Reference
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace