Revit 2027 API
ExportLinetypeInfo Methods
The ExportLinetypeInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExportLinetypeInfo Class
Autodesk.Revit.DB Namespace