Revit 2027 API
ParameterMap Properties
The ParameterMap type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the map is empty.
Item | Gets or sets an item at a specified key within the map.
Size | Returns the number of objects that are in the map.
Top
See Also
Reference
ParameterMap Class
Autodesk.Revit.DB Namespace