Revit 2027 API
Reference Methods
The Reference type exposes the following members.
Methods
Name | Description
Contains | Checks if given reference identifies part of object identified by this reference.
ConvertToStableRepresentation | Converts the reference to a stable String representation.
CreateLinkReference | Creates a Reference from a Reference in an RVT Link.
CreateReferenceInLink | Creates a Reference in an RVT Link from a Reference in the RVT host file.
EqualTo | Checks if given reference is equal to this reference.
ParseFromStableRepresentation | Converts a stable String representation of a reference to a Reference object.
Top
See Also
Reference
Reference Class
Autodesk.Revit.DB Namespace