Revit 2027 API
Pipe Class
 A pipe in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Plumbing.Pipe
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Pipe : MEPCurve
Public Class Pipe
	Inherits MEPCurve
public ref class Pipe : public MEPCurve
type Pipe =
    class
        inherit MEPCurve
    end
The Pipe type exposes the following members.
Properties
Name | Description
FlowState | The flow state of the pipe.
IsPlaceholder |  Identifies if the pipe is a placeholder or not.
PipeSegment |  The pipe segment that was assigned to this pipe according to the routing preference.
PipeType |  The pipe type of this pipe.
Top
Methods
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector) |  Creates a new pipe that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ) |  Creates a new pipe that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) |  Creates a new pipe from two points.
CreatePlaceholder |  Creates a new placeholder pipe.
IsPipeTypeId |  Checks if given type is valid pipe type.
IsPipingConnector |  Checks if the given connector is a valid piping connector.
IsPipingSystemTypeId |  Checks if given type is valid piping system type.
SetSystemType |  Updates the associated system type for the pipe.
Top
Remarks
 The pipe is only available in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace