Revit 2027 API
MessageBoxShowingEventArgs Class
 The event arguments used by the DialogBoxShowing event when a Windows message box is about to be displayed in Revit.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
 Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MessageBoxShowingEventArgs : DialogBoxShowingEventArgs
Public Class MessageBoxShowingEventArgs
	Inherits DialogBoxShowingEventArgs
public ref class MessageBoxShowingEventArgs : public DialogBoxShowingEventArgs
type MessageBoxShowingEventArgs =
    class
        inherit DialogBoxShowingEventArgs
    end
The MessageBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
DialogType |  An integer that describes the standard Windows type of the dialog box.
Message |  The message that has been displayed in the dialog box.
Top
Methods
Name | Description
Top
Remarks
 When the application receives this object, a simple message box is about to be displayed in Revit that requires user interaction. The OverrideResult function can be used to cause the dialog to be dismissed and return a desired result code.
See Also
Reference
Autodesk.Revit.UI.Events Namespace