Revit 2027 API
FieldDomainPointsByUV Class
 Represents a set of two-dimensional point coordinates (defined usually on surface)
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.FieldDomainPoints
 Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FieldDomainPointsByUV : FieldDomainPoints
Public Class FieldDomainPointsByUV
	Inherits FieldDomainPoints
public ref class FieldDomainPointsByUV : public FieldDomainPoints
type FieldDomainPointsByUV =
    class
        inherit FieldDomainPoints
    end
The FieldDomainPointsByUV type exposes the following members.
Constructors
Name | Description
FieldDomainPointsByUV(IList<UV>) |  Creates object from an array of two-dimensional point coordinates
FieldDomainPointsByUV(IList<UV>, ICollection<Double>, ICollection<Double>) |  Creates object from an array of two-dimensional point coordinates
Top
Properties
Name | Description
Top
Methods
Name | Description
SetGridCoordinates |  Set u and v coordinates that specify a grid on the surface. The display of the grid is controlled by AnalysisDisplayColoredSurfaceSettings::getShowGridLines(). If AnalysisDisplayColoredSurfaceSettings::getShowGridLines() returns true and both sets are empty then a grid will be displayed using a default spacing; if only one of the sets is non-empty, then only the corresponding set of grid lines will be displayed, i.e. the grid will consist solely of parallel lines at the specified coordinates.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace