Revit 2027 API
ExternalDataManagerCommand Methods
The ExternalDataManagerCommand type exposes the following members.
Methods
Name | Description
Dispose
RegisterCommand |  Registers a command.
Top
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace