Revit 2027 API
DisplacementElement Properties
The DisplacementElement type exposes the following members.
Properties
Name | Description
ParentId |  The element id of the parent DisplacementElement. This DisplacementElement's relative transform will be concatenated with the absolute transform of its parent.
Top
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace