Revit 2027 API
Options Class
User preferences for parsing of geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Options
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Options : APIObject
Public Class Options
	Inherits APIObject
public ref class Options : public APIObject
type Options =
    class
        inherit APIObject
    end
The Options type exposes the following members.
Constructors
Name | Description
Options() | Creates a default Options object.
Options(Options) | Copy constructor.
Top
Properties
Name | Description
ComputeReferences | Determines whether or not references to geometric objects are computed.
DetailLevel | The detail level for the geometry extracted with these options.
IncludeNonVisibleObjects | Whether to extract element geometry objects not set as Visible. The default is false.
View | The view used for geometry extraction.
Top
Methods
Name | Description
Top
Remarks
This class determines the output of the Element.Geometry property.
See Also
Reference
Autodesk.Revit.DB Namespace