Revit 2027 API
WallType Class
 Represents a specific type of wall, such as 'Generic - 8"'.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.WallType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WallType : HostObjAttributes
Public Class WallType
	Inherits HostObjAttributes
public ref class WallType : public HostObjAttributes
type WallType =
    class
        inherit HostObjAttributes
    end
The WallType type exposes the following members.
Properties
Name | Description
Function |  The wall function.
Kind |  The nature of the wall.
ThermalProperties |  The calculated and settable thermal properties of the WallType
Width |  The overall thickness of this type of wall.
Top
Methods
Name | Description
Top
Remarks
 All wall type objects available in the project can be retrieved from the Document object via the WallTypes property. Every Wall object has a WallType property that returns the a WallType object representing the type. This same WallType property can also be used to change the type of the wall by setting it to a different type.
Example
public void GetInfo_WallType(WallType wallType)
{
    string message;
    // Reports the nature of the wall
    message = "The wall type kind is : " + wallType.Kind.ToString();
    // Get the overall thickness of this type of wall.
    message += "\nThe wall type Width is : " + wallType.Width.ToString();
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace