Revit 2027 API
ExtensibleStorageFilter Properties
The ExtensibleStorageFilter type exposes the following members.
Properties
Name | Description
SchemaGuid |  Schema id used to filter elements with extensible storage data
Top
See Also
Reference
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace