Revit 2027 API
Workset Class
 Represents a workset in the document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetPreview
 Autodesk.Revit.DB.Workset
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Workset : WorksetPreview
Public Class Workset
	Inherits WorksetPreview
public ref class Workset : public WorksetPreview
type Workset =
    class
        inherit WorksetPreview
    end
The Workset type exposes the following members.
Properties
Name | Description
IsEditable |  Whether the workset is editable.
IsOpen |  Whether the workset is open (rather than closed).
IsVisibleByDefault |  Whether the workset is visible by default.
Kind |  Kind of the workset.
Top
Methods
Name | Description
Create |  Creates a new workset.
Top
Remarks
 Worksets are a way to divide a set of elements in the Revit document into subsets for worksharing. There may be one or many worksets in a document. Each element in the document must belong to one and only one workset.
Example
public void GetWorksetsInfo(Document doc)
{
    String message = String.Empty;
    // Enumerating worksets in a document and getting basic information for each
    FilteredWorksetCollector collector = new FilteredWorksetCollector(doc);
    // find all user worksets
    collector.OfKind(WorksetKind.UserWorkset);
    // get information for each workset
    int count = 3;  // show info for 3 worksets only
    foreach (Workset workset in collector)
    {
        message += "Workset : " + workset.Name;
        message += "\nUnique Id : " + workset.UniqueId;
        message += "\nOwner : " + workset.Owner;
        message += "\nKind : " + workset.Kind;
        message += "\nIs default : " + workset.IsDefaultWorkset;
        message += "\nIs editable : " + workset.IsEditable;
        message += "\nIs open : " + workset.IsOpen;
        message += "\nIs visible by default : " + workset.IsVisibleByDefault;
        TaskDialog.Show("GetWorksetsInfo", message);
        if (0 == --count)
            break;
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace