Revit 2027 API
IExporterIFC Methods
The IExporterIFC type exposes the following members.
Methods
Name | Description
ExportIFC |  The method that Revit will invoke to perform an export to IFC.
Top
See Also
Reference
IExporterIFC Interface
Autodesk.Revit.DB.IFC Namespace