Revit 2027 API
StartingViewSettings Class
 The initial view settings for a document dictate which view will initially be open when this model is opened. These settings are available for all Revit project documents.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.StartingViewSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StartingViewSettings : Element
Public Class StartingViewSettings
	Inherits Element
public ref class StartingViewSettings : public Element
type StartingViewSettings =
    class
        inherit Element
    end
The StartingViewSettings type exposes the following members.
Properties
Name | Description
ViewId |  Indicates the specific view that will be opened when the model is loaded. InvalidElementId indicates that no view has been specified. In that case, Revit will open the last views that were open at the time the file was saved.
Top
Methods
Name | Description
GetStartingViewSettings |  Returns the starting view settings for the specified document.
IsAcceptableStartingView |  Checks whether the given Id is an acceptable starting view. InvalidElementId corresponds to "Last Viewed" and is therefore also acceptable.
Top
Remarks
 If worksharing is enabled, the same settings will be used by the central model and all local files and the settings will live in the Project Info workset.
See Also
Reference
Autodesk.Revit.DB Namespace