Revit 2027 API
ViewHVACLoadsReport Methods
The ViewHVACLoadsReport type exposes the following members.
Methods
Name | Description
Create |  Factory method to create a new instance of DBViewHVACLoadsReport.
IsAnalysisCompleted |  Indicates if the heating and cooling loads analysis has completed or not.
RunLoadsAnalysis |  Performs a heating and cooling loads analysis for zones and spaces in the energy model.
Top
See Also
Reference
ViewHVACLoadsReport Class
Autodesk.Revit.DB.Analysis Namespace