Revit 2027 API
KeyBasedTreeEntryError Methods
The KeyBasedTreeEntryError type exposes the following members.
Methods
Name | Description
Dispose
GetEntry |  Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.
Top
See Also
Reference
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace