Revit 2027 API
PipingSystem Methods
The PipingSystem type exposes the following members.
Methods
Name | Description
CanBeHydraulicLoopBoundary |  Checks if the element can be used as a hydraulic loop boundary.
Create(Document, ElementId) |  Creates a new instance of a piping system and adds it to the document.
Create(Document, ElementId, String) |  Creates a new instance of a piping system and adds it to the document.
CreateHydraulicSeparation |  Creates new system which is hydraulically separated from the existing system.
DeleteHydraulicSeparation |  Deletes hydraulically separated systems and merges the system components into the connected system.
GetFixtureUnits |  Gets the fixture units of this piping system.
GetFlow |  Gets the flow of this piping system.
GetPumpSets |  Gets the set of element Id's for all pump sets in the system, if any.
GetStaticPressure |  Gets the static pressure of this piping system.
GetVolume |  Gets the volume of this piping system.
IsFlowServerMissing |  Indicates if any flow server which was used in the piping system is not available.
IsHydraulicLoopBoundary |  Checks if the element is a valid hydraulic loop boundary.
IsPressureDropServerMissing |  Indicates if any pressure drop server which was used in the piping system is not available.
Top
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace