Revit 2027 API
ToggleButton Class
The ToggleButton object represents a button that has been added to a RadioButtonGroup.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.PushButton
 Autodesk.Revit.UI.ToggleButton
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ToggleButton : PushButton
Public Class ToggleButton
	Inherits PushButton
public ref class ToggleButton : public PushButton
type ToggleButton =
    class
        inherit PushButton
    end
The ToggleButton type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Use of this class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace