Revit 2027 API
SpotLightDistribution Class
 This class encapsulates a spot light distribution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.SpotLightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpotLightDistribution : LightDistribution
Public Class SpotLightDistribution
	Inherits LightDistribution
public ref class SpotLightDistribution : public LightDistribution
type SpotLightDistribution =
    class
        inherit LightDistribution
    end
The SpotLightDistribution type exposes the following members.
Constructors
Name | Description
SpotLightDistribution() |  Creates a spot light distribution object with the following values;
PI/6 radians spot beam angle
PI/2 radians spot field angle
PI/6 radians tilt angle
SpotLightDistribution(SpotLightDistribution) |  Creates a copy of the given spotlight distribution
SpotLightDistribution(Double, Double, Double) |  Creates a spot light distribution object with the given values.
Top
Properties
Name | Description
SpotBeamAngle |  The spot beam angle.
SpotFieldAngle |  The spot field angle.
TiltAngle |  The tilt angle.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace