Revit 2027 API
Phase Class
Represents a phase in the life of a building.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Phase
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Phase : Element
Public Class Phase
	Inherits Element
public ref class Phase : public Element
type Phase =
    class
        inherit Element
    end
The Phase type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
The lifetime of an element within a building can be controlled by using phases. Each element will have a construction phase but only those elements that have a finite lifetime will have a destruction phase. All the phases within a project can be retrieved from the Document object.
See Also
Reference
Autodesk.Revit.DB Namespace