Revit 2027 API
SolidOrShellTessellationControls Class
 Controls various aspects of the triangulation produced by [!:SolidUtils::tessellateSolidOrShell()] method.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SolidOrShellTessellationControls
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SolidOrShellTessellationControls : IDisposable
Public Class SolidOrShellTessellationControls
	Implements IDisposable
public ref class SolidOrShellTessellationControls : IDisposable
type SolidOrShellTessellationControls =
    class
        interface IDisposable
    end
The SolidOrShellTessellationControls type exposes the following members.
Constructors
Name | Description
SolidOrShellTessellationControls |  Default constructor.
Top
Properties
Name | Description
Accuracy |  A positive real number specifying how accurately a triangulation should approximate a solid or shell.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LevelOfDetail |  An number between 0 and 1 (inclusive) specifying the level of detail for the triangulation of a solid or shell.
MinAngleInTriangle |  A non-negative real number specifying the minimum allowed angle for any triangle in the triangulation, in radians.
MinExternalAngleBetweenTriangles |  A positive real number specifying the minimum allowed value for the external angle between two adjacent triangles, in radians.
Top
Methods
Name | Description
DisableLevelOfDetail |  Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
Dispose | Releases all resources used by the SolidOrShellTessellationControls
UseLevelOfDetail |  Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
Top
See Also
Reference
Autodesk.Revit.DB Namespace