Revit 2027 API
LinearDimension Class
 LinearDimString
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.LinearDimension
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinearDimension : Dimension
Public Class LinearDimension
	Inherits Dimension
public ref class LinearDimension : public Dimension
type LinearDimension =
    class
        inherit Dimension
    end
The LinearDimension type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of an Linear Dimension element within the project.
Top
See Also
Reference
Autodesk.Revit.DB Namespace