Revit 2027 API
MEPBuildingConstructionSet Methods
The MEPBuildingConstructionSet type exposes the following members.
Methods
Name | Description
Clear | Removes every MEPBuildingConstruction from the set, rendering it empty.
Contains | Tests for the existence of a MEPBuildingConstruction within the set.
Erase | Removes a specified MEPBuildingConstruction from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified MEPBuildingConstruction into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace