Revit 2027 API
RadioButtonGroup Class
Represents a group of related buttons in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RadioButtonGroup
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RadioButtonGroup : RibbonItem
Public Class RadioButtonGroup
	Inherits RibbonItem
public ref class RadioButtonGroup : public RibbonItem
type RadioButtonGroup =
    class
        inherit RibbonItem
    end
The RadioButtonGroup type exposes the following members.
Properties
Name | Description
Current | Gets or sets the current checked ToggleButton of the RadioButtonGroup.
Top
Methods
Name | Description
AddItem | Adds a new ToggleButton to the RadioButtonGroup.
AddItems | Adds new ToggleButtons to the RadioButtonGroup.
GetItems | Gets the collection of ToggleButtons assigned to the RadioButtonGroup.
Top
Remarks
 This class contains a collection of ToggleButtons. Only one of the ToggleButtons will appear active at a given time. When a different button is clicked in the UI the current ToggleButton will be changed, and the ToggleButton's external command will be invoked. Use of this class is not supported in Revit Macros.
Example
private void AddRadioGroup(RibbonPanel panel)
{
    // add radio button group
    RadioButtonGroupData radioData = new RadioButtonGroupData("radioGroup");
    RadioButtonGroup radioButtonGroup = panel.AddItem(radioData) as RadioButtonGroup;
    // create toggle buttons and add to radio button group
    ToggleButtonData tb1 = new ToggleButtonData("toggleButton1", "Red");
    tb1.ToolTip = "Red Option";
    tb1.LargeImage = new BitmapImage(new Uri(@"D:\Sample\HelloWorld\bin\Debug\Red.bmp"));
    ToggleButtonData tb2 = new ToggleButtonData("toggleButton2", "Green");
    tb2.ToolTip = "Green Option";
    tb2.LargeImage = new BitmapImage(new Uri(@"D:\Sample\HelloWorld\bin\Debug\Green.bmp"));
    ToggleButtonData tb3 = new ToggleButtonData("toggleButton3", "Blue");
    tb3.ToolTip = "Blue Option";
    tb3.LargeImage = new BitmapImage(new Uri(@"D:\Sample\HelloWorld\bin\Debug\Blue.bmp"));
    radioButtonGroup.AddItem(tb1);
    radioButtonGroup.AddItem(tb2);
    radioButtonGroup.AddItem(tb3);
}
See Also
Reference
Autodesk.Revit.UI Namespace