Revit 2027 API
SizingOptions Methods
The SizingOptions type exposes the following members.
Methods
Name | Description
Dispose
IsValid |  Checks if the options are valid and ready for sizing operation.
SetEquivalentHeight |  Sets the equivalent height based on the specified width.
SetEquivalentWidth |  Sets the equivalent width based on the specified height.
SetNextAvailableSize(Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
SetNextAvailableSize(ConnectorProfileType, Double, Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
Top
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace