Revit 2027 API
ProjectLocationSetIterator Class
An iterator to a project location set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ProjectLocationSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ProjectLocationSetIterator : APIObject,
	IEnumerator
Public MustInherit Class ProjectLocationSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ProjectLocationSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ProjectLocationSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ProjectLocationSetIterator type exposes the following members.
Constructors
Name | Description
ProjectLocationSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace