Revit 2027 API
TableData Class
 The TableData class is implemented to hold most of the data that describe the style of the rows, columns, and cells in a table.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TableData
 Autodesk.Revit.DB.Electrical.PanelScheduleData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TableData : IDisposable
Public Class TableData
	Implements IDisposable
public ref class TableData : IDisposable
type TableData =
    class
        interface IDisposable
    end
The TableData type exposes the following members.
Properties
Name | Description
FreezeColumnsAndRows |  set to true if the columns and rows should be unmovable by the slider grips
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberOfSections |  Gets the number of items in section data array.
Width |  Gets or sets the table width in feet
WidthInPixels |  Gets the width of the panel schedule in logical pixels
ZoomLevel |  The value of zoom level for corresponding TableView.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TableData
GetSectionData(Int32) |  Returns the section data array element at the specified index.
GetSectionData(SectionType) |  Returns the pointer to the section data array element at the specified section type.
IsEqual |  Checks if this element is equal in value to the other element.
IsValidZoomLevel |  Verifies if the value of zoom level is valid.
Top
See Also
Reference
Autodesk.Revit.DB Namespace