Revit 2027 API
ComboBoxMemberData Class
This class contains information necessary to construct a ComboBoxMember.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ComboBoxMemberData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComboBoxMemberData : RibbonItemData
Public Class ComboBoxMemberData
	Inherits RibbonItemData
public ref class ComboBoxMemberData : public RibbonItemData
type ComboBoxMemberData =
    class
        inherit RibbonItemData
    end
The ComboBoxMemberData type exposes the following members.
Constructors
Name | Description
ComboBoxMemberData | Constructs a new instance of ComboBoxMemberData.
Top
Properties
Name | Description
GroupName | Gets or sets a group name for the ComboBoxMember.
Image | The image shown on the ComboBoxMember.
Text | The user-visible text of the ComboBoxMember.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace