Revit 2027 API
GBXMLExportOptions Class
 Green Building XML Export options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GBXMLExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GBXMLExportOptions : IDisposable
Public Class GBXMLExportOptions
	Implements IDisposable
public ref class GBXMLExportOptions : IDisposable
type GBXMLExportOptions =
    class
        interface IDisposable
    end
The GBXMLExportOptions type exposes the following members.
Constructors
Name | Description
GBXMLExportOptions |  Constructs a new instance of the options used to export a model in gbXML (Green Building XML) format.
Top
Properties
Name | Description
ExportAnalyticalSystems | Obsolete.
 Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the GBXMLExportOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace