Revit 2027 API
ElectricalLoadAreaData Class
 Represents the electrical load area data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpatialElementDomainData
 Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalLoadAreaData : SpatialElementDomainData
Public Class ElectricalLoadAreaData
	Inherits SpatialElementDomainData
public ref class ElectricalLoadAreaData : public SpatialElementDomainData
type ElectricalLoadAreaData =
    class
        inherit SpatialElementDomainData
    end
The ElectricalLoadAreaData type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CreateElectricalLoadAreas |  Creates electrical load areas on all the empty plan circuits of the given level.
GetAreaBasedLoadIds |  Gets the area based load ids of the electrical load area to be included.
HasCircuitsWithoutElectricalLoadAreas |  Checks whether there are any empty plan circuits in which there are no electrical load areas.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace