Revit 2027 API
StructuralSectionAnalysisParams Methods
The StructuralSectionAnalysisParams type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace