Revit 2027 API
TableCellStyleOverrideOptions Class
 This helper class represents the overridden characteristics of the associated cell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TableCellStyleOverrideOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TableCellStyleOverrideOptions : IDisposable
Public Class TableCellStyleOverrideOptions
	Implements IDisposable
public ref class TableCellStyleOverrideOptions : IDisposable
type TableCellStyleOverrideOptions =
    class
        interface IDisposable
    end
The TableCellStyleOverrideOptions type exposes the following members.
Constructors
Name | Description
TableCellStyleOverrideOptions() |  Creates a new instance with no style characteristics overridden.
TableCellStyleOverrideOptions(TableCellStyleOverrideOptions) |  Creates a new instance by copying an existing instance.
Top
Properties
Name | Description
BackgroundColor |  Indicates if the background color characteristic is overridden.
Bold |  Indicates if the bold characteristic is overridden.
BorderBottomLineStyle |  Indicates if the border bottom line style characteristic is overridden.
BorderLeftLineStyle |  Indicates if the border left line style characteristic is overridden.
BorderLineStyle |  Indicates if the border line style characteristic is overridden.
BorderRightLineStyle |  Indicates if the border right line style characteristic is overridden.
BorderTopLineStyle |  Indicates if the border top line style characteristic is overridden.
Font |  Indicates if the font name characteristic is overridden.
FontColor |  Indicates if the font color characteristic is overridden.
FontSize |  Indicates if the font size characteristic is overridden.
HorizontalAlignment |  Indicates if the horizontal alignment characteristic is overridden.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Italics |  Indicates if the italics characteristic is overridden.
TextOrientation |  Indicates if the text orientation characteristic is overridden.
Underline |  Indicates if the underline characteristic is overridden.
VerticalAlignment |  Indicates if the vertical alignment characteristic is overridden.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TableCellStyleOverrideOptions
SetAllOverrides |  Sets all overrides to a specific value.
Top
Remarks
 The user can override the text appearance and cell graphic properties by setting the corresponding flag to true. The global base format will control the non-overridden characteristics.
See Also
Reference
Autodesk.Revit.DB Namespace