Revit 2027 API
FabricAreaType Class
 A FabricAreaType object is used in FabricArea object generation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.FabricAreaType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricAreaType : ElementType
Public Class FabricAreaType
	Inherits ElementType
public ref class FabricAreaType : public ElementType
type FabricAreaType =
    class
        inherit ElementType
    end
The FabricAreaType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
CreateDefaultFabricAreaType |  Creates a new FabricAreaType object with a default name.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace