Revit 2027 API
UpdaterRegistry Methods
The UpdaterRegistry type exposes the following members.
Methods
Name | Description
AddTrigger(UpdaterId, ElementFilter, ChangeType) |  Adds trigger with the specified element filter and ChangeType for all documents associated with this Updater
AddTrigger(UpdaterId, Document, ElementFilter, ChangeType) |  Adds trigger with the specified element filter and ChangeType for the specified document
AddTrigger(UpdaterId, Document, ICollection<ElementId>, ChangeType) |  Adds a trigger to an updater with specified set of elements and ChangeType
DisableUpdater |  Disables the updater.
Dispose
EnableUpdater |  Enables the updater.
GetIsUpdaterOptional |  Check if the updater is optional or not.
GetRegisteredUpdaterInfos() |  Returns UpdaterInfos for all the application-wide updaters.
GetRegisteredUpdaterInfos(Document) |  Returns information about all updaters applicable to the given document.
IsUpdaterEnabled |  Checks if the updater is enabled or not.
IsUpdaterRegistered(UpdaterId) |  Checks whether updater with the given id is registered
IsUpdaterRegistered(UpdaterId, Document) |  Checks whether updater with the given id is registered in a document.
RegisterUpdater(IUpdater) |  Registers an updater application-wide, which means the updater may get triggered in any open document.
RegisterUpdater(IUpdater, Document) |  Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document.
RegisterUpdater(IUpdater, Boolean) |  Registers an updater application-wide, which means the updater may get triggered in any open document.
RegisterUpdater(IUpdater, Document, Boolean) |  Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document.
RemoveAllTriggers |  Removes all triggers associated with Updater with specified UpdaterId. Does not unregister updater.
RemoveDocumentTriggers |  Removes all triggers associated with specified document and Updater Does not unregister updater.
SetExecutionOrder |  Forces execution order between two updaters Execution order: first before second
SetIsUpdaterOptional |  Sets a flag indicating whether an updater is optional or not.
UnregisterUpdater(UpdaterId) |  Removes the updater associated with the input id from the UpdaterRegistry. Also removes all triggers associated with the Updater.
UnregisterUpdater(UpdaterId, Document) |  Unregisters an updater for the given document.
Top
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace