Revit 2027 API
ExternalFileReference Methods
The ExternalFileReference type exposes the following members.
Methods
Name | Description
Dispose
GetAbsolutePath |  Returns an absolute path to the referenced file, regardless of whether the PathType.Enum is relative or absolute.
GetLinkedFileStatus |  Returns a LinkedFileStatus.Enum corresponding to the load status of the referenced file.
GetPath |  Gets the path of the link, relative or absolute according to the link's settings
GetReferencingId |  Gets the ElementId corresponding to the element which this ExternalFileReference is associated with.
IsValidExternalFileReference |  Checks an ExternalFileReference to see if it is properly created.
IsValidPathTypeForExternalFileReference |  Checks whether a PathType enum value will be valid to use with this ExternalFileReference.
Top
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace