Revit 2027 API
ReferencePlane Methods
The ReferencePlane type exposes the following members.
Methods
Name | Description
Flip |  Flips the orientation of the reference plane.
GetPlane |  Returns the geometry plane to which the reference plane is assigned.
GetReference |  Returns the geometry reference of the reference plane.
Top
See Also
Reference
ReferencePlane Class
Autodesk.Revit.DB Namespace