Revit 2027 API
IControllableDropHandler Interface
 An interface to be executed when custom data is dragged and dropped onto the Revit user interface. This interface is different from IDropHandler in that it allows the handler to verify whether the drop event can be executed on the given view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IControllableDropHandler : IDropHandler
Public Interface IControllableDropHandler
	Inherits IDropHandler
public interface class IControllableDropHandler : IDropHandler
type IControllableDropHandler =
    interface
        interface IDropHandler
    end
The IControllableDropHandler type exposes the following members.
Methods
Name | Description
CanExecute |  Implement this method to inform Revit whether the drop event can be executed onto the given view.
Top
Remarks
 Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.
See Also
Reference
Autodesk.Revit.UI Namespace