Revit 2027 API
MechanicalEquipment Class
Provides access to the Mechanical Equipment in Autodesk Revit MEP.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.MEPModel
 Autodesk.Revit.DB.Mechanical.MechanicalEquipment
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalEquipment : MEPModel
Public Class MechanicalEquipment
	Inherits MEPModel
public ref class MechanicalEquipment : public MEPModel
type MechanicalEquipment =
    class
        inherit MEPModel
    end
The MechanicalEquipment type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
The Mechanical Equipment object can only be queried in Autodesk Revit MEP.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace