Revit 2027 API
StructuralSectionGeneralLA Class
 Defines parameters for Angle Cold Formed structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralLA : StructuralSectionColdFormed
Public Class StructuralSectionGeneralLA
	Inherits StructuralSectionColdFormed
public ref class StructuralSectionGeneralLA : public StructuralSectionColdFormed
type StructuralSectionGeneralLA =
    class
        inherit StructuralSectionColdFormed
    end
The StructuralSectionGeneralLA type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralLA |  Creates a new instance of Angle Cold Formed shape.
Top
Properties
Name | Description
LipLength |  Lip segment length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace