Revit 2027 API
SlabShapeCrease Methods
The SlabShapeCrease type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SlabShapeCrease Class
Autodesk.Revit.DB Namespace