Revit 2027 API
ACADExportOptions Class
 The base class for options used to export DWG and DXF format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DWGExportOptions
 Autodesk.Revit.DB.DXFExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ACADExportOptions : BaseExportOptions
Public Class ACADExportOptions
	Inherits BaseExportOptions
public ref class ACADExportOptions : public BaseExportOptions
type ACADExportOptions =
    class
        inherit BaseExportOptions
    end
The ACADExportOptions type exposes the following members.
Properties
Name | Description
ACAPreference |  The preferred way to generate geometry of ACA objects. Default value is ACAObjectPreference.Object.
ExportingAreas |  True to export area and room geometry, false otherwise. Default value is false.
ExportOfSolids |  The mode used to export solids in 3D views. Default value is SolidGeometry.Polymesh.
FileVersion |  ACADVersion::Default Default value is ACADVersion.Default.
HatchBackgroundColor |  The color that will be set as hatch backgound color on the exported hatch. This color will be used only if useHatchBackgroundColor is true. default value is white
LineScaling |  The scaling mode for the line type. Default value is LineScaling.ViewScale.
LinetypesFileName |  The custom linetype file name (*.lin). Default value is empty.
MarkNonplotLayers |  If true and the nonplot layer suffix is not empty, all layers whose names contain that suffix will be marked as non-plot.
NonplotSuffix |  If the MarkNonplotLayers attribute is set to true, all layers with names containing this suffix will be marked as non-plot. No action will be performed if the suffix is empty.
SharedCoords |  True to use the shared coordinate system's origin, false to use the project origin. Default value is false.
TargetUnit |  The target unit type. Default value is ExportUnit.Default.
TextTreatment |  The text treatment. Deault value is TextTreatment.Exact.
UseHatchBackgroundColor |  Indicates if hatch background color will be used or not. default value is false.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace