Revit 2027 API
DialogBoxShowingEventArgs Properties
The DialogBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
DialogId |  A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
Top
See Also
Reference
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace