Revit 2027 API
TargetHostEdgeAndTransform Methods
The TargetHostEdgeAndTransform type exposes the following members.
Methods
Name | Description
Dispose
GetHostEdgeTransform |  Gets the transform that is associated to the host edge's geometry.
GetTargetHostEdge |  Gets the target host edge.
Top
See Also
Reference
TargetHostEdgeAndTransform Class
Autodesk.Revit.DB.Structure Namespace