Revit 2027 API
HasNoValueFilterRule Class
 Tests whether an element's parameter doesn't have a value.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.ParameterValuePresenceRule
 Autodesk.Revit.DB.HasNoValueFilterRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HasNoValueFilterRule : ParameterValuePresenceRule
Public Class HasNoValueFilterRule
	Inherits ParameterValuePresenceRule
public ref class HasNoValueFilterRule : public ParameterValuePresenceRule
type HasNoValueFilterRule =
    class
        inherit ParameterValuePresenceRule
    end
The HasNoValueFilterRule type exposes the following members.
Constructors
Name | Description
HasNoValueFilterRule |  constructs an instance of HasNoValueFilterRule.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace