Revit 2027 API
RouteAnalysisSettings Methods
The RouteAnalysisSettings type exposes the following members.
Methods
Name | Description
GetExcludedCategoryIds |  Returns ElementIds for Category elements which are excluded (not taken into account) by route calculation. These categories are always excluded, regardless of the EnableIgnoredCategoryIds value. If an excluded category has sub-categories, then the sub-categories will be excluded as well.
GetIgnoredCategoryIds |  Returns ElementIds for Category elements which are ignored (not taken into account) route calculation. To enable ignoring of these categories, EnableIgnoredCategoryIds must be set to true. If an ignored category has sub-categories, then the sub-categories will be ignored as well.
GetRouteAnalysisSettings |  Returns the RouteAnalysisSettings element for a given document.
IsLargeGeometryAllowed |  Returns if large geometry is allowed for path of travel creation or not.
SetIgnoredCategoryIds |  Sets the ElementIds for Category elements which are ignored by route calculation.
Top
See Also
Reference
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace