Revit 2027 API
CentralModelContentionException Class
The exception thrown when a central model is busy (locked) and the operation is canceled.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CentralModelContentionException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class CentralModelContentionException : CentralModelException
<SerializableAttribute>
Public Class CentralModelContentionException
	Inherits CentralModelException
[SerializableAttribute]
public ref class CentralModelContentionException : public CentralModelException
[<SerializableAttribute>]
type CentralModelContentionException =
    class
        inherit CentralModelException
    end
The CentralModelContentionException type exposes the following members.
Properties
Name | Description
CurrentUser | Retrieves current user name.
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace