Revit 2027 API
Panel Class
This object represents a curtain panel.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 Autodesk.Revit.DB.FamilyInstance
 Autodesk.Revit.DB.Panel
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Panel : FamilyInstance
Public Class Panel
	Inherits FamilyInstance
public ref class Panel : public FamilyInstance
type Panel =
    class
        inherit FamilyInstance
    end
The Panel type exposes the following members.
Properties
Name | Description
Lockable | This property is used to know whether a panel can be locked.
PanelType |  The Panel style of this Panel.
Transform | This property is used to find the transform of a curtain panel within project.
Top
Methods
Name | Description
FindHostPanel |  Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel.
GetRefGridLines |  This method is used to get the reference gridlines.
Top
See Also
Reference
Autodesk.Revit.DB Namespace