Revit 2027 API
FileSaveDialog Properties
The FileSaveDialog type exposes the following members.
Properties
Name | Description
InitialFileName |  The initial file name to be shown for this save operation.
Top
See Also
Reference
FileSaveDialog Class
Autodesk.Revit.UI Namespace