Revit 2027 API
DetailArc Class
Represents a DetailArc within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.DetailCurve
 Autodesk.Revit.DB.DetailArc
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DetailArc : DetailCurve
Public Class DetailArc
	Inherits DetailCurve
public ref class DetailArc : public DetailCurve
type DetailArc =
    class
        inherit DetailCurve
    end
The DetailArc type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.
See Also
Reference
Autodesk.Revit.DB Namespace