Revit 2027 API
AssetPropertyBoolean Class
 Represents a property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyBoolean
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyBoolean : AssetProperty
Public Class AssetPropertyBoolean
	Inherits AssetProperty
public ref class AssetPropertyBoolean : public AssetProperty
type AssetPropertyBoolean =
    class
        inherit AssetProperty
    end
The AssetPropertyBoolean type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace