Revit 2027 API
BuildingOperatingYearSchedule Properties
The BuildingOperatingYearSchedule type exposes the following members.
Properties
Name | Description
ScheduleName |  The name of the schedule.
Top
See Also
Reference
BuildingOperatingYearSchedule Class
Autodesk.Revit.DB.Analysis Namespace