Revit 2027 API
PresetInitialColor Properties
The PresetInitialColor type exposes the following members.
Properties
Name | Description
Preset |  The preset value
Top
See Also
Reference
PresetInitialColor Class
Autodesk.Revit.DB.Lighting Namespace