Revit 2027 API
BIMExportOptions Methods
The BIMExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
BIMExportOptions Class
Autodesk.Revit.DB Namespace