Revit 2027 API
AreaBasedLoadData Properties
The AreaBasedLoadData type exposes the following members.
Properties
Name | Description
ApparentLoad |  The electrical apparent load of the area based load.
ApparentPowerDensity |  The apparent power density of the area based load.
AreaBasedLoadType |  The electrical area based load type of the area based load.
ConnectedPhases |  The electrical connected phases of the area based load to its upstream node.
Current |  The current of the area based load .
LoadClassification |  The load classification of the area based load.
LoadDensity |  The load density of the area based load.
LoadType |  The load type of the area based load.
PhasesNumber |  The number of electrical phases of the area based load.
PowerFactor |  The power factor of the area based load.
PowerFactorState |  The power factor state of the area based load.
TrueLoad |  The electrical true load of the area based load.
Voltage |  The voltage of the area based load.
Top
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace