Revit 2027 API
Wall Properties
The Wall type exposes the following members.
Properties
Name | Description
CrossSection |  Gets or sets the Cross-section for this wall.
CurtainGrid |  Get the grid object of a curtain wall
Flipped |  Property to test whether the wall orientation is flipped.
IsStackedWall |  Identifies if the wall is a stacked wall.
IsStackedWallMember |  Identifies if the wall is a member of a stacked wall.
Orientation |  The outward-facing normal vector of the exterior side face at the starting point of the wall.
SketchId |  Returns id of the profile sketch, or invalidElementId if sketch does not exist.
StackedWallOwnerId |  Gets the stacked wall which contains this stacked wall member.
StructuralUsage |  Retrieves or changes the wall's designated structural usage.
WallType |  Retrieves or changes the type of the wall.
Width |  Get the overall thickness of the wall.
Top
See Also
Reference
Wall Class
Autodesk.Revit.DB Namespace