Revit 2027 API
LayerModifier Class
 A modifier used to designate extra strings to appear in the exported layer name.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LayerModifier
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LayerModifier : IDisposable
Public Class LayerModifier
	Implements IDisposable
public ref class LayerModifier : IDisposable
type LayerModifier =
    class
        interface IDisposable
    end
The LayerModifier type exposes the following members.
Constructors
Name | Description
LayerModifier() |  Constructs a new LayerModifier with default values.
LayerModifier(ModifierType, String) |  Constructs a new LayerModifier with modifierType and separator.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ModifierType |  The modifier type of LayerModifier.
Separator |  The separator string that will follow this modifier in the export layer name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LayerModifier
Top
Remarks
 A modifier consists of a type (from ModifierType and an optional separator. Apply a modifier to one or more ExportLayerInfo objects to modify the layer name that will be assigned when a Revit object is exported.
See Also
Reference
Autodesk.Revit.DB Namespace