Revit 2027 API
SATImportOptions Class
 The import options used to import SAT format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.SATImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SATImportOptions : BaseImportOptions
Public Class SATImportOptions
	Inherits BaseImportOptions
public ref class SATImportOptions : public BaseImportOptions
type SATImportOptions =
    class
        inherit BaseImportOptions
    end
The SATImportOptions type exposes the following members.
Constructors
Name | Description
SATImportOptions() |  Constructs a new instance of SATImportOptions with default values of all properties.
SATImportOptions(SATImportOptions) |  Constructs a new instance of SATImportOptions as a copy of the import options.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace