Revit 2027 API
ISingleServerService Interface
 The base interface class for all single-server services.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface ISingleServerService : IExternalService
Public Interface ISingleServerService
	Inherits IExternalService
public interface class ISingleServerService : IExternalService
type ISingleServerService =
    interface
        interface IExternalService
    end
The ISingleServerService type exposes the following members.
Methods
Name | Description
Top
Remarks
 Both single-server and multi-server services may have more than one server registered for them. The difference between these two kinds is while there can only be one active server at any given time for a single-sever service, there may be a set of active servers assigned for a multi-server service.
 ISingleServerService does not have any specific methods (currently) added to those inherited from the common IExternalService interface.
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace