Revit 2027 API
LoadNature Methods
The LoadNature type exposes the following members.
Methods
Name | Description
Create |  Creates a new LoadNature.
Top
See Also
Reference
LoadNature Class
Autodesk.Revit.DB.Structure Namespace