Revit 2027 API
WireframeBuilder Class
 Constructs a shape representation consisting of points and curves. That shape would typically be stored in a DirectShape or a DirectShapeType object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ShapeBuilder
 Autodesk.Revit.DB.WireframeBuilder
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WireframeBuilder : ShapeBuilder
Public Class WireframeBuilder
	Inherits ShapeBuilder
public ref class WireframeBuilder : public ShapeBuilder
type WireframeBuilder =
    class
        inherit ShapeBuilder
    end
The WireframeBuilder type exposes the following members.
Constructors
Name | Description
WireframeBuilder |  Default constructor.
Top
Properties
Name | Description
Top
Methods
Name | Description
AddCurve |  Add a curve to the shape representation stored in this WireframeBuilder.
AddPoint |  Add a point to the shape representation stored in this WireframeBuilder.
Reset |  Clears the accumulated geometry.
ValidateCurve |  Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input. This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve().
ValidatePoint |  Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input.
Top
See Also
Reference
Autodesk.Revit.DB Namespace