Revit 2027 API
OperationCanceledException Class
The exception that is thrown when an operation is unexpectedly cancelled.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.OperationCanceledException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class OperationCanceledException : ApplicationException
<SerializableAttribute>
Public Class OperationCanceledException
	Inherits ApplicationException
[SerializableAttribute]
public ref class OperationCanceledException : public ApplicationException
[<SerializableAttribute>]
type OperationCanceledException =
    class
        inherit ApplicationException
    end
The OperationCanceledException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace