Revit 2027 API
RibbonButtonOptions Class
 A utility class containing the Revit.ini options settings related to ribbon buttons
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonButtonOptions
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RibbonButtonOptions : IDisposable
Public Class RibbonButtonOptions
	Implements IDisposable
public ref class RibbonButtonOptions : IDisposable
type RibbonButtonOptions =
    class
        interface IDisposable
    end
The RibbonButtonOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RibbonButtonOptions
Top
See Also
Reference
Autodesk.Revit.UI Namespace