Revit 2027 API
SymbolGeometryId Methods
The SymbolGeometryId type exposes the following members.
Methods
Name | Description
AsUniqueIdentifier |  Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
Dispose
Top
See Also
Reference
SymbolGeometryId Class
Autodesk.Revit.DB Namespace