Revit 2027 API
Level Methods
The Level type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of level based on an input elevation.
FindAssociatedPlanViewId |  Finds the id of the first available associated floor or structural plan view associated with this level.
GetNearestLevelId(Document, Double) |  Returns id of the Level which is closest to the specified elevation.
GetNearestLevelId(Document, Double, Double) |  Returns id of the Level which is closest to the specified elevation.
GetPlaneReference |  Returns a reference to this element as a plane.
Top
See Also
Reference
Level Class
Autodesk.Revit.DB Namespace