Revit 2027 API
RevisionNumberingSequence Properties
The RevisionNumberingSequence type exposes the following members.
Properties
Name | Description
NumberType |  Indicates the revision number type of the revision numbering sequence.
SequenceName |  The name of this revision numbering sequence.
Top
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace