Revit 2027 API
MemberForces Class
 An object that represents a member forces on analytical element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.MemberForces
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MemberForces : IDisposable
Public Class MemberForces
	Implements IDisposable
public ref class MemberForces : IDisposable
type MemberForces =
    class
        interface IDisposable
    end
The MemberForces type exposes the following members.
Constructors
Name | Description
MemberForces |  Creates a new instance of MemberForces.
Top
Properties
Name | Description
Force |  The translational forces at relative point position of the element.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Moment |  The rotational forces at relative point position of the element.
Start |  Member Forces position on analytical element. True for start, false for end.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MemberForces
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace