Revit 2027 API
OutdatedDirectlyOpenedCentralException Methods
The OutdatedDirectlyOpenedCentralException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
OutdatedDirectlyOpenedCentralException Class
Autodesk.Revit.Exceptions Namespace