Revit 2027 API
SpaceFilter Class
 A filter used to match spaces.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Mechanical.SpaceFilter
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpaceFilter : ElementSlowFilter
Public Class SpaceFilter
	Inherits ElementSlowFilter
public ref class SpaceFilter : public ElementSlowFilter
type SpaceFilter =
    class
        inherit ElementSlowFilter
    end
The SpaceFilter type exposes the following members.
Constructors
Name | Description
SpaceFilter |  Constructs a filter which matches only spaces.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace