Revit 2027 API
EnergyAnalysisZone Class
 Analytical zone.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisZone
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyAnalysisZone : Element
Public Class EnergyAnalysisZone
	Inherits Element
public ref class EnergyAnalysisZone : public Element
type EnergyAnalysisZone =
    class
        inherit Element
    end
The EnergyAnalysisZone type exposes the following members.
Properties
Name | Description
AirChangesPerHour |  The outside air rate or air changes per hour as a number between 0 and 10000.
CADObjectUniqueId |  The unique id of the originating CAD object (model element) associated with this zone.
CoolingAirTemperature |  The cooling air temperature in unit Kelvin (K).
CoolingSetPoint |  The cooling temperature set point in unit Kelvin (K).
DehumidificationSetPoint |  The dehumidification set point as a number between 0 and 1.
HeatingAirTemperature |  The cooling air temperature in unit Kelvin (K).
HeatingSetPoint |  The heating temperature set point in unit Kelvin (K).
HumidificationSetPoint |  The humidification set point as a number between 0 and 1.
OutsideAirPerArea |  The outside air per area in unit ft/s.
OutsideAirPerPerson |  The outside air per person in unit ft3/s.
UseAirChangesPerHour |  Use the air changes per hour.
UseDehumidificationSetPoint |  Use the dehumidification set point.
UseHumidificationSetPoint |  Use the humidification set point.
UseOutsideAirPerArea |  Use the outside air per area.
UseOutsideAirPerPerson |  Use the outside air per person.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace