Revit 2027 API
ViewSheet Class
 Class for ViewSheet
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.ViewSheet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewSheet : View
Public Class ViewSheet
	Inherits View
public ref class ViewSheet : public View
type ViewSheet =
    class
        inherit View
    end
The ViewSheet type exposes the following members.
Properties
Name | Description
IsPlaceholder |  Identifies whether or not the view sheet represents a placeholder sheet.
SheetCollectionId |  The ID of the sheet collection this sheet is associated with.
SheetNumber |  The sheet number of the document.
SheetTitleBlockId |  The Id of the title block this sheet is associated with.
Top
Methods
Name | Description
CanBeDuplicated |  Identifies if this sheet can be duplicated.
ConvertToRealSheet |  Converts a placeholder sheet to a real one with an optional titleblock.
Create |  Creates a new ViewSheet.
CreatePlaceholder |  Creates a placeholder sheet in a document.
DeleteViewport |  Removes a viewport from the sheet by deleting it from the document.
Duplicate(SheetDuplicateOption) |  Duplicates this sheet to generate a new one.
GetAdditionalRevisionIds |  Gets the Revisions that are additionally included in the sheet's revision schedules.
GetAllPlacedViews |  Returns the ElementIds of Views placed on this sheet.
GetAllRevisionCloudIds |  Gets the ids of the revision clouds which appear on the sheet's revision schedules.
GetAllRevisionIds |  Gets the ordered array of Revisions which participate in the sheet's revision schedules.
GetAllViewports |  Returns the ElementIds of Viewports on this sheet.
GetCurrentRevision |  Returns the most recent numbered Revision shown on this ViewSheet.
GetRevisionCloudNumberOnSheet |  Gets the Revision Number for a RevisionCloud on this sheet.
GetRevisionNumberOnSheet |  Gets the Revision Number for a particular Revision as it will appear on this sheet.
SetAdditionalRevisionIds |  Sets the Revisions to additionally include in the sheet's revision schedules.
Top
Example
private void Getinfo_ViewSheet(ViewSheet viewSheet)
{
    string message = "ViewSheet: ";
    //Get the number of the Sheet
    string sheetNumber = viewSheet.SheetNumber;
    message += "\nSheet Number: " + sheetNumber;
    //Exception occurs when set SheetNumber to a number that isn't unique
    string TestSheetNumber = "My sheet";
    viewSheet.SheetNumber = TestSheetNumber;
    message += "\nSheet Number after set: " + sheetNumber;
    ICollection<ElementId> views = viewSheet.GetAllPlacedViews();
    message += "\nNumber of views in the sheet : " + views.Count;
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace