Revit 2027 API
SelectionUIOptions Methods
The SelectionUIOptions type exposes the following members.
Methods
Name | Description
Dispose
ElementSelectsAsPinned |  Checks whether the specified element will be treated as pinned for the purposes of selection.
GetSelectionUIOptions |  Returns the current user's SelectionOptions.
Top
See Also
Reference
SelectionUIOptions Class
Autodesk.Revit.UI Namespace