Revit 2027 API
TopRail Class
 Represents a top rail element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.ContinuousRail
 Autodesk.Revit.DB.Architecture.TopRail
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TopRail : ContinuousRail
Public Class TopRail
	Inherits ContinuousRail
public ref class TopRail : public ContinuousRail
type TopRail =
    class
        inherit ContinuousRail
    end
The TopRail type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace