Revit 2027 API
FaceArrayIterator Methods
The FaceArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
FaceArrayIterator Class
Autodesk.Revit.DB Namespace