Revit 2027 API
Revision Class
 Represents a single revision in the project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Revision
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Revision : Element
Public Class Revision
	Inherits Element
public ref class Revision : public Element
type Revision =
    class
        inherit Element
    end
The Revision type exposes the following members.
Properties
Name | Description
Description |  The description of this Revision.
Issued |  Indicates whether this Revision has been issued.
IssuedBy |  Indicates who has issued or will issue this Revision.
IssuedTo |  Indicates to whom this Revision was or will be issued.
RevisionDate |  The date of this Revision.
RevisionNumber |  The Revision number of this revision.
RevisionNumberingSequenceId |  The id of the revision numbering sequence which controls this revision's numbering.
SequenceNumber |  The Sequence Number of this Revision.
Visibility |  Controls the visibility of revision clouds and revision tags related to this Revision.
Top
Methods
Name | Description
CombineWithNext |  Combines the specified Revision with the next Revision.
CombineWithPrevious |  Combines the specified Revision with the previous Revision.
Create |  Creates a new Revision in the project.
GetAllRevisionIds |  Returns the ids of all Revisions in the project ordered by sequence number.
ReorderRevisionSequence |  Reorders the sequence of Revisions in the project.
Top
Remarks
 The Revision object represents the data related to a single revision in the project. Revision clouds and tags can be associated with a particular Revision object to display its properties on sheets.
 The revisions in the project are stored in a specific order called the revision sequence. The revision sequence represents the conceptual sequence in which revisions will be issued.
See Also
Reference
Autodesk.Revit.DB Namespace