Revit 2027 API
ExtendedPropertiesLinkLoadContent Class
 Represents the data needed to establish or update an ExtendedPropertiesLink. To be used as the result of invoking an external server in order to update or create an ExtendedPropertiesLink.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceLoadContent
 Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkLoadContent
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtendedPropertiesLinkLoadContent : ExternalResourceLoadContent
Public Class ExtendedPropertiesLinkLoadContent
	Inherits ExternalResourceLoadContent
public ref class ExtendedPropertiesLinkLoadContent : public ExternalResourceLoadContent
type ExtendedPropertiesLinkLoadContent =
    class
        inherit ExternalResourceLoadContent
    end
The ExtendedPropertiesLinkLoadContent type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
SetExtendedPropertiesLinkData |  Sets the extended properties data from the external server.
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace