Revit 2027 API
MEPNetworkSegmentData Methods
The MEPNetworkSegmentData type exposes the following members.
Methods
Name | Description
Dispose
GetDownstreamSegments |  Gets all downstream network segments.
GetUpstreamSegments |  Gets all upstream network segments.
IsValid |  Verified if this segment data has been assigned some valid values afer calculation.
Top
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace