Revit 2027 API
DoubleArray Class
An array that contains doubles.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DoubleArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DoubleArray : APIObject,
	IEnumerable
Public Class DoubleArray
	Inherits APIObject
	Implements IEnumerable
public ref class DoubleArray : public APIObject,
	IEnumerable
type DoubleArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The DoubleArray type exposes the following members.
Constructors
Name | Description
DoubleArray | Initializes a new instance of the DoubleArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a double at a specified index within the array.
Size | Returns the number of doubles that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every double from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace