Revit 2027 API
BRepBuilderEdgeGeometry Class
 An abstract class used by BRepBuilder to represent the geometry of an edge. Specific edge-geometry representations are represented by subclasses.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BRepBuilderEdgeGeometry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BRepBuilderEdgeGeometry : IDisposable
Public Class BRepBuilderEdgeGeometry
	Implements IDisposable
public ref class BRepBuilderEdgeGeometry : IDisposable
type BRepBuilderEdgeGeometry =
    class
        interface IDisposable
    end
The BRepBuilderEdgeGeometry type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Create(Curve) |  Construct BRepBuilderEdgeGeometry based on any Revit Curve, including Line and Arc. The curve will be simplified if possible.
Create(XYZ, XYZ) |  Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points.
Dispose | Releases all resources used by the BRepBuilderEdgeGeometry
Top
See Also
Reference
Autodesk.Revit.DB Namespace