Revit 2027 API
ModelCurveArrayIterator Properties
The ModelCurveArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
ModelCurveArrayIterator Class
Autodesk.Revit.DB Namespace