Revit 2027 API
RepeaterCoordinates Methods
The RepeaterCoordinates type exposes the following members.
Methods
Name | Description
Dispose
GetCoordinate |  Returns the coordinate in the given dimension.
Top
See Also
Reference
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace