Revit 2027 API
BuildingOperatingDaySchedule Properties
The BuildingOperatingDaySchedule type exposes the following members.
Properties
Name | Description
ScheduleName |  The name of the schedule.
Top
See Also
Reference
BuildingOperatingDaySchedule Class
Autodesk.Revit.DB.Analysis Namespace