Revit 2027 API
VertexFormat Methods
The VertexFormat type exposes the following members.
Methods
Name | Description
Dispose
IsValid |  Tests whether the vertex format specification is valid for rendering.
Top
See Also
Reference
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace