Revit 2027 API
AnalyticalPowerDistributableNodeData Class
 Represents the data and parameters of a power distributable node. A power distribution node is an electrical analytical node with a distribution system which defines the connection rules between upstream and downstream electrical analytical nodes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
 Autodesk.Revit.DB.Electrical.AnalyticalBusData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
 Autodesk.Revit.DB.Electrical.AnalyticalTransferSwitchData
 Autodesk.Revit.DB.Electrical.AnalyticalTransformerData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalPowerDistributableNodeData : AnalyticalDistributionNodePropertyData
Public Class AnalyticalPowerDistributableNodeData
	Inherits AnalyticalDistributionNodePropertyData
public ref class AnalyticalPowerDistributableNodeData : public AnalyticalDistributionNodePropertyData
type AnalyticalPowerDistributableNodeData =
    class
        inherit AnalyticalDistributionNodePropertyData
    end
The AnalyticalPowerDistributableNodeData type exposes the following members.
Properties
Name | Description
AssignedPhasesNumber |  The number of electrical phases assigned through the distribution system of the power distributable node.
AssignedVoltage |  The voltage assigned through the distribution system of the power distributable node.
DistributionSystem |  The distribution system of the power distributable node.
Top
Methods
Name | Description
GetAllAvailableConnectedPhasesOnDownstream |  Get all the available electrical connected phases that this power distributable node can provide to the downstream node.
GetApparentPerPhaseResults |  Get an ElectricalPerPhaseData which contains each electrical phase's apparent load and apprent current of the power distributable node.
GetConnectedPhasesOnDownstream |  Get the electrical connected phases of the downstream node.
GetDemandPerPhaseResults |  Get an ElectricalPerPhaseData which contains each electrical phase's demand load and demand current of the power distributable node.
SetConnectedPhasesOnDownstream |  Set the electrical connected phases of the downstream node.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace