Revit 2027 API
AnalysisDisplayDeformedShapeSettings Methods
The AnalysisDisplayDeformedShapeSettings type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Compares two deformed shape settings objects.
Top
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace