Revit 2027 API
PathReinSpanSymbol Class
 Represents a Path Reinforcement Span Symbol element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.PathReinSpanSymbol
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PathReinSpanSymbol : IndependentTag
Public Class PathReinSpanSymbol
	Inherits IndependentTag
public ref class PathReinSpanSymbol : public IndependentTag
type PathReinSpanSymbol =
    class
        inherit IndependentTag
    end
The PathReinSpanSymbol type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of PathReinSpanSymbol in the project.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace