Revit 2027 API
SpacingRule Methods
The SpacingRule type exposes the following members.
Methods
Name | Description
SetLayoutFixedDistance | Set the Layout property to FixedDistance.
SetLayoutFixedNumber | Set the Layout property to FixedNumber.
SetLayoutMaximumSpacing | Set the Layout property to MaximumSpacing.
SetLayoutMinimumSpacing | Set the Layout property to MinimumSpacing.
SetLayoutNone | Set the Layout property to None.
Top
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace