Revit 2027 API
CustomInitialColor Class
 This class encapsulates a custom initial lighting color.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.CustomInitialColor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CustomInitialColor : InitialColor
Public Class CustomInitialColor
	Inherits InitialColor
public ref class CustomInitialColor : public InitialColor
type CustomInitialColor =
    class
        inherit InitialColor
    end
The CustomInitialColor type exposes the following members.
Constructors
Name | Description
CustomInitialColor(CustomInitialColor) |  Creates a copy of the given custom initial color
CustomInitialColor(Double) |  Creates a custom initial color set to the given color
Top
Properties
Name | Description
Temperature |  The custom color temperature value.
Top
Methods
Name | Description
Top
Remarks
 This color is called an initial color because a color filter can also be added to modify the color.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace