Revit 2027 API
PointLoad Properties
The PointLoad type exposes the following members.
Properties
Name | Description
ForceVector |  The force vector applied to the point load, oriented according to OrientTo setting.
MomentVector |  The moment vector applied to the point load, oriented according to OrientTo setting.
Point |  Returns the position of point load, measured in decimal feet.
Top
See Also
Reference
PointLoad Class
Autodesk.Revit.DB.Structure Namespace