Revit 2027 API
SelectionFilterElement Class
 A filter element that stores an explicit list of ElementIds. Only elements whose ElementIds are in this list will pass the filter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FilterElement
 Autodesk.Revit.DB.SelectionFilterElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SelectionFilterElement : FilterElement
Public Class SelectionFilterElement
	Inherits FilterElement
public ref class SelectionFilterElement : public FilterElement
type SelectionFilterElement =
    class
        inherit FilterElement
    end
The SelectionFilterElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddSet |  Adds a set of ElementIds to the filter's set.
AddSingle |  Adds a single ElementId to the filter's set.
Clear |  Removes all ElementIds from the filter.
Contains |  Returns true if the given ElementId is a member of this filter's set.
Create |  Creates a new SelectionFilterElement in the given document.
GetElementIds |  Returns the set of ElementIds contained by this filter.
IsEmpty |  Determines whether this filter's set is empty or not.
RemoveSet |  Removes a set of ElementIds from the filter's set.
RemoveSingle |  Removes a single ElementId from the filter's set.
SetElementIds |  Replaces the set of ElementIds contained by this filter.
Top
Example
public static void CreateSelectionFilter(Document doc, View view)
{
    // find room tags in this view
    FilteredElementCollector collector = new FilteredElementCollector(doc, view.Id);
    collector.WherePasses(new RoomTagFilter());
    // collect tags whose room number matches criteria
    List<ElementId> tagIds = new List<ElementId>();
    foreach (RoomTag tag in collector.Cast<RoomTag>())
    {
        int number = Int32.Parse(tag.Room.Number);
        if (number % 3 == 0)
        {
            tagIds.Add(tag.Id);
        }
    }
    using (Transaction t = new Transaction(doc, "Create SelectionFilterElement"))
    {
        t.Start();
        // Create selection filter and assign ids
        SelectionFilterElement filterElement = SelectionFilterElement.Create(doc, "Room tags filter");
        filterElement.SetElementIds(tagIds);
        ElementId filterId = filterElement.Id;
        // Add the filter to the view
        view.AddFilter(filterId);
        doc.Regenerate();
        // Use the existing graphics settings, and change the color to Blue
        OverrideGraphicSettings overrideSettings = view.GetFilterOverrides(filterId);
        overrideSettings.SetProjectionLineColor(new Color(0x00, 0x00, 0xFF));
        view.SetFilterOverrides(filterId, overrideSettings);
        t.Commit();
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace