Revit 2027 API
RibbonItemData Methods
The RibbonItemData type exposes the following members.
Methods
Name | Description
GetContextualHelp | Gets the contextual help bound with this control.
SetContextualHelp | Sets the contextual help bound with this button data.
Top
See Also
Reference
RibbonItemData Class
Autodesk.Revit.UI Namespace