Revit 2027 API
DWGExportOptions Properties
The DWGExportOptions type exposes the following members.
Properties
Name | Description
MergedViews |  Whether to merge all views in one file (via XRefs). Default value is false for mergedViews.
Top
See Also
Reference
DWGExportOptions Class
Autodesk.Revit.DB Namespace