Revit 2027 API
TextNoteOptions Class
 Options to use when creating a new text note element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TextNoteOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextNoteOptions : IDisposable
Public Class TextNoteOptions
	Implements IDisposable
public ref class TextNoteOptions : IDisposable
type TextNoteOptions =
    class
        interface IDisposable
    end
The TextNoteOptions type exposes the following members.
Constructors
Name | Description
TextNoteOptions() |  Default constructor; populates the options with their respective default values.
TextNoteOptions(ElementId) |  Constructs text options to create text of the given type.
Top
Properties
Name | Description
HorizontalAlignment |  Horizontal alignment of the text.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
KeepRotatedTextReadable |  Flag controling whether a rotate text is to stay oriented to be always readable.
Rotation |  Base line angle of a text note, in radians.
TypeId |  Id of a text type that defines the style of a text note.
VerticalAlignment |  Vertical alignment of the text.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TextNoteOptions
Top
Remarks
 Use an instance of this class as an argument in the TextNote.Create methods.
Example
#region Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document, Autodesk.Revit.DB.ElementId, Autodesk.Revit.DB.XYZ, double, System.String, Autodesk.Revit.DB.TextNoteOptions)
#region Autodesk.Revit.DB.TextElement.GetMinimumAllowedWidth(Autodesk.Revit.DB.Document, Autodesk.Revit.DB.ElementId)
public TextNote AddNewTextNote(UIDocument uiDoc)
{
    Document doc = uiDoc.Document;
    XYZ textLoc = uiDoc.Selection.PickPoint("Pick a point for sample text.");
    ElementId defaultTextTypeId = doc.GetDefaultElementTypeId(ElementTypeGroup.TextNoteType);
    double noteWidth = .2;
    // make sure note width works for the text type
    double minWidth = TextNote.GetMinimumAllowedWidth(doc, defaultTextTypeId);
    double maxWidth = TextNote.GetMaximumAllowedWidth(doc, defaultTextTypeId);
    if (noteWidth < minWidth)
    {
        noteWidth = minWidth;
    }
    else if (noteWidth > maxWidth)
    {
        noteWidth = maxWidth;
    }
    TextNoteOptions opts = new TextNoteOptions(defaultTextTypeId);
    opts.HorizontalAlignment = HorizontalTextAlignment.Left;
    opts.Rotation = Math.PI / 4;
    TextNote textNote = TextNote.Create(doc, doc.ActiveView.Id, textLoc, noteWidth, "New sample text", opts);
    return textNote;
}
#endregion
#endregion
See Also
Reference
Autodesk.Revit.DB Namespace