Revit 2027 API
PipingSystemType Class
 Base class for piping system types
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.MEPSystemType
 Autodesk.Revit.DB.Plumbing.PipingSystemType
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipingSystemType : MEPSystemType
Public Class PipingSystemType
	Inherits MEPSystemType
public ref class PipingSystemType : public MEPSystemType
type PipingSystemType =
    class
        inherit MEPSystemType
    end
The PipingSystemType type exposes the following members.
Properties
Name | Description
FlowConversionMethod |  The flow conversion method for the piping system type.
FluidTemperature |  Fluid Temperature, in Kelvin.
FluidType |  Fluid Type
SingleLineBendDropType |  Symbol for a 1 line drop
SingleLineBendRiseType |  Symbol for a 1 line rise
SingleLineJunctionDropType |  Symbol for a 1 line junction drop
SingleLineJunctionRiseType |  Symbol for a 1 line junction rise
TwoLineDropType |  Symbol for a 2 line drop
TwoLineRiseType |  Symbol for a 2 line rise
Top
Methods
Name | Description
Create |  Creates a new instance of a piping system type and adds it to the document.
ValidateRiseDropSymbolType |  Confirms if the parameter is a valid piping rise/drop symbol type.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace