Revit 2027 API
RadioButtonGroup Properties
The RadioButtonGroup type exposes the following members.
Properties
Name | Description
Current | Gets or sets the current checked ToggleButton of the RadioButtonGroup.
Top
See Also
Reference
RadioButtonGroup Class
Autodesk.Revit.UI Namespace