Revit 2027 API
MEPSystem Properties
The MEPSystem type exposes the following members.
Properties
Name | Description
BaseEquipment | The base panel or equipment of the system.
BaseEquipmentConnector | The connector within base equipment which is used to connect with system.
ConnectorManager | Connector manager of the system.
Elements | Terminal elements in the system.
HasDesignParts |  Indicates if the system has one or more design parts.
HasFabricationParts |  Indicates if the system has one or more fabrication parts.
HasPlaceholders |  Indicates if the system has one or more placeholders.
IsEmpty |  Indicates if the system is empty or not.
IsMultipleNetwork |  Indicates if the system is well connected or not. The flag will enable the "Divide System" button.
IsValid |  Indicates if the system is valid or not. atom AtomValidateSystem default false
PressureLossOfCriticalPath |  The total pressure loss of the sections in critical path.
SectionsCount |  The number of sections.
Top
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace