Revit 2027 API
IIFCEntityTreeUIServer Interface
 The interface used to provide UI on IFC Entity selection.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IIFCEntityTreeUIServer : IExternalServer
Public Interface IIFCEntityTreeUIServer
	Inherits IExternalServer
public interface class IIFCEntityTreeUIServer : IExternalServer
type IIFCEntityTreeUIServer =
    interface
        interface IExternalServer
    end
The IIFCEntityTreeUIServer type exposes the following members.
Methods
Name | Description
ShowDialog |  Shows dialog on managing IFCEntityTreeUI.
Top
See Also
Reference
Autodesk.Revit.UI Namespace