Revit 2027 API
CorruptModelException Class
The exception that is thrown when the model is or seems corrupt.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CorruptModelException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class CorruptModelException : ApplicationException
<SerializableAttribute>
Public Class CorruptModelException
	Inherits ApplicationException
[SerializableAttribute]
public ref class CorruptModelException : public ApplicationException
[<SerializableAttribute>]
type CorruptModelException =
    class
        inherit ApplicationException
    end
The CorruptModelException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace