Revit 2027 API
PipeInsulation Class
 Represents insulation applied to the outside of a given pipe, fitting or content.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Plumbing.PipeInsulation
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeInsulation : InsulationLiningBase
Public Class PipeInsulation
	Inherits InsulationLiningBase
public ref class PipeInsulation : public InsulationLiningBase
type PipeInsulation =
    class
        inherit InsulationLiningBase
    end
The PipeInsulation type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of pipe insulation.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace