Revit 2027 API
ElementIdParameterValue Properties
The ElementIdParameterValue type exposes the following members.
Properties
Name | Description
Value |  The stored value
Top
See Also
Reference
ElementIdParameterValue Class
Autodesk.Revit.DB Namespace