Revit 2027 API
IFCCategoryTemplate Properties
The IFCCategoryTemplate type exposes the following members.
Properties
Name | Description
IsValidCategoryMappingFile |  Whether or not the category mapping file is valid.
Top
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace