Revit 2027 API
CurtainGridLine Properties
The CurtainGridLine type exposes the following members.
Properties
Name | Description
AllSegmentCurves | Retrieve the curves of all segments.
ExistingSegmentCurves | Retrieve all the existing segment curves of the grid line.
FullCurve | Retrieve the geometry curve of the curtain grid line.
IsUGridLine | Retrieve the direction of a grid line.If it is true,we say it is a UGridLine,otherwise it is VGridLine
Lock | Retrieves or changes the lock state of the curtain grid line.
SkippedSegmentCurves | Retrieve all the removed segment curves of the grid line.
Top
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace