Revit 2027 API
RebarShapeConstraintCircumference Properties
The RebarShapeConstraintCircumference type exposes the following members.
Properties
Name | Description
ArcReferenceType |  The choice of rule for measuring the diameter.
Top
See Also
Reference
RebarShapeConstraintCircumference Class
Autodesk.Revit.DB.Structure Namespace