Revit 2027 API
WorksharingSaveAsOptions Class
 This class contains options specific to worksharing SaveAs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksharingSaveAsOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksharingSaveAsOptions : IDisposable
Public Class WorksharingSaveAsOptions
	Implements IDisposable
public ref class WorksharingSaveAsOptions : IDisposable
type WorksharingSaveAsOptions =
    class
        interface IDisposable
    end
The WorksharingSaveAsOptions type exposes the following members.
Constructors
Name | Description
WorksharingSaveAsOptions |  Constructs a new WorksharingSaveAsOptions with default settings.
Top
Properties
Name | Description
ClearTransmitted |  For a transmitted model opened with DetachAndPreserveWorksets, clear its transmitted flag in the Save/SaveAs operation.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OpenWorksetsDefault |  The default set of user-worksets to open when opening the model in the UI. Default is AskUserToSpecify.
SaveAsCentral |  Whether to save the new model as a central instead of local model. True: save as a central model. Default is false: save as a local model.
Top
Methods
Name | Description
Dispose | Releases all resources used by the WorksharingSaveAsOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace