Revit 2027 API
DesignToFabricationConverter Class
 This class represents the MEP design to fabrication part convert tool.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DesignToFabricationConverter : IDisposable
Public Class DesignToFabricationConverter
	Implements IDisposable
public ref class DesignToFabricationConverter : IDisposable
type DesignToFabricationConverter =
    class
        interface IDisposable
    end
The DesignToFabricationConverter type exposes the following members.
Constructors
Name | Description
DesignToFabricationConverter |  Creates a new instance of the DesignToFabricationConverter class.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Convert |  Converts the set of MEP design elements into fabrication parts.
Dispose | Releases all resources used by the DesignToFabricationConverter
GetConvertedFabricationParts |  Gets the set of element identifiers for newly created fabrication parts.
GetConvertedFabricationPartsWithInvalidConnections |  Gets the collection of converted fabrication parts with invalid connections.
GetDesignElementAndFabricationPartsWithDifferentOffsets |  Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets.
GetDesignElementAndFabricationPartsWithOpenConnectors |  Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors.
GetElementsWithOpenConnector |  Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
GetPartialConvertFailureResults |  Gets the partial failure results.
SetMapForFamilySymbolToFabricationPartType |  Set a map for the conversion of in line family symbols to similar fabrication part types.
Top
Remarks
 After a new instance of the class is created, call the Convert method to convert the MEP design elements into fabrication parts. Use the method SetMapForFamilySymbolToFabricationPartType to optionally convert family content to fabrication parts prior to calling Convert by providing a mapping of family symbols to fabrication parts types. If not set, then during conversion these families will remain and any connections to other converted elements will be maintained. After the convert method has been invoked, query the class to obtain more information about the conversion:
GetConvertedFabricationParts() to get a set of element identifiers for the newly created fabrication parts.
GetElementsWithOpenConnector() to get a set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace