Revit 2027 API
DefaultValueException Class
The exception thrown when Revit cannot initialize a default value for a family parameter.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.DefaultValueException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class DefaultValueException : InvalidOperationException
<SerializableAttribute>
Public Class DefaultValueException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class DefaultValueException : public InvalidOperationException
[<SerializableAttribute>]
type DefaultValueException =
    class
        inherit InvalidOperationException
    end
The DefaultValueException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace