Revit 2027 API
Space Class
Provides access to the space topology in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElement
 Autodesk.Revit.DB.Mechanical.Space
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Space : SpatialElement
Public Class Space
	Inherits SpatialElement
public ref class Space : public SpatialElement
type Space =
    class
        inherit SpatialElement
    end
The Space type exposes the following members.
Properties
Name | Description
ActualExhaustAirflow | Get the Actual Exhaust Airflow of the Space.
ActualHVACLoad | Get the Actual HVAC Load of the Space.
ActualLightingLoad | Get the Actual Lighting Load of the Space.
ActualOtherLoad | Get the Actual Other Load of the Space.
ActualPowerLoad | Get the Actual Power Load of the Space.
ActualReturnAirflow | Get the Actual Return Airflow of the Space.
ActualSupplyAirflow | Get the Actual Supply Airflow of the Space.
AirChangesPerHour | Get the Specified AirChangesPerHour of the Space.
AreaperPerson | Get or set the Area per Person of the Space.
AverageEstimatedIllumination | Get the Average Estimated Illumination of the Space.
BaseHeatLoadOn | The heat load-on.
BaseOffset | Get or set the Base Offset of the Space.
CalculatedCoolingLoad | Get the Calculated Cooling Load of the Space.
CalculatedHeatingLoad | Get the Calculated Heating Load of the Space.
CalculatedSupplyAirflow | Get the Calculated Supply Airflow of the Space.
CeilingReflectance | Get or set the Ceiling Reflectance of the Space.
ClosedShell | Return the closedShell of the space.
ConditionType | Get or set the Condition type of the Space.
DesignCoolingLoad | Get or set the Design Cooling Load of the Space.
DesignExhaustAirflow | Get or set the Specified Exhaust Airflow of the Space.
DesignHeatingLoad | Get or set the Design Heating Load of the Space.
DesignHVACLoadperArea | Get or set the Design HVAC Load per Area of the Space.
DesignLightingLoad | Get or set the Design Lighting Load of the Space.
DesignOtherLoadperArea | Get or set the Design Other Load per Area of the Space.
DesignPowerLoad | Get or set the Design Power Load of the Space.
DesignReturnAirflow | Get or set the Specified Return Airflow of the Space.
DesignSupplyAirflow | Get or set the Specified Supply Airflow of the Space.
FloorReflectance | Get or set the Floor Reflectance of the Space.
LatentHeatGainperPerson | Get or set the Latent Heat Gain per Person of the Space.
LightingCalculationWorkplane | Get or set the Lighting Calculation Workplane of the Space.
LightingLoadUnit | Get or set the Lighting Load Unit of the Space.
LimitOffset | Get or set the Limit Offset of the Space.
NumberofPeople | Get or set the Number of People of the Space.
OccupancyUnit | Get or set the Occupancy Unit of the Space.
Occupiable | Reports whether this zone is Occupiable or not.
OutdoorAirflow | Get the Outdoor Airflow of the Space.
OutdoorAirFlowStandard | Get the OutdoorAirFlowStandard of the Space.
OutdoorAirPerArea | Get the Specified OutdoorAirPerArea of the Space.
OutdoorAirPerPerson | Get the Specified OutdoorAirPerPerson of the Space.
Plenum | Reports whether this zone is Plenum or not.
PowerLoadUnit | Get or set the Power Load Unit of the Space.
ReturnAirflow | Get or set the Return type of Supply Airflow of the Space.
Room | Return the Room of the space.
SensibleHeatGainperPerson | Get or set the Sensible Heat Gain per Person of the Space.
SpaceCavityRatio | Get the Space Cavity Ratio of the Space.
SpaceConstruction | Get the Space Construction of the Space.
SpaceType | Get or set the Space type of the Space.
SpaceTypeId | Get or set the Space type element of the Space.
UnboundedHeight | Get the Unbounded Height of the Space.
UpperLimit | Get or set the Upper Limit of the Space.
Volume | Get the Volume of the Space.
WallReflectance | Get or set the Wall Reflectance of the Space.
Zone | Obsolete.
Reports this space belong to which Zone.
Top
Methods
Name | Description
IsPointInSpace | Determines if a point lies within the volume of the Space.
Top
Remarks
The space object can be queried for its boundary for use in space planning tools.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace