Revit 2027 API
FilterNumericGreater Class
 Tests whether numeric values from the document are greater than a certain value
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterNumericRuleEvaluator
 Autodesk.Revit.DB.FilterNumericGreater
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterNumericGreater : FilterNumericRuleEvaluator
Public Class FilterNumericGreater
	Inherits FilterNumericRuleEvaluator
public ref class FilterNumericGreater : public FilterNumericRuleEvaluator
type FilterNumericGreater =
    class
        inherit FilterNumericRuleEvaluator
    end
The FilterNumericGreater type exposes the following members.
Constructors
Name | Description
FilterNumericGreater |  Constructs an instance of FilterNumericGreater.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace