Revit 2027 API
AnalysisDisplayColoredSurfaceSettings Methods
The AnalysisDisplayColoredSurfaceSettings type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Compares two colored surface settings objects.
Top
See Also
Reference
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace