Revit 2027 API
DockablePaneState Methods
The DockablePaneState type exposes the following members.
Methods
Name | Description
Dispose
SetFloatingRectangle |  When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window.
Top
See Also
Reference
DockablePaneState Class
Autodesk.Revit.UI Namespace