Revit 2027 API
MacroModuleIterator Methods
The MacroModuleIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  Returns the current Macro.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace