Revit 2027 API
IFCUserDefinedProperty Methods
The IFCUserDefinedProperty type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IFCUserDefinedProperty Class
Autodesk.Revit.DB Namespace