Revit 2027 API
RebarCrankOverridableParameters Methods
The RebarCrankOverridableParameters type exposes the following members.
Methods
Name | Description
Dispose
GetCrankEndAngledLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters.
GetCrankEndLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank length parameters.
GetCrankEndOffsetLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters.
GetCrankEndRatioFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank ratio parameters.
GetCrankEndStraightLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters.
GetCrankStartAngledLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters.
GetCrankStartLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank length parameters.
GetCrankStartOffsetLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank offset length parameters.
GetCrankStartRatioFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters.
GetCrankStartStraightLengthFormulaParams |  Gets the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters.
Top
See Also
Reference
RebarCrankOverridableParameters Class
Autodesk.Revit.DB.Structure Namespace