Revit 2027 API
INavisworksExporter Interface
 The interface used to implement a Navisworks exporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface INavisworksExporter : IExternalServer
Public Interface INavisworksExporter
	Inherits IExternalServer
public interface class INavisworksExporter : IExternalServer
type INavisworksExporter =
    interface
        interface IExternalServer
    end
The INavisworksExporter type exposes the following members.
Methods
Name | Description
Export |  The method that Revit will invoke to perform an export to Navisworks.
ValidateExportOptions |  Determines if the inputs are valid, and returns an error message if not.
Top
Remarks
 Implement this interface and register an instance of the derived class with the Navisworks external service.
See Also
Reference
Autodesk.Revit.DB Namespace