Revit 2027 API
RepeatingReferenceSource Methods
The RepeatingReferenceSource type exposes the following members.
Methods
Name | Description
Dispose
GetBounds |  Returns information about the boundaries of the repeating reference array.
GetDefaultRepeatingReferenceSource |  Returns the default repeating reference source for a given element.
GetReference |  Returns an individual repeating reference given by coordinates in the array, or null if there is no reference at the coordinates (for example if there is a hole in a divided surface.)
HasRepeatingReferenceSource |  Determines whether an element has any repeating reference sources that can be used when creating component repeaters.
Top
See Also
Reference
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace