Revit 2027 API
ExternalResourceSubFolder Methods
The ExternalResourceSubFolder type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace