Revit 2027 API
BasePoint Methods
The BasePoint type exposes the following members.
Methods
Name | Description
GetProjectBasePoint |  Gets the project base point for the document.
GetSurveyPoint |  Gets the survey point for the document.
Top
See Also
Reference
BasePoint Class
Autodesk.Revit.DB Namespace