Revit 2027 API
EnergyAnalysisZone Properties
The EnergyAnalysisZone type exposes the following members.
Properties
Name | Description
AirChangesPerHour |  The outside air rate or air changes per hour as a number between 0 and 10000.
CADObjectUniqueId |  The unique id of the originating CAD object (model element) associated with this zone.
CoolingAirTemperature |  The cooling air temperature in unit Kelvin (K).
CoolingSetPoint |  The cooling temperature set point in unit Kelvin (K).
DehumidificationSetPoint |  The dehumidification set point as a number between 0 and 1.
HeatingAirTemperature |  The cooling air temperature in unit Kelvin (K).
HeatingSetPoint |  The heating temperature set point in unit Kelvin (K).
HumidificationSetPoint |  The humidification set point as a number between 0 and 1.
OutsideAirPerArea |  The outside air per area in unit ft/s.
OutsideAirPerPerson |  The outside air per person in unit ft3/s.
UseAirChangesPerHour |  Use the air changes per hour.
UseDehumidificationSetPoint |  Use the dehumidification set point.
UseHumidificationSetPoint |  Use the humidification set point.
UseOutsideAirPerArea |  Use the outside air per area.
UseOutsideAirPerPerson |  Use the outside air per person.
Top
See Also
Reference
EnergyAnalysisZone Class
Autodesk.Revit.DB.Analysis Namespace