Revit 2027 API
ComponentRepeaterSlot Methods
The ComponentRepeaterSlot type exposes the following members.
Methods
Name | Description
IsTypeValidForSlot |  Determines whether instance of given family type can be used in the component repeater slot.
MakeDefault |  Populates the slot with an instance of the default family type of the component repeater.
MakeEmpty |  Makes the slot empty by removing the instance currently held by the slot.
Top
See Also
Reference
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace