Revit 2027 API
IFCFamilyInstanceExtrusionExportResults Class
 This class represents the results of a geometric analysis of a family instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCFamilyInstanceExtrusionExportResults : IDisposable
Public Class IFCFamilyInstanceExtrusionExportResults
	Implements IDisposable
public ref class IFCFamilyInstanceExtrusionExportResults : IDisposable
type IFCFamilyInstanceExtrusionExportResults =
    class
        interface IDisposable
    end
The IFCFamilyInstanceExtrusionExportResults type exposes the following members.
Properties
Name | Description
ExtraOffset |  The extra offset determined from the geometry of the family instance.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaterialId |  The best material id determined for the family instance.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCFamilyInstanceExtrusionExportResults
GetCutPairOpenings |  Gets the set of "openings" determined from the analysis of the instance geometry.
GetExtrusionHandle |  Gets the extruded solid handle generated for the family instance.
Top
Remarks
 The analysis attempts to convert the geometry of the instance into a single extrusion with additional extruded openings cutting the main solid.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace