Revit 2027 API
VertexIndexPairArrayIterator Properties
The VertexIndexPairArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
VertexIndexPairArrayIterator Class
Autodesk.Revit.DB Namespace