Revit 2027 API
Zone Class
 A zone is a collection of one or more spaces.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.Zone
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Zone : Element
Public Class Zone
	Inherits Element
public ref class Zone : public Element
type Zone =
    class
        inherit Element
    end
The Zone type exposes the following members.
Properties
Name | Description
Area | Get the Area of the Zone.
Boundary | Returns the boundary of the Zone.
Name | Get or Set the Name of the Zone.
(Overrides Element.Name)
Phase | Get the Phase of the Zone.
Spaces | Obsolete.
Get the Spaces of the Zone.
Top
Methods
Name | Description
CreateAreaBasedLoad |  Creates a new instance of an area based load and adds it to the document.
GetDomainData |  Gets the domain data for the zone.
Top
Remarks
 The concept of zones is central to the way in which engineers design HVAC systems. When you are designing HVAC systems, you relate to zones as spaces that are under the same thermostatic control. Conceptually, zones are an arbitrary set of areas or volumes within a building that is controlled by one thermostat. An area based load is a collection of one or more electrical load areas. When it has the AreaBasedLoadData, it is an area based load, otherwise, it is a zone.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace