Revit 2027 API
ReferencePoint Class
A reference point in an Autodesk Revit family.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ReferencePoint
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReferencePoint : Element
Public Class ReferencePoint
	Inherits Element
public ref class ReferencePoint : public Element
type ReferencePoint =
    class
        inherit Element
    end
The ReferencePoint type exposes the following members.
Properties
Name | Description
CoordinatePlaneVisibility | Visibility settings for the coordinate reference planes.
Name
(Overrides Element.Name)
Position | The position of the ReferencePoint.
ShowNormalReferencePlaneOnly | Whether all three coordinate planes are shown, or only the normal (XY) plane.
Visible | Whether the point is visible when the family is loaded into a project.
Top
Methods
Name | Description
GetCoordinatePlaneReferenceXY | A reference for the XY plane of the coordinate system.
GetCoordinatePlaneReferenceXZ | A reference for the XZ plane of the coordinate system.
GetCoordinatePlaneReferenceYZ | A reference for the YZ plane of the coordinate system.
GetCoordinateSystem | The position and orientation of the ReferencePoint.
GetHubId | Id of associated Hub.
GetInterpolatingCurves | The set of CurveByPoints elements that interpolate a ReferencePoint.
GetPointElementReference | Retrieve a copy of the rule that computes the location of the ReferencePoint relative to other elements in the document.
GetVisibility | Gets the visibility for the point.
SetCoordinateSystem | The position and orientation of the ReferencePoint.
SetPointElementReference | Change the rule for computing the location of the ReferencePoint relative to other elements in the document.
SetVisibility | Sets the visibility for the point.
Top
Remarks
A ReferencePoint represents a point in space together with a local coordinate system. ReferencePoints can be free, or constrained to other elements in several ways. When the point is constrained, the coordinate system is also constrained in certain ways.
See Also
Reference
Autodesk.Revit.DB Namespace