Revit 2027 API
FabricationPartSizeMap Class
 This class represents the fabrication part size map for straights allowing the sizes to be changed from a user interface for multiple straights with diffent sizes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationPartSizeMap : IDisposable
Public Class FabricationPartSizeMap
	Implements IDisposable
public ref class FabricationPartSizeMap : IDisposable
type FabricationPartSizeMap =
    class
        interface IDisposable
    end
The FabricationPartSizeMap type exposes the following members.
Constructors
Name | Description
FabricationPartSizeMap(String, Double, Double, Boolean) |  Creates a new instance of the FabricationPartSizeMap class.
FabricationPartSizeMap(String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32) |  Creates a new instance of the FabricationPartSizeMap class.
Top
Properties
Name | Description
AllowMultipleServiceSizes |  State flag to allow multiple services to include the same size.
Depth |  The depth of the straight.
IsMappedProductList |  Are the mapped sizes for a product listed fabrication part.
IsProductList |  Are the sizes for a product listed fabrication part.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MappedDepth |  The mapped size for the depth of the straight.
MappedProfileType |  The mapped shape of the straight.
MappedServiceId |  The mapped service identifier of the straight.
MappedWidthDiameter |  The mapped size for the width or diameter of the straight.
PaletteId |  The palette identifier of the straight.
ProfileType |  The shape of the straight.
ServiceId |  The service identifier of the straight.
SizeString |  The size display string for the straight that can be used by the user interface.
WidthDiameter |  The width or diameter of the straight.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationPartSizeMap
Top
Remarks
 This is used as the data container for the FabricationPartSizeMapSet typeDef for crs:Set or Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap for ISet so a list of sizes can be generated to allow the user to select a size and map it to another.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace