Revit 2027 API
RebarShapeConstraintChordLength Class
 A constraint that can be applied to a RebarShapeDefinitionByArc and drives the straight distance between the arc endpoints.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintChordLength : RebarShapeConstraint
Public Class RebarShapeConstraintChordLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintChordLength : public RebarShapeConstraint
type RebarShapeConstraintChordLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintChordLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintChordLength |  Create a constraint to drive chord length.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace