Revit 2027 API
CannotOpenBothCentralAndLocalException Methods
The CannotOpenBothCentralAndLocalException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CannotOpenBothCentralAndLocalException Class
Autodesk.Revit.Exceptions Namespace