Revit 2027 API
ElementFilter Methods
The ElementFilter type exposes the following members.
Methods
Name | Description
Dispose
PassesFilter(Element) |  Applies the filter to a given element.
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
Top
See Also
Reference
ElementFilter Class
Autodesk.Revit.DB Namespace