Revit 2027 API
FabricationRodInfo Class
 The rod information of the fabrication part.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationRodInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationRodInfo : IDisposable
Public Class FabricationRodInfo
	Implements IDisposable
public ref class FabricationRodInfo : IDisposable
type FabricationRodInfo =
    class
        interface IDisposable
    end
The FabricationRodInfo type exposes the following members.
Properties
Name | Description
CanRodsBeHosted |  Controls whether the hanger's rod's will be automatically hosted by other elements.
IsAttachedToStructure |  Checks if the hanger is attached to structure.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RodCount |  Gets the number of rods.
Top
Methods
Name | Description
AttachToHanger |  Attaches the hanger rod to another bearer hanger.
AttachToStructure |  Attaches to the nearest structural element.
Dispose | Releases all resources used by the FabricationRodInfo
GetBearerExtension |  Gets the bearer extension. The method is applicable only for bearer hanger.
GetRodAttachedElementId |  Gets the identifier of the attached component for the specified rod.
GetRodEndPosition |  Gets the position of the rod end.
GetRodLength |  Get the current rod length. If the rod is the length will include structural extension.
GetRodStructureExtension |  Gets the length of the rod's top extension into structure.
IsRodLockedWithHost |  Checks if the rod is locked with the host. The method is applicable only for bearer hanger.
SetBearerExtension |  Sets the bearer extension. The method is applicable only for bearer hanger.
SetRodEndPosition |  Sets the position of the rod end. The method is applicable only for bearer hanger.
SetRodLength |  Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted.
SetRodLockedWithHost |  Locks the rod with the host. The method is applicable only for bearer hanger.
SetRodStructureExtension |  Set the length of the rod's top extension into structure. The rod must be attached to structure.
Top
Remarks
 A fabrication part may have one or more rods. The FabricationRodInfo stores the rod information of the fabrication part.
See Also
Reference
Autodesk.Revit.DB Namespace