Revit 2027 API
AnalyticalLink Class
 An analytical link element that is used to create connections between other Analytical Elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalLink
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalLink : Element
Public Class AnalyticalLink
	Inherits Element
public ref class AnalyticalLink : public Element
type AnalyticalLink =
    class
        inherit Element
    end
The AnalyticalLink type exposes the following members.
Properties
Name | Description
End |  The point at the end of the AnalyticalLink.
EndHubId |  Hub ID at end of AnalyticalLink.
OwnerId |  ElementId of Analytical Element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API
Start |  The point at the start of the AnalyticalLink.
StartHubId |  Hub ID at start of AnalyticalLink.
Top
Methods
Name | Description
Create |  Creates a new instance of a AnalyticalLink element between two Hubs.
IsAutoGenerated |  Specifies whether or not an AnalyticalLink was created by an Analytical Element.
IsValidHub |  Checks whether input hub is valid for an AnalyticalLink.
Top
Example
public void ReadAnalyticalLinks(Document document)
  {
      FilteredElementCollector collectorAnalyticalLinks = new FilteredElementCollector(document);
      collectorAnalyticalLinks.OfClass(typeof(AnalyticalLink));
      IEnumerable<AnalyticalLink> alinks = collectorAnalyticalLinks.ToElements().Cast<AnalyticalLink>();
      int nAutoGeneratedLinks = 0;
      int nManualLinks = 0;
      foreach (AnalyticalLink alink in alinks)
      {
          if (alink.IsAutoGenerated() == true)
              nAutoGeneratedLinks++;
          else
              nManualLinks++;
      }
      string msg = "Auto-generated AnalyticalLinks: " + nAutoGeneratedLinks;
      msg += "\nManually created AnalyticalLinks: " + nManualLinks;
      TaskDialog.Show("AnalyticalLinks", msg);
  }
See Also
Reference
Autodesk.Revit.DB.Structure Namespace