Revit 2027 API
SpaceTagFilter Class
 A filter used to match space tags.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Mechanical.SpaceTagFilter
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpaceTagFilter : ElementSlowFilter
Public Class SpaceTagFilter
	Inherits ElementSlowFilter
public ref class SpaceTagFilter : public ElementSlowFilter
type SpaceTagFilter =
    class
        inherit ElementSlowFilter
    end
The SpaceTagFilter type exposes the following members.
Constructors
Name | Description
SpaceTagFilter |  Constructs a filter which matches only spaces.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace