Revit 2027 API
FamilyParameterSetIterator Properties
The FamilyParameterSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
FamilyParameterSetIterator Class
Autodesk.Revit.DB Namespace