Revit 2027 API
ElementLevelFilter Properties
The ElementLevelFilter type exposes the following members.
Properties
Name | Description
LevelId |  The id of the level that will be matched to elements' associated level.
Top
See Also
Reference
ElementLevelFilter Class
Autodesk.Revit.DB Namespace