Revit 2027 API
StructuralSectionCParallelFlange Class
 Defines parameters for C-channel Parallel Flange structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionCParallelFlange : StructuralSectionGeneralU
Public Class StructuralSectionCParallelFlange
	Inherits StructuralSectionGeneralU
public ref class StructuralSectionCParallelFlange : public StructuralSectionGeneralU
type StructuralSectionCParallelFlange =
    class
        inherit StructuralSectionGeneralU
    end
The StructuralSectionCParallelFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionCParallelFlange |  Creates a new instance of Structural Section C Parallel Flange shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace