Revit 2027 API
RuledFace Properties
The RuledFace type exposes the following members.
Properties
Name | Description
Curve | Profile curves of the surface.
IsExtruded | Determines if this is an extruded ruled surface.
Point | Profile points of the surface.
RulingsAreParallel | Determines if the rulings of this ruled surface are parallel.
Top
See Also
Reference
RuledFace Class
Autodesk.Revit.DB Namespace