Revit 2027 API
ApplicationEntryPoint Methods
The ApplicationEntryPoint type exposes the following members.
Methods
Name | Description
CreateRibbonPanel(String)
(Overrides UIApplication.CreateRibbonPanel(String))
CreateRibbonPanel(String, String)
(Overrides UIApplication.CreateRibbonPanel(String, String))
CreateRibbonPanel(Tab, String)
(Overrides UIApplication.CreateRibbonPanel(Tab, String))
CreateRibbonTab
(Overrides UIApplication.CreateRibbonTab(String))
FinishInitializationEO |  For Revit Macros internal use only.
GetRibbonPanels()
(Overrides UIApplication.GetRibbonPanels())
GetRibbonPanels(String)
(Overrides UIApplication.GetRibbonPanels(String))
GetRibbonPanels(Tab)
(Overrides UIApplication.GetRibbonPanels(Tab))
Initialize |  For Revit Macros internal use only.
OnShutdownEO |  For Revit Macros internal use only.
Top
See Also
Reference
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace