Revit 2027 API
DisplacementPath Methods
The DisplacementPath type exposes the following members.
Methods
Name | Description
Create |  Creates a new DisplacementPath referencing a DisplacementElement and edge or curve and adds it to the document.
IsValidParam |  Is the specified value a valid edge or curve parameter.
IsValidReference |  Does the specified pick represent an edge or a curve belonging to one of the displaced elements.
SetAnchorPoint |  Sets the reference that determines the origin of this DisplacementPath.
Top
See Also
Reference
DisplacementPath Class
Autodesk.Revit.DB Namespace