Revit 2027 API
AnalysisDisplayMarkersAndTextSettings Methods
The AnalysisDisplayMarkersAndTextSettings type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Compares two colored surface settings objects.
Top
See Also
Reference
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace