Revit 2027 API
VertexStreamPosition Class
 A stream that can be used to write vertices of type VertexPosition into a buffer (see VertexBuffer).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexStream
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexStreamPosition : VertexStream
Public Class VertexStreamPosition
	Inherits VertexStream
public ref class VertexStreamPosition : public VertexStream
type VertexStreamPosition =
    class
        inherit VertexStream
    end
The VertexStreamPosition type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPosition into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPosition instances into the stream and associated buffer.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace