Revit 2027 API
DefinitionGroups Methods
The DefinitionGroups type exposes the following members.
Methods
Name | Description
Contains | Tests for the existence of a definition group within the collection.
Create | Create a new parameter definition group using the name provided.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Retrieves an enumerator to the collection.
Top
See Also
Reference
DefinitionGroups Class
Autodesk.Revit.DB Namespace