Revit 2027 API
ColorWithTransparency Class
 Color with transparency
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ColorWithTransparency
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ColorWithTransparency : IDisposable
Public Class ColorWithTransparency
	Implements IDisposable
public ref class ColorWithTransparency : IDisposable
type ColorWithTransparency =
    class
        interface IDisposable
    end
The ColorWithTransparency type exposes the following members.
Constructors
Name | Description
ColorWithTransparency() |  color
ColorWithTransparency(UInt32, UInt32, UInt32, UInt32) |  color
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ColorWithTransparency
GetBlue |  get blue
GetColor |  get color
GetGreen |  get green
GetRed |  get red
GetTransparency |  get transparency
SetBlue |  set blue
SetColor |  set color
SetGreen |  set green
SetRed |  set red
SetTransparency |  set transparency
Top
See Also
Reference
Autodesk.Revit.DB Namespace