Revit 2027 API
AssetPropertyEnum Properties
The AssetPropertyEnum type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
See Also
Reference
AssetPropertyEnum Class
Autodesk.Revit.DB.Visual Namespace