Revit 2027 API
AnnotationSymbol Methods
The AnnotationSymbol type exposes the following members.
Methods
Name | Description
addLeader | add a leader to this annotation symbol.
duplicate | Duplicate this annotation symbol.
GetLeaders |  Returns a collection of leaders currently attached to the annotation.
removeLeader | remove a leader of this annotation symbol.
Top
See Also
Reference
AnnotationSymbol Class
Autodesk.Revit.DB Namespace