Revit 2027 API
FloorType Class
 An object that specifies the type of a floor in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.FloorType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FloorType : HostObjAttributes
Public Class FloorType
	Inherits HostObjAttributes
public ref class FloorType : public HostObjAttributes
type FloorType =
    class
        inherit HostObjAttributes
    end
The FloorType type exposes the following members.
Properties
Name | Description
IsFoundationSlab |  Returns whether the element FloorAttributes type is FoundationSlab.
StructuralMaterialId |  Returns the identifier of the material that defines the element's structural analysis properties.
ThermalProperties |  The calculated and settable thermal properties of the FloorType
Top
Methods
Name | Description
Top
Remarks
 The structural layers of the floor can be accessed via this object.
Example
public void GetInfo_FloorType(FloorType floorType)
{
    string message;
    // Get whether FloorType is a foundation slab
    message = "If is foundation slab : " + floorType.IsFoundationSlab;
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace