Revit 2027 API
IndependentTag Properties
The IndependentTag type exposes the following members.
Properties
Name | Description
HasLeader |  Identifies if a tag has at least one visible leader, or if all leaders are hidden.
IsMaterialTag |  Identifies if it is a material tag or not.
IsMulticategoryTag |  Identifies if it is a multi-category tag or not.
IsOrphaned |  Identifies if the tag is orphaned or not.
LeaderEndCondition |  The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
LeadersPresentationMode |  Identifies the Presentation Mode that is applied to tag leaders.
LeaderStartCondition |  The leader start condition of the tag, such as if the start of the leader is attached to the tag head or free floating.
MergeElbows |  Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.
MultiLeader |  Returns if the tag if referencing multiple elements and/or sub-elements.
MultiReferenceAnnotationId |  The multi-reference annotation which owns this tag.
RotationAngle |  The rotation angle of the tag relative to its view
TagHeadPosition |  The position of the head of tag in model coordinates.
TagOrientation |  The tag orientation of the tag's head, such as horizontal or vertical.
TagText |  The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
Top
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace