Revit 2027 API
FootPrintRoof Methods
The FootPrintRoof type exposes the following members.
Methods
Name | Description
GetProfiles | Retrieve all the curveLoops of FootPrintRoof.
Top
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace