Revit 2027 API
ElementLogicalFilter Methods
The ElementLogicalFilter type exposes the following members.
Methods
Name | Description
GetFilters |  Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
SetFilters |  Replaces current filters in the logical filter with any number of input filters.
Top
See Also
Reference
ElementLogicalFilter Class
Autodesk.Revit.DB Namespace