Revit 2027 API
LoadBase Methods
The LoadBase type exposes the following members.
Methods
Name | Description
IsOrientToPermitted |  Indicates if the provided orientation is permitted for this load.
IsValidReference |  Indicates if the provided reference can host a load.
RemoveHostConstraint |  Removes constraint from host for this load.
Top
See Also
Reference
LoadBase Class
Autodesk.Revit.DB.Structure Namespace