Revit 2027 API
AssetSet Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Visual.AssetSet
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetSet : APIObject, IEnumerable
Public Class AssetSet
	Inherits APIObject
	Implements IEnumerable
public ref class AssetSet : public APIObject,
	IEnumerable
type AssetSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The AssetSet type exposes the following members.
Constructors
Name | Description
AssetSet | Initializes a new instance of the AssetSet class
Top
Properties
Name | Description
IsEmpty
Size
Top
Methods
Name | Description
Clear
Contains
Erase
ForwardIterator
GetEnumerator
Insert
ReverseIterator
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace