Revit 2027 API
WorksetKindFilter Properties
The WorksetKindFilter type exposes the following members.
Properties
Name | Description
WorksetKind |  The WorksetKind.
Top
See Also
Reference
WorksetKindFilter Class
Autodesk.Revit.DB Namespace