Revit 2027 API
HermiteSplineTangents Class
 This class indicates tangency at the start, the end, or both ends of the curve.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.HermiteSplineTangents
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HermiteSplineTangents : IDisposable
Public Class HermiteSplineTangents
	Implements IDisposable
public ref class HermiteSplineTangents : IDisposable
type HermiteSplineTangents =
    class
        interface IDisposable
    end
The HermiteSplineTangents type exposes the following members.
Constructors
Name | Description
HermiteSplineTangents |  Constructs a new default instance of the class, with tangent vectors uninitialized.
Top
Properties
Name | Description
EndTangent |  The tangent vector at the end of the curve.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StartTangent |  The tangent vector at the start of the curve.
Top
Methods
Name | Description
Dispose | Releases all resources used by the HermiteSplineTangents
Top
Remarks
 Initially, the tangent vectors will not be set, and no tangency condition will be imposed when the curve is created.
See Also
Reference
Autodesk.Revit.DB Namespace