Revit 2027 API
ConceptualSurfaceType Class
 This element represents a conceptual BIM object category to assign to faces in Mass geometries. There is one ConceptualSurfaceType element for each of the Mass Surface Subcategories. for serialization
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.ConceptualSurfaceType
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConceptualSurfaceType : Element
Public Class ConceptualSurfaceType
	Inherits Element
public ref class ConceptualSurfaceType : public Element
type ConceptualSurfaceType =
    class
        inherit Element
    end
The ConceptualSurfaceType type exposes the following members.
Properties
Name | Description
DefaultConstructionTypeId |  The element id of the user specified ConceptualConstructionType to be used by default on creation for mass faces of this mass subcategory.
MassSubCategoryId |  The mass subcategory id of the ConceptualSurfaceType.
Top
Methods
Name | Description
GetAllMassSubCategoryIds |  Get all the mass subcategory ids for which there are ConceptualSurfaceType's.
GetByMassSubCategoryId |  Get the ConceptualSurfaceType by its mass subcategory id.
GetConstructionTypeIds |  The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.
Top
Remarks
 When Conceptual Energy Analysis is enabled in Revit Projects, massing faces will be assigned to the subcategories of Mass category that these ConceptualSurfaceType's are associated with. A default ConceptualConstructionType is associated with the ConceptualSurfaceType. This default ConceptualConstructionType is assigned to Mass faces with the corresponding subcategory. Changing the default ConceptualConstructionType associated with the ConceptualSurfaceType will update the ConceptualConstruction type for all Mass faces of that subcategory which the user has not specifically provided an override value for.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace