Revit 2027 API
CentralModelContentionException Properties
The CentralModelContentionException type exposes the following members.
Properties
Name | Description
CurrentUser | Retrieves current user name.
Top
See Also
Reference
CentralModelContentionException Class
Autodesk.Revit.Exceptions Namespace