Revit 2027 API
ToposolidType Class
 An object that specifies the type of a Toposolid in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.ToposolidType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ToposolidType : HostObjAttributes
Public Class ToposolidType
	Inherits HostObjAttributes
public ref class ToposolidType : public HostObjAttributes
type ToposolidType =
    class
        inherit HostObjAttributes
    end
The ToposolidType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetContourSetting |  Get the contour setting object from the current toposolid type.
SetContourSettting |  Set the contour setting for the current toposolid type by copying from an existing contour setting object.
Top
See Also
Reference
Autodesk.Revit.DB Namespace