Revit 2027 API
PointCloudType Class
 Represents a type of point cloud loaded into a Revit document. Each PointCloudType maps to a single file or identifier (depending upon the type of Point Cloud Engine which governs it).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.PointCloudType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointCloudType : ElementType
Public Class PointCloudType
	Inherits ElementType
public ref class PointCloudType : public ElementType
type PointCloudType =
    class
        inherit ElementType
    end
The PointCloudType type exposes the following members.
Properties
Name | Description
ColorEncoding |  The color encoding used by points extracted from instances of this point cloud.
EngineIdentifier |  The identifier of the engine responsible for handling of the point cloud.
FoundStatus |  Shows whether the Point Cloud external file could be found.
Offset |  Returns the offset stored in the point cloud.
Scale |  The multiplier applied to the points in all instances of this point cloud.
Top
Methods
Name | Description
Create |  Creates a new point cloud type for a given point cloud engine.
GetPath |  Gets the path of the link source from which the points are loaded.
GetReCapProject |  This method provides a direct entry point to get access to an object from the ReCap SDK (ReCapWrapper.RCProject) from Revit. This object represents the point cloud from the RC file path stored in PointCloudType. The ReCap assembly AdskRcManaged.dll will need to be included into code using this method.
Top
See Also
Reference
Autodesk.Revit.DB Namespace