Revit 2027 API
FabricReinSpanSymbol Methods
The FabricReinSpanSymbol type exposes the following members.
Methods
Name | Description
Create |  Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View.
Top
See Also
Reference
FabricReinSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace