Revit 2027 API
EnergyAnalysisConstruction Properties
The EnergyAnalysisConstruction type exposes the following members.
Properties
Name | Description
Absorptance |  The absorptance value of the construction.
ConstructionName |  The name of the construction
Description |  The description of the construction.
HeatTransferCoefficient | Obsolete.
 The heat transfer coefficient value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).
IsSchematic |  Indicates if this originates from a schematic or analytical construction.
Roughness |  The roughness value of the construction, from 1 (Very Rough) to 6 (Very Smooth) and -1 when unset.
ThermalMass |  The thermal mass value (Cth-value) of the construction, in J/(m^2*k) (equivalent to kg/(k*s^2)).
ThermalResistance |  The thermal resistance value (R-value) of the construction, in K*s^3/kg.
ThermalTransmittance |  The thermal transmittance value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).
Top
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace