Revit 2027 API
IndexStreamLine Methods
The IndexStreamLine type exposes the following members.
Methods
Name | Description
AddLine |  Inserts a IndexLine segment into the stream and associated buffer.
AddLines |  Inserts multiple IndexLine segments into the stream and associated buffer.
Top
See Also
Reference
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace