Revit 2027 API
SpanDirectionSymbol Methods
The SpanDirectionSymbol type exposes the following members.
Methods
Name | Description
Create |  Places a new instance of the Span Direction Symbol into the project relative to a particular host element and view.
GetDefaultPlacementPoint |  Gets the default placement point for the input element. The default position is in the middle of the bounding box of the top face.
Top
See Also
Reference
SpanDirectionSymbol Class
Autodesk.Revit.DB Namespace