Revit 2027 API
DisplayingOptionsDialogEventArgs Class
 The event arguments used by DisplayingOptionDialog event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.UI.Events.DisplayingOptionsDialogEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DisplayingOptionsDialogEventArgs : RevitAPIPreEventArgs
Public Class DisplayingOptionsDialogEventArgs
	Inherits RevitAPIPreEventArgs
public ref class DisplayingOptionsDialogEventArgs : public RevitAPIPreEventArgs
type DisplayingOptionsDialogEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The DisplayingOptionsDialogEventArgs type exposes the following members.
Properties
Name | Description
PagesCount |  The count of pages in the options dialog (include the default pages added by Revit).
Top
Methods
Name | Description
AddTab | Add tab to option dialog with tab name and handler information.
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace