Revit 2027 API
AreaBasedLoadBoundaryLineData Methods
The AreaBasedLoadBoundaryLineData type exposes the following members.
Methods
Name | Description
Dispose
GetLevelIdsInRange |  Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line.
IsElevationWithinRange |  Checks whether the given elevation is between the bottom level and the top level(including the bottom level and the top level) of the area based load boundary line.
IsLevelWithinRange |  Checks whether the given level is between the bottom level and the top level (including the bottom level and the top level) of the area based load boundary line.
Top
See Also
Reference
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace