Revit 2027 API
AnalyticalPanel Class
 An element that represents a surface in the Structural Analytical Model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalElement
 Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
 Autodesk.Revit.DB.Structure.AnalyticalPanel
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalPanel : AnalyticalSurfaceBase
Public Class AnalyticalPanel
	Inherits AnalyticalSurfaceBase
public ref class AnalyticalPanel : public AnalyticalSurfaceBase
type AnalyticalPanel =
    class
        inherit AnalyticalSurfaceBase
    end
The AnalyticalPanel type exposes the following members.
Properties
Name | Description
Thickness |  Panel thickness, in the Revit default units.
Top
Methods
Name | Description
Create(Document, CurveLoop) |  Creates a new instance of an Analytical Panel within the project.
Create(Document, Curve, XYZ) |  Creates a new instance of an Analytical Panel within the project.
GetAnalyticalOpeningsIds |  Returns the Analytical Openings ids of the Analytical Panel.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace