Revit 2027 API
PartMakerMethodToDivideVolumes Methods
The PartMakerMethodToDivideVolumes type exposes the following members.
Methods
Name | Description
AddIntersectingReference |  Adds intersecting reference with an offset.
AreElementsValidIntersectingReferences(ICollection<ElementId>) |  Identifies if provided members are valid.
AreElementsValidIntersectingReferences(Document, ICollection<ElementId>) |  Identifies if provided members are valid.
CanBeDivisionProfile(ElementId) |  Checks whether a family defines a profile which can be used by this method.
CanBeDivisionProfile(ElementId, Document) |  Checks whether a family defines a profile which can be used by this method.
Dispose
GetOffsetForIntersectingReference |  Gets offset for the intersecting reference.
GetPlaneOfSketch |  Gets the plane of the sketch.
GetSketchCurves |  Populates the array with copies of curves in the sketch.
GetSplitRefsOffsets |  Returns offsets for plane-defining splitters.
IsElementValidIntersectingReference(ElementId) |  Identifies if the provided member is valid.
IsElementValidIntersectingReference(Document, ElementId) |  Identifies if the provided member is valid.
IsValidSketchPlane |  Identifies if provided sketch plane is valid.
RemoveIntersectingReference |  Removed intersecting reference.
SetOffsetForIntersectingReference |  Sets offset for the intersecting reference.
UsesReference |  Identifies if the PartMaker uses the intersecting reference.
Top
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace