Revit 2027 API
FabricationPartInsulationLining Properties
The FabricationPartInsulationLining type exposes the following members.
Properties
Name | Description
OwnerId |  The ElementId of the owner fabrication part.
Top
See Also
Reference
FabricationPartInsulationLining Class
Autodesk.Revit.DB Namespace