Revit 2027 API
MEPHiddenLineSettings Properties
The MEPHiddenLineSettings type exposes the following members.
Properties
Name | Description
DrawHiddenLine |  Indicates if duct or piping is drawn with the line style and gaps specified for hidden lines.
InsideGap |  The gap for the lines that appear within a crossing segment.
LineStyle |  The line style that determines how the lines of a hidden segment display at the point where the segments cross.
OutsideGap |  The gap for the lines that appear external to the crossing segments.
SingleLineGap |  The gap for the single hidden lines where segments cross.
Top
See Also
Reference
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace