Revit 2027 API
ElementFilter Class
 A base class for a type of filter that accepts or rejects elements based upon criteria.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementLogicalFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementSlowFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementFilter : IDisposable
Public Class ElementFilter
	Implements IDisposable
public ref class ElementFilter : IDisposable
type ElementFilter =
    class
        interface IDisposable
    end
The ElementFilter type exposes the following members.
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ElementFilter
PassesFilter(Element) |  Applies the filter to a given element.
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
Top
See Also
Reference
Autodesk.Revit.DB Namespace