Revit 2027 API
AnnotationSymbol Class
This object represents a symbol of the Generic Annotation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 Autodesk.Revit.DB.FamilyInstance
 Autodesk.Revit.DB.AnnotationSymbol
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnnotationSymbol : FamilyInstance
Public Class AnnotationSymbol
	Inherits FamilyInstance
public ref class AnnotationSymbol : public FamilyInstance
type AnnotationSymbol =
    class
        inherit FamilyInstance
    end
The AnnotationSymbol type exposes the following members.
Properties
Name | Description
AnnotationSymbolType |  The AnnotationSymbol style of this AnnotationSymbol.
Top
Methods
Name | Description
addLeader | add a leader to this annotation symbol.
duplicate | Duplicate this annotation symbol.
GetLeaders |  Returns a collection of leaders currently attached to the annotation.
removeLeader | remove a leader of this annotation symbol.
Top
See Also
Reference
Autodesk.Revit.DB Namespace