Revit 2027 API
RebarCoverType Class
 A named value for a clear cover distance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.RebarCoverType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarCoverType : ElementType
Public Class RebarCoverType
	Inherits ElementType
public ref class RebarCoverType : public ElementType
type RebarCoverType =
    class
        inherit ElementType
    end
The RebarCoverType type exposes the following members.
Properties
Name | Description
CoverDistance |  A distance that can be used as a concrete cover value in a document.
Top
Methods
Name | Description
Create |  Creates a new CoverType in the document.
Top
Remarks
 In Revit Structure, CoverTypes are the rows in the Rebar Cover Settings dialog.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace