Revit 2027 API
EnergyAnalysisMaterial Properties
The EnergyAnalysisMaterial type exposes the following members.
Properties
Name | Description
Density |  The density of the material, in kg/(ft^3).
Description |  The description of the material.
MaterialName |  The name of the material.
SpecificHeatCapacity |  The specific heat capacity of the material, in ft^2/(k*s^2).
ThermalConductivity |  The thermal conductivity of the material, kg*ft/(k*s^3).
ThermalResistance |  The thermal resistance (R-value) of the material, in m^2*K/W (eqivelent to K*s^3/kg).
Thickness |  The thickness of the material, in ft.
Top
See Also
Reference
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace