Revit 2027 API
MultiReferenceAnnotationType Properties
The MultiReferenceAnnotationType type exposes the following members.
Properties
Name | Description
DimensionStyleId |  The dimension style which will be used by the child dimension of the multi-reference annotation.
GroupTagHeads |  Controls if parameter values for the annotation's references will be reported in one grouped tag head or if every reference will get its own tag head.
ReferenceCategoryId |  The category of elements to which this annotation applies.
ShowDimensionText |  Controls if text from the multi-reference annotation's dimension will be shown.
TagTypeId |  The tag type which will be used by the child tag the multi-reference annotation.
Top
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace