Revit 2027 API
LineLoadType Class
 LineLoadType class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.LoadTypeBase
 Autodesk.Revit.DB.Structure.LineLoadType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LineLoadType : LoadTypeBase
Public Class LineLoadType
	Inherits LoadTypeBase
public ref class LineLoadType : public LoadTypeBase
type LineLoadType =
    class
        inherit LoadTypeBase
    end
The LineLoadType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace