Revit 2027 API
SaveOptions Class
 This class contains options available for saving a document to disk.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SaveOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SaveOptions : IDisposable
Public Class SaveOptions
	Implements IDisposable
public ref class SaveOptions : IDisposable
type SaveOptions =
    class
        interface IDisposable
    end
The SaveOptions type exposes the following members.
Constructors
Name | Description
SaveOptions |  Default constructor.
Top
Properties
Name | Description
Compact |  Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PreviewViewId |  The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SaveOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace