Revit 2027 API
ImportIFCOptions Methods
The ImportIFCOptions type exposes the following members.
Methods
Name | Description
Dispose
GetImportIFCOptions |  Returns the current Revit instance's ImportIFCOptions.
Top
See Also
Reference
ImportIFCOptions Class
Autodesk.Revit.DB Namespace