Revit 2027 API
IFCFamilyInstanceExtrusionExportResults Methods
The IFCFamilyInstanceExtrusionExportResults type exposes the following members.
Methods
Name | Description
Dispose
GetCutPairOpenings |  Gets the set of "openings" determined from the analysis of the instance geometry.
GetExtrusionHandle |  Gets the extruded solid handle generated for the family instance.
Top
See Also
Reference
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace