Revit 2027 API
FileImportedEventArgs Properties
The FileImportedEventArgs type exposes the following members.
Properties
Name | Description
Format |  Identifies the import format, e.g. DWG or image.
ImportedInstanceId |  The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance.
Path |  Path of the source file that was imported.
Top
See Also
Reference
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace