Revit 2027 API
Ellipse Class
A whole or partial ellipse.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.Ellipse
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Ellipse : Curve
Public Class Ellipse
	Inherits Curve
public ref class Ellipse : public Curve
type Ellipse =
    class
        inherit Curve
    end
The Ellipse type exposes the following members.
Properties
Name | Description
Center | Returns the center of the ellipse.
Normal | Returns the normal to the plane in which the ellipse is defined.
RadiusX | Returns the X vector radius of the ellipse.
RadiusY | Returns the Y vector radius of the ellipse.
XDirection | The X direction.
YDirection | The Y direction.
Top
Methods
Name | Description
CreateCurve |  Creates a new geometric ellipse or elliptical arc object.
Top
See Also
Reference
Autodesk.Revit.DB Namespace