Revit 2027 API
IndexPrimitive Class
 The base class for index buffer primitives.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
 Autodesk.Revit.DB.DirectContext3D.IndexLine
 Autodesk.Revit.DB.DirectContext3D.IndexPoint
 Autodesk.Revit.DB.DirectContext3D.IndexTriangle
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IndexPrimitive : IDisposable
Public Class IndexPrimitive
	Implements IDisposable
public ref class IndexPrimitive : IDisposable
type IndexPrimitive =
    class
        interface IDisposable
    end
The IndexPrimitive type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IndexPrimitive
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace