Revit 2027 API
RebarSpliceOptions Class
 This class encapsulates the options for the rebar splice operation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarSpliceOptions
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarSpliceOptions : IDisposable
Public Class RebarSpliceOptions
	Implements IDisposable
public ref class RebarSpliceOptions : IDisposable
type RebarSpliceOptions =
    class
        interface IDisposable
    end
The RebarSpliceOptions type exposes the following members.
Constructors
Name | Description
RebarSpliceOptions |  Constructs a RebarSpliceOptions
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SplicePosition |  Identifies the splice line position.
SpliceTypeId |  Identifies the id of the Rebar Splice Type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarSpliceOptions
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace