Revit 2027 API
BuildingOperatingDaySchedule Class
 Represents the operating schedule of a 24 hour day.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BuildingOperatingDaySchedule : Element
Public Class BuildingOperatingDaySchedule
	Inherits Element
public ref class BuildingOperatingDaySchedule : public Element
type BuildingOperatingDaySchedule =
    class
        inherit Element
    end
The BuildingOperatingDaySchedule type exposes the following members.
Properties
Name | Description
ScheduleName |  The name of the schedule.
Top
Methods
Name | Description
Create |  Creates a new instance of a BuildingOperatingDaySchedule.
GetValueForHour |  Gets the usage value for an hour.
SetValueForHour |  Sets the usage value for an hour.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace