Revit 2027 API
FamilyContextException Class
The exception that is thrown when an operation is invalid in the current family document, because of the type of family.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.FamilyContextException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class FamilyContextException : InvalidOperationException
<SerializableAttribute>
Public Class FamilyContextException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class FamilyContextException : public InvalidOperationException
[<SerializableAttribute>]
type FamilyContextException =
    class
        inherit InvalidOperationException
    end
The FamilyContextException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace