Revit 2027 API
ExternalResourceSubFolder Class
 Data that describes a remote folder to be shown in the file browser dialog
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceSubFolder
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalResourceSubFolder : IDisposable
Public Class ExternalResourceSubFolder
	Implements IDisposable
public ref class ExternalResourceSubFolder : IDisposable
type ExternalResourceSubFolder =
    class
        interface IDisposable
    end
The ExternalResourceSubFolder type exposes the following members.
Constructors
Name | Description
ExternalResourceSubFolder() |  Constructs a new ExternalResourceSubFolder with default values for folder name and icon path.
ExternalResourceSubFolder(String, String) |  Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.
Top
Properties
Name | Description
FolderName |  Folder displayed name.
IconPath |  The path of the resource icon.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalResourceSubFolder
Top
See Also
Reference
Autodesk.Revit.DB Namespace