Revit 2027 API
RevitServerUnauthenticatedUserException Class
The exception that is thrown when an unauthenticated user attempts to initiate a call to RevitServer.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerUnauthenticatedUserException : RevitServerException
<SerializableAttribute>
Public Class RevitServerUnauthenticatedUserException
	Inherits RevitServerException
[SerializableAttribute]
public ref class RevitServerUnauthenticatedUserException : public RevitServerException
[<SerializableAttribute>]
type RevitServerUnauthenticatedUserException =
    class
        inherit RevitServerException
    end
The RevitServerUnauthenticatedUserException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace