Revit 2027 API
ElementIntersectsFilter Class
 A base class for filters used to match elements which intersect with geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.ElementIntersectsFilter
 Autodesk.Revit.DB.ElementIntersectsElementFilter
 Autodesk.Revit.DB.ElementIntersectsSolidFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementIntersectsFilter : ElementSlowFilter
Public Class ElementIntersectsFilter
	Inherits ElementSlowFilter
public ref class ElementIntersectsFilter : public ElementSlowFilter
type ElementIntersectsFilter =
    class
        inherit ElementSlowFilter
    end
The ElementIntersectsFilter type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
IsCategorySupported |  Identifies if the input element is of a category supported by element intersection filters.
IsElementSupported |  Identifies if the input element is supported by element intersection filters.
Top
See Also
Reference
Autodesk.Revit.DB Namespace