Revit 2027 API
SketchPlane Class
 Represents a sketch plane or work plane.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SketchPlane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SketchPlane : Element
Public Class SketchPlane
	Inherits Element
public ref class SketchPlane : public Element
type SketchPlane =
    class
        inherit Element
    end
The SketchPlane type exposes the following members.
Properties
Name | Description
IsSuitableForModelElements |  Identifies if the sketch plane can be assigned to model elements.
Top
Methods
Name | Description
Create(Document, ElementId) |  Creates a sketch plane from a grid, reference plane, or level.
Create(Document, Plane) |  Creates a new sketch plane from a geometric plane.
Create(Document, Reference) |  Creates a new sketch plane from a reference to a planar face.
GetPlane |  Returns the corresponding Plane.
GetPlaneReference |  Returns a reference to this element as a plane.
Top
Remarks
 A SketchPlane object is used as an input to creation of sketch-referencing elements such as Model Curves or sketch-owning elements such as Generic Forms. The SketchPlane can be obtained from an existing element or created from a geometric plane or planar face. Note that the sketch plane element passed as input to create an element may not be the actual sketch plane assigned to that element; Revit may look for a geometrically equivalent plane to use, or may create a new one if the input plane is already used for other purposes. Some sketch planes (such as those obtained from detail curves) are suitable only for use in creating detail elements; they will be rejected when used for other element types.
Example
public void ShowSketchPlane(SketchPlane sketchPlane)
{
    // get the information of the created sketch plane
    string information = "Sketch Plane: ";
    //get the corresponding Plane
    Autodesk.Revit.DB.Plane plane = sketchPlane.GetPlane();
    //show the plane's origin point
    information += "\norigin of the plane:  " + XYZToString(plane.Origin);
    //show the plane's normal vector
    information += "\nnormal of the plane:  " + XYZToString(plane.Normal);
    //show the plane's Xvec vector
    information += "\nXvec of the plane: (" + XYZToString(plane.XVec);
    //show the plane's Yvec vector
    information += "\nYvec of the plane: (" + XYZToString(plane.YVec);
    TaskDialog.Show("Revit",information);
}
// output the point's three coordinates
string XYZToString(XYZ point)
{
    return "(" + point.X + ", " + point.Y + ", " + point.Z + ")";
}
See Also
Reference
Autodesk.Revit.DB Namespace