Revit 2027 API
InsulationLiningBase Properties
The InsulationLiningBase type exposes the following members.
Properties
Name | Description
HostElementId |  The id of the host element for the insulation or lining element.
Thickness |  Thickness of the insulation or lining element.
Top
See Also
Reference
InsulationLiningBase Class
Autodesk.Revit.DB Namespace