Revit 2027 API
SystemZoneElementType Methods
The SystemZoneElementType type exposes the following members.
Methods
Name | Description
CreateSketchBased |  Creates a new element type for sketch-based system-zone elements and adds it to the document.
CreateSpaceBased |  Creates a new element type for space-based system-zone elements and adds it to the document.
Top
See Also
Reference
SystemZoneElementType Class
Autodesk.Revit.DB.Mechanical Namespace