Revit 2027 API
FaceSplitter Class
 Represents an element that splits a face.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FaceSplitter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceSplitter : Element
Public Class FaceSplitter
	Inherits Element
public ref class FaceSplitter : public Element
type FaceSplitter =
    class
        inherit Element
    end
The FaceSplitter type exposes the following members.
Properties
Name | Description
SplitElementId |  The id of the element whose face is split by this element.
Top
Methods
Name | Description
GetBoundaries |  Gets the boundaries.
Top
See Also
Reference
Autodesk.Revit.DB Namespace