Revit 2027 API
TableView Class
 This represents a view that shows a table. Most of the layout data for the table is contained in the TableData class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.TableView
 Autodesk.Revit.DB.Electrical.PanelScheduleView
 Autodesk.Revit.DB.ViewSchedule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TableView : View
Public Class TableView
	Inherits View
public ref class TableView : public View
type TableView =
    class
        inherit View
    end
The TableView type exposes the following members.
Properties
Name | Description
MaximumColumnWidth |  Gets the maximum column width
MaximumGridWidth |  Gets the allowed maximum grid width
MaximumRowHeight |  Gets the maximum row height
MinimumColumnWidth |  Gets the minimum column width
MinimumRowHeight |  Gets the minimum row height
TargetId |  the element id of the element that is being viewed
Top
Methods
Name | Description
GetAvailableParameterCategories |  Get all available parameter categories.
GetAvailableParameters |  Gets a list of valid parameters for the specified category that can be used in the table view.
GetCalculatedValueName |  Gets the calculated value name for a cell from the template view.
GetCalculatedValueText |  Gets the calculated value text for a cell from the instance view.
GetCellText |  Gets the cell's text based on its type
IsValidSectionType |  Identifies if the section type is valid for this view.
Top
See Also
Reference
Autodesk.Revit.DB Namespace