Revit 2027 API
PlanViewRange Methods
The PlanViewRange type exposes the following members.
Methods
Name | Description
Dispose
GetLevelId |  Get the element id of the level for a View Depth plane
GetOffset |  Get the offset value associated with a View Depth plane
SetLevelId |  Set the level for a View Depth plane
SetOffset |  Set the offset value associated with a View Depth plane
Top
See Also
Reference
PlanViewRange Class
Autodesk.Revit.DB Namespace