Revit 2027 API
VertexPositionNormalColored Methods
The VertexPositionNormalColored type exposes the following members.
Methods
Name | Description
GetColor |  Gets the vertex's color.
GetSizeInFloats |  Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
SetColor |  Sets the vertex's color.
Top
See Also
Reference
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace