Revit 2027 API
SpacingRule Properties
The SpacingRule type exposes the following members.
Properties
Name | Description
BeltMeasurement |  On a curved surface, BeltMeasurement specifies where the grid's distances are measured.
Distance | The exact distance between layout lines.
GridlinesRotation | An additional rotation to be applied to this set of grid lines.
HasBeltMeasurement |  True if the gridlines are not parallel due to surface curvature, and the BeltMeasurement property therefore applies.
Justification | The justification of the lines within the region.
Layout | A choice of several gridline layout rules.
Number | The exact number of lines in the region.
Offset | An additional offset applied to the first gridline.
Top
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace