Revit 2027 API
FabricationService Methods
The FabricationService type exposes the following members.
Methods
Name | Description
Dispose
GetButton |  Gets the service button for a given palette index and button index from the service.
GetButtonCount |  Gets the number of buttons for a given palette in the service.
GetPaletteName |  Gets the name of a palette based on palette index.
IsCompatibleWith |  Check whether the service is broadly interchangable with another one without affecting part geometry. The services must have the same fabrication system template and specification.
IsPaletteExcluded |  Get whether a service palette is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServicePaletteExclusions.
IsValidButtonIndex |  Validates the button index.
IsValidPaletteIndex |  Validates the palette index.
OverrideServiceButtonExclusion |  Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only.
ResetServiceExclusionOverrides |  Resets the overridden service palette and button exclusions back to default, as defined by the configuration.
SetServicePaletteExclusions |  Sets the service palette exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those palettes passed.
Top
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace