Revit 2027 API
EditScope Class
 The base class for a scope object that provides special access and limitations related to editing certain elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EditScope
 Autodesk.Revit.DB.Architecture.TopographyEditScope
 Autodesk.Revit.DB.SketchEditScope
 Autodesk.Revit.DB.StairsEditScope
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EditScope : IDisposable
Public Class EditScope
	Implements IDisposable
public ref class EditScope : IDisposable
type EditScope =
    class
        interface IDisposable
    end
The EditScope type exposes the following members.
Properties
Name | Description
IsActive |  Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
IsPermitted |  Tells if the edit scope is permitted to start.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Cancel |  Cancels the edit scope.
Commit |  Finishes the edit scope.
Dispose | Releases all resources used by the EditScope
Top
Remarks
 Derivations of this class provide specific functionality to manage edit modes for specific purposes.
See Also
Reference
Autodesk.Revit.DB Namespace