Revit 2027 API
ExtElemChangeBeamSectionRegistry Class
 An object that stores IExtElemChangeBeamSection
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtElemChangeBeamSectionRegistry : IDisposable
Public Class ExtElemChangeBeamSectionRegistry
	Implements IDisposable
public ref class ExtElemChangeBeamSectionRegistry : IDisposable
type ExtElemChangeBeamSectionRegistry =
    class
        interface IDisposable
    end
The ExtElemChangeBeamSectionRegistry type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExtElemChangeBeamSectionRegistry
RegisterInterface |  Registers a IExtElemChangeBeamSection
Unregister |  Unregisters IExtElemChangeBeamSection.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace