Revit 2027 API
LineProperties Class
 A structure that has access to the pen properties of lines/curves that are currently being drawn/exported via an export context during a custom export process.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LineProperties
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LineProperties : IDisposable
Public Class LineProperties
	Implements IDisposable
public ref class LineProperties : IDisposable
type LineProperties =
    class
        interface IDisposable
    end
The LineProperties type exposes the following members.
Properties
Name | Description
Color |  The current color used when drawing lines/curves.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LineWidth |  The current width (thickness) of the pen stroke when drawing lines/curves.
PatternId |  Id of the current Line pattern element used when drawing lines/curves.
Transparency |  The current transparency level to be applied to the current color.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LineProperties
Top
Remarks
 For more about using properties of this class refer to the interface IModelExportContext and its methods which handle geometric objects such as OnCurve(CurveNode), OnLineSegment(LineSegment), etc. LineProperties are available as a read-only property on the respective output nodes, i.e. CurveNode, LineSegment, etc.
See Also
Reference
Autodesk.Revit.DB Namespace