Revit 2027 API
FillPattern Methods
The FillPattern type exposes the following members.
Methods
Name | Description
Dispose
ExpandDots |  Corrects pattern dots to make them be drawn properly for Revit.
ExportToPAT |  Export a list of FillPatterns to an AutoCAD PAT file.
GetFillGrid |  Gets the specified fill grid.
GetFillGrids |  Gets all fill grids in this fill pattern
IsEqual |  Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.
SetFillGrid |  Sets the fill grid.
SetFillGrids |  Set the fill grids in this fill pattern.
Top
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace