Revit 2027 API
DistributionSysTypeSet Properties
The DistributionSysTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of DistributionSys types that are in the set.
Top
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace