Revit 2027 API
CeilingType Class
 Represents a ceiling type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.CeilingType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CeilingType : HostObjAttributes
Public Class CeilingType
	Inherits HostObjAttributes
public ref class CeilingType : public HostObjAttributes
type CeilingType =
    class
        inherit HostObjAttributes
    end
The CeilingType type exposes the following members.
Properties
Name | Description
ThermalProperties |  The calculated and settable thermal properties of the CeilingType
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace