Revit 2027 API
ICodeCheckingParameterServer Interface
 Interface for the code checking parameter server to implement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface ICodeCheckingParameterServer : IExternalServer
Public Interface ICodeCheckingParameterServer
	Inherits IExternalServer
public interface class ICodeCheckingParameterServer : IExternalServer
type ICodeCheckingParameterServer =
    interface
        interface IExternalServer
    end
The ICodeCheckingParameterServer type exposes the following members.
Methods
Name | Description
PerformCodeChecking |  The server's method that will be called when Revit User clicks the Code Checking parameter's button from the properties palette.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace