Revit 2027 API
AssetPropertyTime Class
 Represents a connected property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyTime
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyTime : AssetProperty
Public Class AssetPropertyTime
	Inherits AssetProperty
public ref class AssetPropertyTime : public AssetProperty
type AssetPropertyTime =
    class
        inherit AssetProperty
    end
The AssetPropertyTime type exposes the following members.
Properties
Name | Description
Value | Get the value of the property
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace