Revit 2027 API
ImportInstance Properties
The ImportInstance type exposes the following members.
Properties
Name | Description
IsLinked | Identifies whether this instance is a linked object rather than imported one.
Top
See Also
Reference
ImportInstance Class
Autodesk.Revit.DB Namespace