Revit 2027 API
Surface Class
 A mathematical representation of a surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Surface : IDisposable
Public Class Surface
	Implements IDisposable
public ref class Surface : IDisposable
type Surface =
    class
        interface IDisposable
    end
The Surface type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OrientationMatchesParametricOrientation |  Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
Top
Methods
Name | Description
Dispose | Releases all resources used by the Surface
GetBoundingBoxUV |  Gets the UV bounding box of the surface.
IsCoincidentWith |  Determine if two surfaces are coincident (ignoring Envelopes). For an affirmative answer, the surfaces must have the same type (e.g., two planes).
Project |  Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
ProjectWithGuessPoint |  Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
Top
Remarks
 This geometric object is not bounded by edges or edge loops. A bounded surface obtained from a Revit element will be represented by a Face instead.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.ConicalSurface
 Autodesk.Revit.DB.CylindricalSurface
 Autodesk.Revit.DB.HermiteSurface
 Autodesk.Revit.DB.OffsetSurface
 Autodesk.Revit.DB.Plane
 Autodesk.Revit.DB.RevolvedSurface
 Autodesk.Revit.DB.RuledSurface