Revit 2027 API
StructuralSectionConcreteRectangleCut Class
 Defines parameters for parameterized concrete rectangle cut structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcreteRectangleCut : StructuralSectionRectangular
Public Class StructuralSectionConcreteRectangleCut
	Inherits StructuralSectionRectangular
public ref class StructuralSectionConcreteRectangleCut : public StructuralSectionRectangular
type StructuralSectionConcreteRectangleCut =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionConcreteRectangleCut type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteRectangleCut |  Creates a new instance of Structural Section Concrete Rectangle Cut shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BottomCutHeight |  Section height left Cut.
BottomCutWidth |  Section width left Cut.
TopCutHeight |  Section height right Cut.
TopCutWidth |  Section width right Cut.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace