Revit 2027 API
BalusterPattern Class
 Baluster pattern class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.BalusterPattern
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BalusterPattern : IDisposable
Public Class BalusterPattern
	Implements IDisposable
public ref class BalusterPattern : IDisposable
type BalusterPattern =
    class
        interface IDisposable
    end
The BalusterPattern type exposes the following members.
Properties
Name | Description
BreakPattern |  The condition which controls breaking baluster patterns distribution.
DistributionJustification |  Determines how baluster pattern distribution is justified.
EndSpace |  The extra space added after a whole baluster pattern.
ExcessLengthFillBalusterId |  The id of a Baluster family used to fill excess length, which is the extra space along the railing segment that cannot be filled with a pattern. If set to InvalidElementId, it will be the default - the id of the BaseRailingAttr containing the Baluster pattern.
ExcessLengthFillSpacing |  The value defines the spacing between each baluster instance inserted in the excess length.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Length |  The length of the main baluster pattern.
PatternAngle |  The angle between neighboring railing segments which conditions breaking patterns distribution along a railing path.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BalusterPattern
DuplicateBaluster |  Duplicates the baluster pointed by given index in the main baluster pattern.
GetBaluster |  Gets information about the given baluster from the main baluster pattern.
GetBalusterCount |  Gets the number of balusters in the main baluster pattern definition.
RemoveBaluster |  Removes a baluster from the main baluster pattern.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace