Revit 2027 API
FilteredElementIterator Class
 An iterator to a set of elements filtered by the settings of a FilteredElementCollector.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredElementIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilteredElementIterator : IEnumerator<Element>
Public Class FilteredElementIterator
	Implements IEnumerator(Of Element)
public ref class FilteredElementIterator : IEnumerator<Element^>
type FilteredElementIterator =
    class
        interface IEnumerator<Element>
    end
The FilteredElementIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilteredElementIterator
GetCurrent |  The current element found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next element passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
Autodesk.Revit.DB Namespace