Revit 2027 API
AnalysisDisplayMarkersAndTextSettings Class
 Contains markers and text settings for analysis display style element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayMarkersAndTextSettings : IDisposable
Public Class AnalysisDisplayMarkersAndTextSettings
	Implements IDisposable
public ref class AnalysisDisplayMarkersAndTextSettings : IDisposable
type AnalysisDisplayMarkersAndTextSettings =
    class
        interface IDisposable
    end
The AnalysisDisplayMarkersAndTextSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayMarkersAndTextSettings() |  Constructs a default instance of markers and text settings.
AnalysisDisplayMarkersAndTextSettings(AnalysisDisplayMarkersAndTextSettings) |  Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MarkerSize |  Size of marker.
MarkerType |  Type of marker.
Rounding |  Increment to which numeric values of analysis results are rounded in markers.
TextLabelType |  Type of diagram text label visualization.
TextTypeId |  Element id of text associated with the settings.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisDisplayMarkersAndTextSettings
IsEqual |  Compares two colored surface settings objects.
Top
Example
// Settings relating to the marker shape and size and the display of values
AnalysisDisplayMarkersAndTextSettings markerSettings = new AnalysisDisplayMarkersAndTextSettings();
markerSettings.MarkerSize = .05;
markerSettings.MarkerType = AnalysisDisplayStyleMarkerType.Triangle;
markerSettings.Rounding = .01;
// Settings relating to the marker color
AnalysisDisplayColorSettings colorSettings = new AnalysisDisplayColorSettings();
colorSettings.MaxColor = new Color(255, 0, 0);
colorSettings.MinColor = new Color(0, 255, 255);
// Settings relating to the legend
AnalysisDisplayLegendSettings legendSettings = new AnalysisDisplayLegendSettings();
legendSettings.Rounding = .01;
// Create the new display style
AnalysisDisplayStyle ads = AnalysisDisplayStyle.CreateAnalysisDisplayStyle(doc, "Markers 1", markerSettings, colorSettings, legendSettings);
// Assign the new display style to the current view
doc.ActiveView.AnalysisDisplayStyleId = ads.Id;
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace