Revit 2027 API
PipeSegment Methods
The PipeSegment type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a PipeSegment and adds it to the document.
Top
See Also
Reference
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace