Revit 2027 API
RoutingCondition Methods
The RoutingCondition type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
RoutingCondition Class
Autodesk.Revit.DB Namespace