Revit 2027 API
AnalyticalOpening Properties
The AnalyticalOpening type exposes the following members.
Properties
Name | Description
PanelId |  ElementId of the AnalyticalPanel parent.
Top
See Also
Reference
AnalyticalOpening Class
Autodesk.Revit.DB.Structure Namespace