Revit 2027 API
ParameterDownloadOptions Methods
The ParameterDownloadOptions type exposes the following members.
Methods
Name | Description
Dispose
GetCategories |  Get categories for binding.
GetGroupTypeId |  Get properties palette group identifier.
SetCategories |  Set categories for binding.
SetGroupTypeId |  Set properties palette group identifier.
Top
See Also
Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace