Revit 2027 API
IFCExternalServiceUIData Class
 UI data wrapper for IFCExternalServiceUIData.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.IFCExternalServiceUIData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCExternalServiceUIData : IDisposable
Public Class IFCExternalServiceUIData
	Implements IDisposable
public ref class IFCExternalServiceUIData : IDisposable
type IFCExternalServiceUIData =
    class
        interface IDisposable
    end
The IFCExternalServiceUIData type exposes the following members.
Properties
Name | Description
Document |  return the document
IsReset |  flag to indicate the value has been reset
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParamId |  the parameter id
SelectedIFCItem |  The selected IFC Item (can be IFC Entity, or PredefinedType)
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCExternalServiceUIData
GetParentHwnd |  return the parent handle
GetRevitElementIds |  return the list of revit Element Ids
Top
See Also
Reference
Autodesk.Revit.UI Namespace