Revit 2027 API
InsulationMaterial Class
 This class represents the definition of Conductor Insulation Material data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.InsulationMaterial
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InsulationMaterial : IDisposable
Public Class InsulationMaterial
	Implements IDisposable
public ref class InsulationMaterial : IDisposable
type InsulationMaterial =
    class
        interface IDisposable
    end
The InsulationMaterial type exposes the following members.
Properties
Name | Description
Id |  The Conductor Insulation Material id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The Conductor Insulation Material name.
Top
Methods
Name | Description
Create |  Creates a Conductor Insulation Material.
Dispose | Releases all resources used by the InsulationMaterial
GetInsulationMaterial |  Gets the Conductor Insulation Material data by given Conductor Insulation Material id.
GetInsulationMaterialIdByName |  Gets the Conductor Insulation Material id by given Conductor Insulation Material name.
GetInsulationMaterialIds |  Gets all the Conductor Insulation Material ids in the given document, sorted by name.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace