Revit 2027 API
StructuralSectionGeneralCEx Class
 Defines parameters for Channel With Fold Cold Formed shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionGeneralCEx : StructuralSectionColdFormed
Public Class StructuralSectionGeneralCEx
	Inherits StructuralSectionColdFormed
public ref class StructuralSectionGeneralCEx : public StructuralSectionColdFormed
type StructuralSectionGeneralCEx =
    class
        inherit StructuralSectionColdFormed
    end
The StructuralSectionGeneralCEx type exposes the following members.
Constructors
Name | Description
StructuralSectionGeneralCEx |  Creates a new instance of general Channel Cold Formed shape.
Top
Properties
Name | Description
FoldLength |  Fold segment length.
LipLength |  Lip segment length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace