Revit 2027 API
IFCPropertyMappingInfo Methods
The IFCPropertyMappingInfo type exposes the following members.
Methods
Name | Description
Dispose
IsValidMappingInfo |  Defines whether the mapping info contains meaningful data.
Top
See Also
Reference
IFCPropertyMappingInfo Class
Autodesk.Revit.DB Namespace