Revit 2027 API
PlanTopologySetIterator Properties
The PlanTopologySetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
PlanTopologySetIterator Class
Autodesk.Revit.DB Namespace