Revit 2027 API
DockableFrameVisibilityChangedEventArgs Class
 The event arguments used by the DockableFrameVisibilityChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DockableFrameVisibilityChangedEventArgs : RevitAPISingleEventArgs
Public Class DockableFrameVisibilityChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class DockableFrameVisibilityChangedEventArgs : public RevitAPISingleEventArgs
type DockableFrameVisibilityChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The DockableFrameVisibilityChangedEventArgs type exposes the following members.
Properties
Name | Description
DockableFrameShown |  True if the pane is being shown, false if it is being hidden.
PaneId |  The identifier for dockable pane.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace