Revit 2027 API
MassLevelData Methods
The MassLevelData type exposes the following members.
Methods
Name | Description
IsEmpty |  Indicates if the MassLevelData (Mass Floor) has a geometrical representation. May not if the level does not intersect the mass geometry.
IsMassFamilyInstance |  Checks if the ElementId is a mass family instance.
IsValidConceptualConstructionTypeElement |  Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor).
Top
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace