Revit 2027 API
ReferenceArray Class
An array that contains reference objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferenceArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReferenceArray : APIObject,
	IEnumerable
Public Class ReferenceArray
	Inherits APIObject
	Implements IEnumerable
public ref class ReferenceArray : public APIObject,
	IEnumerable
type ReferenceArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The ReferenceArray type exposes the following members.
Constructors
Name | Description
ReferenceArray | Initializes a new instance of the ReferenceArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a reference at a specified index within the array.
Size | Returns the number of references that are in the array.
Top
Methods
Name | Description
Append | Add the reference to the end of the array.
Clear | Removes every reference from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified reference into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace