Revit 2027 API
StructuralSectionRectangleParameterized Class
 Defines parameters for parameterized rectangle structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionRectangleParameterized : StructuralSectionGeneralF
Public Class StructuralSectionRectangleParameterized
	Inherits StructuralSectionGeneralF
public ref class StructuralSectionRectangleParameterized : public StructuralSectionGeneralF
type StructuralSectionRectangleParameterized =
    class
        inherit StructuralSectionGeneralF
    end
The StructuralSectionRectangleParameterized type exposes the following members.
Constructors
Name | Description
StructuralSectionRectangleParameterized |  Creates a new instance of Structural Section Rectangle Parameterized shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace