Revit 2027 API
RoofBase Methods
The RoofBase type exposes the following members.
Methods
Name | Description
GetSlabShapeEditor |  Gets a SlabShapeEditor that can used to add or modify points of this RoofBase.
Top
See Also
Reference
RoofBase Class
Autodesk.Revit.DB Namespace