Revit 2027 API
RevitServerModelNameBreaksConventionException Methods
The RevitServerModelNameBreaksConventionException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerModelNameBreaksConventionException Class
Autodesk.Revit.Exceptions Namespace