Revit 2027 API
ConicalSurface Class
 A Conical Surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.ConicalSurface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConicalSurface : Surface
Public Class ConicalSurface
	Inherits Surface
public ref class ConicalSurface : public Surface
type ConicalSurface =
    class
        inherit Surface
    end
The ConicalSurface type exposes the following members.
Properties
Name | Description
Axis |  Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.
HalfAngle |  Cone angle.
Origin |  Apex of the cone. This is the origin of the local coordinate system associated with this cone.
XDir |  X axis of the local coordinate system associated with this cone.
YDir |  X axis of the local coordinate system associated with this cone.
Top
Methods
Name | Description
Create |  Creates a conical surface defined by a local reference frame and a half angle.
GetFrameOfReference |  Returns frame of reference associated with this ConicalSurface.
IsValidConeAngle |  Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
Top
Remarks
 The parametric equation of the cone is S(u, v) = center + v*[sin(halfAngle)(cos(u)*xVec + sin(u)*yVec) + cos(halfAngle)*zVec]. Only the branch of the cone with v >= 0 should be used.
See Also
Reference
Autodesk.Revit.DB Namespace