Revit 2027 API
FamilyInstanceCreationData Class
A class which wraps the arguments of FamilyInstance for batch creation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Creation.FamilyInstanceCreationData
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyInstanceCreationData
Public Class FamilyInstanceCreationData
public ref class FamilyInstanceCreationData
type FamilyInstanceCreationData = class end
The FamilyInstanceCreationData type exposes the following members.
Constructors
Name | Description
FamilyInstanceCreationData(Object) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(FamilySymbol, IList<XYZ>) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(Face, Line, FamilySymbol) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(Curve, FamilySymbol, Level, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(Face, XYZ, XYZ, FamilySymbol) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, Element, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, Level, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, Element, Level, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class
FamilyInstanceCreationData(XYZ, FamilySymbol, XYZ, Element, StructuralType) | Initializes a new instance of the FamilyInstanceCreationData class
Top
Properties
Name | Description
Axis |  Get or set the axis of the FamilyInstance
RotateAngle |  Get or set the rotate angle of the FamilyInstance
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.Creation Namespace