Revit 2027 API
PanelScheduleData Methods
The PanelScheduleData type exposes the following members.
Methods
Name | Description
AddLoadClassification |  Add a Load Classification Id to the array of Load Classifications.
GetLoadClassifications |  Gets an array of the load classifications associated with this panel schedule
GetNumberOfCircuitRows |  Gets the number of rows in the circuit table
IsSymmetric |  Check if this panel schedule is symmetric
RemoveLoadClassification |  Remove a Load Classification Id from the array of Load Classifications
SetBorderAroundSchedule |  Adds a border around the schedule
SetBorderAroundSections |  Adds a border around the sections
SetLoadClassifications |  Sets the Load Classifications associated with this panel schedule
UpdateCircuitTableForInstance |  Redraw the circuit table for the given panel with the given parameter updates
UpdateCircuitTableForTemplate |  Redraw the circuit table for a template with the given parameter updates
UpdateIsSectionHidden |  Update if this section is hidden or not
UpdateLoadSummary |  Update the load summary section
UpdateVerticalHeadersInSection |  Sets if this header should have vertical text
Top
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace