Revit 2027 API
MeshFromGeometryOperationResult Methods
The MeshFromGeometryOperationResult type exposes the following members.
Methods
Name | Description
Dispose
GetIssues |  Returns the array of issues encountered while building a mesh.
GetMesh |  This returns a valid mesh only for the first call. Later calls will throw an exception as the mesh is no longer valid in this object.
Top
See Also
Reference
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace