Revit 2027 API
EnergyAnalysisDetailModel Properties
The EnergyAnalysisDetailModel type exposes the following members.
Properties
Name | Description
BuildingTypeId |  The building type element.
ExportCategory |  Export elements of this category in energy analysis.
ExportMullions |  Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces |  Indicates if to set and get the setting for if shading surfaces should be included.
SimplifyCurtainSystems |  Indicates if to specify the setting for simplified curtain systems.
Tier |  Level of computation for energy analysis model.
Top
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace