Revit 2027 API
FilterInverseRule Class
 A filter rule that inverts the boolean values returned by the rule it contains.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterInverseRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterInverseRule : FilterRule
Public Class FilterInverseRule
	Inherits FilterRule
public ref class FilterInverseRule : public FilterRule
type FilterInverseRule =
    class
        inherit FilterRule
    end
The FilterInverseRule type exposes the following members.
Constructors
Name | Description
FilterInverseRule |  Constructs a new instance of FilterInverseRule.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetInnerRule |  Gets the rule being inverted.
SetInnerRule |  Gets the rule being inverted.
Top
Remarks
 FilterInverse rule performs a logical "not" operation on its inner rule's "elementPasses()" method.
See Also
Reference
Autodesk.Revit.DB Namespace