Revit 2027 API
DocumentCreatedEventArgs Class
 The event arguments used by the DocumentCreated event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentCreatedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentCreatedEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentCreatedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentCreatedEventArgs : public RevitAPIPostDocEventArgs
type DocumentCreatedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentCreatedEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 The newly created document is supplied in these arguments.
See Also
Reference
Autodesk.Revit.DB.Events Namespace