Revit 2027 API
ExportFontKey Class
 A key used to represent an item stored in an ExportFontTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportFontKey
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportFontKey : IDisposable
Public Class ExportFontKey
	Implements IDisposable
public ref class ExportFontKey : IDisposable
type ExportFontKey =
    class
        interface IDisposable
    end
The ExportFontKey type exposes the following members.
Constructors
Name | Description
ExportFontKey() |  Constructs a new default ExportFontKey.
ExportFontKey(ExportFontKey) |  Constructs a new copy of the input ExportFontKey object.
ExportFontKey(String) |  Constructs a new ExportFontKey using an input font name.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OriginalFontName |  The original font name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportFontKey
Top
See Also
Reference
Autodesk.Revit.DB Namespace