Revit 2027 API
ClassificationEntry Methods
The ClassificationEntry type exposes the following members.
Methods
Name | Description
HasBadCategoryId |  Checks if the category id is Revit BuiltInCategory id.
HasBadLevel |  Checks if the level is an integer in range between 1 and 5 inclusive.
HasInvalidKey |  Checks if the key matches the level and parent key.
Top
See Also
Reference
ClassificationEntry Class
Autodesk.Revit.DB Namespace