Revit 2027 API
RenderingSettings Methods
The RenderingSettings type exposes the following members.
Methods
Name | Description
Dispose
GetBackgroundSettings |  Returns an object that represents the rendering background settings.
GetRenderingImageExposureSettings |  Returns an object that represents the rendering image exposure settings.
GetRenderingQualitySettings |  Returns an object that represents the rendering quality settings.
GetRenderingRegionOutline |  Returns the outline of the rendering region.
SetBackgroundSettings |  Changes the rendering background settings details for the current background style.
SetRenderingImageExposureSettings |  Changes the rendering image exposure settings.
SetRenderingQualitySettings |  Change rendering quality settings.
Top
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace