Revit 2027 API
FilledRegion Properties
The FilledRegion type exposes the following members.
Properties
Name | Description
IsMasking |  Indicates whether this element is a 'Filled Region or a 'Masking Region'.
Top
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace