Revit 2027 API
StructuralSectionUserDefined Class
 Defines parameters for parameterized user defined structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUserDefined
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionUserDefined : StructuralSectionRectangular
Public Class StructuralSectionUserDefined
	Inherits StructuralSectionRectangular
public ref class StructuralSectionUserDefined : public StructuralSectionRectangular
type StructuralSectionUserDefined =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionUserDefined type exposes the following members.
Constructors
Name | Description
StructuralSectionUserDefined |  Creates a new instance of Structural Section User Defined shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace