Revit 2027 API
IntersectionResultArrayIterator Methods
The IntersectionResultArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
IntersectionResultArrayIterator Class
Autodesk.Revit.DB Namespace