Revit 2027 API
FamilySymbolFilter Properties
The FamilySymbolFilter type exposes the following members.
Properties
Name | Description
FamilyId |  The family id.
Top
See Also
Reference
FamilySymbolFilter Class
Autodesk.Revit.DB Namespace