Revit 2027 API
CADLinkType Methods
The CADLinkType type exposes the following members.
Methods
Name | Description
LoadFrom(ExternalResourceReference) |  Loads or reloads the DWG link from the given external resource reference.
LoadFrom(String) |  Loads or reloads the DWG link from the given file path.
Reload() |  Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Reload(CADLinkOptions) |  Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Top
See Also
Reference
CADLinkType Class
Autodesk.Revit.DB Namespace