Revit 2027 API
DirectShapeOptions Class
 This class is used to control behavior of a DirectShape object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectShapeOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DirectShapeOptions : IDisposable
Public Class DirectShapeOptions
	Implements IDisposable
public ref class DirectShapeOptions : IDisposable
type DirectShapeOptions =
    class
        interface IDisposable
    end
The DirectShapeOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ReferencingOption |  Whether or not the geometry stored in a DirectShape object may be referenced.
RoomBoundingOption |  Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DirectShapeOptions
Top
Remarks
 Use Enable/Disable functions to change the default behavior. Use DirectShape.SetOptions to modify that object's behavior.
See Also
Reference
Autodesk.Revit.DB Namespace