Revit 2027 API
View Properties
The View type exposes the following members.
Properties
Name | Description
AnalysisDisplayStyleId |  Element id of Analysis Display Style associated with the view.
AreAnalyticalModelCategoriesHidden |  Indicates if analytical model categories are currently hidden in the view.
AreAnnotationCategoriesHidden |  Indicates if annotation categories are currently hidden in the view.
AreCoordinationModelHandlesHidden |  Indicates if Coordination Model handles are currently hidden in the view.
AreImportCategoriesHidden |  Indicates if import categories are currently hidden in the view.
AreModelCategoriesHidden |  Indicates if model categories are currently hidden in the view.
ArePointCloudsHidden |  Indicates if point clouds are currently hidden in the view.
AssociatedAssemblyInstanceId |  The Id of the assembly instance that owns the assembly view.
CanBePrinted | Test whether the view can be printed.
CropBox | The Crop Box applied to the view, or an outline encompassing the crop region applied to the view.
CropBoxActive | Whether or not the Crop Box/Region is active for the view.
CropBoxVisible | Whether or not the Crop Box/Region is visible for the view.
DetailLevel |  The detail level of this view.
Discipline |  The Discipline of the view.
DisplayStyle |  The DisplayStyle of the view. Returns DisplayStyle.Wireframe if the view has no display style.
GenLevel | The level for the view.
IsAssemblyView |  Indicates if the view is assembly view.
IsCallout |  Indicates if the view is a callout view.
IsTemplate | Test whether the view is a view template.
Origin | Returns the origin of the screen.
Outline | The bounds of the view in paper space (in feet).
PartsVisibility |  The visibility setting for parts in this view.
RevealConstraintsMode |  Indicates whether the Reveal Constraints mode is activated in the view.
RightDirection | The direction towards the right side of the screen.
Scale | The scale of the view.
ShadowIntensity |  The intesity of cast shadows - 0 = no shadows, 100 = black.
SketchPlane | The sketch plane assigned to the view for model curve creation.
SunAndShadowSettings | The sun and shadow settings assigned to the view for shadow calculation and rendering.
SunlightIntensity |  The intensity of the simulated (directional) sunlight. 0 = no directional light; maximum value is 100.
TemporaryViewModes |  Data of temporary view modes associated with this view.
Title |  The view title. This consists of the view name plus other modifiers, such as the view type, sheet number, area scheme, and/or assembly type, depending on the specifics of the view.
UpDirection | The direction towards the top of the screen.
ViewDirection | The direction towards the viewer.
ViewPositionId |  The id of the view's saved position. Default is set to ElementId.InvalidElementId.
ViewTemplateId |  The id of the template view that controls this view's parameters.
ViewType | The type of the view.
Top
See Also
Reference
View Class
Autodesk.Revit.DB Namespace