Revit 2027 API
FileImportingEventArgs Class
 The event arguments used by the FileImporting event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.FileImportingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FileImportingEventArgs : RevitAPIPreDocEventArgs
Public Class FileImportingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class FileImportingEventArgs : public RevitAPIPreDocEventArgs
type FileImportingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The FileImportingEventArgs type exposes the following members.
Properties
Name | Description
Format |  Identifies the import format, e.g. DWG or image.
Path |  Path of the source file which is about to be imported.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace