Revit 2027 API
APIObject Class
Supports all objects in the Autodesk Revit API hierarchy.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class APIObject : IDisposable
Public Class APIObject
	Implements IDisposable
public ref class APIObject : IDisposable
type APIObject =
    class
        interface IDisposable
    end
The APIObject type exposes the following members.
Properties
Name | Description
IsReadOnly | Identifies if the object is read-only or modifiable.
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.Creation.Application
 Autodesk.Revit.Creation.ItemFactoryBase
 Autodesk.Revit.DB.Binding
 Autodesk.Revit.DB.BoundingBoxXYZ
 Autodesk.Revit.DB.Category
 Autodesk.Revit.DB.CategoryNameMap
 Autodesk.Revit.DB.CategoryNameMapIterator
 Autodesk.Revit.DB.CategorySet
 Autodesk.Revit.DB.CategorySetIterator
 Autodesk.Revit.DB.City
 Autodesk.Revit.DB.CitySet
 Autodesk.Revit.DB.CitySetIterator
 Autodesk.Revit.DB.Color
 Autodesk.Revit.DB.CombinableElementArray
 Autodesk.Revit.DB.CombinableElementArrayIterator
 Autodesk.Revit.DB.ConnectorSet
 Autodesk.Revit.DB.ConnectorSetIterator
 Autodesk.Revit.DB.CurtainCell
 Autodesk.Revit.DB.CurtainGrid
 Autodesk.Revit.DB.CurtainGridSet
 Autodesk.Revit.DB.CurtainGridSetIterator
 Autodesk.Revit.DB.CurveArrArray
 Autodesk.Revit.DB.CurveArrArrayIterator
 Autodesk.Revit.DB.CurveArray
 Autodesk.Revit.DB.CurveArrayIterator
 Autodesk.Revit.DB.CurveByPointsArray
 Autodesk.Revit.DB.CurveByPointsArrayIterator
 Autodesk.Revit.DB.DefinitionBindingMap
 Autodesk.Revit.DB.DefinitionBindingMapIterator
 Autodesk.Revit.DB.DefinitionFile
 Autodesk.Revit.DB.DefinitionGroup
 Autodesk.Revit.DB.DetailCurveArray
 Autodesk.Revit.DB.DetailCurveArrayIterator
 Autodesk.Revit.DB.DimensionSegment
 Autodesk.Revit.DB.DimensionSegmentArray
 Autodesk.Revit.DB.DimensionSegmentArrayIterator
 Autodesk.Revit.DB.DocumentSet
 Autodesk.Revit.DB.DocumentSetIterator
 Autodesk.Revit.DB.DoubleArray
 Autodesk.Revit.DB.DoubleArrayIterator
 Autodesk.Revit.DB.EdgeArray
 Autodesk.Revit.DB.EdgeArrayArray
 Autodesk.Revit.DB.EdgeArrayArrayIterator
 Autodesk.Revit.DB.EdgeArrayIterator
 Autodesk.Revit.DB.Electrical.DistributionSysTypeSet
 Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator
 Autodesk.Revit.DB.Electrical.VoltageTypeSet
 Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator
 Autodesk.Revit.DB.Electrical.WireConduitType
 Autodesk.Revit.DB.Electrical.WireConduitTypeSet
 Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator
 Autodesk.Revit.DB.Electrical.WireSet
 Autodesk.Revit.DB.Electrical.WireSetIterator
 Autodesk.Revit.DB.Electrical.WireTypeSet
 Autodesk.Revit.DB.Electrical.WireTypeSetIterator
 Autodesk.Revit.DB.ElementArray
 Autodesk.Revit.DB.ElementArrayIterator
 Autodesk.Revit.DB.ElementSet
 Autodesk.Revit.DB.ElementSetIterator
 Autodesk.Revit.DB.FaceArray
 Autodesk.Revit.DB.FaceArrayIterator
 Autodesk.Revit.DB.FamilyElementVisibility
 Autodesk.Revit.DB.FamilyManager
 Autodesk.Revit.DB.FamilyParameter
 Autodesk.Revit.DB.FamilyParameterSet
 Autodesk.Revit.DB.FamilyParameterSetIterator
 Autodesk.Revit.DB.FamilyPointLocation
 Autodesk.Revit.DB.FamilyPointPlacementReference
 Autodesk.Revit.DB.FamilyType
 Autodesk.Revit.DB.FamilyTypeSet
 Autodesk.Revit.DB.FamilyTypeSetIterator
 Autodesk.Revit.DB.FormArray
 Autodesk.Revit.DB.FormArrayIterator
 Autodesk.Revit.DB.GeomCombinationSet
 Autodesk.Revit.DB.GeomCombinationSetIterator
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.GroupSet
 Autodesk.Revit.DB.GroupSetIterator
 Autodesk.Revit.DB.IntersectionResult
 Autodesk.Revit.DB.IntersectionResultArray
 Autodesk.Revit.DB.IntersectionResultArrayIterator
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.Leader
 Autodesk.Revit.DB.LeaderArray
 Autodesk.Revit.DB.LeaderArrayIterator
 Autodesk.Revit.DB.Location
 Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet
 Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator
 Autodesk.Revit.DB.Mechanical.SpaceSet
 Autodesk.Revit.DB.Mechanical.SpaceSetIterator
 Autodesk.Revit.DB.MEPModel
 Autodesk.Revit.DB.ModelCurveArrArray
 Autodesk.Revit.DB.ModelCurveArrArrayIterator
 Autodesk.Revit.DB.ModelCurveArray
 Autodesk.Revit.DB.ModelCurveArrayIterator
 Autodesk.Revit.DB.MullionTypeSet
 Autodesk.Revit.DB.MullionTypeSetIterator
 Autodesk.Revit.DB.Options
 Autodesk.Revit.DB.PanelTypeSet
 Autodesk.Revit.DB.PanelTypeSetIterator
 Autodesk.Revit.DB.PaperSize
 Autodesk.Revit.DB.PaperSizeSet
 Autodesk.Revit.DB.PaperSizeSetIterator
 Autodesk.Revit.DB.PaperSource
 Autodesk.Revit.DB.PaperSourceSet
 Autodesk.Revit.DB.PaperSourceSetIterator
 Autodesk.Revit.DB.Parameter
 Autodesk.Revit.DB.ParameterMap
 Autodesk.Revit.DB.ParameterMapIterator
 Autodesk.Revit.DB.ParameterSet
 Autodesk.Revit.DB.ParameterSetIterator
 Autodesk.Revit.DB.PhaseArray
 Autodesk.Revit.DB.PhaseArrayIterator
 Autodesk.Revit.DB.PlanCircuit
 Autodesk.Revit.DB.PlanCircuitSet
 Autodesk.Revit.DB.PlanCircuitSetIterator
 Autodesk.Revit.DB.PlanTopology
 Autodesk.Revit.DB.PlanTopologySet
 Autodesk.Revit.DB.PlanTopologySetIterator
 Autodesk.Revit.DB.PrintManager
 Autodesk.Revit.DB.PrintParameters
 Autodesk.Revit.DB.PrintSetup
 Autodesk.Revit.DB.ProjectLocationSet
 Autodesk.Revit.DB.ProjectLocationSetIterator
 Autodesk.Revit.DB.Reference
 Autodesk.Revit.DB.ReferenceArray
 Autodesk.Revit.DB.ReferenceArrayArray
 Autodesk.Revit.DB.ReferenceArrayArrayIterator
 Autodesk.Revit.DB.ReferenceArrayIterator
 Autodesk.Revit.DB.ReferencePointArray
 Autodesk.Revit.DB.ReferencePointArrayIterator
 Autodesk.Revit.DB.Settings
 Autodesk.Revit.DB.SlabShapeCreaseArray
 Autodesk.Revit.DB.SlabShapeCreaseArrayIterator
 Autodesk.Revit.DB.SlabShapeVertexArray
 Autodesk.Revit.DB.SlabShapeVertexArrayIterator
 Autodesk.Revit.DB.SpacingRule
 Autodesk.Revit.DB.Steel.SteelElementProperties
 Autodesk.Revit.DB.SweepProfile
 Autodesk.Revit.DB.SymbolicCurveArray
 Autodesk.Revit.DB.SymbolicCurveArrayIterator
 Autodesk.Revit.DB.TemporaryViewModes
 Autodesk.Revit.DB.ThermalProperties
 Autodesk.Revit.DB.TilePatterns
 Autodesk.Revit.DB.Transform
 Autodesk.Revit.DB.VertexIndexPairArray
 Autodesk.Revit.DB.VertexIndexPairArrayIterator
 Autodesk.Revit.DB.ViewSet
 Autodesk.Revit.DB.ViewSetIterator
 Autodesk.Revit.DB.ViewSheetSetting
 Autodesk.Revit.DB.Visual.AssetSet
 Autodesk.Revit.DB.Visual.AssetSetIterator
 Autodesk.Revit.UI.Events.DialogBoxData
 Autodesk.Revit.UI.ExternalApplicationArray
 Autodesk.Revit.UI.ExternalApplicationArrayIterator
 Autodesk.Revit.UI.ExternalCommandData
 Autodesk.Revit.UI.TaskDialog