Revit 2027 API
EnergyAnalysisWindowType Methods
The EnergyAnalysisWindowType type exposes the following members.
Methods
Name | Description
GetSolarHeatGainCoefficientsForSolarIndicientAngles |  Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type.
Top
See Also
Reference
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace