Revit 2027 API
Mesh Methods
The Mesh type exposes the following members.
Methods
Name | Description
ComputeSurfaceArea |  Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh.
GetNormal |  Returns a normal unit vector at the given index.
GetNormals |  Returns all normals assigned to the mesh.
Top
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace