Revit 2027 API
DoubleArray Properties
The DoubleArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a double at a specified index within the array.
Size | Returns the number of doubles that are in the array.
Top
See Also
Reference
DoubleArray Class
Autodesk.Revit.DB Namespace