Revit 2027 API
RebarFreeFormAccessor Class
 A class that is used to access the properties and capabilities of free-form Rebar.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarFreeFormAccessor
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarFreeFormAccessor : IDisposable
Public Class RebarFreeFormAccessor
	Implements IDisposable
public ref class RebarFreeFormAccessor : IDisposable
type RebarFreeFormAccessor =
    class
        interface IDisposable
    end
The RebarFreeFormAccessor type exposes the following members.
Properties
Name | Description
AlignedFreeFormSetOrientationOptions | Obsolete.
 Orientation options for an Aligned Free Form Rebar set.
CycleCounter
Identifies the cycle counter. It can be zero or a pozitive number.
Its value is changed when the free form Rebar element is selected and the user press Space key -or- through the setter of this property -or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0). This property can be accessed just for Rebars that are controlled by a server.
FreeFormSetOrientationOptions |  Identifies the orientation options for an Aligned or 3D Path Free Form Rebar set.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RebarStyle |  Identifies the RebarStyle of the current Rebar element.
StirrupTieAttachmentType |  Identifies the StirrupTieAttachmentType of the current Rebar element. The RebarStyle of the Rebar element must be StirrupTie.
WorkshopInstructions |  Identifies the workshop instructions of the current Rebar element.
Top
Methods
Name | Description
AddUpdatingSharedParameter |  Add existing shared parameter as a dependency for the calculation of the rebar curves.
CanBeTerminationPlaneNormal |  A vector can be termination (e.g. hook, crank) plane normal if for a bar specified by index, the bar direction is not parallel with the vector.
DisconnectFromServer |  Sets the GUID of the API server to invalid value and removes all the server related data from the Rebar (ex. the current constraints and the handle tags are removed). Calling this method will result in a Rebar that will not react to host changes anymore, however it will still have all the properties that it used to have.
Dispose | Releases all resources used by the RebarFreeFormAccessor
Flip3dPathSet |  For a free form set distributed along a 3D path, this method flips the distribution path. The set should not have Single layout rule.
GetComputationDataFor3DPathSet |  For a free form set distributed along a 3D path, this method gets the computation data.
GetCouplerIdAtIndex |  Gets the id of the Rebar Coupler that is applied to the bar with index barPositionIndex at the specified end.
GetCrankTypeIdAtIndex |  Gets the id of the Rebar Crank Type that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetCustomDistributionPath |  Gets the custom distribution path for free form rebar set.
GetDefaultPositiveDirectionForMorphedTargetEdgesHandle |  Gets the default positive direction of the specified target rebar edge in terms of how Morphed Free Form Rebar is defining the default positive direction.
GetEndTreatmentTypeIdAtIndex |  Gets the id of the EndTreatmentType that is applied to the bar with index barPositionIndex at the specified end.
GetHookTypeIdAtIndex |  Gets the id of the RebarHookType that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetServerGUID |  Returns the GUID of the API server.
GetShapeIdAtIndex |  Gets the Rebar Shape id for the bar with index barPositionIndex.
GetTerminationOrientationAtIndex |  Gets the termination's (e.g. hook, crank ) orientation that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetTerminationPlaneNormalForBarIndex |  Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
GetTerminationRotationAngleAtIndex |  Gets the termination (e.g hook,crank) rotation angle that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetUpdatingSharedParameters |  Get the shared parameters listed as dependencies in the calculation of the rebar curves
HasValid3DPathServer |  Returns true if the current rebar is created with the 3D Path Free Form rebar server, false otherwise.
HasValidAlignedServer |  Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.
HasValidMorphedServer |  Returns true if the current rebar is created with the Morphed Free Form rebar server, false otherwise.
HasValidServer |  Returns true if the current rebar contains a valid server GUID, false otherwise.
HasValidSurfaceServer |  Returns true if the current rebar is created with the Surface Free Form rebar server, false otherwise.
IsBarMatchedWithShapeInReverseOrder |  Checks if the bar at index barPositionIndex it's matched in reversed order with its shape.
IsUnconstrained |  Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints.
IsValidRebarTargetForMorphedRebar |  Checks if the rebar can be used as a target for morphed rebar. A rebar is a valid target for morphed rebar if all the bars in set have the same number of segments and all are planar. Multiplanar bars are considered invalid.
RemoveUpdatingSharedParameter |  Remove existing shared parameter as a dependency for the calculation of the rebar curves.
SetComputationDataFor3DPathSet |  For a free form set distributed along a 3D path, this method sets the computation data.
SetCurves(IList<CurveLoop>) |  Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetCurves(IList<IList<Curve>>) |  Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetLayoutAsCustomSpacing |  Sets the Layout Rule property of rebar set to Custom Spacing.
SetLayoutAsFixedNumber |  Sets the Layout Rule property of rebar set to Fixed Number.
SetLayoutAsMaximumSpacing |  Sets the Layout Rule property of rebar set to Maximum Spacing.
SetLayoutAsMinimumClearSpacing |  Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
SetLayoutAsNumberWithSpacing |  Sets the Layout Rule property of rebar set to Number With Spacing.
SetLayoutAsSingle |  Sets the Layout Rule property of rebar set to Single.
SetReportedShape |  This method changes the RebarShape of a Free Form Rebar that is using RebarWorkInstructions.Straight property to the provided RebarShape.
SetTerminationPlaneNormalForBarIndex |  Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay. Will throw exception if the rebar has valid constraints.
Top
Remarks
 Obtain an instance of this class from GetFreeFormAccessor(). The accessor includes a reference to the Rebar element. If the referenced Rebar element is deleted, using the methods form this class will throw exception.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace