Revit 2027 API
ParameterMapIterator Properties
The ParameterMapIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Key | Retrieves the key that is the current focus of the iterator.
Top
See Also
Reference
ParameterMapIterator Class
Autodesk.Revit.DB Namespace