Revit 2027 API
StructuralSectionConcretePolygon Class
 Defines parameters for parameterized concrete polygon structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcretePolygon
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcretePolygon : StructuralSectionRound
Public Class StructuralSectionConcretePolygon
	Inherits StructuralSectionRound
public ref class StructuralSectionConcretePolygon : public StructuralSectionRound
type StructuralSectionConcretePolygon =
    class
        inherit StructuralSectionRound
    end
The StructuralSectionConcretePolygon type exposes the following members.
Constructors
Name | Description
StructuralSectionConcretePolygon |  Creates a new instance of Structural Section Concrete Polygon shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
PolygonDefinition |  Indicates whether the polygon contour is inscribed or circumscribed.
Sides |  Number of sides of the polygon contour.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace