Revit 2027 API
ReinforcementAbbreviationTag Class
 This class is used to access the Area or Path Reinforcement abbreviation tag data. It stores abbreviation tag value and abbreviation type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReinforcementAbbreviationTag : IDisposable
Public Class ReinforcementAbbreviationTag
	Implements IDisposable
public ref class ReinforcementAbbreviationTag : IDisposable
type ReinforcementAbbreviationTag =
    class
        interface IDisposable
    end
The ReinforcementAbbreviationTag type exposes the following members.
Constructors
Name | Description
ReinforcementAbbreviationTag |  Constructs a new ReinforcementAbbreviationTag.
Top
Properties
Name | Description
AbbreviationTag |  The abbreviation tag value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TypeTag |  The abbreviation tag type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReinforcementAbbreviationTag
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace