Revit 2027 API
ChangeType Class
 A class representing a change that can be detected and tracked during Dynamic Update.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ChangeType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ChangeType : IDisposable
Public Class ChangeType
	Implements IDisposable
public ref class ChangeType : IDisposable
type ChangeType =
    class
        interface IDisposable
    end
The ChangeType type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
ConcatenateChangeTypes |  Creates a ChangeType that is a union of the two input ChangeTypes
Contains |  Checks whether this ChangeType contains the input ChangeType
Dispose | Releases all resources used by the ChangeType
IsIdentical |  Compares if two ChangeTypes are identical
Top
Remarks
 ChangeTypes for specific changes can be obtained from the static methods available on Element.
See Also
Reference
Autodesk.Revit.DB Namespace