Revit 2027 API
PlanCircuitSetIterator Class
An iterator to a set of plan circuit objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PlanCircuitSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class PlanCircuitSetIterator : APIObject,
	IEnumerator
Public MustInherit Class PlanCircuitSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class PlanCircuitSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type PlanCircuitSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The PlanCircuitSetIterator type exposes the following members.
Constructors
Name | Description
PlanCircuitSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace