Revit 2027 API
Mesh Class
A triangular mesh.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Mesh
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Mesh : GeometryObject
Public Class Mesh
	Inherits GeometryObject
public ref class Mesh : public GeometryObject
type Mesh =
    class
        inherit GeometryObject
    end
The Mesh type exposes the following members.
Properties
Name | Description
DistributionOfNormals |  Indicates the distribution of normal vectors along the tessellated mesh surface.
IsClosed |  Indicates whether the mesh is closed.
MaterialElementId | Element ID of the material from which this mesh is composed.
NumberOfNormals |  The number of normals associated with the mesh.
NumTriangles | The number of triangles that the mesh contains.
Transformed | Transforms this mesh and returns the result.
Triangle | Retrieves a specific triangle.
Vertices | Retrieves all vertices used to define this mesh. Intended for indexed access.
Top
Methods
Name | Description
ComputeSurfaceArea |  Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh.
GetNormal |  Returns a normal unit vector at the given index.
GetNormals |  Returns all normals assigned to the mesh.
Top
Remarks
Meshes are generated during triangulation of faces. They can also be encountered directly in Revit geometry (typically imported geometry). Meshes contain a single array of Vertices, and a corresponding array of triangles. Triangles can be accessed by index from Triangle[Int32], and reference 3 vertices from the Vertices array.
See Also
Reference
Autodesk.Revit.DB Namespace