Revit 2027 API
ThermalProperties Class
 Class specific to thermal properties for assembly types, such as Wall, Floor, Ceiling, Roof and Building Pad.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ThermalProperties
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ThermalProperties : APIObject
Public Class ThermalProperties
	Inherits APIObject
public ref class ThermalProperties : public APIObject
type ThermalProperties =
    class
        inherit APIObject
    end
The ThermalProperties type exposes the following members.
Properties
Name | Description
Absorptance |  Value of absorptance.
HeatTransferCoefficient | Obsolete.
 The heat transfer coefficient value (U-Value). The unit is watts per meter-squared kelvin (W/(m^2*K)).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Roughness |  Value of roughness.
ThermalMass |  The calculated thermal mass value. The unit is kilogram feet-squared per second squared kelvin (kg ft^2/(s^2 K)).
ThermalResistance |  The calculated thermal resistance value (R-Value). The unit is meter-squared kelvin per watt ((m^2*K)/Watt).
ThermalTransmittance |  The thermal transmittance value (U-Value). The unit is watts per meter-squared kelvin (W/(m^2*K)).
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace