Revit 2027 API
BaseArray Properties
The BaseArray type exposes the following members.
Properties
Name | Description
Label | The family parameter label of the BaseArray.
Name | Get and Set the Name property
(Overrides Element.Name)
NumMembers | Retrieves or changes the number of the arrayed members.
Top
See Also
Reference
BaseArray Class
Autodesk.Revit.DB Namespace