Revit 2027 API
DirectShape Class
 This class is used to store externally created geometric shapes. Primary intended use is for importing shapes from other data formats such as IFC or STEP. A DirectShape object may be assigned a category. That will affect how that object is displayed in Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DirectShape
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DirectShape : Element
Public Class DirectShape
	Inherits Element
public ref class DirectShape : public Element
type DirectShape =
    class
        inherit Element
    end
The DirectShape type exposes the following members.
Properties
Name | Description
ApplicationDataId |  A text string that identifies the data to the creating application.
ApplicationId |  A text string that identifies the creating application.
TypeId |  Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.
Top
Methods
Name | Description
AddExternallyTaggedGeometry |  Adds the externally tagged geometry object to the DirectShape.
AddReferenceCurve(Curve) |  Adds a reference curve to the DirectShape.
AddReferenceCurve(Curve, DirectShapeReferenceOptions) |  Adds a reference curve to the DirectShape.
AddReferencePlane(Plane) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, DirectShapeReferenceOptions) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV, DirectShapeReferenceOptions) |  Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
AddReferencePoint(XYZ) |  Adds a reference point to the DirectShape.
AddReferencePoint(XYZ, DirectShapeReferenceOptions) |  Adds a reference point to the DirectShape.
AppendShape(IList<GeometryObject>) |  Appends the collection of GeometryObjects into the model shape representation stored in this DirectShape.
AppendShape(ShapeBuilder) |  Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShape. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
AreOptionsValid |  Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
AreOptionsValidForTransientDirectShape |  Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
AreValidDirectShapeReferenceOptions |  Validates that the input DirectShapeReferenceOptions are suitable for creating a direct shape reference object. If the options specify an ExternalGeometryId, it must not correspond to any existing reference object belonging to the DirectShape.
CanCreateParts |  Indicates if it is possible to create parts from this DirectShape element.
CreateElement |  Creates a DirectShape object and adds it to document.
CreateElementInstance |  Creates a DirectShape object and adds it to document.
CreateGeometryInstance |  Creates a copy of a definition shape that was created earlier.
GetExternallyTaggedGeometry |  Gets the externally tagged geometry by its external ID that is stored in this DirectShape.
GetExternallyTaggedReference |  Retrieve a Reference to reference geometry of the DirectShape that is associated with a particular ExternalGeometryId.
GetOptions |  Gets a copy of the current options for this DirectShape.
HasExternalGeometry |  Checks whether the externally tagged geometry is already present in this DirectShape.
HasExternallyTaggedReference |  Checks if the externally tagged reference is already present in this DirectShape.
IsSupportedDocument |  Tests whether a DirectShape or a DirectShapeType may be created in this document.
IsValidCategoryId |  Test the category id to make sure the category is allowed for a DirectShape or DirectShapeType.
IsValidGeometry |  Validates geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry must make sense as a shape representation for the category assigned to this DirectShape object.
IsValidReferenceCurve |  Validates that the input curve is suitable for creating a direct shape reference curve. Bounded and unbounded lines are accepted. Other bounded and unbounded curve types with natural bounds are accepted if they are not closed. Unbounded periodic curves are not allowed.
IsValidReferencePlaneBoundingBoxUV |  Validates that the input BoundingBoxUV is suitable for bounding a reference plane surface. The input BoundingBoxUV must be set and not degenerate.
IsValidShape(ExternallyTaggedGeometryObject) |  Validates shape to be stored in a DirectShape.
IsValidShape(IList<GeometryObject>) |  Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry().
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
IsValidTypeId |  Tests the type id to make sure it satisfies the following conditions
It is a valid element id.
It corresponds to a valid DirectShapeType.
The DirectShapeType has the same category assigned.
 Additionally, this functions tests that the current type id in this DirectShape is invalid. The type id is initialized to invalidElementId by the create functions. Once it is set, it may no longer be changed.
IsValidUsage |  Validates that the ExternallyTaggedGeometryObject's usage is set to an allowed value for a DirectShape.
RemoveAllReferenceObjects |  Removes all reference objects (if any) from the DirectShape.
RemoveExternallyTaggedGeometry |  Removes the externally tagged geometry object by its external ID from this DirectShape.
RemoveReferenceObject(ExternalGeometryId) |  Removes any reference object associated with the provided ExternalGeometryId from the DirectShape. Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
RemoveReferenceObject(String) |  Removes any reference objects with the given name from the DirectShape. Nothing is done if no reference objects have the given name or if the name is the empty string.
ResetExternallyTaggedGeometry |  Removes all of the externally tagged geometry in this DirectShape.
SetName |  Sets the name for the DirectShape element.
SetOptions |  Sets the options to use for this DirectShape.
SetShape(IList<GeometryObject>) |  Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetShape(ShapeBuilder) |  Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept.
SetShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Builds the shape of this object from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetTypeId |  Sets the DirectShapeType for the DirectShape element.
UpdateExternallyTaggedGeometry |  Updates the externally tagged geometry object in the DirectShape.
Top
Remarks
 DirectShape is not a replacement for "real" Wall, Roof, Window, etc. It would typically be used where there is not enough information to create, e.g., a Wall, or full functionality of a Wall object is not needed. Some category-specific functionality may be available. If you need to modify a shape held by a DirectShape object, use Revit Geometry API, and then store the modified shape back to the DirectShape object.
Example
// Create a DirectShape Sphere
public void CreateSphereDirectShape(Document doc)
{
    List<Curve> profile = new List<Curve>();
    // first create sphere with 2' radius
    XYZ center = XYZ.Zero;
    double radius = 2.0;
    XYZ profile00 = center;
    XYZ profilePlus = center + new XYZ(0, radius, 0);
    XYZ profileMinus = center - new XYZ(0, radius, 0);
    profile.Add(Line.CreateBound(profilePlus, profileMinus));
    profile.Add(Arc.Create(profileMinus, profilePlus, center + new XYZ(radius, 0, 0)));
    CurveLoop curveLoop = CurveLoop.Create(profile);
    SolidOptions options = new SolidOptions(ElementId.InvalidElementId, ElementId.InvalidElementId);
    Frame frame = new Frame(center, XYZ.BasisX, -XYZ.BasisZ, XYZ.BasisY);
    if (Frame.CanDefineRevitGeometry(frame) == true)
    {
        Solid sphere = GeometryCreationUtilities.CreateRevolvedGeometry(frame, new CurveLoop[] { curveLoop }, 0, 2 * Math.PI, options);
        using (Transaction t = new Transaction(doc, "Create sphere direct shape"))
        {
            t.Start();
            // create direct shape and assign the sphere shape
            DirectShape ds = DirectShape.CreateElement(doc, new ElementId(BuiltInCategory.OST_GenericModel));
            ds.ApplicationId = "Application id";
            ds.ApplicationDataId = "Geometry object id";
            ds.SetShape(new GeometryObject[] { sphere });
            t.Commit();
        }
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace