Revit 2027 API
PointOnEdge Class
Define a ReferencePoint relative to a referenceable edge or curve on another element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointElementReference
 Autodesk.Revit.DB.PointOnEdge
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointOnEdge : PointElementReference
Public Class PointOnEdge
	Inherits PointElementReference
public ref class PointOnEdge : public PointElementReference
type PointOnEdge =
    class
        inherit PointElementReference
    end
The PointOnEdge type exposes the following members.
Properties
Name | Description
LocationOnCurve | The point location on curve.
Top
Methods
Name | Description
GetEdgeReference | Get a copy of the edge or curve reference.
SetEdgeReference | Change the edge or curve reference.
Top
Remarks
The ReferencePoint's X basis vector is constrained to the tangent vector to the curve. The Y and Z vectors are free to rotate around the curve.
See Also
Reference
Autodesk.Revit.DB Namespace