Revit 2027 API
AssemblyMemberDifferentParameters Class
 The two assembly members being compared have different parameters
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentParameters
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyMemberDifferentParameters : AssemblyMemberDifference
Public Class AssemblyMemberDifferentParameters
	Inherits AssemblyMemberDifference
public ref class AssemblyMemberDifferentParameters : public AssemblyMemberDifference
type AssemblyMemberDifferentParameters =
    class
        inherit AssemblyMemberDifference
    end
The AssemblyMemberDifferentParameters type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace