Revit 2027 API
ElectricalPerPhaseData Methods
The ElectricalPerPhaseData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ElectricalPerPhaseData Class
Autodesk.Revit.DB.Electrical Namespace