Revit 2027 API
FileArgumentAlreadyExistsException Class
The exception that is thrown when the specified file exists.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class FileArgumentAlreadyExistsException : ArgumentException
<SerializableAttribute>
Public Class FileArgumentAlreadyExistsException
	Inherits ArgumentException
[SerializableAttribute]
public ref class FileArgumentAlreadyExistsException : public ArgumentException
[<SerializableAttribute>]
type FileArgumentAlreadyExistsException =
    class
        inherit ArgumentException
    end
The FileArgumentAlreadyExistsException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace