Revit 2027 API
DistributionSysType Properties
The DistributionSysType type exposes the following members.
Properties
Name | Description
ElectricalPhase |  Get or set electrical phase (single, triple or undefined) of distribution system.
ElectricalPhaseConfiguration |  Get or set electrical phase configuration (Y, delta or undefined) of distribution system.
HighLegPhase |  The high-leg phase in the 3 phase 4 wires delta distribution system.
IsInUse |  Get the value which indicates whether this distribution system is in service now.
NumWires |  Get or set number of wires of distribution system.
VoltageLineToGround |  Get or set line to ground voltage of distribution system type.
VoltageLineToLine |  Get or set line to line voltage type of distribution system type.
Top
See Also
Reference
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace