Revit 2027 API
MaterialNode Properties
The MaterialNode type exposes the following members.
Properties
Name | Description
Color |  The color the material is being rendered at
Glossiness |  The level of glossiness of the material
HasOverriddenAppearance |  Identifies if the default rendering appearance the material has is being overridden.
MaterialId |  The Id of the element assocated with this material in the model.
Smoothness |  The level of smoothness of the material.
ThumbnailFile |  The path if a file that contains a thumbnail image of the material.
Transparency |  The value of transparency the material is being rendered with
Top
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace