Revit 2027 API
DocumentPreviewSettings Methods
The DocumentPreviewSettings type exposes the following members.
Methods
Name | Description
Dispose
ForceViewUpdate |  Sets Revit to update the preview view if necessary.
IsViewIdValidForPreview |  Identifies if the view id is valid as a preview view id.
Top
See Also
Reference
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace