Revit 2027 API
StructuralSectionConcretePolygon Properties
The StructuralSectionConcretePolygon type exposes the following members.
Properties
Name | Description
PolygonDefinition |  Indicates whether the polygon contour is inscribed or circumscribed.
Sides |  Number of sides of the polygon contour.
Top
See Also
Reference
StructuralSectionConcretePolygon Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace