Revit 2027 API
FamilyParameterSetIterator Class
An iterator to a FamilyParameter set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyParameterSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class FamilyParameterSetIterator : APIObject,
	IEnumerator
Public MustInherit Class FamilyParameterSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class FamilyParameterSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type FamilyParameterSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The FamilyParameterSetIterator type exposes the following members.
Constructors
Name | Description
FamilyParameterSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace