Revit 2027 API
SATExportOptions Class
 The export options used by exporting SAT format file. So far, there is no option in it.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SATExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SATExportOptions : IDisposable
Public Class SATExportOptions
	Implements IDisposable
public ref class SATExportOptions : IDisposable
type SATExportOptions =
    class
        interface IDisposable
    end
The SATExportOptions type exposes the following members.
Constructors
Name | Description
SATExportOptions() |  Constructs a new instance of SATImportOptions with default values of all properties.
SATExportOptions(SATExportOptions) |  Constructs a new instance of SATImportOptions as a copy of the export options.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SATExportOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace