Revit 2027 API
SplitButtonData Class
This class contains information necessary to construct a split button in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PulldownButtonData
 Autodesk.Revit.UI.SplitButtonData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SplitButtonData : PulldownButtonData
Public Class SplitButtonData
	Inherits PulldownButtonData
public ref class SplitButtonData : public PulldownButtonData
type SplitButtonData =
    class
        inherit PulldownButtonData
    end
The SplitButtonData type exposes the following members.
Constructors
Name | Description
SplitButtonData | Constructs a new instance of SplitButtonData.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace