Revit 2027 API
Color Properties
The Color type exposes the following members.
Properties
Name | Description
Blue | Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Green | Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
InvalidColorValue |  Get the invalid Color whose IntegerValue is -1.
IsValid | Identifies if the color represents a valid color, or an uninitialized/invalid value.
Red | Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead.
Top
See Also
Reference
Color Class
Autodesk.Revit.DB Namespace