Revit 2027 API
RebarConstraintsManager Methods
The RebarConstraintsManager type exposes the following members.
Methods
Name | Description
AllowConstraintTargets |  Returns true if references are valid targets for handle, false otherwise.
ApplyRebarConstraints |  Returns true if constraints were applied to rebar with success.
ClearHandleConstraintPairHighlighting |  Clears all highlighting in all views.
Dispose
GetAllConstrainedHandles |  Retrieves all handles on the Rebar that are constrained to external references.
GetAllHandles |  Gets all RebarConstrainedHandles of this bar.
GetConstraintCandidatesForHandle(RebarConstrainedHandle, ElementId)
For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle.
For free form rebar will return an empty list.
GetConstraintCandidatesForHandle(RebarConstrainedHandle, Reference)
For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference.
For free form rebar will return an empty list.
GetCurrentConstraintOnHandle |  Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
GetPreferredConstraintOnHandle
For ShapeDriven: Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
For FreeForm: Returns the RebarConstraint that acts on the specified RebarConstraintHandle.
GetRebar |  Gets the Rebar element whose constraints are managed using this instance.
HasValidRebar |  Checks whether the Manager's Rebar is still valid.
HighlightHandleConstraintPairInAllViews |  Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.
RemovePreferredConstraintFromHandle
For ShapeDriven: Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.
For FreeForm: Removes the RebarConstraint that is associated to the specified RebarConstrainedHandle.
SetPreferredConstraint |  Sets the RebarConstraint as preferred constraint for its RebarConstrainedHandle.
SetPreferredConstraintsToSurfaceForHandles
For ShapeDriven Rebar it will set a preferred 'ToSurface' RebarConstraint for each input handle. The surface that will be used by the constraint is the current surface that is used to compute the position of the handle.
This function applies only for shape driven Rebar, and will throw exception for free form rebar.
Top
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace