Revit 2027 API
IFCExtrusionData Class
 Represents the geometry of an extrusion (a solid body or opening) generated from Revit geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCExtrusionData
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCExtrusionData : IDisposable
Public Class IFCExtrusionData
	Implements IDisposable
public ref class IFCExtrusionData : IDisposable
type IFCExtrusionData =
    class
        interface IDisposable
    end
The IFCExtrusionData type exposes the following members.
Constructors
Name | Description
IFCExtrusionData |  Constructs a new empty extrusion data object.
Top
Properties
Name | Description
ExtrusionBasis |  The basis used for the extrusion.
ExtrusionDirection |  The direction used for the extrusion.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ScaledExtrusionLength |  The length of the extrusion, scaled in the units of the export.
Top
Methods
Name | Description
AddLoop |  Adds a curve loop to the extrusion data.
ClearLoops |  Clears the curve loops stored in the extrusion data.
Dispose | Releases all resources used by the IFCExtrusionData
GetLoops |  Gets the curve loops that form the base shape of the extrusion.
IsValid |  Determines if the extrusion data represents a valid extrusion.
RemoveLoopAt |  Removes the loop at the specified index.
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace