Revit 2027 API
FilterInverseRule Methods
The FilterInverseRule type exposes the following members.
Methods
Name | Description
GetInnerRule |  Gets the rule being inverted.
SetInnerRule |  Gets the rule being inverted.
Top
See Also
Reference
FilterInverseRule Class
Autodesk.Revit.DB Namespace