Revit 2027 API
DuctInsulation Methods
The DuctInsulation type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of duct insulation.
Top
See Also
Reference
DuctInsulation Class
Autodesk.Revit.DB.Mechanical Namespace