Revit 2027 API
PipeFittingAndAccessoryPressureDropUIDataItem Class
 The input and output data used by external UI servers for initializing and storing the UI settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeFittingAndAccessoryPressureDropUIDataItem : IDisposable
Public Class PipeFittingAndAccessoryPressureDropUIDataItem
	Implements IDisposable
public ref class PipeFittingAndAccessoryPressureDropUIDataItem : IDisposable
type PipeFittingAndAccessoryPressureDropUIDataItem =
    class
        interface IDisposable
    end
The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipeFittingAndAccessoryPressureDropUIDataItem
GetEntity |  Returns the entity set by UI server. or an invalid entity otherwise.
GetPipeFittingAndAccessoryData |  Gets the fitting data stored in the UI data item.
SetEntity |  Stores the entity in the UI data item.
Top
Remarks
 One family instance has one UI data item. The UI data item contains a corresponding PipeFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.
See Also
Reference
Autodesk.Revit.UI.Plumbing Namespace