Revit 2027 API
LinkNode Methods
The LinkNode type exposes the following members.
Methods
Name | Description
GetDocument |  Returns the document associated with the link.
Top
See Also
Reference
LinkNode Class
Autodesk.Revit.DB Namespace