Revit 2027 API
LayoutRule Class
The LayoutRule object is a base object for all type of layout rules for Beam System within the Autodesk Revit API.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleClearSpacing
 Autodesk.Revit.DB.LayoutRuleFixedDistance
 Autodesk.Revit.DB.LayoutRuleFixedNumber
 Autodesk.Revit.DB.LayoutRuleMaximumSpacing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class LayoutRule : APIObject
Public MustInherit Class LayoutRule
	Inherits APIObject
public ref class LayoutRule abstract : public APIObject
[<AbstractClassAttribute>]
type LayoutRule =
    class
        inherit APIObject
    end
The LayoutRule type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
This class just used as the base class of those concrete LayoutRule classes.
See Also
Reference
Autodesk.Revit.DB Namespace