Revit 2027 API
MassInstanceUtils Class
 A static class that contains methods for processing curves driven by points.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MassInstanceUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MassInstanceUtils : IDisposable
Public Class MassInstanceUtils
	Implements IDisposable
public ref class MassInstanceUtils : IDisposable
type MassInstanceUtils =
    class
        interface IDisposable
    end
The MassInstanceUtils type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddMassLevelDataToMassInstance |  Create a MassLevelData (Mass Floor) to associate a Level with a mass instance.
Dispose | Releases all resources used by the MassInstanceUtils
GetGrossFloorArea |  Get the total occupiable floor area represented by a mass instance.
GetGrossSurfaceArea |  Get the total exterior building surface area represented by a mass instance.
GetGrossVolume |  Get the total building volume represented by a mass instance.
GetJoinedElementIds |  Get the ElementIds of Elements that are joined to a mass instance.
GetMassLevelDataIds |  Get the ElementIds of the MassLevelDatas (Mass Floors) associated with a mass instance.
GetMassLevelIds |  Get the ElementIds of the Levels associated with a mass instance.
RemoveMassLevelDataFromMassInstance |  Delete the MassLevelData (Mass Floor) that associates a Level with a mass instance.
Top
See Also
Reference
Autodesk.Revit.DB Namespace