Revit 2027 API
Sketch Methods
The Sketch type exposes the following members.
Methods
Name | Description
GetAllElements |  Returns all elements which belong to the sketch.
Top
See Also
Reference
Sketch Class
Autodesk.Revit.DB Namespace