Revit 2027 API
MassLevelData Class
 MassLevelData is a conceptual representation of an occupiable floor (Mass Floor) in a conceptual building model. It is defined by associating a particular level with a particular mass element in a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.MassLevelData
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MassLevelData : Element
Public Class MassLevelData
	Inherits Element
public ref class MassLevelData : public Element
type MassLevelData =
    class
        inherit Element
    end
The MassLevelData type exposes the following members.
Properties
Name | Description
ConceptualConstructionId |  The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).
ConceptualConstructionIsByEnergyData |  Indicates if the ConceptualConstructionType of the MassLevelData (Mass Floor) is synchronized with the EnergyDataSettings or if it overrides those settings.
MaterialId |  The ElementId of the visualization material used for the MassLevelData (Mass Floor)
NExteriorSurfaceArea |  The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.
NLevelFafArea |  The surface area of the intersection of the MassLevelData's level with the mass geometry.
NLevelPerimeter |  The perimeter of the intersection of the MassLevelData's level with the mass geometry.
NVolume |  The volume of from the level of this MassLevelData (Mass Floor) to the next in the mass.
OwningMassId |  The ElementId of the mass that the MassLevelData (Mass Floor) is associated with.
StrUsage |  A String which describes the usage or occupancy type of the level of the MassLevelData.
Top
Methods
Name | Description
IsEmpty |  Indicates if the MassLevelData (Mass Floor) has a geometrical representation. May not if the level does not intersect the mass geometry.
IsMassFamilyInstance |  Checks if the ElementId is a mass family instance.
IsValidConceptualConstructionTypeElement |  Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor).
Top
Remarks
 MassLevelData reports metrics, such as floor areas, related to conceptual space planning. MassLevelData contains information, such as ConceptualConstructionType, used as part of the Conceptual Energy Analytical model. The MassLevel data geometry is determined by combining all the geometry of a mass into a single geometry, and then taking the area of intersection with the level of the MassLevelData.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace