Revit 2027 API
TableCellCombinedParameterData Methods
The TableCellCombinedParameterData type exposes the following members.
Methods
Name | Description
Create |  construct a TableCellCombinedParameterData
Dispose
Top
See Also
Reference
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace