Revit 2027 API
BRepBuilderSurfaceGeometry Class
 An abstract class used by BRepBuilder to represent the geometry of a surface. Specific surface-geometry representations are represented by subclasses.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BRepBuilderSurfaceGeometry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BRepBuilderSurfaceGeometry : IDisposable
Public Class BRepBuilderSurfaceGeometry
	Implements IDisposable
public ref class BRepBuilderSurfaceGeometry : IDisposable
type BRepBuilderSurfaceGeometry =
    class
        interface IDisposable
    end
The BRepBuilderSurfaceGeometry type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Create |  Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, Boolean, BoundingBoxUV) |  Construct a BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are not supplied. In this case, the NURBS surface will be a piecewise polynomial surface.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, IList<Double>, Boolean, BoundingBoxUV) |  Construct BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are supplied. In this case, the NURBS surface will be a piecewise rational polynomial surface.
Dispose | Releases all resources used by the BRepBuilderSurfaceGeometry
Top
See Also
Reference
Autodesk.Revit.DB Namespace