Revit 2027 API
ModuleSettings Methods
The ModuleSettings type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace