Revit 2027 API
MultiReferenceAnnotation Properties
The MultiReferenceAnnotation type exposes the following members.
Properties
Name | Description
DimensionId |  The child dimension owned by this multi-reference annotation.
TagId |  The child IndependentTag owned by this multi-reference annotation.
Top
See Also
Reference
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace