Revit 2027 API
GenericZoneDomainData Class
 A base class for specific domain requirements for a generic zone.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.GenericZoneDomainData
 Autodesk.Revit.DB.Mechanical.HVACZoneData
 Autodesk.Revit.DB.Mechanical.SystemZoneData
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GenericZoneDomainData : IDisposable
Public Class GenericZoneDomainData
	Implements IDisposable
public ref class GenericZoneDomainData : IDisposable
type GenericZoneDomainData =
    class
        interface IDisposable
    end
The GenericZoneDomainData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the GenericZoneDomainData
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace