Revit 2027 API
FamilyInstanceFilter Properties
The FamilyInstanceFilter type exposes the following members.
Properties
Name | Description
FamilySymbolId |  The family symbol id.
Top
See Also
Reference
FamilyInstanceFilter Class
Autodesk.Revit.DB Namespace