Revit 2027 API
XYZ Class
Object representing coordinates in 3-dimensional space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.XYZ
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class XYZ
Public Class XYZ
public ref class XYZ
type XYZ = class end
The XYZ type exposes the following members.
Constructors
Name | Description
XYZ() | Creates a default XYZ with the values (0, 0, 0).
XYZ(Double, Double, Double) | Creates an XYZ with the supplied coordinates.
Top
Properties
Name | Description
BasisX | The basis of the X axis.
BasisY | The basis of the Y axis.
BasisZ | The basis of the Z axis.
Item | Indexed access to coordinates.
X | Gets the first coordinate.
Y | Gets the second coordinate.
Z | Gets the third coordinate.
Zero | The coordinate origin or zero vector.
Top
Methods
Name | Description
Add | Adds the specified vector to this vector and returns the result.
AngleOnPlaneTo | Returns the angle between this vector and the specified vector projected to the specified plane.
AngleTo | Returns the angle between this vector and the specified vector.
CrossProduct | The cross product of this vector and the specified vector.
DistanceTo | Returns the distance from this point to the specified point.
Divide | Divides this vector by the specified value and returns the result.
DotProduct | The dot product of this vector and the specified vector.
GetLength | Gets the length of this vector.
IsAlmostEqualTo(XYZ) | Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09).
IsAlmostEqualTo(XYZ, Double) | Determines whether 2 vectors are the same within the given tolerance.
IsUnitLength | The boolean value that indicates whether this vector is of unit length.
IsWithinLengthLimits | Validates that the input point is within Revit design limits.
IsZeroLength | The boolean value that indicates whether this vector is a zero vector.
Multiply | Multiplies this vector by the specified value and returns the result.
Negate | Negates this vector.
Normalize | Returns a new XYZ whose coordinates are the normalized values from this vector.
Subtract | Subtracts the specified vector from this vector and returns the result.
ToString |  Gets formatted string showing (X, Y, Z) with values formatted to 9 decimal places.
(Overrides Object.ToString())
TripleProduct | The triple product of this vector and the two specified vectors.
Top
Operators
Name | Description
Addition(XYZ, XYZ) | Adds the two specified vectors and returns the result.
Division(XYZ, Double) | Divides the specified vector by the specified value.
Multiply(Double, XYZ) | Multiplies the specified number and the specified vector.
Multiply(XYZ, Double) | Multiplies the specified number and the specified vector.
Subtraction(XYZ, XYZ) | Subtracts the two specified vectors and returns the result.
UnaryNegation(XYZ) | Negates the specified vector and returns the result.
Top
Remarks
Usually this means a point or a vector in 3-dimensional space, depending on the actual use.
See Also
Reference
Autodesk.Revit.DB Namespace