Revit 2027 API
Stairs Properties
The Stairs type exposes the following members.
Properties
Name | Description
ActualRiserHeight |  The actual height of the stairs risers in the stairs.
ActualRisersNumber |  The total number of actually created risers in model.
ActualTreadDepth |  The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
ActualTreadsNumber |  The number of treads actually created in the stairs.
BaseElevation |  The base elevation of the stairs.
DesiredRisersNumber |  The number of risers is calculated based on the height between levels.
Height |  The height of the stair between the base and top levels.
MultistoryStairsId |  The id of the MultistoryStairs element to which this element belongs. If this stairs element is not a member of a MultistoryStairs element, this will be InvalidElementId.
NumberOfStories |  The number of stories of a multi-story stair, or 1 for a single-story stair.
TopElevation |  The top elevation of the stairs.
Top
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace