Revit 2027 API
PreDocEventArgs Class
 The class is used as base class for the arguments of any pre-event arguments that is associated to a particular Document.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PreEventArgs
 Autodesk.Revit.DB.Events.PreDocEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PreDocEventArgs : PreEventArgs
Public Class PreDocEventArgs
	Inherits PreEventArgs
public ref class PreDocEventArgs : public PreEventArgs
type PreDocEventArgs =
    class
        inherit PreEventArgs
    end
The PreDocEventArgs type exposes the following members.
Properties
Name | Description
Document |  The document associated with the event.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace