Revit 2027 API
FamilyTypeSet Class
A set that contains FamilyType objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyTypeSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyTypeSet : APIObject,
	IEnumerable
Public Class FamilyTypeSet
	Inherits APIObject
	Implements IEnumerable
public ref class FamilyTypeSet : public APIObject,
	IEnumerable
type FamilyTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The FamilyTypeSet type exposes the following members.
Constructors
Name | Description
FamilyTypeSet | Initializes a new instance of the FamilyTypeSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains
Erase
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace