Revit 2027 API
PointCloudOverrides Class
 Graphic overrides that are stored by a view to be applied to a PointCloudInstance element, or a scan within the element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudOverrides
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointCloudOverrides : IDisposable
Public Class PointCloudOverrides
	Implements IDisposable
public ref class PointCloudOverrides : IDisposable
type PointCloudOverrides =
    class
        interface IDisposable
    end
The PointCloudOverrides type exposes the following members.
Constructors
Name | Description
PointCloudOverrides |  Constructs empty overrides object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
ArePointCloudOverrideSettingsValid |  Checks if PointCloudOverrideSettings are valid
Assign |  Assigns values of the source overrides to this object.
Dispose | Releases all resources used by the PointCloudOverrides
GetPointCloudRegionOverrideSettings(ElementId) |  Gets region override settings assigned to the whole PointCloudInstance element.
GetPointCloudRegionOverrideSettings(ElementId, String, Document) |  Gets override settings assigned to a particular region within a PointCloudInstance element.
GetPointCloudScanOverrideSettings(ElementId) |  Gets scan override settings assigned to the whole PointCloudInstance element.
GetPointCloudScanOverrideSettings(ElementId, String, Document) |  Gets override settings assigned to a particular scan within a PointCloudInstance element.
IsEqual |  Check if the contents of two overrides are equal.
SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings) |  Assigns region override settings to the whole PointCloudInstance element.
SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) |  Assigns override settings to a particular region within a PointCloudInstance element.
SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings) |  Assigns scan override settings to the whole PointCloudInstance element.
SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) |  Assigns scan override settings to a particular scan within a PointCloudInstance element.
Top
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace