Revit 2027 API
PlanTopologySetIterator Class
An iterator to a set of plan topology objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PlanTopologySetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class PlanTopologySetIterator : APIObject,
	IEnumerator
Public MustInherit Class PlanTopologySetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class PlanTopologySetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type PlanTopologySetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The PlanTopologySetIterator type exposes the following members.
Constructors
Name | Description
PlanTopologySetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace