Revit 2027 API
CommandEventArgs Class
The base class of the command Executed and CanExecute event arguments.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.BeforeExecutedEventArgs
 Autodesk.Revit.UI.Events.CanExecuteEventArgs
 Autodesk.Revit.UI.Events.ExecutedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CommandEventArgs : RevitEventArgs
Public Class CommandEventArgs
	Inherits RevitEventArgs
public ref class CommandEventArgs : public RevitEventArgs
type CommandEventArgs =
    class
        inherit RevitEventArgs
    end
The CommandEventArgs type exposes the following members.
Properties
Name | Description
ActiveDocument |  The active document.
CommandId |  The command id.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace