Revit 2027 API
ExportFontInfo Class
 A value used to represent the info stored in an ExportFontTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportFontInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportFontInfo : IDisposable
Public Class ExportFontInfo
	Implements IDisposable
public ref class ExportFontInfo : IDisposable
type ExportFontInfo =
    class
        interface IDisposable
    end
The ExportFontInfo type exposes the following members.
Constructors
Name | Description
ExportFontInfo() |  Constructs a new default ExportFontInfo.
ExportFontInfo(ExportFontInfo) |  Constructs a new copy of the input ExportFontInfo object.
ExportFontInfo(String) |  Constructs a new ExportFontInfo using the destination font name as input.
Top
Properties
Name | Description
DestinationFontName |  The destination font name (the name of the font in the exported format).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportFontInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace