Revit 2027 API
ColorFillScheme Class
 Represents a color scheme could be used to colorfy elements in floor plan views and section views.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ColorFillScheme
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ColorFillScheme : Element
Public Class ColorFillScheme
	Inherits Element
public ref class ColorFillScheme : public Element
type ColorFillScheme =
    class
        inherit Element
    end
The ColorFillScheme type exposes the following members.
Properties
Name | Description
AreaSchemeId |  Represents the id of AreaScheme of area plan views that this scheme could be applied to.
CategoryId |  Represents the element category that can be colored by this scheme.
IsByRange |  Represents if the parameter values in entries are treated as value range or not.
IsLinkedFilesIncluded |  Represent if the scheme includes entries whose parameter values are based on elements from linked files.
ParameterDefinition |  Represents the parameter of the elements that this scheme could be used to color.
StorageType |  Represents the type of parameter values stored in entries.
Title |  Represents the title displayed in ColorFillLegend.
Top
Methods
Name | Description
AddEntry |  Adds new entry to the scheme.
AreEntriesConsistentWithScheme |  Checks whether the entries can be set to the scheme or not.
CanDefineByRange |  Checks whether the scheme entries can be explained by range.
CanRemoveEntry |  Checks whether entry can be removed from the scheme.
CanUpdateEntry |  Checks whether entry exists in the scheme and not the same as input one.
Duplicate |  Generates a copy of current scheme.
GetEntries |  Retrieves copies of all entries.
GetFormatOptions |  Returns the FormatOptions of the scheme.
GetSupportedParameterIds |  Retrieves collection of all parameters supported by the scheme.
IsEntryConsistentWithScheme |  Checks whether an entry can be added to the scheme or not.
IsValidParameterDefinitionId |  Checks whether the input parameter id can be applied to the scheme.
IsValidSchemeName |  Checks whether the name is valid for new generated scheme.
RemoveEntry |  Removes an entry whose parameter value is the same as the input from the scheme
SetEntries |  Update scheme entries in batch mode.
SetFormatOptions |  Sets the FormatOptions of the scheme.
SortEntries |  Sorts the scheme entries ascending.
UpdateEntry |  Updates the scheme entry with the same parameter value as the input entry.
Top
Remarks
A color scheme is based on element category and one of the category parameter, it contains a set of ColorFillSchemeEntry which stores parameter value, color, fill pattern and other entry data. The entry paramater values may be a range or a single value, based on the IsByRange property. Then elements with the specified category could be colored with the color and fill pattern of matching entry whose parameter value or value range matches the element parameter value.
You can retrieve the entries with GetEntries(), or modify entries with AddEntry(ColorFillSchemeEntry), RemoveEntry(ColorFillSchemeEntry), UpdateEntry(ColorFillSchemeEntry) and SetEntries().
Unlike most of the other elements, the color scheme works in an "asynchronous" way in UI:
If document elements change, the color scheme will not be updated immediately.
If color schemes changes, the document elements will not be updated immediately too.
API works slightly different with UI:
GetEntries() will return the entries corresponding to the latest document elements status immediately.
The entries modification operation will retrieve the latest entries with GetEntries() at first, and then modify those entries by request, but document elements will still not be updated immediately.
To modify multiple entries, it's better to use SetEntries() but not modify them one by one with other methods for better performance.
Notes:
To apply a color scheme whose CategoryId property is OST_Areas to an area plan view, the AreaSchemeId property must be the same as the view if it is not used as a template.
To generate a new color scheme, you have to use Duplicate(String) method to duplicate form an existing one.
There should not exist two entries values that are the same in a color scheme. if the StorageType property is Double, then the value accuracy should be based on FormatOptions property.
See Also
Reference
Autodesk.Revit.DB Namespace