Revit 2027 API
SpaceSet Properties
The SpaceSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of objects that are in the set.
Top
See Also
Reference
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace