Revit 2027 API
PushButton Class
The PushButton object represents an button on a RibbonPanel.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.PushButton
 Autodesk.Revit.UI.ToggleButton
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PushButton : RibbonButton
Public Class PushButton
	Inherits RibbonButton
public ref class PushButton : public RibbonButton
type PushButton =
    class
        inherit RibbonButton
    end
The PushButton type exposes the following members.
Properties
Name | Description
AssemblyName | The assembly path of the button.
AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button.
ClassName | The name of the class containing the implementation for the command.
Top
Methods
Name | Description
Top
Remarks
Use of this class is not supported in Revit Macros.
Example
private void AddPushButton(RibbonPanel panel)
{
    PushButton pushButton = panel.AddItem(new PushButtonData("HelloWorld",
        "HelloWorld", @"D:\Sample\HelloWorld\bin\Debug\HelloWorld.dll", "HelloWorld.CsHelloWorld")) as PushButton;
    // Set ToolTip and contextual help
    pushButton.ToolTip = "Say Hello World";
    ContextualHelp contextHelp = new ContextualHelp(ContextualHelpType.Url,
        "http://www.autodesk.com");
   pushButton.SetContextualHelp(contextHelp);
    // Set the large image shown on button
    pushButton.LargeImage =
        new BitmapImage(new Uri(@"D:\Sample\HelloWorld\bin\Debug\39-Globe_32x32.png"));
}
See Also
Reference
Autodesk.Revit.UI Namespace