Revit 2027 API
CoordinationModelElementProperty Class
 A class that defines a property of an element inside a Coordination Model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalData.CoordinationModelElementProperty
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CoordinationModelElementProperty : IDisposable
Public Class CoordinationModelElementProperty
	Implements IDisposable
public ref class CoordinationModelElementProperty : IDisposable
type CoordinationModelElementProperty =
    class
        interface IDisposable
    end
The CoordinationModelElementProperty type exposes the following members.
Properties
Name | Description
Group |  The name of the group of properties to which this property belongs to. E.g. Group = Identity Data.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the property.
Value |  The value of the property provided as a string.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CoordinationModelElementProperty
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace