Revit 2027 API
StructuralSectionSigmaProfileWithLips Class
 Defines parameters for structural Sigma Profile section with lips.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionSigmaProfileWithLips : StructuralSectionColdFormed
Public Class StructuralSectionSigmaProfileWithLips
	Inherits StructuralSectionColdFormed
public ref class StructuralSectionSigmaProfileWithLips : public StructuralSectionColdFormed
type StructuralSectionSigmaProfileWithLips =
    class
        inherit StructuralSectionColdFormed
    end
The StructuralSectionSigmaProfileWithLips type exposes the following members.
Constructors
Name | Description
StructuralSectionSigmaProfileWithLips |  Creates a new instance of Structural Section Sigma Profile With Lips shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BendWidth |  Bend segment width.
LipLength |  Lip segment length.
MiddleBendLength |  Middle Bend segment length.
TopBendLength |  Top Bend segment length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace