Revit 2027 API
STEPImportOptions Class
 The import options used to import STEP format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.STEPImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class STEPImportOptions : BaseImportOptions
Public Class STEPImportOptions
	Inherits BaseImportOptions
public ref class STEPImportOptions : public BaseImportOptions
type STEPImportOptions =
    class
        inherit BaseImportOptions
    end
The STEPImportOptions type exposes the following members.
Constructors
Name | Description
STEPImportOptions() |  Constructs a new instance of STEPImportOptions with default values of all properties.
STEPImportOptions(STEPImportOptions) |  Constructs a new instance of STEPImportOptions as a copy of the import options.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace