Revit 2027 API
CategorySet Properties
The CategorySet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of categories that are in the set.
Top
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace