Revit 2027 API
ExternallyTaggedNonBRep Class
 This class is used to create an externally tagged geometry object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternallyTaggedGeometryObject
 Autodesk.Revit.DB.ExternallyTaggedNonBRep
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternallyTaggedNonBRep : ExternallyTaggedGeometryObject
Public Class ExternallyTaggedNonBRep
	Inherits ExternallyTaggedGeometryObject
public ref class ExternallyTaggedNonBRep : public ExternallyTaggedGeometryObject
type ExternallyTaggedNonBRep =
    class
        inherit ExternallyTaggedGeometryObject
    end
The ExternallyTaggedNonBRep type exposes the following members.
Constructors
Name | Description
ExternallyTaggedNonBRep |  Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject.
Top
Properties
Name | Description
Top
Methods
Name | Description
SetUsage |  Controls the usage of this ExternallyTaggedNonBRep.
Top
See Also
Reference
Autodesk.Revit.DB Namespace