Revit 2027 API
ModelCurveArray Methods
The ModelCurveArray type exposes the following members.
Methods
Name | Description
Append | Add the model curve to the end of the array.
Clear | Removes every model curve from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified model curve into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
ModelCurveArray Class
Autodesk.Revit.DB Namespace