Revit 2027 API
DefaultDivideSettings Class
 Provides access to project-wide divide settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DefaultDivideSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DefaultDivideSettings : Element
Public Class DefaultDivideSettings
	Inherits Element
public ref class DefaultDivideSettings : public Element
type DefaultDivideSettings =
    class
        inherit Element
    end
The DefaultDivideSettings type exposes the following members.
Properties
Name | Description
PathDistance |  A default Divided Path distance for a fixed, minimum, or maximum distance layout.
PathLayout |  A default Divided Path layout.
PathMeasurementType |  A default Divided Path measurement type for distance layouts.
PathNumber |  A default Divided Path number for a fixed number layout.
Top
Methods
Name | Description
GetDefaultDivideSettings |  Obtains the DefaultDivideSettings object for the specified document.
GetSurfaceDistance |  Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
GetSurfaceLayout |  Gets the default Divided Surface layout for U or V gridlines.
GetSurfaceNumber |  Gets the default Divided Surface number for a fixed number layout for U or V gridlines.
SetSurfaceDistance |  Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
SetSurfaceLayout |  Sets the default Divided Surface layout for U or V gridlines.
SetSurfaceNumber |  Sets the default Divided Surface number for a fixed number layout for U or V gridlines.
Top
See Also
Reference
Autodesk.Revit.DB Namespace