Revit 2027 API
CompoundStructureLayer Methods
The CompoundStructureLayer type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace