Revit 2027 API
SplitButton Properties
The SplitButton type exposes the following members.
Properties
Name | Description
CurrentButton | Gets or sets the current PushButton of the SplitButton.
IsSynchronizedWithCurrentItem |  Indicates whether the top PushButton on the SplitButton changes based on the CurrentButton property.
Top
See Also
Reference
SplitButton Class
Autodesk.Revit.UI Namespace