Revit 2027 API
AnalyticalPanel Methods
The AnalyticalPanel type exposes the following members.
Methods
Name | Description
Create(Document, CurveLoop) |  Creates a new instance of an Analytical Panel within the project.
Create(Document, Curve, XYZ) |  Creates a new instance of an Analytical Panel within the project.
GetAnalyticalOpeningsIds |  Returns the Analytical Openings ids of the Analytical Panel.
Top
See Also
Reference
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace