Revit 2027 API
VertexPositionNormal Methods
The VertexPositionNormal type exposes the following members.
Methods
Name | Description
GetSizeInFloats |  Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Top
See Also
Reference
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace