Revit 2027 API
InternalException Class
The exception that is thrown when an issue in the Revit code resulted in an unexpected error.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InternalException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InternalException : ApplicationException
<SerializableAttribute>
Public Class InternalException
	Inherits ApplicationException
[SerializableAttribute]
public ref class InternalException : public ApplicationException
[<SerializableAttribute>]
type InternalException =
    class
        inherit ApplicationException
    end
The InternalException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
Remarks
Please contact Autodesk Developer Support with the information about what led to this exception.
See Also
Reference
Autodesk.Revit.Exceptions Namespace