Revit 2027 API
FabricationItemFolder Class
 A fabrication item folder that can contain sub folders and access to the FabricationItemFiles contained within.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationItemFolder
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationItemFolder : IDisposable
Public Class FabricationItemFolder
	Implements IDisposable
public ref class FabricationItemFolder : IDisposable
type FabricationItemFolder =
    class
        interface IDisposable
    end
The FabricationItemFolder type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The item folder's name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationItemFolder
GetItemFiles |  Gets the item files in this item folder.
GetSubFolders |  Gets the item folder's sub folders.
Top
See Also
Reference
Autodesk.Revit.DB Namespace