Revit 2027 API
ElectricalLoadClassification Properties
The ElectricalLoadClassification type exposes the following members.
Properties
Name | Description
Abbreviation |  The abbreviation of the load classification name
ActualElectricalLoadLabel |  The name template for the actual load parameter on the load classification.
DemandFactorId |  The demand factor definition this load classification element uses.
LoadSummaryDemandFactorLabel |  The name template for the demand factor parameter of the load classification.
Motor |  Indicates if this load classification is to be used for motors.
Other |  Indicates if it is the default load classification, and its name is Other.
PanelConnectedCurrentLabel |  The name template for the connected current parameter on the load classification.
PanelConnectedLabel |  The name template for the connected load parameter of the load classification.
PanelEstimatedCurrentLabel |  The name template for the estimated current parameter on the load classification.
PanelEstimatedLabel |  The name template for the estimated demand parameter on the load classification.
SpaceLoadClass |  The electrical load class associated with a space.
Spare |  Indicates if this load classification is to be used for spare.
Top
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace