Revit 2027 API
AnalysisDisplayDiagramSettings Methods
The AnalysisDisplayDiagramSettings type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Compares two diagram settings objects.
Top
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace