Revit 2027 API
KeyBasedTreeEntry Methods
The KeyBasedTreeEntry type exposes the following members.
Methods
Name | Description
Dispose
GetChildrenKeys |  Gets a collection containing the keys of all children entry objects from this entry.
Top
See Also
Reference
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace