Revit 2027 API
KeyBasedTreeEntryTable Class
 KeyBasedTreeEntryTable represents the collection of key-based tree entries for a document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.KeyBasedTreeEntryTable
 Autodesk.Revit.DB.AssemblyCodeTable
 Autodesk.Revit.DB.KeynoteTable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntryTable : Element
Public Class KeyBasedTreeEntryTable
	Inherits Element
public ref class KeyBasedTreeEntryTable : public Element
type KeyBasedTreeEntryTable =
    class
        inherit Element
    end
The KeyBasedTreeEntryTable type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetKeyBasedTreeEntries |  Gets the KeyBasedTreeEntries for this table.
LoadFrom |  Loads KeyBasedTreeEntries from the specified external resource into this KeyBasedTreeEntryTable.
Reload |  Reloads KeyBasedTreeEntries from their currently-stored location into this KeyBasedTreeEntryTable.
ServerSupports |  Checks if the server referenced by the given ExternalResourceReference supports the ExternalResourceReferenceType of this KeyBasedTreeEntryTable.
Top
See Also
Reference
Autodesk.Revit.DB Namespace