Revit 2027 API
ComponentRepeater Properties
The ComponentRepeater type exposes the following members.
Properties
Name | Description
DefaultFamilyType |  The default family type for the component repeater.
DimensionCount |  The dimension count of the component repeater.
Top
See Also
Reference
ComponentRepeater Class
Autodesk.Revit.DB Namespace