Revit 2027 API
KeyBasedTreeEntriesLoadContent Class
 This class is used by IExternalResourceServers to return KeyBasedTreeEntries data to Revit when their LoadResource method is invoked.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceLoadContent
 Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntriesLoadContent : ExternalResourceLoadContent
Public Class KeyBasedTreeEntriesLoadContent
	Inherits ExternalResourceLoadContent
public ref class KeyBasedTreeEntriesLoadContent : public ExternalResourceLoadContent
type KeyBasedTreeEntriesLoadContent =
    class
        inherit ExternalResourceLoadContent
    end
The KeyBasedTreeEntriesLoadContent type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddEntry |  Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.
BuildEntries |  Builds a KeyBasedTreeEntries object.
CanAddEntry |  Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent.
GetEntries |  Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
GetLoadResults |  Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
IsEntriesBuilt |  Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built.
Reset |  Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.
Top
Remarks
The class contains a KeyBasedTreeEntries object which should hold the KeyBasedTreeEntries data generated by the IExternalResourceServer.
An ExternalResourceServer can create the KeyBasedTreeEntries from an arbitrary data source by using AddEntry to add individual KeyBasedTreeEntries. Once all the desired entries have been added, BuildEntries can be called to construct the KeyBasedTreeEntries object from the individual entries that were added.
KeyBasedTreeEntriesLoadContent must have a built KeyBasedTreeEntries before its LoadStatus property can be set to ExternalResourceLoadStatus.Success.
See Also
Reference
Autodesk.Revit.DB Namespace