Revit 2027 API
DocumentWorksharingEnabledEventArgs Methods
The DocumentWorksharingEnabledEventArgs type exposes the following members.
Methods
Name | Description
GetDocument |  Returns document associated with this event
Top
See Also
Reference
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace