Revit 2027 API
SymbolicCurve Class
A curve that provides information but is not intended to represent actual geometry in an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.SymbolicCurve
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SymbolicCurve : CurveElement
Public Class SymbolicCurve
	Inherits CurveElement
public ref class SymbolicCurve : public CurveElement
type SymbolicCurve =
    class
        inherit CurveElement
    end
The SymbolicCurve type exposes the following members.
Properties
Name | Description
IsDrawnInForeground | Indicates if this curve will be drawn in the foreground of the family instance.
ReferenceType | Indicates the type of reference.
Subcategory | The subcategory.
Top
Methods
Name | Description
GetVisibility | Gets the visibility for the symbolic curve.
SetVisibility | Sets the visibility for the symbolic curve.
Top
Remarks
For example, when creating a door family, you might sketch symbolic lines in an elevation view to represent a door swing. Symbolic curves are visible parallel to the view in which you sketch them.
See Also
Reference
Autodesk.Revit.DB Namespace