Revit 2027 API
MultiReferenceAnnotationOptions Methods
The MultiReferenceAnnotationOptions type exposes the following members.
Methods
Name | Description
Dispose
ElementsMatchReferenceCategory |  Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType.
GetAdditionalReferencesToDimension |  Gets the additional references which the dimension will witness.
GetElementsToDimension |  Gets the elements which the dimension will witness.
IsAllowedDimensionStyleType |  Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
ReferencesDontMatchReferenceCategory |  Verifies that all of the references belongs to elements which doesn't match the reference category required by the MultiReferenceAnnotationType.
SetAdditionalReferencesToDimension |  Sets the additional references which the dimension will witness.
SetElementsToDimension |  Sets the elements which the dimension will witness.
Top
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace