Revit 2027 API
VoltageTypeSetIterator Methods
The VoltageTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
VoltageTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace