Revit 2027 API
SolidCurveIntersectionOptions Methods
The SolidCurveIntersectionOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace