Revit 2027 API
ExtrusionRoof Class
Represents some kinds of Extrusion Roofs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.RoofBase
 Autodesk.Revit.DB.ExtrusionRoof
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtrusionRoof : RoofBase
Public Class ExtrusionRoof
	Inherits RoofBase
public ref class ExtrusionRoof : public RoofBase
type ExtrusionRoof =
    class
        inherit RoofBase
    end
The ExtrusionRoof type exposes the following members.
Properties
Name | Description
CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof.
Top
Methods
Name | Description
GetProfile | Retrieve the Profile of ExtrusionRoof.
Top
Remarks
The ExtrusionRoof object represents some kinds of extruded roofs in Revit.
See Also
Reference
Autodesk.Revit.DB Namespace