Revit 2027 API
LightDistribution Methods
The LightDistribution type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the LightDistribution derived object.
Dispose
Top
See Also
Reference
LightDistribution Class
Autodesk.Revit.DB.Lighting Namespace