Revit 2027 API
FabricationHostedInfo Class
 The fabrication hosted element information.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationHostedInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationHostedInfo : IDisposable
Public Class FabricationHostedInfo
	Implements IDisposable
public ref class FabricationHostedInfo : IDisposable
type FabricationHostedInfo =
    class
        interface IDisposable
    end
The FabricationHostedInfo type exposes the following members.
Properties
Name | Description
HostId |  Returns the identifier of the host.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
DisconnectFromHost |  Disconnects the part from the host.
Dispose | Releases all resources used by the FabricationHostedInfo
GetBearerCenterline |  Gets the centerline of the bearer. The method is applicable only for bearer hanger.
PlaceOnHost(ElementId, Connector, Double) |  Places the part on the specified host.
PlaceOnHost(ElementId, Connector, Double, Double) |  Places the part on the specified host.
Top
Remarks
 A fabrication part may have a host, the FabricationHostedInfo stores the host information for the fabrication part.
See Also
Reference
Autodesk.Revit.DB Namespace