Revit 2027 API
RebarHandleNameData Methods
The RebarHandleNameData type exposes the following members.
Methods
Name | Description
Dispose
GetCustomHandleTag |  Gets the handle tag for which we need to specify the name.
SetCustomHandleName |  Sets the name of the handle.
Top
See Also
Reference
RebarHandleNameData Class
Autodesk.Revit.DB.Structure Namespace