Revit 2027 API
FilterNumericGreaterOrEqual Class
 Tests whether numeric values from the document are greater than or equal to a certain value
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterNumericRuleEvaluator
 Autodesk.Revit.DB.FilterNumericGreaterOrEqual
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterNumericGreaterOrEqual : FilterNumericRuleEvaluator
Public Class FilterNumericGreaterOrEqual
	Inherits FilterNumericRuleEvaluator
public ref class FilterNumericGreaterOrEqual : public FilterNumericRuleEvaluator
type FilterNumericGreaterOrEqual =
    class
        inherit FilterNumericRuleEvaluator
    end
The FilterNumericGreaterOrEqual type exposes the following members.
Constructors
Name | Description
FilterNumericGreaterOrEqual |  Constructs an instance of FilterNumericGreaterOrEqual.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace