Revit 2027 API
DirectShapeReferenceOptions Class
 This class is used to control the behavior of DirectShape and DirectShapeType reference objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectShapeReferenceOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DirectShapeReferenceOptions : IDisposable
Public Class DirectShapeReferenceOptions
	Implements IDisposable
public ref class DirectShapeReferenceOptions : IDisposable
type DirectShapeReferenceOptions =
    class
        interface IDisposable
    end
The DirectShapeReferenceOptions type exposes the following members.
Constructors
Name | Description
DirectShapeReferenceOptions() |  Constructs a new DirectShapeRefOptions instance with default settings.
DirectShapeReferenceOptions(DirectShapeReferenceOptions) |  Constructs a new copy of the input DirectShapeRefOptions object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DirectShapeReferenceOptions
GetExternalGeometryId |  Retrieves the ExternalGeometryId associated with the reference object.
IsValidExternalGeometryId |  Validates that the input ExternalGeometryId can be assigned to a direct shape reference.
IsValidReferenceName |  Validates that the input name can be assigned to a direct shape reference.
SetExternalGeometryId |  Sets the ExternalGeometryId associated with the reference object. The ID must be non-empty.
Top
See Also
Reference
Autodesk.Revit.DB Namespace