Revit 2027 API
CloudPoint Structure
Represents a point obtained from a Point cloud.
Inheritance Hierarchy
System.Object
 System.ValueType
 Autodesk.Revit.DB.PointClouds.CloudPoint
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public struct CloudPoint
Public Structure CloudPoint
public value class CloudPoint
[<SealedAttribute>]
type CloudPoint =
    struct
        inherit ValueType
    end
The CloudPoint type exposes the following members.
Constructors
Name | Description
CloudPoint |  Creates a new cloud point.
Top
Methods
Name | Description
Top
Operators
Name | Description
Implicit(CloudPoint to XYZ) |  Creates an XYZ object from this point cloud.
Top
Fields
Name | Description
Color | The color
X | The X coordinate
Y | The Y coordinate
Z | The Z coordinate
Top
See Also
Reference
Autodesk.Revit.DB.PointClouds Namespace