Revit 2027 API
ModelCurveArray Class
An array that contains model curves.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ModelCurveArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelCurveArray : APIObject,
	IEnumerable
Public Class ModelCurveArray
	Inherits APIObject
	Implements IEnumerable
public ref class ModelCurveArray : public APIObject,
	IEnumerable
type ModelCurveArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The ModelCurveArray type exposes the following members.
Constructors
Name | Description
ModelCurveArray | Initializes a new instance of the ModelCurveArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a model curve at a specified index within the array.
Size | Returns the number of model curves that are in the array.
Top
Methods
Name | Description
Append | Add the model curve to the end of the array.
Clear | Removes every model curve from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified model curve into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace