Revit 2027 API
RadialArray Properties
The RadialArray type exposes the following members.
Properties
Name | Description
NumMembers | Retrieves or changes the number of arrayed members. Array placeholder members in the family environment are not counted.
(Overrides BaseArray.NumMembers)
Top
See Also
Reference
RadialArray Class
Autodesk.Revit.DB Namespace