Revit 2027 API
SpatialElementCalculationLocation Properties
The SpatialElementCalculationLocation type exposes the following members.
Properties
Name | Description
MarkerPosition |  The position of the spatial element calculation location marker.
Top
See Also
Reference
SpatialElementCalculationLocation Class
Autodesk.Revit.DB Namespace