Revit 2027 API
Revolution Class
A revolution solid or void form.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Revolution
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Revolution : GenericForm
Public Class Revolution
	Inherits GenericForm
public ref class Revolution : public GenericForm
type Revolution =
    class
        inherit GenericForm
    end
The Revolution type exposes the following members.
Properties
Name | Description
Axis | Returns the Axis of the Revolution.
EndAngle | The end angle of the revolution relative to the sketch plane.
Sketch | Returns the Sketch of the Revolution.
StartAngle | The start angle of the revolution relative to the sketch plane.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace