Revit 2027 API
LoadCase Methods
The LoadCase type exposes the following members.
Methods
Name | Description
Create(Document, String, ElementId, ElementId) |  Creates a new LoadCase.
Create(Document, String, ElementId, LoadCaseCategory) |  Creates a new LoadCase.
IsLoadCaseSubcategoryId |  Checks whether provided element ID refer to subcategory of Structural Load Cases (OST_LoadCases) category - one of built-in or user defined.
IsLoadNatureId |  Checks whether provided element ID refer to LoadNature element.
IsNumberUnique |  Checks that a given number is unique among all load cases.
Top
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace