Revit 2027 API
PointLoadType Class
 PointLoadType class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.LoadTypeBase
 Autodesk.Revit.DB.Structure.PointLoadType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointLoadType : LoadTypeBase
Public Class PointLoadType
	Inherits LoadTypeBase
public ref class PointLoadType : public LoadTypeBase
type PointLoadType =
    class
        inherit LoadTypeBase
    end
The PointLoadType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace