Revit 2027 API
ElementPhaseStatusFilter Properties
The ElementPhaseStatusFilter type exposes the following members.
Properties
Name | Description
PhaseId |  The phase id.
Top
See Also
Reference
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace