Revit 2027 API
StructuralSectionZProfile Class
 Defines parameters for Z Profile structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionZProfile : StructuralSectionGeneralLZ
Public Class StructuralSectionZProfile
	Inherits StructuralSectionGeneralLZ
public ref class StructuralSectionZProfile : public StructuralSectionGeneralLZ
type StructuralSectionZProfile =
    class
        inherit StructuralSectionGeneralLZ
    end
The StructuralSectionZProfile type exposes the following members.
Constructors
Name | Description
StructuralSectionZProfile |  Creates a new instance of Structural Section Z Profile shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace