Revit 2027 API
FilteredWorksetIterator Class
 An iterator to a set of worksets filtered by the settings of a FilteredWorksetCollector.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredWorksetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilteredWorksetIterator : IEnumerator<Workset>
Public Class FilteredWorksetIterator
	Implements IEnumerator(Of Workset)
public ref class FilteredWorksetIterator : IEnumerator<Workset^>
type FilteredWorksetIterator =
    class
        interface IEnumerator<Workset>
    end
The FilteredWorksetIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilteredWorksetIterator
GetCurrent |  The current workset found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next workset passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
Autodesk.Revit.DB Namespace