Revit 2027 API
StructuralSectionGeneralR Properties
The StructuralSectionGeneralR type exposes the following members.
Properties
Name | Description
WallDesignThickness |  Represents wall design thickness of rectangle.
WallNominalThickness |  Represents wall nominal thickness of rectangle.
Top
See Also
Reference
StructuralSectionGeneralR Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace