Revit 2027 API
ConduitSettings Class
 The conduit settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ConduitSettings
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConduitSettings : Element
Public Class ConduitSettings
	Inherits Element
public ref class ConduitSettings : public Element
type ConduitSettings =
    class
        inherit Element
    end
The ConduitSettings type exposes the following members.
Properties
Name | Description
ConnectorSeparator |  The conduit connector separator string.
FittingAnnotationSize |  The value of fitting annotation size.
RiseDropAnnotationSize |  The rise drop annotation size.
SizePrefix |  The conduit size prefix string.
SizeSuffix |  The conduit size suffix string.
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
Top
Methods
Name | Description
GetConduitSettings |  Gets the conduit settings of the project.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace