Revit 2027 API
PointCollection Methods
The PointCollection type exposes the following members.
Methods
Name | Description
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetPointBufferPointer |  Returns an unsafe pointer to the buffer in which this collection stores the points.
GetPointIterator |  Creates and returns an iterator for the points contained in this collection.
Top
See Also
Reference
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace