Revit 2027 API
DockableFrameVisibilityChangedEventArgs Properties
The DockableFrameVisibilityChangedEventArgs type exposes the following members.
Properties
Name | Description
DockableFrameShown |  True if the pane is being shown, false if it is being hidden.
PaneId |  The identifier for dockable pane.
Top
See Also
Reference
DockableFrameVisibilityChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace