Revit 2027 API
STLExportOptions Class
 The export options used by exporting STL format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BIMExportOptions
 Autodesk.Revit.DB.STLExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class STLExportOptions : BIMExportOptions
Public Class STLExportOptions
	Inherits BIMExportOptions
public ref class STLExportOptions : public BIMExportOptions
type STLExportOptions =
    class
        inherit BIMExportOptions
    end
The STLExportOptions type exposes the following members.
Constructors
Name | Description
STLExportOptions() |  Constructs a new instance of STLExportOptions with default values of all properties.
STLExportOptions(ExportResolution) |  Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
Top
Properties
Name | Description
ExportBinary |  True to export in binary STL format, false to export in ASCII STL format. Default value is true.
ExportColor |  True to export color information, false otherwise. Default value is false.
GridAspectRatio |  The maximum aspect ratio allowed in the grid placed across the face. The minimum allowed value is 1.0. The maximum allowed value is 10.0. By default this property is ignored.
MaxEdgeLength |  The maximum length allowed for any chord on an edge or between any two adjacent grid lines. This is a percentage value. By exporting, the real value of maximum edge length is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.1%. The maximum allowed value is 10.0%. By default this property is ignored.
NormalTolerance |  The maximum change in the surface normal between adjacent nodes in the mesh. This property is defined in degrees. The minimum allowed value is 1.0 degrees. The maximum allowed value is 45.0 degrees. Default value is 15.0 degrees.
SurfaceTolerance |  The maximum distance between mesh triangles and model geometry. This is a percentage value. By exporting, the real value of surface tolerance is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.001%. The maximum allowed value is 1.0%. Default value is 0.1%.
TargetUnit |  The unit type of geometry in the resultant STL file. Default value is ExportUnit::Default.
Top
Methods
Name | Description
IsGridAspectRatioSet |  Checks whether the GridAspectRatio tessellation parameter is explicitly set.
IsMaxEdgeLengthSet |  Checks whether the MaxEdgeLength tessellation parameter is explicitly set.
IsNormalToleranceSet |  Checks whether the NormalTolerance tessellation parameter is explicitly set.
IsSurfaceToleranceSet |  Checks whether the SurfaceTolerance tessellation parameter is explicitly set.
IsValidForGridAspectRatio |  Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter.
IsValidForMaxEdgeLength |  Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter.
IsValidForNormalTolerance |  Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter.
IsValidForSurfaceTolerance |  Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter.
SetTessellationSettings |  Sets all the tessellation parameters to its predefined values for the given resolution type.
Top
See Also
Reference
Autodesk.Revit.DB Namespace