Revit 2027 API
CombinableElement Class
An element that can be added to a geometry combination.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.GeomCombination
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CombinableElement : Element
Public Class CombinableElement
	Inherits Element
public ref class CombinableElement : public Element
type CombinableElement =
    class
        inherit Element
    end
The CombinableElement type exposes the following members.
Properties
Name | Description
Combinations | The geometry combinations that this element belongs to.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace