Revit 2027 API
ViewSheetSetting Methods
The ViewSheetSetting type exposes the following members.
Methods
Name | Description
Delete | Delete the current view sheet set, and make the In-Session set as the current one.
Rename | Rename the current view sheet set.
Revert | Revert the current view sheet set.
Save | Save the changes for the current view sheet set.
SaveAs | Save the current view sheet set to another view sheet set with the specified name.
Top
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace