Revit 2027 API
ElectricalLoadClassification Class
 The ElectricalLoadClassification class represents a serialized version of an instance of load classification.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalLoadClassification
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalLoadClassification : Element
Public Class ElectricalLoadClassification
	Inherits Element
public ref class ElectricalLoadClassification : public Element
type ElectricalLoadClassification =
    class
        inherit Element
    end
The ElectricalLoadClassification type exposes the following members.
Properties
Name | Description
Abbreviation |  The abbreviation of the load classification name
ActualElectricalLoadLabel |  The name template for the actual load parameter on the load classification.
DemandFactorId |  The demand factor definition this load classification element uses.
LoadSummaryDemandFactorLabel |  The name template for the demand factor parameter of the load classification.
Motor |  Indicates if this load classification is to be used for motors.
Other |  Indicates if it is the default load classification, and its name is Other.
PanelConnectedCurrentLabel |  The name template for the connected current parameter on the load classification.
PanelConnectedLabel |  The name template for the connected load parameter of the load classification.
PanelEstimatedCurrentLabel |  The name template for the estimated current parameter on the load classification.
PanelEstimatedLabel |  The name template for the estimated demand parameter on the load classification.
SpaceLoadClass |  The electrical load class associated with a space.
Spare |  Indicates if this load classification is to be used for spare.
Top
Methods
Name | Description
Create |  Creates a new instance of load classification and adds it to the document.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace