Revit 2027 API
FilterElementIdRule Methods
The FilterElementIdRule type exposes the following members.
Methods
Name | Description
UsesLevelFiltering |  This function checks if a parameter uses level filtering.
Top
See Also
Reference
FilterElementIdRule Class
Autodesk.Revit.DB Namespace