Revit 2027 API
MacroManagerIterator Methods
The MacroManagerIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  Returns the current Macro module.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace