Revit 2027 API
FamilyPointLocation Class
 Data corresponding to the point locations in certain types of Family Symbols.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyPointLocation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyPointLocation : APIObject
Public Class FamilyPointLocation
	Inherits APIObject
public ref class FamilyPointLocation : public APIObject
type FamilyPointLocation =
    class
        inherit APIObject
    end
The FamilyPointLocation type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the corresponding reference point in the Family document.
Top
Methods
Name | Description
GetLocation |  Gets the location of the point.
Top
Remarks
 Examples of FamilySymbol objects that contain placement references are Panels and Flexible Components.
See Also
Reference
Autodesk.Revit.DB Namespace