Revit 2027 API
ViewDisplaySketchyLines Class
 Represents the settings for sketchy lines.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewDisplaySketchyLines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewDisplaySketchyLines : IDisposable
Public Class ViewDisplaySketchyLines
	Implements IDisposable
public ref class ViewDisplaySketchyLines : IDisposable
type ViewDisplaySketchyLines =
    class
        interface IDisposable
    end
The ViewDisplaySketchyLines type exposes the following members.
Properties
Name | Description
EnableSketchyLines |  True to enable sketchy lines visibility. False to disable it.
Extension |  The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Jitter |  The jitter defines jitteriness of the line. Values between 0 and 10.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ViewDisplaySketchyLines
Top
See Also
Reference
Autodesk.Revit.DB Namespace