Revit 2027 API
StructuralSection Methods
The StructuralSection type exposes the following members.
Methods
Name | Description
Dispose
GetBoundarySize |  Returns size of the section boundary.
GetEnumerator
Top
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace