Revit 2027 API
AnalysisDisplayLegend Class
 The legend that describes an Analysis Visualization.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayLegend : Element
Public Class AnalysisDisplayLegend
	Inherits Element
public ref class AnalysisDisplayLegend : public Element
type AnalysisDisplayLegend =
    class
        inherit Element
    end
The AnalysisDisplayLegend type exposes the following members.
Properties
Name | Description
Height |  The height, in sheet size, of the legend's rectangle
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace