Revit 2027 API
BRepBuilderPersistentIds Class
 This class stores a map from ExternalGeometryIds to BRepBuilderGeometryIds.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BRepBuilderPersistentIds
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BRepBuilderPersistentIds : IDisposable
Public Class BRepBuilderPersistentIds
	Implements IDisposable
public ref class BRepBuilderPersistentIds : IDisposable
type BRepBuilderPersistentIds =
    class
        interface IDisposable
    end
The BRepBuilderPersistentIds type exposes the following members.
Constructors
Name | Description
BRepBuilderPersistentIds |  Constructs a new BRepBuilderPersistentIds and associates the existing BRepBuilder to it.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddSubTag |  Adds a correspondence between an ExternalGeometryId and a BRepBuilderGeometryId. Note that an existing correspondence in the map cannot be updated and that a particular BRepBuilderGeometryId may be related to at most one ExternalGeometryId.
Dispose | Releases all resources used by the BRepBuilderPersistentIds
IsAssociatedBRepBuilderValid |  Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds.
IsBRepBuilderGeometryIdFaceOrEdge |  Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, the input BRepBuilderGeometryId must represent the ID of either a Face or an Edge.
IsValidBRepBuilderGeometryIdForNewCorrespondence |  Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input BRepBuilderGeometryId must not already exist.
IsValidExternalGeometryIdForNewCorrespondence |  Validates the input ExternalGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input ExternalGeometryId must not already exist.
Top
See Also
Reference
Autodesk.Revit.DB Namespace