Revit 2027 API
MechanicalEquipmentSet Methods
The MechanicalEquipmentSet type exposes the following members.
Methods
Name | Description
Add |  Adds member element ids to the mechanical equipment set.
AreElementsNotConnectedInSeries |  Checks if the elements are not serially connected.
AreValidMembers |  Checks if these are valid members for mechanical equipment set.
Create |  Creates a new instance of a mechanical equipment set and adds it to the document.
GetMembers |  Gets member element ids for the mechanical equipment set.
Remove |  Removes member element ids from the mechanical equipment set.
Top
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace