Revit 2027 API
Gutter Class
An object that represents a gutter within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.HostedSweep
 Autodesk.Revit.DB.Architecture.Gutter
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Gutter : HostedSweep
Public Class Gutter
	Inherits HostedSweep
public ref class Gutter : public HostedSweep
type Gutter =
    class
        inherit HostedSweep
    end
The Gutter type exposes the following members.
Properties
Name | Description
GutterType | Retrieves/set an object that represents the type of the Gutter.
Top
Methods
Name | Description
AddSegment | Add segments to the gutter.
(Overrides HostedSweep.AddSegment(Reference))
Top
Remarks
This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace