Revit 2027 API
ElevationMarker Class
 ElevationMarkers either host elevation ViewSection views or view references.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElevationMarker
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElevationMarker : Element
Public Class ElevationMarker
	Inherits Element
public ref class ElevationMarker : public Element
type ElevationMarker =
    class
        inherit Element
    end
The ElevationMarker type exposes the following members.
Properties
Name | Description
CurrentViewCount |  The current number of views hosted by this ElevationMarker.
IsReference |  Indicates if this is a reference ElevationMarker. Only reference elevations can be hosted by reference ElevationMarkers.
MaximumViewCount |  The maximum number of views that can be hosted by this ElevationMarker.
Top
Methods
Name | Description
CreateElevation |  Creates a new elevation ViewSection on the ElevationMarker at the desired index.
CreateElevationMarker |  Creates a new ElevationMarker.
CreateReferenceElevation |  Creates a reference elevation on the ElevationMarker at the desired index.
CreateReferenceElevationMarker |  Creates a new ElevationMarker.
GetViewId |  Returns the ViewSection id for the index of the ElevationMarker.
HasElevations |  Returns true if the ElevationMarker has at least one elevation view, false otherwise.
IsAvailableIndex |  Returns true if a new elevation ViewSection can be placed at %index%, returns false otherwise.
Top
Remarks
 ElevationMarkers store the ViewFamilyType which will be used by all elevations hosted on the ElevationMarker. The orientation of an ElevationMarker is determined by the orientation of the views it hosts. You can check the orientation of any view by getting View.ViewDirection. To reorient the ElevationMarker and all of the views it hosts, call ElementTransformUtils.RotateElement with the ElevationMarker as an argument.
See Also
Reference
Autodesk.Revit.DB Namespace