Revit 2027 API
ViewSheet Methods
The ViewSheet type exposes the following members.
Methods
Name | Description
CanBeDuplicated |  Identifies if this sheet can be duplicated.
ConvertToRealSheet |  Converts a placeholder sheet to a real one with an optional titleblock.
Create |  Creates a new ViewSheet.
CreatePlaceholder |  Creates a placeholder sheet in a document.
DeleteViewport |  Removes a viewport from the sheet by deleting it from the document.
Duplicate(SheetDuplicateOption) |  Duplicates this sheet to generate a new one.
GetAdditionalRevisionIds |  Gets the Revisions that are additionally included in the sheet's revision schedules.
GetAllPlacedViews |  Returns the ElementIds of Views placed on this sheet.
GetAllRevisionCloudIds |  Gets the ids of the revision clouds which appear on the sheet's revision schedules.
GetAllRevisionIds |  Gets the ordered array of Revisions which participate in the sheet's revision schedules.
GetAllViewports |  Returns the ElementIds of Viewports on this sheet.
GetCurrentRevision |  Returns the most recent numbered Revision shown on this ViewSheet.
GetRevisionCloudNumberOnSheet |  Gets the Revision Number for a RevisionCloud on this sheet.
GetRevisionNumberOnSheet |  Gets the Revision Number for a particular Revision as it will appear on this sheet.
SetAdditionalRevisionIds |  Sets the Revisions to additionally include in the sheet's revision schedules.
Top
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace