Revit 2027 API
StructuralSectionHotRolled Properties
The StructuralSectionHotRolled type exposes the following members.
Properties
Name | Description
FlangeThickness |  Flange Thickness.
FlangeThicknessLocation |  Flange Thickness Location.
WebFillet |  Web Fillet - fillet radius between web and flange.
WebThickness |  Web Thickness.
WebThicknessLocation |  Web Thickness Location.
Top
See Also
Reference
StructuralSectionHotRolled Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace