Revit 2027 API
CancellationListener Class
 Allows clients to poll the cancellation status of a background operation. Revit instantiates CancellationListener objects for internal background operation implementations only. As such, third-party developers are not expected to instantiate or handle CancellationListener objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CancellationListener
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CancellationListener : IDisposable
Public Class CancellationListener
	Implements IDisposable
public ref class CancellationListener : IDisposable
type CancellationListener =
    class
        interface IDisposable
    end
The CancellationListener type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CancellationListener
IsCancelled |  Returns true if the operation associated with this instance has been cancelled.
Top
See Also
Reference
Autodesk.Revit.DB Namespace