Revit 2027 API
DocumentDifference Methods
The DocumentDifference type exposes the following members.
Methods
Name | Description
Dispose
GetCreatedElementIds |  Created element id collection.
GetDeletedElementIds |  Deleted element id collection. For non-worksharing models, this will always be an empty collection.
GetModifiedElementIds |  Modified element id collection.
Top
See Also
Reference
DocumentDifference Class
Autodesk.Revit.DB Namespace