Revit 2027 API
ReinforcementSettings Class
 Provides access to project-wide reinforcement settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.ReinforcementSettings
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReinforcementSettings : Element
Public Class ReinforcementSettings
	Inherits Element
public ref class ReinforcementSettings : public Element
type ReinforcementSettings =
    class
        inherit Element
    end
The ReinforcementSettings type exposes the following members.
Properties
Name | Description
HostStructuralRebar |  Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar.
NumberingMethod |  Identifies the type of the numbering method.
RebarPresentationInSection |  The default presentation mode for rebar sets, when:
The view direction is perpendicular to the rebar normal and the rebar set is cut.
The view direction is not perpendicular to the rebar normal and the view direction is not parallel to the rebar normal.
RebarPresentationInView |  The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut.
RebarShapeDefinesEndTreatments |  End Treatments are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
RebarShapeDefinesHooks |  Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
RebarVaryingLengthNumberSuffix |  A unique identifier used for a bar within a variable length rebar set.
Top
Methods
Name | Description
GetFabricRoundingManager |  Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
GetRebarRoundingManager |  Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
GetReinforcementAbbreviationTag |  Gets one abbreviation tag for desired ReinforcementAbbreviationTagType.
GetReinforcementAbbreviationTags |  Gets a list of abbreviation tags for desired reinforcement object type.
GetReinforcementSettings |  Obtains the ReinforcementSettings object for the specified project document.
IsEqual |  Checks if Reinforcement Settings is equal to other
SetReinforcementAbbreviationTag |  Sets one abbreviation tag for desired ReinforcementAbbreviationTagType.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace