Revit 2027 API
ToggleButtonData Class
This class contains information necessary to construct a toggle button in a RadioButtonGroup.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PushButtonData
 Autodesk.Revit.UI.ToggleButtonData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ToggleButtonData : PushButtonData
Public Class ToggleButtonData
	Inherits PushButtonData
public ref class ToggleButtonData : public PushButtonData
type ToggleButtonData =
    class
        inherit PushButtonData
    end
The ToggleButtonData type exposes the following members.
Constructors
Name | Description
ToggleButtonData(String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.
ToggleButtonData(String, String, String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace