Revit 2027 API
FileArgumentNotFoundException Class
The exception that is thrown when a method received a filename as an argument and requires it to exist as a precondition.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ArgumentException
 Autodesk.Revit.Exceptions.FileArgumentNotFoundException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class FileArgumentNotFoundException : ArgumentException
<SerializableAttribute>
Public Class FileArgumentNotFoundException
	Inherits ArgumentException
[SerializableAttribute]
public ref class FileArgumentNotFoundException : public ArgumentException
[<SerializableAttribute>]
type FileArgumentNotFoundException =
    class
        inherit ArgumentException
    end
The FileArgumentNotFoundException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace