Revit 2027 API
CurveArray Methods
The CurveArray type exposes the following members.
Methods
Name | Description
Append | Add the curve to the end of the array.
Clear | Removes every curve from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified curve into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
CurveArray Class
Autodesk.Revit.DB Namespace