Revit 2027 API
IMemberForcesServer Methods
The IMemberForcesServer type exposes the following members.
Methods
Name | Description
MemberForcesUpdate |  The server's method that will be called when Revit User clicks Member Forces button in the MPP.
Top
See Also
Reference
IMemberForcesServer Interface
Autodesk.Revit.DB.Structure Namespace