Revit 2027 API
GroupSet Class
An set that contains groups.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GroupSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GroupSet : APIObject, IEnumerable
Public Class GroupSet
	Inherits APIObject
	Implements IEnumerable
public ref class GroupSet : public APIObject,
	IEnumerable
type GroupSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The GroupSet type exposes the following members.
Constructors
Name | Description
GroupSet | Initializes a new instance of the GroupSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of groups that are in the set.
Top
Methods
Name | Description
Clear | Removes every group from the set, rendering it empty.
Contains | Tests for the existence of a group within the set.
Erase | Removes a specified group from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified group into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace