Revit 2027 API
LinearArray Methods
The LinearArray type exposes the following members.
Methods
Name | Description
ArrayElementsWithoutAssociation |  Creates a new linear array from a set of elements.
ArrayElementWithoutAssociation |  Creates a new linear array from a single element.
Create(Document, View, ElementId, Int32, XYZ, ArrayAnchorMember) |  Creates a new linear array element from a single element.
Create(Document, View, ICollection<ElementId>, Int32, XYZ, ArrayAnchorMember) |  Creates a new linear array element from a set of elements.
GetCopiedMemberIds | Retrieves the copied member ids from the array. The first item in an array contains the original elements from which the array was created. All other items in the array are copies.
(Overrides BaseArray.GetCopiedMemberIds())
GetMinimumSize |  Returns the minimum size for a linear array based on the document.
GetNumberOfMembersIncludingPlaceholders |  Returns the number of items in an array, including placeholder items in families.
GetOriginalMemberIds | Retrieves the ids for the original elements from which the array was created. These elements form the first item in the array.
(Overrides BaseArray.GetOriginalMemberIds())
IsElementArrayable |  Indicates whether the input element is arrayable.
IsValidNumberOfMembers |  This indicates whether the input count is a valid size for an array based on the document.
Top
See Also
Reference
LinearArray Class
Autodesk.Revit.DB Namespace