Revit 2027 API
StairsLanding Class
 An object that represents a stairs landing in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.StairsLanding
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StairsLanding : Element
Public Class StairsLanding
	Inherits Element
public ref class StairsLanding : public Element
type StairsLanding =
    class
        inherit Element
    end
The StairsLanding type exposes the following members.
Properties
Name | Description
BaseElevation |  The base elevation of the landing.
IsAutomaticLanding |  True if the landing is an automatic landing, False otherwise.
Thickness |  The thickness of the landing.
Top
Methods
Name | Description
CanCreateAutomaticLanding |  Checks whether automatic landing(s) can be created between the given two stairs runs and logically join(s) with the stairs runs.
CreateAutomaticLanding |  Creates automatic landing(s) between two stairs runs.
CreateSketchedLanding |  Creates a customized landing between two runs by providing the closed boundary curves of the landing.
CreateSketchedLandingWithSlopeData |  Creates a customized landing between two runs by providing the closed boundary curves of the landing, specifying slope type and height.
GetAllSupports |  Returns all the supports hosting the stairs landing.
GetConnections |  Returns information about the connections in which the stairs landing participates.
GetFootprintBoundary |  Returns the landing's boundary curves which are projected on the stairs base level.
GetStairs |  Returns the stairs to which the landing belongs.
GetStairsPath |  Returns the stairs path curves on the landing. The curves are projected on the stairs base level.
SetSketchedLandingBoundaryAndPath |  Sets the boundary and path curves of the sketched landing.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace