Revit 2027 API
DocumentPrintingEventArgs Class
 The event arguments used by the DocumentPrinting event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentPrintingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentPrintingEventArgs : RevitAPIPreDocEventArgs
Public Class DocumentPrintingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class DocumentPrintingEventArgs : public RevitAPIPreDocEventArgs
type DocumentPrintingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The DocumentPrintingEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetSettings |  Gets the print settings of the active printing session.
GetViewElementIds |  Returns ElementIds of the views to be printed.
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace