Revit 2027 API
MEPNetworkSegmentId Class
 Represents a unique identifier for one analytical segment in the network.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPNetworkSegmentId : IDisposable
Public Class MEPNetworkSegmentId
	Implements IDisposable
public ref class MEPNetworkSegmentId : IDisposable
type MEPNetworkSegmentId =
    class
        interface IDisposable
    end
The MEPNetworkSegmentId type exposes the following members.
Constructors
Name | Description
MEPNetworkSegmentId() |  Creates a default invalid segment id on the network.
MEPNetworkSegmentId(ElementId, Int32) |  Creates a valid segment id on the network.
Top
Properties
Name | Description
ElementId |  The element id where this analytical segment belongs.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SegmentId |  The segment identifier.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPNetworkSegmentId
IsValid |  Verifies if this is a valid segment id.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace