Revit 2027 API
SolidGeometryOptions Methods
The SolidGeometryOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace