Revit 2027 API
MEPCurve Properties
The MEPCurve type exposes the following members.
Properties
Name | Description
ConnectorManager | The connector manager of this MEP curve.
Diameter | The diameter of the MEP curve.
Height | The height of the MEP curve.
LevelOffset | The offset of the MEP curve.
MEPSystem | The system of the MEP curve.
ReferenceLevel | The reference level of the MEP curve.
Width | The width of the MEP curve.
Top
See Also
Reference
MEPCurve Class
Autodesk.Revit.DB Namespace