Revit 2027 API
AnalyticalPowerDistributableNodeData Methods
The AnalyticalPowerDistributableNodeData type exposes the following members.
Methods
Name | Description
GetAllAvailableConnectedPhasesOnDownstream |  Get all the available electrical connected phases that this power distributable node can provide to the downstream node.
GetApparentPerPhaseResults |  Get an ElectricalPerPhaseData which contains each electrical phase's apparent load and apprent current of the power distributable node.
GetConnectedPhasesOnDownstream |  Get the electrical connected phases of the downstream node.
GetDemandPerPhaseResults |  Get an ElectricalPerPhaseData which contains each electrical phase's demand load and demand current of the power distributable node.
SetConnectedPhasesOnDownstream |  Set the electrical connected phases of the downstream node.
Top
See Also
Reference
AnalyticalPowerDistributableNodeData Class
Autodesk.Revit.DB.Electrical Namespace