Revit 2027 API
RevitServerException Class
The exception that is base class for all exceptions originating from the Revit server.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 More
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerException : ApplicationException
<SerializableAttribute>
Public Class RevitServerException
	Inherits ApplicationException
[SerializableAttribute]
public ref class RevitServerException : public ApplicationException
[<SerializableAttribute>]
type RevitServerException =
    class
        inherit ApplicationException
    end
The RevitServerException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException
 Autodesk.Revit.Exceptions.RevitServerCommunicationException
 Autodesk.Revit.Exceptions.RevitServerInternalException
 Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException
 Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException
 Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException
 Autodesk.Revit.Exceptions.RevitServerUnauthorizedException