Revit 2027 API
HostObjAttributes Methods
The HostObjAttributes type exposes the following members.
Methods
Name | Description
GetCompoundStructure | Returns an object that represents the compound structure of the element.
SetCompoundStructure | Sets the compound structure of the element.
Top
See Also
Reference
HostObjAttributes Class
Autodesk.Revit.DB Namespace