Revit 2027 API
RoofBase Class
Represents all kinds of Roofs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.RoofBase
 Autodesk.Revit.DB.ExtrusionRoof
 Autodesk.Revit.DB.FootPrintRoof
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoofBase : HostObject
Public Class RoofBase
	Inherits HostObject
public ref class RoofBase : public HostObject
type RoofBase =
    class
        inherit HostObject
    end
The RoofBase type exposes the following members.
Properties
Name | Description
EaveCuts | Retrieve or set the EaveCutterType.
FasciaDepth | Retrieve or set the FasciaDepth.
RoofType | Retrieve or set the Type.
Top
Methods
Name | Description
GetSlabShapeEditor |  Gets a SlabShapeEditor that can used to add or modify points of this RoofBase.
Top
Remarks
The RoofBase object represents all kinds of roof in Revit.
See Also
Reference
Autodesk.Revit.DB Namespace