Revit 2027 API
DuctSizeSettingIterator Class
 An iterator to a set of items from DuctSizeSettings. Each item is a KeyValuePair(DuctShape::Enum, DuctSizes).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctSizeSettingIterator : IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
Public Class DuctSizeSettingIterator
	Implements IEnumerator(Of KeyValuePair(Of DuctShape, DuctSizes))
public ref class DuctSizeSettingIterator : IEnumerator<KeyValuePair<DuctShape, DuctSizes^>>
type DuctSizeSettingIterator =
    class
        interface IEnumerator<KeyValuePair<DuctShape, DuctSizes>>
    end
The DuctSizeSettingIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctSizeSettingIterator
HasCurrent |  Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the enumerator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace