Revit 2027 API
BasicLossFactor Properties
The BasicLossFactor type exposes the following members.
Properties
Name | Description
LossFactor |  The loss factor.
Top
See Also
Reference
BasicLossFactor Class
Autodesk.Revit.DB.Lighting Namespace