Revit 2027 API
ConceptualConstructionType Properties
The ConceptualConstructionType type exposes the following members.
Properties
Name | Description
MassSurfaceSubCategoryId |  The surface type subcategory element id associated with the ConceptualConstructionType.
MaterialId |  Material used for visualization of this construction.
Top
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace