Revit 2027 API
AreaScheme Properties
The AreaScheme type exposes the following members.
Properties
Name | Description
IsGrossBuildingArea | Indicates if the area scheme is a Gross Building Area scheme.
Top
See Also
Reference
AreaScheme Class
Autodesk.Revit.DB Namespace