Revit 2027 API
FilledRegionType Methods
The FilledRegionType type exposes the following members.
Methods
Name | Description
IsValidBackgroundPatternId |  Check if the id is valid for a background pattern
IsValidFillPatternId |  Check if the id is a FillPatternElement or an invalidElementId
IsValidForegroundPatternId |  Check if the id is valid for a foreground pattern
IsValidLineWeight |  Indicates whether the given line weight value is valid.
IsValidMasking |  Check that in a family the FillRegionType is always masking.
IsValidSolidFillPatternId |  Checks if the id is valid for a background pattern
Top
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace