Revit 2027 API
TransferringProjectStandardsEventArgs Methods
The TransferringProjectStandardsEventArgs type exposes the following members.
Methods
Name | Description
GetExternalItems |  Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
SetExternalItems |  Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
Top
See Also
Reference
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace