Revit 2027 API
DimensionEqualityLabelFormatting Methods
The DimensionEqualityLabelFormatting type exposes the following members.
Methods
Name | Description
Dispose
GetFormatOptions |  Gets the format options used to show the parameter value.
IsValidFormatOptions |  Checks whether a FormatOptions object is valid for the LabelType.
SetFormatOptions |  Sets the format options used to show the parameter value.
Top
See Also
Reference
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace