Revit 2027 API
CADLinkOperations Class
 This class is used to extend the IExternalResourceServer interface with methods to support operations specifically related to DWG links.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkOperations
 Autodesk.Revit.DB.CADLinkOperations
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CADLinkOperations : LinkOperations
Public Class CADLinkOperations
	Inherits LinkOperations
public ref class CADLinkOperations : public LinkOperations
type CADLinkOperations =
    class
        inherit LinkOperations
    end
The CADLinkOperations type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
The class owns single-method interfaces which are used as callbacks to perform specific operations on DWG link external resources.
An empty CADLinkOperations instance is passed to an IExternalResourceServer (inside an ExternalResourceServerExtensions object) via the GetTypeSpecificServerOperations method. The server provider can then add their own implemented interface objects to the CADLinkOperations, thus making them available to Revit to use as callbacks.
Supporting these additional, type-specific operations is not absolutely required, but is strongly recommended in order for users to be able to perform all the same operations they would with locally-accessed links.
See Also
Reference
Autodesk.Revit.DB Namespace