Revit 2027 API
MEPSpaceConstruction Class
Construction definition for Space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPSpaceConstruction
Public Class MEPSpaceConstruction
public ref class MEPSpaceConstruction
type MEPSpaceConstruction = class end
The MEPSpaceConstruction type exposes the following members.
Properties
Name | Description
CurrentConstruction | Get all the Building Constructions according to the specific Construction type.
SpaceConstructions | Return all the Space constructions of current space.
Top
Methods
Name | Description
DeleteConstruction | Remove an existing construction from Space constructions.
DuplicateConstruction | Create a new construction for Space constructions.
NewConstruction | Create a new construction for Space constructions.
Top
Remarks
This is used to define the information in Constructions.xml.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace