Revit 2027 API
ElementArrayIterator Properties
The ElementArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
ElementArrayIterator Class
Autodesk.Revit.DB Namespace