Revit 2027 API
ReferenceArrayArrayIterator Class
An iterator to a ReferenceArray array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferenceArrayArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ReferenceArrayArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class ReferenceArrayArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ReferenceArrayArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ReferenceArrayArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ReferenceArrayArrayIterator type exposes the following members.
Constructors
Name | Description
ReferenceArrayArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace