Revit 2027 API
DirectContext3DHandleSettings Class
 Overriding settings applied to DirectContext3DHandles through the Visibility dialog.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DirectContext3DHandleSettings : IDisposable
Public Class DirectContext3DHandleSettings
	Implements IDisposable
public ref class DirectContext3DHandleSettings : IDisposable
type DirectContext3DHandleSettings =
    class
        interface IDisposable
    end
The DirectContext3DHandleSettings type exposes the following members.
Constructors
Name | Description
DirectContext3DHandleSettings() |  Constructs an instance of settings with default values.
DirectContext3DHandleSettings(DirectContext3DHandleSettings) |  Constructs a copy of source object.
DirectContext3DHandleSettings(Boolean, Int32) |  Constructs an instance of settings with provided values.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Visibility |  Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
Top
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose | Releases all resources used by the DirectContext3DHandleSettings
GetColor |  Gets the color of the handle and the associated DirectContext3D graphics.
GetTransparency |  Gets the transparency value of the handle and the associated DirectContext3D graphics.
IsEqual |  Check if the contents of two instances of settings are equal.
SetColor |  Sets the color of the handle and the associated DirectContext3D graphics.
SetTransparency |  Sets the transparency value of the handle and the associated DirectContext3D graphics.
SetVisibility |  Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
Top
Remarks
DirectContext3D graphics can be displayed with or without an associated DirectContext3D handle element. For DirectContext3D graphics that utilize the handle element, the visibility and appearance of the graphics can be adjusted through the Visibility/Graphics dialog.
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace