Revit 2027 API
EdgeArrayIterator Properties
The EdgeArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
EdgeArrayIterator Class
Autodesk.Revit.DB Namespace