Revit 2027 API
FabricationItemFile Class
 This class holds information about the item file, including whether it is already loaded from disk into Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationItemFile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationItemFile : IDisposable
Public Class FabricationItemFile
	Implements IDisposable
public ref class FabricationItemFile : IDisposable
type FabricationItemFile =
    class
        interface IDisposable
    end
The FabricationItemFile type exposes the following members.
Properties
Name | Description
Identifier |  The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file.
IsUsed |  Checks to see if the item file is already in use in the project.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationItemFile
GetImage | Gets the image for the fabrication item file.
IsLoaded |  Checks to see if the item file has been loaded into the configuration.
IsValid |  Checks to see if the item file is valid.
Top
Remarks
 This object is created as a result of loading from disk.
See Also
Reference
Autodesk.Revit.DB Namespace