Revit 2027 API
EnergyAnalysisSpace Class
 Analytical space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class EnergyAnalysisSpace : Element
Public Class EnergyAnalysisSpace
	Inherits Element
public ref class EnergyAnalysisSpace : public Element
type EnergyAnalysisSpace =
    class
        inherit Element
    end
The EnergyAnalysisSpace type exposes the following members.
Properties
Name | Description
Area |  The area for this space.
CADObjectUniqueId |  The unique id of the originating Element associated with this EnergyAnalysisSpace at the time of EAM creation.
ComposedName |  The composed name for this space.
Description |  The description.
Number |  The number to identify the space.
SpaceName |  The name.
Volume |  The volume for this space.
Top
Methods
Name | Description
GetAnalyticalSurfaces |  Provides a way to access the collection of analytical surfaces for a space. Geometry data defining an analytical space volume. Through an analytical surface you can connect a source element with each polygon in a space. The analytical surfaces defines an enclosed volume bounded by the center plane of walls and the top plane of roofs and floors.
GetBoundary |  Gets the collection of polygons that form the 2D boundary. This method returns a collection of polyloops (planar polygons) that defines an enclosed area measured by interior bounding surfaces, if in rooms and spaces mode. In other modes, returns no polyloops.
GetClosedShell |  Gets the collection of polygons that form a closed shell. This method returns a collection of polyloops (planar polygons) that defines an enclosed volume measured by interior bounding surfaces, if in rooms and spaces mode. In other modes, returns no polyloops.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace