Revit 2027 API
IndexPoint Class
 A point primitive consisting of one index.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
 Autodesk.Revit.DB.DirectContext3D.IndexPoint
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IndexPoint : IndexPrimitive
Public Class IndexPoint
	Inherits IndexPrimitive
public ref class IndexPoint : public IndexPrimitive
type IndexPoint =
    class
        inherit IndexPrimitive
    end
The IndexPoint type exposes the following members.
Constructors
Name | Description
IndexPoint |  Constructs the point primitive.
Top
Properties
Name | Description
Index |  The index of the point's vertex.
Top
Methods
Name | Description
GetSizeInShortInts |  Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace