Revit 2027 API
DuctSettings Class
 The duct setting class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.DuctSettings
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctSettings : Element
Public Class DuctSettings
	Inherits Element
public ref class DuctSettings : public Element
type DuctSettings =
    class
        inherit Element
    end
The DuctSettings type exposes the following members.
Properties
Name | Description
AirDensity |  The air density in kg/ft^3.
AirDynamicViscosity |  The dynamic viscosity of air in kg/(ft*s).
Centerline |  The abbreviation of the Centerline (=) string.
ConnectorSeparator |  The duct connector separator string.
FittingAngleUsage |  Determine how to use fitting angle during duct layout or modifying layout.
FittingAnnotationSize |  The value of fitting annotation size.
FlatOnBottom |  The abbreviation of the Flat On Bottom (FOB) string.
FlatOnTop |  The abbreviation of the Flat On Top (FOT) string.
NetworkBasedCalculations |  Indicates whether to enable network based calculations for duct networks.
OvalDuctSizeSeparator |  The oval duct size separator string.
OvalDuctSizeSuffix |  The oval duct size suffix string.
RectangularDuctSizeSeparator |  The rectangular duct size separator string.
RectangularDuctSizeSuffix |  The rectangular duct size suffix string.
RiseDropAnnotationSize |  The rise drop annotation size.
RoundDuctSizePrefix |  The round duct size prefix string.
RoundDuctSizeSuffix |  The round duct size suffix string.
SetDown |  The abbreviation of the Set Down from top (TD) of fitting string.
SetDownFromBottom |  The abbreviation of the Set Down from bottom (BD) of fitting string.
SetUp |  The abbreviation of the Set Up from top (TU) of fitting string.
SetUpFromBottom |  The abbreviation of the Set Up from bottom (BU) of fitting string.
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
Top
Methods
Name | Description
GetDuctSettings |  Get the duct settings of the project.
GetPressLossCalculationServerInfo |  Get the MEPServerInfo of the current pipe pressure loss calculation server.
GetSpecificFittingAngles |  Gets the list of specific fitting angles.
GetSpecificFittingAngleStatus |  Gets the status of given specific angle.
IsNetworkBasedCalculationsEnabled |  Indicates whether network based calculations for duct networks is enabled in the specified document.
IsValidSpecificFittingAngle |  Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
SetPressLossCalculationServerInfo |  Set the MEPServerInfo of the current pipe pressure loss calculation server.
SetSpecificFittingAngleStatus |  Sets the status of given specific angle.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace