Revit 2027 API
ConnectorElement Class
 A base class that provides support for all connector elements occurring in families.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ConnectorElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConnectorElement : Element,
	IConnector
Public Class ConnectorElement
	Inherits Element
	Implements IConnector
public ref class ConnectorElement : public Element,
	IConnector
type ConnectorElement =
    class
        inherit Element
        interface IConnector
    end
The ConnectorElement type exposes the following members.
Properties
Name | Description
CoordinateSystem | The coordinate system of the connector.
Direction |  Gets the direction of the connector element.
Domain | The domain of the connector.
Height | The height of the connector.
IsPrimary |  Identifies if this is the primary connector in the family.
Origin | The location of the connector in family document.
Radius | The radius of the connector.
Shape | The shape of the connector.
SystemClassification |  The system classification of the connector.
Width | The width of the connector.
Top
Methods
Name | Description
AssignAsPrimary |  Assign a connector as a primary connector.
ChangeHostReference(Reference) |  Changes the connector host reference to a new planar face.
ChangeHostReference(Reference, Edge) |  Changes the connector host reference to a new planar face and a new edge loop.
CreateCableTrayConnector(Document, Reference) |  Create a new cable tray ConnectorElement.
CreateCableTrayConnector(Document, Reference, Edge) |  Create a new cable tray ConnectorElement.
CreateConduitConnector(Document, Reference) |  Create a new conduit ConnectorElement.
CreateConduitConnector(Document, Reference, Edge) |  Create a new conduit ConnectorElement.
CreateDuctConnector(Document, DuctSystemType, ConnectorProfileType, Reference) |  Create a new duct ConnectorElement.
CreateDuctConnector(Document, DuctSystemType, ConnectorProfileType, Reference, Edge) |  Create a new duct ConnectorElement.
CreateElectricalConnector(Document, ElectricalSystemType, Reference) |  Create a new electrical ConnectorElement.
CreateElectricalConnector(Document, ElectricalSystemType, Reference, Edge) |  Create a new electrical ConnectorElement.
CreatePipeConnector(Document, PipeSystemType, Reference) |  Create a new pipe ConnectorElement.
CreatePipeConnector(Document, PipeSystemType, Reference, Edge) |  Create a new pipe ConnectorElement with a face and an edge.
FlipDirection |  Reverses the direction of the connector element.
GetLinkedConnectorElement |  Get the linked connector element.
IsSystemClassificationValid |  Checks that the MEPSystemType is valid for the domain of connector.
SetLinkedConnectorElement |  Set the linked connector element.
Top
See Also
Reference
Autodesk.Revit.DB Namespace