Revit 2027 API
FlexDuctType Class
A flex duct type in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.MEPCurveType
 Autodesk.Revit.DB.Mechanical.FlexDuctType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FlexDuctType : MEPCurveType
Public Class FlexDuctType
	Inherits MEPCurveType
public ref class FlexDuctType : public MEPCurveType
type FlexDuctType =
    class
        inherit MEPCurveType
    end
The FlexDuctType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
The flex duct type is only available in the Autodesk Revit MEP product.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace