Revit 2027 API
FileArgumentAlreadyExistsException Methods
The FileArgumentAlreadyExistsException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ArgumentException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
FileArgumentAlreadyExistsException Class
Autodesk.Revit.Exceptions Namespace