Revit 2027 API
AssemblyDifferenceNone Class
 The two assemblies being compared are identical
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 Autodesk.Revit.DB.AssemblyDifferenceNone
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyDifferenceNone : AssemblyDifference
Public Class AssemblyDifferenceNone
	Inherits AssemblyDifference
public ref class AssemblyDifferenceNone : public AssemblyDifference
type AssemblyDifferenceNone =
    class
        inherit AssemblyDifference
    end
The AssemblyDifferenceNone type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace