Revit 2027 API
StairsLandingType Properties
The StairsLandingType type exposes the following members.
Properties
Name | Description
IsMonolithic |  True if the stairs landing is monolithic, false otherwise.
Thickness |  Thickness of the stairs landing.
Top
See Also
Reference
StairsLandingType Class
Autodesk.Revit.DB.Architecture Namespace