Revit 2027 API
RevitAPIPostDocEventArgs Properties
The RevitAPIPostDocEventArgs type exposes the following members.
Properties
Name | Description
Document |  The document associated with the event.
Top
See Also
Reference
RevitAPIPostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace