Revit 2027 API
RevolvedSurface Class
 A surface of revolution defined by a profile curve and a local coordinate system. The surface is obtained by rotating the curve around Z axis of the local coordinate system.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.RevolvedSurface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevolvedSurface : Surface
Public Class RevolvedSurface
	Inherits Surface
public ref class RevolvedSurface : public Surface
type RevolvedSurface =
    class
        inherit Surface
    end
The RevolvedSurface type exposes the following members.
Properties
Name | Description
Axis |  Axis of the revolved surface. This is the Z axis of the local coordinate system associated with this revolved surface.
Origin |  Center of the circle that defines the base of the revolved surface. This is the origin of the local coordinate system associated with this revolved surface.
XDir |  X axis of the local coordinate system associated with this revolved surface.
YDir |  X axis of the local coordinate system associated with this revolved surface.
Top
Methods
Name | Description
Create(Frame, Curve) |  Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve.
Create(XYZ, XYZ, Curve) |  Creates a Surface object coincident with the surface of revolution defined by an axis and a profile curve.
Create(Frame, Curve, Double, Double) |  Creates a Surface object coincident with the surface of revolution defined by a coordinate frame, a profile curve, and start and end angles of revolution.
Create(XYZ, XYZ, Curve, Double, Double) |  Creates a Surface object coincident with the surface of revolution defined by an axis, a profile curve, and start and end angles of revolution.
GetProfileCurve |  Returns a copy of the profile curve expressed in the surface's coordinate system.
GetProfileCurveInWorldCoordinates |  Returns a copy of the profile curve expressed in the world coordinate system.
IsValidProfileCurve(Frame, Curve) |  Checks if the input profile curve is valid to create a surface of revolution in the given frame of reference.
IsValidProfileCurve(XYZ, XYZ, Curve) |  Checks if the input profile curve is valid to create a surface of revolution around the given axis.
Top
Remarks
 The parametric equation of a surface of revolution is S(u, v) = center + C1(v)*cos(u)*xVec + C1(v)*sin(u)*yVec + C2(v)*zVec, where the profile curve in the SurfRev's xz plane has the parametric equation (C1(t), C2(t)). Note that the direction of X axis may agree or disagree with the chosen orientation of the surface.
See Also
Reference
Autodesk.Revit.DB Namespace