Revit 2027 API
MechanicalEquipmentSet Class
 A set of interrelated mechanical equipment in a MEP system that works together.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalEquipmentSet : Element
Public Class MechanicalEquipmentSet
	Inherits Element
public ref class MechanicalEquipmentSet : public Element
type MechanicalEquipmentSet =
    class
        inherit Element
    end
The MechanicalEquipmentSet type exposes the following members.
Properties
Name | Description
Classification |  The classification for the mechanical equipment set.
OnDuty |  The number of pieces of mechanical equipment operating in parallel at any given time.
OnStandby |  The number of pieces of mechanical equipment that are not operational at any given time.
Top
Methods
Name | Description
Add |  Adds member element ids to the mechanical equipment set.
AreElementsNotConnectedInSeries |  Checks if the elements are not serially connected.
AreValidMembers |  Checks if these are valid members for mechanical equipment set.
Create |  Creates a new instance of a mechanical equipment set and adds it to the document.
GetMembers |  Gets member element ids for the mechanical equipment set.
Remove |  Removes member element ids from the mechanical equipment set.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace