Revit 2027 API
LinkElementId Methods
The LinkElementId type exposes the following members.
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
Top
See Also
Reference
LinkElementId Class
Autodesk.Revit.DB Namespace