Revit 2027 API
CitySet Properties
The CitySet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of cities that are in the set.
Top
See Also
Reference
CitySet Class
Autodesk.Revit.DB Namespace