Revit 2027 API
DirectShapeTypeOptions Class
 This class is used to control behavior of a DirectShapeType object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectShapeTypeOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DirectShapeTypeOptions : IDisposable
Public Class DirectShapeTypeOptions
	Implements IDisposable
public ref class DirectShapeTypeOptions : IDisposable
type DirectShapeTypeOptions =
    class
        interface IDisposable
    end
The DirectShapeTypeOptions type exposes the following members.
Constructors
Name | Description
DirectShapeTypeOptions |  Constructs a new DirectShapeTypeOptions instance with default settings.
Top
Properties
Name | Description
AllowDuplicateNames |  Determines whether or not duplicate DirectShapeType names are allowed.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DirectShapeTypeOptions
IsEqualTo |  Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same.
IsValid |  Determines whether a DirectShapeTypeOptions is internally consistent (valid).
Top
Remarks
 Use Enable/Disable functions to change the default behavior. Use DirectShapeType.SetOptions to modify that object's behavior.
See Also
Reference
Autodesk.Revit.DB Namespace