Revit 2027 API
ElementSetIterator Class
An iterator to an element set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ElementSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ElementSetIterator : APIObject,
	IEnumerator
Public MustInherit Class ElementSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ElementSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ElementSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ElementSetIterator type exposes the following members.
Constructors
Name | Description
ElementSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace