Revit 2027 API
AssetPropertyString Properties
The AssetPropertyString type exposes the following members.
Properties
Name | Description
Value |  value of the property
Top
See Also
Reference
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace