Revit 2027 API
SystemZoneElementType Class
 Represents an element type for a system-zone element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Mechanical.SystemZoneElementType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SystemZoneElementType : ElementType
Public Class SystemZoneElementType
	Inherits ElementType
public ref class SystemZoneElementType : public ElementType
type SystemZoneElementType =
    class
        inherit ElementType
    end
The SystemZoneElementType type exposes the following members.
Properties
Name | Description
AirChangesPerHour |  The air changes per hour.
CoolingAirTemperature |  The cooling air temperature in unit Kelvin (K).
CoolingSetPoint |  The cooling temperature set point in unit Kelvin (K).
DehumidificationSetPoint |  The humidification set point as a number between 0 and 1.
GeometricDefinition |  The geometric definition for this element type.
HeatingAirTemperature |  The heating air temperature in unit Kelvin (K).
HeatingSetPoint |  The heating temperature set point in unit Kelvin (K).
HumidificationSetPoint |  The humidification set point as a number between 0 and 1.
OutdoorAirPerArea |  The outdoor air per area in unit feet per second.
OutdoorAirPerPerson |  The outdoor air in unit cubic feet per second per person.
UseDehumidificationSetPoint |  Use the dehumidification set point.
UseHumidificationSetPoint |  Use the humidification set point.
Top
Methods
Name | Description
CreateSketchBased |  Creates a new element type for sketch-based system-zone elements and adds it to the document.
CreateSpaceBased |  Creates a new element type for space-based system-zone elements and adds it to the document.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace