Revit 2027 API
DocumentCreatingEventArgs Properties
The DocumentCreatingEventArgs type exposes the following members.
Properties
Name | Description
DocumentType |  Type of the document which is about to be created, e.g. Project or Template.
Template |  The template file path to be used for creating the new document.
Top
See Also
Reference
DocumentCreatingEventArgs Class
Autodesk.Revit.DB.Events Namespace