Revit 2027 API
Entity Class
 An object stored in the Extensible Storage framework. An Entity is described by a Schema, which serves both to identify an Entity, and to describe its contents (Fields).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExtensibleStorage.Entity
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Entity : IDisposable
Public Class Entity
	Implements IDisposable
public ref class Entity : IDisposable
type Entity =
    class
        interface IDisposable
    end
The Entity type exposes the following members.
Constructors
Name | Description
Entity() |  The default-constructed Entity is invalid.
Entity(Entity) |  Constructs a new copy of the input ESEntity object.
Entity(Guid) |  Creates a new Entity corresponding to the Schema of the specified GUID.
Entity(Schema) |  Creates a new Entity corresponding to the Schema.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Schema |  The Schema describing this Entity.
SchemaGUID |  The GUID of the Schema describing this Entity.
Top
Methods
Name | Description
Clear(Field) |  Resets the field to its default value.
Clear(String) |  Resets the field to its default value.
Dispose | Releases all resources used by the Entity
Get<FieldType>(Field) |  Retrieves the value of the field in the entity.
Get<FieldType>(String) |  Retrieves the value of the field in the entity.
Get<FieldType>(Field, ForgeTypeId) |  Retrieves the value of the field in the entity.
Get<FieldType>(String, ForgeTypeId) |  Retrieves the value of the field in the entity.
IsValid |  Checks whether this Entity has a live Schema corresponding to it.
ReadAccessGranted |  Checks whether this Entity may be retrieved by the current add-in.
RecognizedField |  Checks whether a Field belongs to the same Schema as this Entity.
Set<FieldType>(Field, FieldType) |  Stores the value of the field in the entity.
Set<FieldType>(String, FieldType) |  Stores the value of the field in the entity.
Set<FieldType>(Field, FieldType, ForgeTypeId) |  Stores the value of the field in the entity.
Set<FieldType>(String, FieldType, ForgeTypeId) |  Stores the value of the field in the entity.
WriteAccessGranted |  Checks whether this Entity may be stored by the current add-in.
Top
Remarks
 An Entity is similar to an object in most object-oriented languages, while a Schema is the class of that object. The Get and Set methods are central - they provide access to the fields of the Entity. Note that an unitialized Entity retrieved from an Element or another Entity (if it has not been created yet) will be represented as an invalid entity, not null. If an Element containing an Entity is split (e.g., a wall split), the Entity and its data will exist in both new Elements. If an Element containing an Entity is copied, the Element copy will also contain a copy of the Entity and its data. If an Entity stores an ElementId, and the Element with that ElementId is deleted, the stored ElementId will automatically be set to ElementId.InvalidElementId (-1).
See Also
Reference
Autodesk.Revit.DB.ExtensibleStorage Namespace