Revit 2027 API
LineLoad Properties
The LineLoad type exposes the following members.
Properties
Name | Description
EndPoint |  Returns the three dimensional location of the end point for the line load.
ForceVector1 |  The force vector applied to the start point of the line load, oriented according to OrientTo setting.
ForceVector2 |  The force vector applied to the end point of the line load, oriented according to OrientTo setting.
IsProjected |  Indicates if the load is projected.
IsUniform |  Indicates if the load is uniform.
MomentVector1 |  The moment vector applied to the start point of the line load, oriented according to OrientTo setting.
MomentVector2 |  The moment vector applied to the end point of the line load, oriented according to OrientTo setting.
StartPoint |  Returns the three dimensional location of the start point for the line load.
Top
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace