Revit 2027 API
PanelScheduleTemplate Class
 The PanelScheduleTemplate class represents an instance of panel schedule template element. An instance object could be a branch panel, a switchboard or a data panel template.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.PanelScheduleTemplate
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PanelScheduleTemplate : Element
Public Class PanelScheduleTemplate
	Inherits Element
public ref class PanelScheduleTemplate : public Element
type PanelScheduleTemplate =
    class
        inherit Element
    end
The PanelScheduleTemplate type exposes the following members.
Properties
Name | Description
IsBranchPanelSchedule |  Checks to see if this object is branch panel schedule template element.
IsDataPanelSchedule |  Checks to see if this object is data panel schedule template element.
IsDefault |  Checks to see if this is default template for the given panel schedule type.
IsSwitchboardSchedule |  Checks to see if this object is switchboard schedule template element.
Top
Methods
Name | Description
CopyFrom |  Copies all values from other element to this object.
Create |  Creates a new instance of a panel schedule template.
GetPanelScheduleType |  Returns the panel schedule type.
GetSectionData |  Gets the writable section data object.
GetTableData |  Gets the writable table data object.
HasSameType |  Checks if given template has the same panel schedule type with this template.
IsValidPanelConfiguration |  Checks if given panel configuration is valid for given panel schedule type.
IsValidType(PanelScheduleType) |  Checks if given type is valid for this panel schedule template element.
SetTableData |  Assigns table data to this template
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace