Revit 2027 API
WaterLoopData Methods
The WaterLoopData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace