Revit 2027 API
FabricationDimensionDefinition Class
 Represents the definition of a single fabrication pattern dimension. Together all dimensions represent the parametric definition of the fabrication part.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FabricationDimensionDefinition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationDimensionDefinition : IDisposable
Public Class FabricationDimensionDefinition
	Implements IDisposable
public ref class FabricationDimensionDefinition : IDisposable
type FabricationDimensionDefinition =
    class
        interface IDisposable
    end
The FabricationDimensionDefinition type exposes the following members.
Properties
Name | Description
IsModifiable |  Checks if the fabrication dimension is modifiable by user.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  Fabrication dimension name.
Type |  Fabrication dimension type.
UnitType |  Fabrication dimension unit type.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FabricationDimensionDefinition
Top
See Also
Reference
Autodesk.Revit.DB Namespace