Revit 2027 API
ScheduleFilter Methods
The ScheduleFilter type exposes the following members.
Methods
Name | Description
Dispose
GetDoubleValue |  Gets the filter value for a filter using a double value.
GetElementIdValue |  Gets the filter value for a filter using an ElementId value.
GetIntegerValue |  Gets the filter value for a filter using an integer value.
GetStringValue |  Gets the filter value for a filter using a string value.
SetNullValue |  Sets the filter to have no specified value (used for HasParameter filters).
SetValue(Double) |  Set the filter value to a double.
SetValue(ElementId) |  Set the filter value to an ElementId.
SetValue(Int32) |  Set the filter value to an integer.
SetValue(String) |  Set the filter value to a string.
Top
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace