Revit 2027 API
NumberingSchema Methods
The NumberingSchema type exposes the following members.
Methods
Name | Description
AddMatchingParameter |  Add a new parameter to the matching criteria for this numbering schema.
AddPartitioningParameter |  Add a parameter to be used for partitioning elements in this schema.
AppendSequence | Obsolete.
 Appends all elements of one numbering sequence to the end of another sequence.
ApplyExternalSorting |  Applies an externally defined sort order to elements in a partition by assigning specific numbers.
AssignElementsToSequence | Obsolete.
 Assigns the input elements to a sequence identified by the given partition name.
CanChangePartitioningValue |  Returns true if this schema has partitions based on one parameter, that parameter is of type Text and it is modifiable.
ChangeNumber |  Replaces an existing number with a another one that does not exists in the same partition.
ChangePartitioningValue |  Moves all elements of a numbering sequence from one partition to another.
Create |  Creates a numbering schema and registers it with a document.
FilterCompatibleOutputParameters |  Returns the subset of input parameters that are valid as numbering output parameters for the specified categories or filter.
FilterToNumberableCategories |  Filters a set of categorie IDs to only does that are usable in numbering.
GetAvailableParameters |  Get all the available parameters that can be used with numbering.
GetCategoriesWitheBuiltInMatching |  Returns a set of all the categories ids that support built-in matching.
GetFormatting |  Get the configuration for formatting.
GetMatchingParameters |  Returns the parameters used for matching elements in this schema.
GetMinimumNumberOfDigits | Obsolete.
 Returns the minimum number of digits to be used for formating the Number parameter of all enumerable elements of the given document.
GetNumberingInfoForReferences |  Get all the ElementInfos from a given document related to a set of references.
GetNumberingSchema(Document, NumberingSchemaType) | Obsolete.
 Returns an instance of the specified Numbering Schema in the given document.
GetNumberingSchema(Document, String) |  Returns an instance of the specified Numbering Schema in the given document.
GetNumberingSequences |  Returns all numbering sequences within this numbering schema.
GetNumberingSequencesInfos |  Returns all numbering sequences infos within this numbering schema.
GetNumberOfPartitions |  Get the number of partitions managed by the schema.
GetNumbers |  Returns all numbers currently used in the given numbering sequence
GetPartitioningParameters |  Get the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
GetSchemasInDocument |  Returns a set of Ids of all Numbering Schema elements for a given document.
GetScopeDefiningCategories |  Get the categories that define the scope of this numbering schema.
GetUseBuiltInMatchingForCategories |  Get the set of categories where the built-in matching criteria is used.
GetValidCategoriesForNumbering |  Gets a list of categories that can be used for a numbering.
IsValidPartitionName |  Tests if the given string can be used as a name for a numbering partition.
MergeSequences | Obsolete.
 Merges all elements from given numbering sequences to a new sequence.
MoveSequence | Obsolete.
 Moves all elements of a numbering sequence from one partition to another.
RemoveGaps |  Removes gaps, if any, in a numbering sequence
RemoveMatchingParameter |  Remove a parameter from the set of parameters used in matching elements so they would get the same number.
RemovePartitioningParameter |  Remove a parameter that is used for partitioning elements in this schema.
SetFormatting |  Set the NumberingFormatSettings for this schema.
SetMatchingParameters |  Sets the parameters used by a specific numbering schema for matching elements so they would get the same number.
SetMinimumNumberOfDigits | Obsolete.
 Sets a new value for the minimum number of digits to be used for formating the Number parameter of all numbered elements of the given document.
SetPartitioningParameters |  Set the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
SetScopeDefiningFilterAndOutputParam |  Sets the filter and the output parameter that is going to be used by this schema.
SetUseBuiltInMatchingForCategories |  Use the built-in matching criteria for a set of categories if one is available for a given category.
ShiftNumbers |  Shifts all numbers in the sequence so the starting number has the given value.
SwapNumber |  Replaces an existing number with a another one that exists in the same partition.
Top
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace