Revit 2027 API
TransformWithBoundary Methods
The TransformWithBoundary type exposes the following members.
Methods
Name | Description
Dispose
GetBoundary |  Returns the boundary for the model space to view projection space transform.
GetModelToProjectionTransform |  Gets the model space to view projection space transform.
Top
See Also
Reference
TransformWithBoundary Class
Autodesk.Revit.DB Namespace