Revit 2027 API
ConnectionValidationInfo Methods
The ConnectionValidationInfo type exposes the following members.
Methods
Name | Description
Dispose
GetWarning |  Access specific warning number of warnings generated by reload.
IsValidWarningIndex |  Validate warning index.
ManyWarnings |  Returns number of warnings generated by reload.
Top
See Also
Reference
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace