Revit 2027 API
Control Class
A control in Autodesk Revit family document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Control
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Control : Element
Public Class Control
	Inherits Element
public ref class Control : public Element
type Control =
    class
        inherit Element
    end
The Control type exposes the following members.
Properties
Name | Description
Origin |  The control origin.
Shape |  The control shape.
View |  The view.
Top
Methods
Name | Description
Top
Remarks
 The object represents a variety of different shapes of controls in family document. The different shapes of controls can handle the family instance in different ways.
A vertical/horizontal arrow control rotates the instance by 180 degrees.
A double vertical arrow control mirrors the instance geometry vertically.
A double horizontal arrow control mirrors the instance geometry horizontally.
See Also
Reference
Autodesk.Revit.DB Namespace