Revit 2027 API
PointCloudOverrideSettings Methods
The PointCloudOverrideSettings type exposes the following members.
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose
GetModeOverride |  Lookup color settings for the given color mode.
IsEqual |  Checks if the contents of two settings are equal.
SetModeOverride |  Sets color settings for the given color mode.
Top
See Also
Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace