Revit 2027 API
FormulaManager Class
 A class to access and query information about formula engine in Revit models.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormulaManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FormulaManager : IDisposable
Public Class FormulaManager
	Implements IDisposable
public ref class FormulaManager : IDisposable
type FormulaManager =
    class
        interface IDisposable
    end
The FormulaManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FormulaManager
Evaluate |  Evaluates value of the formula
GetFunctions |  Gets list of function names supported by formula engine
GetOperators |  Gets list of operator names supported by formula engine
Validate |  Validates the formuls
Top
Remarks
 Formula manager
See Also
Reference
Autodesk.Revit.DB Namespace