Revit 2027 API
FailureMessage Class
 Represents a message describing a failure of an operation in Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureMessage
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FailureMessage : IDisposable
Public Class FailureMessage
	Implements IDisposable
public ref class FailureMessage : IDisposable
type FailureMessage =
    class
        interface IDisposable
    end
The FailureMessage type exposes the following members.
Constructors
Name | Description
FailureMessage |  Creates a new FailureMessage related to a given FailureDefinition.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddResolution |  Adds a resolution for the failure.
Dispose | Releases all resources used by the FailureMessage
GetAdditionalElements |  Retrieves list of the additional reference elements for the failure.
GetDefaultResolutionCaption |  Retrieves the caption of the default resolution of the failure.
GetDescriptionText |  Retrieves the description text of the failure.
GetFailingElements |  Retrieves list of the elements that have caused the failure.
GetFailureDefinitionId |  Retrieves the id of the failure definition for the failure.
GetSeverity |  Retrieves the severity of the failure.
HasResolutionOfType |  Checks if failure has a resolution of a given type.
HasResolutions |  Checks if the failure has any resolutions.
SetAdditionalElement |  Sets the additional reference element for the failure.
SetAdditionalElements |  Sets the additional reference elements for the failure.
SetFailingElement |  Sets the element that has caused the failure.
SetFailingElements |  Sets elements that have caused the failure.
Top
Remarks
 Failure messages are typically shown to the user in the Revit error dialog. This class contains the following information about the failures:
The basic description of the failure (retrieved from the FailureDefinition)
The available resolutions for the failure.
The elements related to the failure.
See Also
Reference
Autodesk.Revit.DB Namespace