Revit 2027 API
ViewDrafting Class
 ViewDrafting represents a drafting view within the model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.ViewDrafting
 Autodesk.Revit.DB.ImageView
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewDrafting : View
Public Class ViewDrafting
	Inherits View
public ref class ViewDrafting : public View
type ViewDrafting =
    class
        inherit View
    end
The ViewDrafting type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new ViewDrafting in the model.
Top
See Also
Reference
Autodesk.Revit.DB Namespace