Revit 2027 API
CurveElementFilter Properties
The CurveElementFilter type exposes the following members.
Properties
Name | Description
CurveElementType |  The curve element type.
Top
See Also
Reference
CurveElementFilter Class
Autodesk.Revit.DB Namespace