Revit 2027 API
ElementRecord Class
 A record in the Revit database representing an element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementRecord
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementRecord : IDisposable
Public Class ElementRecord
	Implements IDisposable
public ref class ElementRecord : IDisposable
type ElementRecord =
    class
        interface IDisposable
    end
The ElementRecord type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
WorksetId |  Get Id of the workset which owns the element.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ElementRecord
GetBoundingBox |  Gets the bounding box of the element record.
GetCategoryId |  Gets the category id of the element record.
GetDesignOptionId |  Gets the design option id of the element record.
GetId |  Gets the id of the element record.
GetOwnerViewId |  Gets the element id of the owner view record.
HasBoundingBox |  Determines whether this element record has a bounding box.
IsAnElementType |  Identifies if the element record represents an ElementType.
IsCurveDriven |  Identifies if the element is curve driven.
Top
Remarks
 The record is used to extract basic information about an element before the element is fully expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace