Revit 2027 API
ElectricalSetting Class
 The ElectricalSetting class represents an instance of element of electrical settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.ElectricalSetting
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalSetting : Element
Public Class ElectricalSetting
	Inherits Element
public ref class ElectricalSetting : public Element
type ElectricalSetting =
    class
        inherit Element
    end
The ElectricalSetting type exposes the following members.
Properties
Name | Description
CircuitLoadCalculationMethod |  The method to calculate circuit load
CircuitNamePhaseA |  Circuit Naming by Phase - Phase A Label.
CircuitNamePhaseB |  Circuit Naming by Phase - Phase B Label.
CircuitNamePhaseC |  Circuit Naming by Phase - Phase C Label.
CircuitPathOffset |  The default circuit path offset for newly created circuit.
CircuitRating |  The default circuit rating for newly created circuit.
CircuitSequence |  The sequence in which power circuits are created.
DistributionSysTypes |  Get all distribution system types of the project.
VoltageTypes |  Get all voltage type definitions information of the project.
WireConduitTypes |  Get electrical conduit types information of the project.
WireTypes |  Get all wire type definition information of the project.
Top
Methods
Name | Description
AddDistributionSysType |  Add a new distribution system type to project.
AddVoltageType |  Add a new type definition of voltage into project.
GetCircuitNamingSchemeSettings |  Gets the circuit naming scheme settings of the project.
GetElectricalSettings |  Get the electrical settings of the project.
GetSpecificFittingAngles |  Gets the list of specific fitting angles.
GetSpecificFittingAngleStatus |  Gets the status of given specific fitting angle.
IsValidSpecificFittingAngle |  Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
RemoveDistributionSysType |  Remove an existing distribution system type from the project.
RemoveVoltageType |  Remove the voltage type from project.
RemoveWireType |  Remove wire type definition from project.
SetSpecificFittingAngleStatus |  Sets the status of given specific angle.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace