Revit 2027 API
PolylineNode Class
 An output node that represents a 3D polyline.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.PolylineNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PolylineNode : ModelCurveNode
Public Class PolylineNode
	Inherits ModelCurveNode
public ref class PolylineNode : public ModelCurveNode
type PolylineNode =
    class
        inherit ModelCurveNode
    end
The PolylineNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetPolyline |  Returns the polyline object corresponding to the node.
Top
Remarks
 See also: OnPolyline(PolylineNode).
See Also
Reference
Autodesk.Revit.DB Namespace