Revit 2027 API
ViewExportedEventArgs Class
 The event arguments used by the ViewExported event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.ViewExportedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewExportedEventArgs : RevitAPIPostDocEventArgs
Public Class ViewExportedEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class ViewExportedEventArgs : public RevitAPIPostDocEventArgs
type ViewExportedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The ViewExportedEventArgs type exposes the following members.
Properties
Name | Description
ViewId |  Identifies the view that was exported.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace