Revit 2027 API
ExternalResourceServerExtensions Methods
The ExternalResourceServerExtensions type exposes the following members.
Methods
Name | Description
Dispose
GetCADLinkOperations |  Gets the specific methods supported by external resource CAD Links.
GetRevitLinkOperations |  Gets the specific methods supported by the external resource of Revit Links.
Top
See Also
Reference
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace