Revit 2027 API
RoutingPreferenceManager Methods
The RoutingPreferenceManager type exposes the following members.
Methods
Name | Description
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule) |  Adds a new routing preference rule to the rule group.
AddRule(RoutingPreferenceRuleGroupType, RoutingPreferenceRule, Int32) |  Adds a new routing preference rule to the specified position in the rule group.
Dispose
GetMEPPartId |  Gets a fitting or segment id of given routing preference group that meets the specified routing conditions.
GetNumberOfRules |  The number of RoutingPreference rules in a group.
GetRule |  Gets the specified rule.
GetSharedSizes |  Gets a list of all segments of a given profile shape that define a given size.
RemoveRule |  Removes an existing routing preference rule. Thrown if the index is out of bounds.
Top
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace