Revit 2027 API
ExternalResourceMatchOptions Class
 Represents match options used to filter external resources when listing them from external resource server.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceMatchOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalResourceMatchOptions : IDisposable
Public Class ExternalResourceMatchOptions
	Implements IDisposable
public ref class ExternalResourceMatchOptions : IDisposable
type ExternalResourceMatchOptions =
    class
        interface IDisposable
    end
The ExternalResourceMatchOptions type exposes the following members.
Constructors
Name | Description
ExternalResourceMatchOptions |  Constructs new instance with specified resource type.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ResourceType |  The desired resource type which external resources should match.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalResourceMatchOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace