Revit 2027 API
MessageBoxShowingEventArgs Properties
The MessageBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
DialogType |  An integer that describes the standard Windows type of the dialog box.
Message |  The message that has been displayed in the dialog box.
Top
See Also
Reference
MessageBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace