Revit 2027 API
OrdinateDimensionSetting Class
 Represents a collection of Ordinate Dimension settings that can be associated to an ordinate DimensionType.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.OrdinateDimensionSetting
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class OrdinateDimensionSetting : IDisposable
Public Class OrdinateDimensionSetting
	Implements IDisposable
public ref class OrdinateDimensionSetting : IDisposable
type OrdinateDimensionSetting =
    class
        interface IDisposable
    end
The OrdinateDimensionSetting type exposes the following members.
Constructors
Name | Description
OrdinateDimensionSetting |  Constructs a new OrdinateDimensionSetting object with default settings.
Top
Properties
Name | Description
DimensionLineLength |  Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented.
DimensionLineStyle |  Specifies the dimension line style.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OriginTickMarkId |  Specifies the id of the tick mark element to use for the dimension origin.
OriginVisibility |  Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string).
TextOrientation |  Specifies where to align the dimension text.
TextPosition |  Specifies the dimension text position.
Top
Methods
Name | Description
Dispose | Releases all resources used by the OrdinateDimensionSetting
Top
See Also
Reference
Autodesk.Revit.DB Namespace