Revit 2027 API
ColorFillScheme Properties
The ColorFillScheme type exposes the following members.
Properties
Name | Description
AreaSchemeId |  Represents the id of AreaScheme of area plan views that this scheme could be applied to.
CategoryId |  Represents the element category that can be colored by this scheme.
IsByRange |  Represents if the parameter values in entries are treated as value range or not.
IsLinkedFilesIncluded |  Represent if the scheme includes entries whose parameter values are based on elements from linked files.
ParameterDefinition |  Represents the parameter of the elements that this scheme could be used to color.
StorageType |  Represents the type of parameter values stored in entries.
Title |  Represents the title displayed in ColorFillLegend.
Top
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace