Revit 2027 API
PointCloudInstance Class
 Represents a single instance of a point cloud in the Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 Autodesk.Revit.DB.PointCloudInstance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointCloudInstance : Instance
Public Class PointCloudInstance
	Inherits Instance
public ref class PointCloudInstance : public Instance
type PointCloudInstance =
    class
        inherit Instance
    end
The PointCloudInstance type exposes the following members.
Properties
Name | Description
FilterAction |  The action taken based on the results of the selection filter applied to this point cloud.
SupportsOverrides |  Identifies whether the instance can have graphic overrides.
Top
Methods
Name | Description
ContainsScan |  Identifies whether the instance contains a scan.
Create |  Creates a new instance of a point cloud based on an input point cloud type and transformation.
GetPoints |  Extracts a collection of points based on a filter.
GetRegions |  Returns array of region names.
GetScanOrigin |  Returns the origin point of a scan in model coordinates.
GetScans |  Returns array of scan names.
GetSelectionFilter |  Returns the currently active selection filter for this point cloud.
HasColor |  Returns true if at least one scan of the element have color, false otherwise.
SetSelectionFilter |  Sets active selection filter by cloning of the one passed to it.
Top
See Also
Reference
Autodesk.Revit.DB Namespace