Revit 2027 API
FormulaEditingEventArgs Properties
The FormulaEditingEventArgs type exposes the following members.
Properties
Name | Description
CurrentDocument |  Returns the current document
Formula |  Returns text of the formula that will be modified
ParameterId |  Returns the Id of the modified parameter
Top
See Also
Reference
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace