Revit 2027 API
RibbonItemEventArgs Class
The base class of the RibbonItem event arguments which have UIApplication property.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.UI.Events.RibbonItemEventArgs
 Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs
 Autodesk.Revit.UI.Events.ComboBoxDropDownClosedEventArgs
 Autodesk.Revit.UI.Events.ComboBoxDropDownOpenedEventArgs
 Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RibbonItemEventArgs : EventArgs
Public Class RibbonItemEventArgs
	Inherits EventArgs
public ref class RibbonItemEventArgs : public EventArgs
type RibbonItemEventArgs =
    class
        inherit EventArgs
    end
The RibbonItemEventArgs type exposes the following members.
Constructors
Name | Description
RibbonItemEventArgs | Initializes a new instance of the RibbonItemEventArgs class
Top
Properties
Name | Description
Application |  The current UIApplication.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace