Revit 2027 API
PolylineSegments Class
 An output node that represents a tessellated polyline segments.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PolylineSegments
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PolylineSegments : IDisposable
Public Class PolylineSegments
	Implements IDisposable
public ref class PolylineSegments : IDisposable
type PolylineSegments =
    class
        interface IDisposable
    end
The PolylineSegments type exposes the following members.
Properties
Name | Description
EndLocalParameter |  Local parameter associated with the end point.
EndParameter |  Parameter associated with the end point.
IsFilled |  Indicates whether the area enclosed by the polyline is to be filled or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LineProperties |  Access to the line (pen) properties of the polyline
StartLocalParameter |  Local parameter associated with the start point.
StartParameter |  Parameter associated with the start point.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PolylineSegments
GetVertices |  Returns an array of vertices of the polyline segments.
Top
Remarks
 See also: OnPolylineSegments(PolylineSegments).
See Also
Reference
Autodesk.Revit.DB Namespace