Revit 2027 API
Reference Class
A stable reference to a geometric object in a Revit model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Reference
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Reference : APIObject
Public Class Reference
	Inherits APIObject
public ref class Reference : public APIObject
type Reference =
    class
        inherit APIObject
    end
The Reference type exposes the following members.
Constructors
Name | Description
Reference | Creates a Reference with the supplied element.
Top
Properties
Name | Description
ElementId | The element id for this reference.
ElementReferenceType | The type of reference.
GlobalPoint | The position on which the reference is hit.
LinkedElementId | The id of the top-level element in the linked document that is referred to by this reference.
UVPoint | The UV parameters of the reference, if the reference contains a face.
Top
Methods
Name | Description
Contains | Checks if given reference identifies part of object identified by this reference.
ConvertToStableRepresentation | Converts the reference to a stable String representation.
CreateLinkReference | Creates a Reference from a Reference in an RVT Link.
CreateReferenceInLink | Creates a Reference in an RVT Link from a Reference in the RVT host file.
EqualTo | Checks if given reference is equal to this reference.
ParseFromStableRepresentation | Converts a stable String representation of a reference to a Reference object.
Top
See Also
Reference
Autodesk.Revit.DB Namespace