Revit 2027 API
AnalyticalModelSelector Class
 Defines a portion of an Analytical Model for an Element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.AnalyticalModelSelector
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalModelSelector : IDisposable
Public Class AnalyticalModelSelector
	Implements IDisposable
public ref class AnalyticalModelSelector : IDisposable
type AnalyticalModelSelector =
    class
        interface IDisposable
    end
The AnalyticalModelSelector type exposes the following members.
Constructors
Name | Description
AnalyticalModelSelector() |  Creates a selector for the analytical model geometry.
AnalyticalModelSelector(AnalyticalCurveSelector) |  Creates a selector for the analytical model geometry.
AnalyticalModelSelector(Curve) |  Creates a selector based on a specific analytical curve.
AnalyticalModelSelector(Curve, AnalyticalCurveSelector) |  Creates a selector based on one portion of a specific analytical curve.
Top
Properties
Name | Description
CurveSelector |  The portion of the curve to be selected.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalyticalModelSelector
Top
Remarks
 This is used to identify the portion of an analytical model of interest to a client. To identify the portion of the analytical model, the client must identify the curve in question, by using one of the following:
The specific curve within the analytical model.
The index of the curve within the analytical model.
 If a specific part of that curve is of interest, the client needs to identify that by specifying one of the following:
The start of the curve.
The end of the curve.
The entire curve. This is the default behavior, so this does not need specifying.
Example
public bool GetReferenceData(AnalyticalElement analyticalModelFrame)
{
   Curve analyticalCurve = analyticalModelFrame.GetCurve();
   if (null != analyticalCurve)
   {
      // test the stable reference to the curve.
      AnalyticalModelSelector amSelector = new AnalyticalModelSelector(analyticalCurve);
      amSelector.CurveSelector = AnalyticalCurveSelector.WholeCurve;
      Reference curveReference = analyticalModelFrame.GetReference(amSelector);
      // test the stable reference to the start point of the curve
      amSelector.CurveSelector = AnalyticalCurveSelector.StartPoint;
      Reference startPointReference = analyticalModelFrame.GetReference(amSelector);
      // test the stable reference to the start point of the curve
      amSelector.CurveSelector = AnalyticalCurveSelector.EndPoint;
      Reference endPointReference = analyticalModelFrame.GetReference(amSelector);
   }
   return true;
}
See Also
Reference
Autodesk.Revit.DB.Structure Namespace