Revit 2027 API
CurveByPoints Properties
The CurveByPoints type exposes the following members.
Properties
Name | Description
IsReferenceLine
ReferenceType | Indicates the type of reference.
SketchPlane | Override the SketchPlane property of CurveElement.
(Overrides CurveElement.SketchPlane)
Subcategory | The subcategory, or graphics style, of the CurveByPoints.
Visible | Whether the point is visible when the family is loaded into a project.
Top
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace