Revit 2027 API
ComponentRepeaterIterator Class
 A slot iterator for ComponentRepeater.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ComponentRepeaterIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComponentRepeaterIterator : IEnumerator<ComponentRepeaterSlot>
Public Class ComponentRepeaterIterator
	Implements IEnumerator(Of ComponentRepeaterSlot)
public ref class ComponentRepeaterIterator : IEnumerator<ComponentRepeaterSlot^>
type ComponentRepeaterIterator =
    class
        interface IEnumerator<ComponentRepeaterSlot>
    end
The ComponentRepeaterIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ComponentRepeaterIterator
GetCurrent |  Returns the current repeater slot.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace