Revit 2027 API
MEPConnectorInfo Methods
The MEPConnectorInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
MEPConnectorInfo Class
Autodesk.Revit.DB Namespace