Revit 2027 API
Segment Methods
The Segment type exposes the following members.
Methods
Name | Description
AddSize |  Adds a new MEPSize to the segment.
GetSizes |  Gets the defined sizes of the segment.
RemoveSize |  Remove the existing MEPSize with this nominal diameter from the segment.
Top
See Also
Reference
Segment Class
Autodesk.Revit.DB Namespace