Revit 2027 API
ExternalEvent Methods
The ExternalEvent type exposes the following members.
Methods
Name | Description
Create |  Creates an instance of external event.
CreateJournalable |  Creates an instance of external event which will have the ability to record its executions in the journal.
Dispose
Raise |  Instructing Revit to raise (signal) the external event.
Top
See Also
Reference
ExternalEvent Class
Autodesk.Revit.UI Namespace