Revit 2027 API
InitialIlluminanceIntensity Class
 This class encapsulates initial illuminance intensity calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialIlluminanceIntensity : InitialIntensity
Public Class InitialIlluminanceIntensity
	Inherits InitialIntensity
public ref class InitialIlluminanceIntensity : public InitialIntensity
type InitialIlluminanceIntensity =
    class
        inherit InitialIntensity
    end
The InitialIlluminanceIntensity type exposes the following members.
Constructors
Name | Description
InitialIlluminanceIntensity(InitialIlluminanceIntensity) |  Creates a copy of the given initial illuminance intensity object
InitialIlluminanceIntensity(Double, Double) |  Creates an initial illuminance intensity object with the given document and illuminance values.
Top
Properties
Name | Description
Distance |  The illuminance intensity distance value.
Illuminance |  The illuminance intensity value.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace