Revit 2027 API
AreaVolumeSettings Properties
The AreaVolumeSettings type exposes the following members.
Properties
Name | Description
ComputeVolumes |  True to enable volume computation. False to disable it.
Top
See Also
Reference
AreaVolumeSettings Class
Autodesk.Revit.DB Namespace