Revit 2027 API
TriangulatedShellComponent Class
 This class represents a triangulated boundary component of a solid or a triangulated connected component of a shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TriangulatedShellComponent
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TriangulatedShellComponent : IDisposable
Public Class TriangulatedShellComponent
	Implements IDisposable
public ref class TriangulatedShellComponent : IDisposable
type TriangulatedShellComponent =
    class
        interface IDisposable
    end
The TriangulatedShellComponent type exposes the following members.
Properties
Name | Description
IsClosed |  True if and only if the triangulation represents a topologically closed shell (i.e., each edge is shared by two triangles).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TriangleCount |  The number of triangles in the triangulation.
VertexCount |  The number of vertices in the triangulation.
Top
Methods
Name | Description
Clear |  Empties the contents of this TriangulatedShellComponent.
Dispose | Releases all resources used by the TriangulatedShellComponent
GetTriangle |  Returns the triangle corresponding to the given index.
GetVertex |  Returns the vertex with a given index.
GetVertices |  Returns the vertices of the triangulation.
Top
Remarks
 The triangulation is "topologically connected" in the following sense: if two triangles share an edge geometrically, then they share a single edge topologically (i.e., they share two vertices defining the geometrically shared edge).
See Also
Reference
Autodesk.Revit.DB Namespace