Revit 2027 API
OutdatedDirectlyOpenedCentralException Class
The exception thrown when a central model is opened directly and its copy in the session is outdated. If the operation is supported for local files, first resave as local, and try again.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class OutdatedDirectlyOpenedCentralException : CentralModelException
<SerializableAttribute>
Public Class OutdatedDirectlyOpenedCentralException
	Inherits CentralModelException
[SerializableAttribute]
public ref class OutdatedDirectlyOpenedCentralException : public CentralModelException
[<SerializableAttribute>]
type OutdatedDirectlyOpenedCentralException =
    class
        inherit CentralModelException
    end
The OutdatedDirectlyOpenedCentralException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace