Revit 2027 API
ThemeChangedEventArgs Properties
The ThemeChangedEventArgs type exposes the following members.
Properties
Name | Description
ThemeChangedType |  Get the application frame theme Type.
Top
See Also
Reference
ThemeChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace