Revit 2027 API
CurtainGrid Methods
The CurtainGrid type exposes the following members.
Methods
Name | Description
AddGridLine |  Add a grid line to the curtain grid.
ChangePanelType |  Change the type of a curtain panel.
GetCell |  Get the specified cell located by the intersection of the grid lines.
GetCurtainCells |  Gets the CurtainCells owned by this curtain grid.
GetMullionIds |  Gets all ElementIds of the mullions of the curtain grid.
GetPanel |  Get the specified panel located by the intersection of the grid lines.
GetPanelIds |  Gets all ElementIds of the panels of the curtain grid.
GetUGridLineIds |  Gets all ElementIds of grid lines in the U direction.
GetUnlockedMullionIds |  Gets all ElementIds of the unlocked mullions of the curtain grid.
GetUnlockedPanelIds |  Gets all ElementIds of the unlocked panels of the curtain grid.
GetVGridLineIds |  Gets all ElementIds of grid lines in the V direction.
Top
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace