Revit 2027 API
StructuralSectionConcreteL Class
 Defines parameters for parameterized concrete L structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteL
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcreteL : StructuralSectionRectangular
Public Class StructuralSectionConcreteL
	Inherits StructuralSectionRectangular
public ref class StructuralSectionConcreteL : public StructuralSectionRectangular
type StructuralSectionConcreteL =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionConcreteL type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteL |  Creates a new instance of Structural Section Concrete L shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
CutHeight |  Cut Height: the height of the cut in a rectangle-cut section shape.
CutWidth |  Cut Width: the width of the cut in a rectangle-cut section shape.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace