Revit 2027 API
NumberingParameter Methods
The NumberingParameter type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
NumberingParameter Class
Autodesk.Revit.DB Namespace