Revit 2027 API
RevitLinkOptions Methods
The RevitLinkOptions type exposes the following members.
Methods
Name | Description
Dispose
GetWorksetConfiguration |  Gets the set of worksets to open when creating the link.
SetWorksetConfiguration |  Sets the set of worksets to open when creating the link.
Top
See Also
Reference
RevitLinkOptions Class
Autodesk.Revit.DB Namespace