Revit 2027 API
StructuralSectionRound Class
 Defines common set of parameters for structural section round contour.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcretePolygon
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionRound : StructuralSection
Public Class StructuralSectionRound
	Inherits StructuralSection
public ref class StructuralSectionRound : public StructuralSection
type StructuralSectionRound =
    class
        inherit StructuralSection
    end
The StructuralSectionRound type exposes the following members.
Properties
Name | Description
CentroidHorizontal |  Distance from centroid to the left extremites along horizontal axis.
CentroidVertical |  Distance from centroid to the upper extremites along vertical axis.
Diameter |  Pipe Diameter.
NameKey |  Name Key
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace