Revit 2027 API
MechanicalEquipmentSetType Class
 Represents a type for a set of interrelated mechanical equipment in a MEP system that works together.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalEquipmentSetType : ElementType
Public Class MechanicalEquipmentSetType
	Inherits ElementType
public ref class MechanicalEquipmentSetType : public ElementType
type MechanicalEquipmentSetType =
    class
        inherit ElementType
    end
The MechanicalEquipmentSetType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new type of a mechanical equipment set and adds it to the document.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace