Revit 2027 API
RadialDimension Class
 An object that represents an Radial Dimension within the Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.RadialDimension
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RadialDimension : Dimension
Public Class RadialDimension
	Inherits Dimension
public ref class RadialDimension : public Dimension
type RadialDimension =
    class
        inherit Dimension
    end
The RadialDimension type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of an Radial Dimension element within the project.
Top
See Also
Reference
Autodesk.Revit.DB Namespace