Revit 2027 API
ModelCurveArrArrayIterator Class
An iterator to a array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ModelCurveArrArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ModelCurveArrArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class ModelCurveArrArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ModelCurveArrArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ModelCurveArrArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ModelCurveArrArrayIterator type exposes the following members.
Constructors
Name | Description
ModelCurveArrArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace