Revit 2027 API
ReferenceArrayIterator Methods
The ReferenceArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
ReferenceArrayIterator Class
Autodesk.Revit.DB Namespace