Revit 2027 API
ServerModelCorruptedException Methods
The ServerModelCorruptedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides CentralModelException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ServerModelCorruptedException Class
Autodesk.Revit.Exceptions Namespace