Revit 2027 API
CustomFieldData Methods
The CustomFieldData type exposes the following members.
Methods
Name | Description
Dispose
GetCustomFieldId |  Gets an unique identifier of the custom field.
GetCustomFieldProperties |  Gets an instance of ICustomFieldProperties which represents the properties of this field.
SetCustomFieldProperties |  Sets an instance of ICustomFieldProperties which represents the properties of this field.
ValidateCustomFieldProperties |  Validates the custom field properties.
Top
See Also
Reference
CustomFieldData Class
Autodesk.Revit.DB Namespace