Revit 2027 API
RebarShapeConstraint180DegreeBendArcLength Class
 A constraint which can be applied to a RebarShapeSegment, and causes the segment to be replaced with a 180-degree arc. The associated parameter drives the arc length.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendArcLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraint180DegreeBendArcLength : RebarShapeConstraint
Public Class RebarShapeConstraint180DegreeBendArcLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraint180DegreeBendArcLength : public RebarShapeConstraint
type RebarShapeConstraint180DegreeBendArcLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraint180DegreeBendArcLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraint180DegreeBendArcLength |  Create a 180-degree bend constraint driven by arc length.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace