Revit 2027 API
SpatialElementTag Methods
The SpatialElementTag type exposes the following members.
Methods
Name | Description
MoveToReferenceLocation |  Moves the SpatialElementTag to the location of SpatialElement that the tag is associated with.
Top
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace