Revit 2027 API
BeamSystem Properties
The BeamSystem type exposes the following members.
Properties
Name | Description
BeamSystemType | Retrieves or changes the type of the BeamSystem.
BeamType | Retrieves or changes the Beam Type of the BeamSystem.
Direction | The Direction of the BeamSystem.
Elevation | Retrieves or changes the Elevation of the BeamSystem.
LayoutRule | Retrieves or changes the LayoutRule of the BeamSystem.
Level | Get or change the level of the BeamSystem. When the level is changed, the elevation is changed to make the the BeamSystem remain the location.
Profile | Retrieve or set the profile of the BeamSystem.
Top
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace