Revit 2027 API
MEPAnalyticalNode Class
 Represents an analytical node of the MEP analytical model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPAnalyticalNode
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPAnalyticalNode : IDisposable
Public Class MEPAnalyticalNode
	Implements IDisposable
public ref class MEPAnalyticalNode : IDisposable
type MEPAnalyticalNode =
    class
        interface IDisposable
    end
The MEPAnalyticalNode type exposes the following members.
Properties
Name | Description
Id |  The identity used in the MEPAnalyticalSegment
IsFlowBlocked |  Is the flow blocked at this analytical node?
IsFocalNode |  Is this node a focal point of multiple branches?
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Location |  The location of this node.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPAnalyticalNode
IsSameNode |  Verify if this node is connected to the other node and thus represents the same analytical node in the network.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace