Revit 2027 API
MullionType Class
An object that represents a mullion type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.FamilySymbol
 Autodesk.Revit.DB.MullionType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MullionType : FamilySymbol
Public Class MullionType
	Inherits FamilySymbol
public ref class MullionType : public FamilySymbol
type MullionType =
    class
        inherit FamilySymbol
    end
The MullionType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace