Revit 2027 API
StairsComponentConnection Methods
The StairsComponentConnection type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace