Revit 2027 API
DesignOption Methods
The DesignOption type exposes the following members.
Methods
Name | Description
GetActiveDesignOptionId |  Gets the active design option id for the document.
Top
See Also
Reference
DesignOption Class
Autodesk.Revit.DB Namespace