Revit 2027 API
PipeScheduleType Class
 Represents a pipe schedule type in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Plumbing.PipeScheduleType
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeScheduleType : ElementType
Public Class PipeScheduleType
	Inherits ElementType
public ref class PipeScheduleType : public ElementType
type PipeScheduleType =
    class
        inherit ElementType
    end
The PipeScheduleType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new pipe schedule type with the given name.
GetPipeScheduleId |  Returns an existing pipe schedule type with the same name.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace