Revit 2027 API
AutoJoinFailedException Methods
The AutoJoinFailedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
AutoJoinFailedException Class
Autodesk.Revit.Exceptions Namespace