Revit 2027 API
MacroModule Class
 A container for individual macros. As it relates to the macros editor, one MacroModule represents a project that can be loaded and edited from within the editor.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.MacroModule
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MacroModule : IEnumerable<Macro>,
	IDisposable
Public Class MacroModule
	Implements IEnumerable(Of Macro), IDisposable
public ref class MacroModule : IEnumerable<Macro^>,
	IDisposable
type MacroModule =
    class
        interface IEnumerable<Macro>
        interface IDisposable
    end
The MacroModule type exposes the following members.
Properties
Name | Description
Environment |  The Macro environment.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MacroLanguageType |  The Macro language type.
MacroManager |  The Macro manager.
ModuleFolder |  The module folder.
ModuleStatus |  The module status.
Name |  The name of the module.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MacroModule
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetMacro |  Gets the macro with the give name.
GetMacroModuleIterator |  Returns a Macro module iterator that iterates through the collection.
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace