Revit 2027 API
ShapeImporter Class
 A utility class that supports conversion of geometry stored in an external format into a Revit geometry objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ShapeImporter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ShapeImporter : IDisposable
Public Class ShapeImporter
	Implements IDisposable
public ref class ShapeImporter : IDisposable
type ShapeImporter =
    class
        interface IDisposable
    end
The ShapeImporter type exposes the following members.
Constructors
Name | Description
ShapeImporter |  Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Top
Properties
Name | Description
DefaultLengthUnit |  The length unit to be used if not specified when the input is a unitless SAT file.
InputFormat |  The format of the incoming data.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Convert |  Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose | Releases all resources used by the ShapeImporter
IsServiceAvailable |  Checks whether the data conversion service and Material Library are available.
SetDefaultLengthUnit |  Sets the length unit to be used when the input is a unitless SAT file.
Top
Remarks
 See ShapeImporterSourceFormat for the list of supported formats.
Example
public void ReadSATFile(Document revitDoc)
{
    // Allow the user to select a SAT file.
    OpenFileDialog ofd = new OpenFileDialog();
    ofd.Filter = "SAT Files (*.sat)|*.sat";
    if (DialogResult.OK == ofd.ShowDialog())
    {
        ShapeImporter shapeImporter = new ShapeImporter();
        shapeImporter.InputFormat = ShapeImporterSourceFormat.SAT;
        IList<GeometryObject> shapes = shapeImporter.Convert(revitDoc, ofd.FileName);
        if (shapes.Count != 0)
        {
            using (Transaction tr = new Transaction(revitDoc, "Create a DirectShape"))
            {
                tr.Start();
                DirectShape dsImportedSat = DirectShape.CreateElement(revitDoc, new ElementId(BuiltInCategory.OST_Walls));
                dsImportedSat.SetShape(shapes);
                tr.Commit();
            }
        }
    }
}
See Also
Reference
Autodesk.Revit.DB Namespace