Revit 2027 API
ConduitSettings Methods
The ConduitSettings type exposes the following members.
Methods
Name | Description
GetConduitSettings |  Gets the conduit settings of the project.
Top
See Also
Reference
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace