Revit 2027 API
GenericForm Class
Provides access to the Generic Form model in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GenericForm : CombinableElement
Public Class GenericForm
	Inherits CombinableElement
public ref class GenericForm : public CombinableElement
type GenericForm =
    class
        inherit CombinableElement
    end
The GenericForm type exposes the following members.
Properties
Name | Description
IsSolid | Identifies if the GenericForm is a solid or a void element.
Name | Get and Set the Name property
(Overrides Element.Name)
Subcategory | The subcategory.
Visible | The visibility of the GenericForm.
Top
Methods
Name | Description
GetVisibility | Gets the visibility for the generic form.
SetVisibility | Sets the visibility for the generic form.
Top
Remarks
The Generic Form object can be queried for a generic form for use in family modeling and massing. It is the base class of Sweep, Blend, Extrusion, Revolution.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Blend
 Autodesk.Revit.DB.Extrusion
 Autodesk.Revit.DB.Form
 Autodesk.Revit.DB.FreeFormElement
 Autodesk.Revit.DB.Revolution
 Autodesk.Revit.DB.Sweep
 Autodesk.Revit.DB.SweptBlend