Revit 2027 API
PathReinforcement Methods
The PathReinforcement type exposes the following members.
Methods
Name | Description
ConvertRebarInSystemToRebars |  Converts all RebarInSystem elements owned by the input PathReinforcement to equivalent Rebar elements.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId) |  Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId, ElementId) |  Creates a new PathReinforcement object from an array of curves and given Rebar Shape id.
GetCurveElementIds |  Retrieves the set of ElementIds of curves forming the boundary of the Path Reinforcement.
GetHostId |  The element that contains the Path Reinforcement.
GetOrCreateDefaultRebarShape |  Creates a new RebarShape object with a default name or returns existing one which fulfills Path Reinforcement bending data requirements.
GetRebarInSystemIds |  Returns the ids of the RebarInSystem elements owned by the PathReinforcement element.
IsAlternatingLayerEnabled |  Checks if alternating bars are present in Path Reinforcement.
IsUnobscuredInView |  Checks if Path Reinforcement is shown unobscured in a view.
IsValidAlternatingBarOrientation |  Checks if orientation for alternating bars is valid.
IsValidPrimaryBarOrientation |  Checks if orientation for primary bars is valid.
IsValidRebarShapeId |  Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement.
RemovePathReinforcementSystem |  Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
SetUnobscuredInView |  Sets Path Reinforcement to be shown unobscured in a view.
Top
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace