Revit 2027 API
LineSegment Class
 An output node that represents a tessellated line segment.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LineSegment
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LineSegment : IDisposable
Public Class LineSegment
	Implements IDisposable
public ref class LineSegment : IDisposable
type LineSegment =
    class
        interface IDisposable
    end
The LineSegment type exposes the following members.
Properties
Name | Description
EndParameter |  Parameter associated with the end point.
EndPoint |  End point of the line segment.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LineProperties |  Access to the line (pen) properties of the line
StartParameter |  Parameter associated with the start point.
StartPoint |  Start point of the line segment.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LineSegment
Top
Remarks
 See also: OnLineSegment(LineSegment).
See Also
Reference
Autodesk.Revit.DB Namespace