Revit 2027 API
DocumentSynchronizingWithCentralEventArgs Class
 The event arguments used by the DocumentSynchronizingWithCentralEventArgs event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSynchronizingWithCentralEventArgs : RevitAPIPreDocEventArgs
Public Class DocumentSynchronizingWithCentralEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class DocumentSynchronizingWithCentralEventArgs : public RevitAPIPreDocEventArgs
type DocumentSynchronizingWithCentralEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The DocumentSynchronizingWithCentralEventArgs type exposes the following members.
Properties
Name | Description
Comments |  User's comments for synchronization.
Location |  Full path of the central model which is to be synchronized.
Options |  User's options associated with the synchronization operation.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace