Revit 2027 API
IntersectingElementData Methods
The IntersectingElementData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
IntersectingElementData Class
Autodesk.Revit.DB Namespace