Revit 2027 API
GeomCombinationSetIterator Methods
The GeomCombinationSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
GeomCombinationSetIterator Class
Autodesk.Revit.DB Namespace