Revit 2027 API
BarTypeDiameterOptions Methods
The BarTypeDiameterOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace