Revit 2027 API
WireConduitTypeSetIterator Class
An iterator to a conduit type set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireConduitTypeSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class WireConduitTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class WireConduitTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class WireConduitTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type WireConduitTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The WireConduitTypeSetIterator type exposes the following members.
Constructors
Name | Description
WireConduitTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace