Revit 2027 API
TriangulatedSolidOrShell Methods
The TriangulatedSolidOrShell type exposes the following members.
Methods
Name | Description
Dispose
GetShellComponent |  Returns the specified shell component of a solid or shell. Input componentIndex must lie between 0 and ShellComponentCount-1, inclusive. The returned TriangulatedShellComponent should not be modified by the caller.
Top
See Also
Reference
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace