Revit 2027 API
CircuitNamingSchemeSettings Properties
The CircuitNamingSchemeSettings type exposes the following members.
Properties
Name | Description
CircuitNamingSchemeId |  The circuit naming scheme id set in CircuitNamingSchemeSettings.
Top
See Also
Reference
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace