Revit 2027 API
LinearArray Properties
The LinearArray type exposes the following members.
Properties
Name | Description
NumMembers | Retrieves or changes the number of arrayed members. Array placeholder members in the family environment are not counted.
(Overrides BaseArray.NumMembers)
Top
See Also
Reference
LinearArray Class
Autodesk.Revit.DB Namespace