Revit 2027 API
Edge Properties
The Edge type exposes the following members.
Properties
Name | Description
ApproximateLength | Returns the approximate length of the edge.
Reference | Returns a stable reference to the edge.
Top
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace