Revit 2027 API
FileAccessException Methods
The FileAccessException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
FileAccessException Class
Autodesk.Revit.Exceptions Namespace