Revit 2027 API
ConduitSizeIterator Class
 An iterator to a set of conduit sizes from ConduitSizes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ConduitSizeIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConduitSizeIterator : IEnumerator<ConduitSize>
Public Class ConduitSizeIterator
	Implements IEnumerator(Of ConduitSize)
public ref class ConduitSizeIterator : IEnumerator<ConduitSize^>
type ConduitSizeIterator =
    class
        interface IEnumerator<ConduitSize>
    end
The ConduitSizeIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConduitSizeIterator
GetCurrent |  Returns the current ConduitSize.
HasCurrent |  Identifies if the iterator has a current item.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace