Revit 2027 API
MechanicalSystemType Methods
The MechanicalSystemType type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a mechanical system type and adds it to the document.
ValidateRiseDropSymbolType |  Confirms if the parameter is a valid HVAC rise/drop symbol type.
Top
See Also
Reference
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace