Revit 2027 API
PulldownButton Methods
The PulldownButton type exposes the following members.
Methods
Name | Description
AddPushButton | Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.
AddSeparator | Adds a separator to the drop-down list.
GetItems | Gets a copy of the collection of buttons assigned to the pulldown button.
Top
See Also
Reference
PulldownButton Class
Autodesk.Revit.UI Namespace