Revit 2027 API
FlexPipe Methods
The FlexPipe type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>) |  Creates a new flexible pipe into the document, using a point array and flex pipe type.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>) |  Creates a new flexible pipe into the document, using a point array and flex pipe type.
IsFlexPipeTypeId |  Checks if given type is valid flexible pipe type.
IsPipingSystemTypeId |  Checks if given type is valid piping system type.
Top
See Also
Reference
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace