Revit 2027 API
View3D Class
 Class for 3D views
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.View3D
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class View3D : View
Public Class View3D
	Inherits View
public ref class View3D : public View
type View3D =
    class
        inherit View
    end
The View3D type exposes the following members.
Properties
Name | Description
IsLocked |  Indicates if the view is locked.
IsPerspective |  Identifies whether this is a perspective view.
IsSectionBoxActive |  Identifies whether or not the section box is active in this 3D view.
ProjectGridsOnSectionBox |  This option projects all grids from the current 3d view on the bottom face of the section box. Only grids that are inside or intersects the section box
Top
Methods
Name | Description
CanResetCameraTarget |  Checks whether the camera target can be reset for this view.
CanSaveOrientation |  Returns true if the View3D's orientation can be saved, false otherwise.
CanToggleBetweenPerspectiveAndIsometric |  Checks whether this view can toggle between perspective and isometric.
CreateIsometric |  Returns a new isometric View3D.
CreatePerspective |  Returns a new perspective View3D.
GetLevelsThatShowGrids |  Returns the list of levels ids where grids are displayed in this 3D view.
GetOrientation |  Gets the current non-saved orientation of the View3D.
GetRenderingSettings |  Returns the current rendering settings for this 3d view.
GetSavedOrientation |  Gets the saved orientation of the View3D.
GetSectionBox |  Gets a copy of the section box for this 3D view.
HasBeenLocked |  Identifies if the view has ever been locked.
HideGridsOnLevel |  This method hides the grid lines in this 3D view on the given Level.
OrientTo |  Reorients the view to align with the forward direction.
ResetCameraTarget |  Resets the camera target to the center of the field of view.
RestoreOrientationAndLock |  Locks the view and restores its orientation.
SaveOrientation |  Converts the temporary orientation of the View3D into its saved orientation.
SaveOrientationAndLock |  Locks the view and saves its orientation
ScalePerspectiveCropBox |  Scale an existing crop box of the perspective view.
SetOrientation |  Sets the temporary orientation of the View3D. The new orientation is not saved in the document.
SetRenderingSettings |  Changes the rendering settings for this 3d view.
SetSectionBox |  Sets the section box for this 3D view.
ShowGridsOnLevel |  This method displays the grid lines in this 3DView on the given Level.
ShowGridsOnLevels |  This method displays the grid lines in this 3D view on the given Levels.
ToggleToIsometric |  Toggles this view to isometric.
ToggleToPerspective |  Toggles this view to perspective.
Unlock |  Unlocks the view. Has no effect if the view is already unlocked.
Top
Example
private void Getinfo_View3D(View3D view3D)
{
    string message = "View3D: ";
    // The position of the camera.
    XYZ eyePosition = view3D.GetOrientation().EyePosition;
    message += "\nCamera position: " + eyePosition;
    // Identifies whether the view is a perspective view.
    if (view3D.IsPerspective)
    {
        message += "\nThe view is a perspective view.";
    }
    // The section box of the 3D view can cut the model.
    if (view3D.IsSectionBoxActive)
    {
        BoundingBoxXYZ sectionBox = view3D.GetSectionBox();
        // Note that the section box can be rotated and transformed.
        // So the min/max corners coordinates relative to the model must be computed via the transform.
        Transform trf = sectionBox.Transform;
        XYZ max = sectionBox.Max; //Maximum coordinates (upper-right-front corner of the box before transform is applied).
        XYZ min = sectionBox.Min; //Minimum coordinates (lower-left-rear corner of the box before transform is applied).
        // Transform the min and max to model coordinates
        XYZ maxInModelCoords = trf.OfPoint(max);
        XYZ minInModelCoords = trf.OfPoint(min);
        message += "\nView has an active section box: ";
        message += "\n'Maximum' coordinates: " + maxInModelCoords;
        message += "\n'Minimum' coordinates: " + minInModelCoords;
    }
    TaskDialog.Show("Revit", message);
}
See Also
Reference
Autodesk.Revit.DB Namespace