Revit 2027 API
TableCellCalculatedValueData Class
 The TableCellCalculatedValueData stores the data for calculated value
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TableCellCalculatedValueData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TableCellCalculatedValueData : IDisposable
Public Class TableCellCalculatedValueData
	Implements IDisposable
public ref class TableCellCalculatedValueData : IDisposable
type TableCellCalculatedValueData =
    class
        interface IDisposable
    end
The TableCellCalculatedValueData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TableCellCalculatedValueData
GetName |  Gets the name of the calculated value.
Top
See Also
Reference
Autodesk.Revit.DB Namespace