Revit 2027 API
BaseArray Class
 An abstract base class that represents an array within the Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.BaseArray
 Autodesk.Revit.DB.LinearArray
 Autodesk.Revit.DB.RadialArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class BaseArray : Element
Public MustInherit Class BaseArray
	Inherits Element
public ref class BaseArray abstract : public Element
[<AbstractClassAttribute>]
type BaseArray =
    class
        inherit Element
    end
The BaseArray type exposes the following members.
Properties
Name | Description
Label | The family parameter label of the BaseArray.
Name | Get and Set the Name property
(Overrides Element.Name)
NumMembers | Retrieves or changes the number of the arrayed members.
Top
Methods
Name | Description
GetCopiedMemberIds | Retrieves the copied member Ids of the Array.
GetOriginalMemberIds | Retrieves the original member Ids of the Array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace