Revit 2027 API
IFCExtrusionData Methods
The IFCExtrusionData type exposes the following members.
Methods
Name | Description
AddLoop |  Adds a curve loop to the extrusion data.
ClearLoops |  Clears the curve loops stored in the extrusion data.
Dispose
GetLoops |  Gets the curve loops that form the base shape of the extrusion.
IsValid |  Determines if the extrusion data represents a valid extrusion.
RemoveLoopAt |  Removes the loop at the specified index.
Top
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace