Revit 2027 API
ModelCurveArrayIterator Class
An iterator to a model curve array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ModelCurveArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ModelCurveArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class ModelCurveArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ModelCurveArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ModelCurveArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ModelCurveArrayIterator type exposes the following members.
Constructors
Name | Description
ModelCurveArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace