Revit 2027 API
StructuralSectionPipeStandard Class
 Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionPipeStandard : StructuralSectionGeneralR
Public Class StructuralSectionPipeStandard
	Inherits StructuralSectionGeneralR
public ref class StructuralSectionPipeStandard : public StructuralSectionGeneralR
type StructuralSectionPipeStandard =
    class
        inherit StructuralSectionGeneralR
    end
The StructuralSectionPipeStandard type exposes the following members.
Constructors
Name | Description
StructuralSectionPipeStandard |  Creates a new instance of Structural Section Pipe Standard shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace