Revit 2027 API
ImageView Class
 Class for ImageView views
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.ViewDrafting
 Autodesk.Revit.DB.ImageView
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ImageView : ViewDrafting
Public Class ImageView
	Inherits ViewDrafting
public ref class ImageView : public ViewDrafting
type ImageView =
    class
        inherit ViewDrafting
    end
The ImageView type exposes the following members.
Properties
Name | Description
ImageInstanceId |  Id of the image in the view.
Top
Methods
Name | Description
Create |  Create an ImageView containing an image imported from disk.
Top
See Also
Reference
Autodesk.Revit.DB Namespace