Revit 2027 API
PhaseFilter Methods
The PhaseFilter type exposes the following members.
Methods
Name | Description
Create |  Creates a new phase filter with default status presentation.
GetPhaseStatusPresentation |  Gets the phase status presentation.
SetPhaseStatusPresentation |  Sets the phase status presentation.
Top
See Also
Reference
PhaseFilter Class
Autodesk.Revit.DB Namespace