Revit 2027 API
KeyBasedTreeEntriesIterator Class
 An iterator to a set of KeyBasedTreeEntry objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntriesIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntriesIterator : IEnumerator<KeyBasedTreeEntry>
Public Class KeyBasedTreeEntriesIterator
	Implements IEnumerator(Of KeyBasedTreeEntry)
public ref class KeyBasedTreeEntriesIterator : IEnumerator<KeyBasedTreeEntry^>
type KeyBasedTreeEntriesIterator =
    class
        interface IEnumerator<KeyBasedTreeEntry>
    end
The KeyBasedTreeEntriesIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the KeyBasedTreeEntriesIterator
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
Autodesk.Revit.DB Namespace