Revit 2027 API
IOException Methods
The IOException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
IOException Class
Autodesk.Revit.Exceptions Namespace