Revit 2027 API
StructuralSectionIWelded Class
 Defines parameters for I-shape Welded structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionIWelded : StructuralSectionRectangular
Public Class StructuralSectionIWelded
	Inherits StructuralSectionRectangular
public ref class StructuralSectionIWelded : public StructuralSectionRectangular
type StructuralSectionIWelded =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionIWelded type exposes the following members.
Constructors
Name | Description
StructuralSectionIWelded |  Creates a new instance of Structural Section I Welded shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BottomFlangeThickness |  Bottom Flange Thickness.
BottomFlangeWidth |  Bottom Flange Width.
TopFlangeThickness |  Top Flange Thickness.
TopFlangeWidth |  Top Flange Width.
WebHeight |  Web Height.
WebThickness |  Web Thickness.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace