Revit 2027 API
EmbodiedCarbonAsset Methods
The EmbodiedCarbonAsset type exposes the following members.
Methods
Name | Description
Dispose
EqualsEmbodiedCarbonOnly |  Determines whether this embodied carbon asset is equal to another, but ignore data from base class.
Top
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace