Revit 2027 API
PolyLine Properties
The PolyLine type exposes the following members.
Properties
Name | Description
NumberOfCoordinates | Gets the number of the coordinate points.
Top
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace