Revit 2027 API
FilterRule Methods
The FilterRule type exposes the following members.
Methods
Name | Description
Dispose
ElementPasses |  Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
GetRuleParameter |  Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
Top
See Also
Reference
FilterRule Class
Autodesk.Revit.DB Namespace