Revit 2027 API
MechanicalFitting Properties
The MechanicalFitting type exposes the following members.
Properties
Name | Description
PartType | The part type of the mechanical fitting.
Top
See Also
Reference
MechanicalFitting Class
Autodesk.Revit.DB.Mechanical Namespace