Revit 2027 API
StructuralSectionLAngle Properties
The StructuralSectionLAngle type exposes the following members.
Properties
Name | Description
BoltDiameterLongerFlange |  Maximum bolt hole diameter in the longer flange, in. (mm)
BoltDiameterShorterFlange |  Maximum bolt hole diameter in the shorter flange, in. (mm)
BoltSpacing1LongerFlange |  Standard bolt spacing first row in the longer flange, in. (mm)
BoltSpacing2LongerFlange |  Standard bolt spacing second row in the longer flange, in. (mm)
BoltSpacingShorterFlange |  Standard bolt spacing in the shorter flange, in. (mm)
Top
See Also
Reference
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace