Revit 2027 API
CoordinationModelLinkData Class
 A class containing link data for Coordination Model type element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalData.CoordinationModelLinkData
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CoordinationModelLinkData : IDisposable
Public Class CoordinationModelLinkData
	Implements IDisposable
public ref class CoordinationModelLinkData : IDisposable
type CoordinationModelLinkData =
    class
        interface IDisposable
    end
The CoordinationModelLinkData type exposes the following members.
Properties
Name | Description
DisplayPath |  The user visible saved path of the local or Autodesk Docs file referenced by the Coordination Model link.
 For a Coordination Model from Autodesk Docs, displayPath should be like "Autodesk Docs://AccountName/ProjectName/Project Files/Nested/3DView".
 For a local Coordination Model, displayPath should be like "c:\Models\local.nwc", when the saved path type is absolute.
 For a local Coordination Model, displayPath should be like "local.nwc", when the saved path type is relative.
FileId |  The id of the Autodesk Docs item defining this Coordination Model link.
 For a Coordination Model from Autodesk Docs, FileId is the id of the Autodesk Docs item defining this Coordination Model link.
 For a local Coordination Model, FileId has an empty value.
FileSize |  The size (in Megabytes) of the local nwc or .nwd file defining the Coordination Model link.
 For a Coordination Model from Autodesk Docs, size is empty.
 For a local Coordination Model, fileSize is the size (in Megabytes) of nwc or .nwd file.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ModelName |  The name of the model defining this Coordination Model link.
 For a Coordination Model from Autodesk Docs, ModelName is the name of the model where the 3D view defining this Coordination Model is found.
 For a local Coordination Model, ModelName is the name of the local .nwc or .nwd file.
ProjectId |  The id in the Data Management API of the Autodesk Docs project where the model view defining this Coordination Model link is found.
 For a Coordination Model from Autodesk Docs, ProjectId is the id in the Data Management API of the Autodesk Docs project where the model view is found.
 For a local Coordination Model, ProjectId has an empty value.
SourcePath |  The full source path of the external resource defining this Coordination Model link.
 For a Coordination Model from Autodesk Docs, sourcePath is the URN of the .svf file and it should look like "https://developer.api.autodesk.com/modelderivative/v2/designdata/dXJuOmFkc2sub2JqZWN0czpvcy5vYmplY3Q6Zm9yZ2UtYmxvZy1wb3N0L1VyYmFuSG91c2UtMjAxNS5ydnQ/manifest/urn:adsk.viewing:fs.file:dXJuOmFkc2sub2JqZWN0czpvcy5vYmplY3Q6Zm9yZ2UtYmxvZy1wb3N0L1VyYmFuSG91c2UtMjAxNS5ydnQ/output/Resource/3D_View/3D_Architectural 144171/3D_Architectural.svf".
 For a local Coordination Model, sourcePath is the absolute path on disk to the .nwc or .nwd file and it should look like "c:\Models\local.nwc".
VersionLabel |  The label of the last saved version of this Coordination Model Link in Revit document.
 For a Coordination Model from Autodesk Docs, VersionLabel is the label of the last saved version of this Coordination Model Link in Revit document.
 For a local Coordination Model, VersionLabel has an empty value.
ViewName |  The name of the Autodesk Docs view defining this Coordination Model.
 For a Coordination Model from Autodesk Docs, ViewName is the name of the view defining this Coordination Model.
 For a local Coordination Models, ViewName has an empty value.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CoordinationModelLinkData
GetCategoryNames |  Return the category names of all elements inside the current Coordination Model Link from Autodesk Docs.
GetPathType |  Returns the path type of the Coordination Model link.
 For a Coordination Model from Autodesk Docs, path type is Cloud.
 For a local Coordination Model, path type can be Absolute or Relative.
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace