Revit 2027 API
AssetPropertyDouble Class
 Represents a property of material.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDouble
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyDouble : AssetProperty
Public Class AssetPropertyDouble
	Inherits AssetProperty
public ref class AssetPropertyDouble : public AssetProperty
type AssetPropertyDouble =
    class
        inherit AssetProperty
    end
The AssetPropertyDouble type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
Methods
Name | Description
IsValidValue |  Checks that the value is a valid value for this property.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace