Revit 2027 API
CopyPasteOptions Class
 Settings to control the behavior of a copy-paste operation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CopyPasteOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CopyPasteOptions : IDisposable
Public Class CopyPasteOptions
	Implements IDisposable
public ref class CopyPasteOptions : IDisposable
type CopyPasteOptions =
    class
        interface IDisposable
    end
The CopyPasteOptions type exposes the following members.
Constructors
Name | Description
CopyPasteOptions |  Creates a new instance of a CopyPasteOptions object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CopyPasteOptions
GetDuplicateTypeNamesHandler |  Returns current duplicate type names handler or null if none is set.
SetDuplicateTypeNamesHandler |  Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
Top
See Also
Reference
Autodesk.Revit.DB Namespace