Revit 2027 API
Railing Properties
The Railing type exposes the following members.
Properties
Name | Description
CanReset |  True if the railing can be reset, False otherwise.
Flipped |  Indicates if the railing is flipped.
HasHost |  Indicates if the railing has a host.
HostId |  The host of the railing.
IsDefault |  Indicates if the railing is the default one that system generates.
TopRail |  The top rail of the railing.
Top
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace