Revit 2027 API
NumberingFormatSettings Class
 Settings associated with the formatting of a numbering schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingFormatSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NumberingFormatSettings : IDisposable
Public Class NumberingFormatSettings
	Implements IDisposable
public ref class NumberingFormatSettings : IDisposable
type NumberingFormatSettings =
    class
        interface IDisposable
    end
The NumberingFormatSettings type exposes the following members.
Constructors
Name | Description
NumberingFormatSettings() |  Create an empty NumberingFormatSettings object.
NumberingFormatSettings(NumberingFormatSettings) |  Copy a parameter and its association.
Top
Properties
Name | Description
AsCharacters |  True if the number is using characters, false for digits.
FirstNumberFormattingOption |  The formatting options for the start of a sequence.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MinimumNumberOfDigits |  Defines the minimum digit count for the numerical display.
NumberOfParameters |  A property defining the number of parameters used in this formatting settings object.
UppercaseCharacters |  if asCharacters is enabled, the characters will be presented as uppercase.
Top
Methods
Name | Description
Dispose | Releases all resources used by the NumberingFormatSettings
GetParameter |  Get the parameter at the provided index incorporated into the numeric label.
GetParameters |  Get parameters incorporated into the numeric label.
RemoveParameter |  Remove a parameter from a specific index. The position where the parameter to be removed.
SetParameter |  Set parameter incorporated into the numeric label. Parameter to be added into the label The position where the parameter to be added
SetParameters |  Set parameters incorporated into the numeric label.
Top
Remarks
This object contains all the formatting settings related to a numbering schema. The final number available on the element is generated for the user based on the parameters set with GetParameters/SetParameters on this object. The order for this parameter is the order in which their values will appear in the generated number. All the transformations applied to this values that are available are controlled from the NumberingFormattedParameter set with the above methods. The value assigned by the system will have the position of the parameter with the same id as the NumberingParameterId on the NumberingSchema. The AsCharacters property controls if in the final output the value assigned by the system will be presented as a set of letter(ex A for 1, B for 2, AA for 20) The MinimumNumberOfDigits property determines the minimum number of digits that will be used for the value assigned for the system if AsCharacters is false.
See Also
Reference
Autodesk.Revit.DB Namespace