Revit 2027 API
CurveExtents Class
 Represents the start and end parameters for a curve segment.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CurveExtents
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveExtents : IDisposable
Public Class CurveExtents
	Implements IDisposable
public ref class CurveExtents : IDisposable
type CurveExtents =
    class
        interface IDisposable
    end
The CurveExtents type exposes the following members.
Properties
Name | Description
EndParameter |  The end parameter of the curve extents.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StartParameter |  The start parameter of the curve extents.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CurveExtents
Top
See Also
Reference
Autodesk.Revit.DB Namespace