Revit 2027 API
AddInId Methods
The AddInId type exposes the following members.
Methods
Name | Description
Dispose
GetAddInName |  name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns
GetAddInNameFromDocument |  name of application associated with this ApplicationId First attempts to obtain the name from AddInIds stored in the document. If unsuccessful, attempts to obtain the name from loaded Third Party AddIns.
GetGUID |  value of the AddInId as a GUID
Top
See Also
Reference
AddInId Class
Autodesk.Revit.DB Namespace