Revit 2027 API
PrintSetup Properties
The PrintSetup type exposes the following members.
Properties
Name | Description
CurrentPrintSetting | The current Print Setting of Print Setup.
InSession | The in-session Print Setting of Print Setup.
Top
See Also
Reference
PrintSetup Class
Autodesk.Revit.DB Namespace