Revit 2027 API
IFCTransformSetter Methods
The IFCTransformSetter type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a transform setter.
Dispose
Initialize |  Initializes the transformation in the transform setter.
InitializeFromBoundingBox
Top
See Also
Reference
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace