Revit 2027 API
PipePressureDropData Class
 The input and output data used by external servers for calculation of the pipe pressure drop.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipePressureDropData
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipePressureDropData : IDisposable
Public Class PipePressureDropData
	Implements IDisposable
public ref class PipePressureDropData : IDisposable
type PipePressureDropData =
    class
        interface IDisposable
    end
The PipePressureDropData type exposes the following members.
Properties
Name | Description
CategoryId |  The category id of pipe curves. It will be OST_PipeCurves, OST_FlexPipeCurves, or OST_PlaceHolderPipes.
Coefficient |  The coefficient of the pipe.
Density |  The density of the pipe. Units: (kg/ft³).
Flow |  The flow of the pipe. Units: (ft³/s).
FlowState |  The flowState of the pipe.
Friction |  The friction of the pipe. Units: (kg/(ft²·s²)).
FrictionFactor |  The friction factor of the pipe.
InsideDiameter |  The inside diameter of the pipe. Units: (ft).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
KLevel |  The system calculation level.
Length |  The length of the pipe. Units: (ft).
NominalDiameter |  The nominal diameter of the pipe. Units: (ft).
OutsideDiameter |  The outside diameter of the pipe. Units: (ft).
PressureDrop |  The pressure drop of the pipe. Units: (kg/(ft·s²)).
RelativeRoughness |  The relative roughness of the pipe.
ReynoldsNumber |  The reynolds number of the pipe.
Roughness |  The roughness of the pipe. Units: (ft).
Velocity |  The velocity of the pipe. Units: (ft/s).
VelocityPressure |  The velocity pressure of the pipe. Units: (kg/(ft·s²)).
Viscosity |  The dynamic viscosity of the pipe. Units: (kg/(ft·s)).
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipePressureDropData
Top
Remarks
 Roughness, Length, Flow, Diameter, Density, and Viscosity field values are input data for the calculation. ReynoldsNumber, FlowStatus, Friction, FrictionFactor, Velocity, Coefficient, and PressureDrop are output values.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace