Revit 2027 API
SketchedStairsCurveData Methods
The SketchedStairsCurveData type exposes the following members.
Methods
Name | Description
Dispose
GetCurve |  Get a copy of the curve that is formed along this boundary.
Top
See Also
Reference
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace