Revit 2027 API
StructuralSectionLProfile Class
 Defines parameters for L profile structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionLProfile : StructuralSectionGeneralLA
Public Class StructuralSectionLProfile
	Inherits StructuralSectionGeneralLA
public ref class StructuralSectionLProfile : public StructuralSectionGeneralLA
type StructuralSectionLProfile =
    class
        inherit StructuralSectionGeneralLA
    end
The StructuralSectionLProfile type exposes the following members.
Constructors
Name | Description
StructuralSectionLProfile |  Creates a new instance of Structural Section L Profile shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace