Revit 2027 API
GraphicsStyle Class
The graphics style instance in Autodesk Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.GraphicsStyle
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GraphicsStyle : Element
Public Class GraphicsStyle
	Inherits Element
public ref class GraphicsStyle : public Element
type GraphicsStyle =
    class
        inherit Element
    end
The GraphicsStyle type exposes the following members.
Properties
Name | Description
GraphicsStyleCategory | The graphics style category.
GraphicsStyleType | The graphics style type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace