Revit 2027 API
GroupSetIterator Class
An iterator to a group set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GroupSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class GroupSetIterator : APIObject,
	IEnumerator
Public MustInherit Class GroupSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class GroupSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type GroupSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The GroupSetIterator type exposes the following members.
Constructors
Name | Description
GroupSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace