Revit 2027 API
ImageTypeOptions Methods
The ImageTypeOptions type exposes the following members.
Methods
Name | Description
Dispose
IsValid |  If true the ImageTypeOptions can be used to create or reload an ImageType.
SetExternalResourceReference |  Update the external resource reference to an image.
SetPath(String)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
SetPath(String, Boolean)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location.
Additionally, indicate whether the path used by ImageType should be absolute or relative.
Top
See Also
Reference
ImageTypeOptions Class
Autodesk.Revit.DB Namespace