Revit 2027 API
ReinforcementRoundingManager Methods
The ReinforcementRoundingManager type exposes the following members.
Methods
Name | Description
Dispose
GetLengthUnitTypeId |  Gets the identifier of the length unit quantifying the reinforcement rounding values.
Top
See Also
Reference
ReinforcementRoundingManager Class
Autodesk.Revit.DB.Structure Namespace