Revit 2027 API
UnauthenticatedException Methods
The UnauthenticatedException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
UnauthenticatedException Class
Autodesk.Revit.Exceptions Namespace