Revit 2027 API
Categories Properties
The Categories type exposes the following members.
Properties
Name | Description
IsEmpty | Whether or not the list of top-level categories is empty.
(Overrides CategoryNameMap.IsEmpty)
Item[BuiltInCategory] |  Retrieves a category object corresponding to a BuiltInCategory id.
Item[String] | Gets a category which has the specified name from this list of top-level categories.
(Overrides CategoryNameMap.Item[String])
Size | The total number of top-level categories in the document.
(Overrides CategoryNameMap.Size)
Top
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace