Revit 2027 API
VertexIndexPairArray Properties
The VertexIndexPairArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a VertexIndex pair at a specified index within the array.
Size | Returns the number of VertexIndex pairs that are in the array.
Top
See Also
Reference
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace