Revit 2027 API
Document Class
 An object that represents an open Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Document
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Document : IDisposable
Public Class Document
	Implements IDisposable
public ref class Document : IDisposable
type Document =
    class
        interface IDisposable
    end
The Document type exposes the following members.
Properties
Name | Description
ActiveProjectLocation | Retrieve the active project location.
ActiveView | The document's active view.
Application | Returns the Application in which the Document resides.
Create | An object that can be used to create new instances of Autodesk Revit API elements within a project.
CreationGUID |  A unique identifier generated when the Document was first created.
DisplayUnitSystem | Provides access to display unit type with in the document.
FamilyCreate | An object that can be used to create new instances of Autodesk Revit API elements within a family document.
FamilyManager | The family manager object provides access to family types and parameters.
IsDetached |  Identifies if a workshared document is detached. Also, see IsWorkshared
IsFamilyDocument | Identifies if the current document is a family document.
IsLinked |  Identifies if a document is a linked RVT.
IsModelInCloud |  Identifies if document is stored on Autodesk cloud services.
IsModifiable |  Identifies if the document is modifiable.
IsModified |  The state of changes made to the document.
IsReadOnly |  Identifies if the document is read-only or can possibly be modified.
IsReadOnlyFile |  Signals whether the document was opened from a read-only file.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
IsWorkshared |  Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document. Also, see IsDetached
MassDisplayTemporaryOverride |  This setting controls temporary display in views of objects with mass category or subcategories.
MullionTypes | This property is used to retrieve all the mullion types in current system.
OwnerFamily | Get the Family of this Family Document.
PanelTypes | Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project.
ParameterBindings | Retrieves an object from which mappings between parameter definitions and categories can be found.
PathName |  The fully qualified path of the document's disk file.
Phases | Retrieves all of the phases in the document.
PlanTopologies | Get the PlanTopologies of the current project in the last phase.
PlanTopologies[Phase] | Gets the PlanTopologies of the current project in a given phase.
PlanTopology[Level] | Get the PlanTopology of a given level in the last phase.
PlanTopology[Level, Phase] | Get the PlanTopology of a given level in a given phase.
PrintManager |  Retrieve the PrintManager of current project.
ProjectInformation | Return the Project Information of the current project.
ProjectLocations | Retrieve all the project locations associated with this project
ReactionsAreUpToDate | Reports if the analytical model has regenerated in a document with reaction loads.
Settings | Provides access to general application settings, such as Categories.
SiteLocation | Returns the site location information.
Title |  The document's title.
TypeOfStorage | Get the storage type of the specified BuiltInParameter.
WorksharingCentralGUID |  The central GUID of the server-based model.
Top
Methods
Name | Description
AcquireCoordinates |  Acquires coordinates from the specified link instance.
AutoJoinElements | Forces the elements in the Revit document to automatically join to their neighbors where appropriate.
CanEnableCloudWorksharing |  Checks if cloud worksharing can be enabled for the cloud model.
CanEnableWorksharing |  Checks if worksharing can be enabled in the document.
Close() | Closes the document, save the changes if there are.
Close(Boolean) | Closes the document with the option to save.
CombineElements | Combine a set of combinable elements into a geometry combination.
ConvertDetailToModelCurves | Converts a group of DetailCurves to equivalent ModelCurves.
ConvertModelToDetailCurves | Converts a group of ModelCurves to equivalent DetailCurves.
ConvertModelToSymbolicCurves | Converts a group of ModelCurves to equivalent SymbolicCurves.
ConvertSymbolicToModelCurves | Converts a group of SymbolicCurves to equivalent ModelCurves.
Delete(ElementId) |  Deletes an element from the document given the id of that element.
Delete(ICollection<ElementId>) |  Deletes a set of elements from the document.
Dispose | Releases all resources used by the Document
EditFamily | Gets the document of a loaded family to edit.
EnableCloudWorksharing |  Enables cloud worksharing for a cloud model
EnableWorksharing |  Enables worksharing in the document.
Equals |  Determines whether the specified Object equals to this Object.
(Overrides Object.Equals(Object))
EraseSchemaAndAllEntities |  Erases Schema and all its Entities from the document.
Export(String, IList<ElementId>, PDFExportOptions) |  Exports a selection of views in PDF format.
Export(String, String, GBXMLExportOptions) |  Export the model in gbXML (green-building) format.
Export(String, String, IFCExportOptions) |  Exports the document to the Industry Standard Classes (IFC) format.
Export(String, String, NavisworksExportOptions) |  Exports a Revit project to the Navisworks .nwc format.
Export(String, String, OBJExportOptions) |  Exports a view specified in the export options to the OBJ format.
Export(String, String, STEPExportOptions) |  Exports the current view or a selection of views in STEP format.
Export(String, String, STLExportOptions) |  Exports a view specified in the export options to the STL format.
Export(String, String, ViewSet, DWFExportOptions) | Exports the current view or a selection of views in DWF format.
Export(String, String, ViewSet, DWFXExportOptions) | Exports the current view or a selection of views in DWFX format.
Export(String, String, ViewSet, FBXExportOptions) | Exports the document in 3D-Studio Max (FBX) format.
Export(String, String, ICollection<ElementId>, DGNExportOptions) |  Exports a selection of views in DGN format.
Export(String, String, ICollection<ElementId>, DWGExportOptions) |  Exports a selection of views in DWG format.
Export(String, String, ICollection<ElementId>, DXFExportOptions) |  Exports a selection of views in DXF format.
Export(String, String, ICollection<ElementId>, SATExportOptions) |  Exports the current view or a selection of views in SAT format.
ExportImage |  Exports a view or set of views into an image file.
GetActiveEditMode |  Returns the document's active edit mode. Returns None if no edit mode is currently active.
GetAllUnusedElements |  Returns the list of element ids that are not used. The list of unused element ids may include elements that can't be deleted.
GetChangedElements |  Extracts a collection containing the ids of elements that have been created, modified or deleted between the input baseVersion and the document's current version.
GetCloudFolderId |  Gets ForgeDM folder id where the model locates.
GetCloudModelPath |  Gets the cloud model path of the cloud model.
GetCloudModelUrn |  A ForgeDM Urn identifying the model.
GetDefaultElementTypeId |  Gets the default element type id with the given DefaultElementType id.
GetDefaultFamilyTypeId |  Gets the default family type id with the given family category id.
GetDocumentPreviewSettings |  Returns the preview settings for the given document.
GetDocumentVersion |  Gets the DocumentVersion that corresponds to a document.
GetElement(ElementId) |  Gets the Element referenced by the input ElementId.
GetElement(Reference) |  Gets the Element referenced by the input reference.
GetElement(String) |  Gets the Element referenced by a unique id string.
GetHashCode |  Gets the hash code of this document instance.
(Overrides Object.GetHashCode())
GetHubId |  Gets ForgeDM hub id where the model locates. It is cached in session.
GetPaintedMaterial |  Get the material painted on the element's face. Returns invalidElementId if the face is not painted.
GetPrintSettingIds |  Retrieves all Print Settings of current project.
GetProjectId |  Gets ForgeDM project id where the model locates.
GetRoomAtPoint(XYZ) | Gets a room containing the point.
GetRoomAtPoint(XYZ, Phase) | Gets a room containing the point.
GetSpaceAtPoint(XYZ) | Gets a space containing the point.
GetSpaceAtPoint(XYZ, Phase) | Gets a space containing the point.
GetSubelement(Reference) |  Gets the subelement referenced by the input reference.
GetSubelement(String) |  Gets the subelement referenced by a unique id string.
GetSubelement(ElementId, Int32) |  Gets the subelement referenced by a parent id and subelement id.
GetTypeOfStorage |  Get the storage type of the identified built-in parameter.
GetUnits |  Gets the Units object.
GetUnusedElements |  Returns the list of element ids that are not used and can be deleted from the document.
GetWarnings |  Returns list of failure messages generated from persistent (reviewable) warnings accumulated in the document.
GetWorksetId |  Get Id of the Workset which owns the element.
GetWorksetTable |  Get the WorksetTable of this document.
GetWorksharingCentralModelPath |  Gets the central model path of the worksharing model.
HasAllChangesFromCentral |  Returns whether the model in the current session is up to date with central.
Import(String, GBXMLImportOptions) | Imports a Green-Building XML file into the document.
Import(String, AXMImportOptions, View) | Obsolete.
 Imports an AXM file into the document.
Import(String, ImportOptions3DM, View) |  Imports a 3DM file into the document.
Import(String, OBJImportOptions, View) |  Imports an OBJ file into the document.
Import(String, SATImportOptions, View) |  Imports an SAT file into the document.
Import(String, SKPImportOptions, View) |  Imports a SKP file into the document.
Import(String, STEPImportOptions, View) |  Imports a STEP file into the document.
Import(String, STLImportOptions, View) |  Imports an STL file into the document.
Import(String, DGNImportOptions, View, ElementId) |  Imports a DGN file to the document.
Import(String, DWGImportOptions, View, ElementId) |  Imports a DWG or DXF file to the document.
IsBackgroundCalculationInProgress |  Indicates whether there are any background calculations in progress for this document.
IsDefaultElementTypeIdValid |  Checks whether the element type id is valid for the give DefaultElmentType id.
IsDefaultFamilyTypeIdValid |  Checks whether the family type id is valid for the give family category.
IsInEditMode |  Indicates if the document is in an edit mode.
IsPainted |  Checks if the element's face is painted with a material.
IsValidVersionGUID |  Checks whether the GUID is valid for the given document. Empty GUID is allowed.
Link(String, DWFImportOptions) |  Links Markups in a DWF file into the project document.
Link(String, ImportOptions3DM, View) |  Links a 3DM file into the project document.
Link(String, OBJImportOptions, View) |  Links an OBJ file into the project document.
Link(String, SATImportOptions, View) |  Links an SAT file into the project document.
Link(String, SKPImportOptions, View) |  Links a SKP file into the project document.
Link(String, STEPImportOptions, View) |  Links an STEP file into the project document.
Link(String, STLImportOptions, View) |  Links an STL file into the project document.
Link(String, DGNImportOptions, View, ElementId) |  Links a DGN file into the project document.
Link(String, DWGImportOptions, View, ElementId) |  Links a DWG or DXF file into the project document.
LoadFamily(Document) |  Loads the contents of this family document into another document.
LoadFamily(String) | Loads an entire family and all its types/symbols into the document.
LoadFamily(Document, IFamilyLoadOptions) |  Loads the contents of this family document into another document.
LoadFamily(String, Family) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
LoadFamily(String, IFamilyLoadOptions, Family) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
LoadFamilySymbol(String, String) | Loads only a specified family type/symbol from a family file into the document.
LoadFamilySymbol(String, String, FamilySymbol) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol.
MakeTransientElements |  This method encapsulates the process of creating transient elements in the document.
Paint(ElementId, Face, ElementId) |  Paint the element's face with specified material.
Paint(ElementId, Face, FamilyParameter) |  Paint the element's face with specified material.
PostFailure |  Posts a failure to be displayed to the user at the end of transaction.
Print(ViewSet) | Prints a set of views with default view template and default print settings.
Print(ViewSet, View) | Prints a set of views with a specified view template and default print settings.
Print(ViewSet, Boolean) | Prints a set of views with default view template and default print settings.
Print(ViewSet, View, Boolean) | Prints a set of views with a specified view template and default print settings.
PublishCoordinates |  Publish coordinates to the specified ProjectLocation of the link instance.
Regenerate | Updates the elements in the Revit document to reflect all changes.
ReloadLatest |  Fetches changes from central (due to one or more synchronizations with central) and merges them into the current session.
RemovePaint |  Remove the material painted on the element's face. If the face is currently not painted,it will do nothing.
ResetSharedCoordinates |  Reset shared coordinates for the host model/file.
Save() |  Saves the document.
Save(SaveOptions) |  Saves the document.
SaveAs(String) |  Saves the document to a given file path.
SaveAs(ModelPath, SaveAsOptions) |  Saves the document to a given path.
SaveAs(String, SaveAsOptions) |  Saves the document to a given file path.
SaveAsCloudModel |  Saves current non-workshared or workshared model as a cloud model or workshared cloud model.
SaveCloudModel |  Saves cloud model.
SaveToProjectAsImage |  Creates an image view from the currently active view.
SeparateElements | Separate a set of combinable elements out of combinations they currently belong to.
SetDefaultElementTypeId |  Sets the default element type id of the given DefaultElementType id.
SetDefaultFamilyTypeId |  Sets the default family type id for the given family category.
SetUnits |  Sets the units.
SynchronizeWithCentral |  Performs reload latest until the model in the current session is up to date and then saves changes back to central. A save to central is performed even if no changes were made.
UnpostFailure |  Deletes the posted failure message associated with a given FailureMessageKey.
Top
Events
Name | Description
DocumentClosing |  Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
DocumentPrinted |  Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
DocumentPrinting |  Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
DocumentSaved |  Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
DocumentSavedAs |  Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
DocumentSaving |  Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
DocumentSavingAs |  Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
ViewPrinted |  Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
ViewPrinting |  Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
Top
Remarks
 The Document object represents an Autodesk Revit project. Revit can have multiple projects open and multiple views to those projects. The active or top most view will be the active project and hence the active document which is available from the Application object.
See Also
Reference
Autodesk.Revit.DB Namespace