Revit 2027 API
GlobalParametersManager Methods
The GlobalParametersManager type exposes the following members.
Methods
Name | Description
AreGlobalParametersAllowed |  Tests whether global parameters are allowed in the given document.
Dispose
FindByName |  Finds whether a global parameter with the given name exists in the input document.
GetAllGlobalParameters |  Returns all global parameters available in the given document.
GetGlobalParametersOrdered |  Returns all global paramters in an ordered array.
IsUniqueName |  Tests whether a name is unique among existing global parameters of a given document.
IsValidGlobalParameter |  Tests whether an ElementId is of a global parameter in the given document.
MoveParameterDownOrder |  Moves given paramerer Down in the current order.
MoveParameterUpOrder |  Moves given paramerer Up in the current order.
SortParameters |  Sorts global parameters in the desired order.
Top
See Also
Reference
GlobalParametersManager Class
Autodesk.Revit.DB Namespace