Revit 2027 API
StructuralSectionGeneralLZ Properties
The StructuralSectionGeneralLZ type exposes the following members.
Properties
Name | Description
BottomFlangeLength |  Bottom Flange segment length.
LipLength |  Lip segment length.
Top
See Also
Reference
StructuralSectionGeneralLZ Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace