Revit 2027 API
FabricationConfigurationInfo Methods
The FabricationConfigurationInfo type exposes the following members.
Methods
Name | Description
Dispose
FindSourceFabricationConfiguration |  Finds the source fabrication configuration on disk which matches the input fabrication configuration.
GetAllFabricationConfigurations |  Gets all added fabrication configurations.
GetProfiles |  Return the profiles in the fabrication configuration.
IsValid |  Checks if the fabrication configuration is valid.
Top
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace