Revit 2027 API
SketchedStairsCurveData Class
 Sketched run/landing curves overrides with height and slope
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SketchedStairsCurveData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SketchedStairsCurveData : IDisposable
Public Class SketchedStairsCurveData
	Implements IDisposable
public ref class SketchedStairsCurveData : IDisposable
type SketchedStairsCurveData =
    class
        interface IDisposable
    end
The SketchedStairsCurveData type exposes the following members.
Constructors
Name | Description
SketchedStairsCurveData |  Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SketchedStairsCurveData
GetCurve |  Get a copy of the curve that is formed along this boundary.
Top
See Also
Reference
Autodesk.Revit.DB Namespace