Revit 2027 API
UIView Methods
The UIView type exposes the following members.
Methods
Name | Description
Close |  Closes the view.
Dispose
GetWindowRectangle |  Gets the rectangle containing the coordinates of the view's drawing area.
GetZoomCorners |  Gets the corners of the view's rectangle. The two points that define the corners of the view's rectangle in model coordinates.
Zoom |  Zoom the view.
ZoomAndCenterRectangle |  Zoom and center the view to a specified rectangle.
ZoomSheetSize |  Zoom to the sheet size.
ZoomToFit |  Zoom the view to fit its contents.
Top
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace