Revit 2027 API
HVACLoadBuildingType Class
 The type element of building.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.HVACLoadType
 Autodesk.Revit.DB.Analysis.HVACLoadBuildingType
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HVACLoadBuildingType : HVACLoadType
Public Class HVACLoadBuildingType
	Inherits HVACLoadType
public ref class HVACLoadBuildingType : public HVACLoadType
type HVACLoadBuildingType =
    class
        inherit HVACLoadType
    end
The HVACLoadBuildingType type exposes the following members.
Properties
Name | Description
BuildingTypeName |  The building type name.
ClosingTime |  The closing time of the building type.
OpeningTime |  The opening time of the building type.
UnoccupiedCoolingSetPoint |  The unoccupied cooling set point of the building type with unit kelvin (K).
Top
Methods
Name | Description
Create |  Creates a building type element.
IsNameUnique(String) |  Determines whether a potential building type name is unique.
IsNameUnique(Document, String) |  Determines whether a potential building type name is unique.
IsValidTime |  Check if the string can be parsed to a valid time for opening time and closing time. A valid string can be "16:30" or "4:30 PM";
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace