Revit 2027 API
AXMImportOptions Properties
The AXMImportOptions type exposes the following members.
Properties
Name | Description
ImportLevels |  Indicate if levels are to be imported. False by default.
Top
See Also
Reference
AXMImportOptions Class
Autodesk.Revit.DB Namespace