Revit 2027 API
PointRelativeToPoint Class
Represents a point placed relative to another point.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointElementReference
 Autodesk.Revit.DB.PointRelativeToPoint
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PointRelativeToPoint : PointElementReference
Public Class PointRelativeToPoint
	Inherits PointElementReference
public ref class PointRelativeToPoint : public PointElementReference
type PointRelativeToPoint =
    class
        inherit PointElementReference
    end
The PointRelativeToPoint type exposes the following members.
Methods
Name | Description
GetHostPointReference | Get a copy of the host point reference.
SetHostPointReference | Change the host point reference.
Top
Remarks
 For this release, the only workflow supported is that the point is placed coincident with the referenced host (a relative transformation of Transform.Identity).
See Also
Reference
Autodesk.Revit.DB Namespace