Revit 2027 API
CableTraySizes Class
 Cable tray sizes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CableTraySizes
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTraySizes : Element,
	IEnumerable<MEPSize>
Public Class CableTraySizes
	Inherits Element
	Implements IEnumerable(Of MEPSize)
public ref class CableTraySizes : public Element,
	IEnumerable<MEPSize^>
type CableTraySizes =
    class
        inherit Element
        interface IEnumerable<MEPSize>
    end
The CableTraySizes type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddSize |  Inserts a new MEPSize into the cable tray sizes. For cable tray, the nominal diameter of MEPSize is used .
ClearAll |  Removes all MEPSizes in the cable tray sizes.
Contains |  Checks whether a cable tray size with the nominal diameter exists.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetCableTraySizes |  Gets the cable tray sizes of the project.
GetCableTraySizesIterator |  Returns a CableTraySizeIterator to the MEP cable tray sizes.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetSizeCount |  Gets the size count of the cable tray size table.
RemoveSize |  Erases the existing MEPSize. For cable tray, the nominal diameter is used in MEPSize.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace