Revit 2027 API
PulldownButton Class
The PulldownButton object represents a button with a drop-down list on RibbonPanel.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonItem
 Autodesk.Revit.UI.RibbonButton
 Autodesk.Revit.UI.PulldownButton
 Autodesk.Revit.UI.SplitButton
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PulldownButton : RibbonButton
Public Class PulldownButton
	Inherits RibbonButton
public ref class PulldownButton : public RibbonButton
type PulldownButton =
    class
        inherit RibbonButton
    end
The PulldownButton type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddPushButton | Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.
AddSeparator | Adds a separator to the drop-down list.
GetItems | Gets a copy of the collection of buttons assigned to the pulldown button.
Top
Remarks
Use of this class is not supported in Revit Macros.
See Also
Reference
Autodesk.Revit.UI Namespace