Revit 2027 API
FamilyPointPlacementReference Class
 This object represents data corresponding to the placement references in a certain types of Family Instances (see examples listed below).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyPointPlacementReference
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyPointPlacementReference : APIObject
Public Class FamilyPointPlacementReference
	Inherits APIObject
public ref class FamilyPointPlacementReference : public APIObject
type FamilyPointPlacementReference =
    class
        inherit APIObject
    end
The FamilyPointPlacementReference type exposes the following members.
Properties
Name | Description
Location |  The location of the point.
Name |  The name of the corresponding reference point in the Family document.
PointReference |  The reference on which the point depends on.
Top
Methods
Name | Description
Top
Remarks
Examples of FamilyInstance objects that contain placement references are Panels and Flexible Components.
See Also
Reference
Autodesk.Revit.DB Namespace