Revit 2027 API
InapplicableDataException Class
The exception that is thrown when attempting to access a piece of data that is structurally not part of an object at the moment.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.InapplicableDataException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InapplicableDataException : InvalidOperationException
<SerializableAttribute>
Public Class InapplicableDataException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class InapplicableDataException : public InvalidOperationException
[<SerializableAttribute>]
type InapplicableDataException =
    class
        inherit InvalidOperationException
    end
The InapplicableDataException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace