Revit 2027 API
CompoundStructure Class
 Describes the internal structure of a wall, floor, roof or ceiling.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CompoundStructure
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CompoundStructure : IDisposable
Public Class CompoundStructure
	Implements IDisposable
public ref class CompoundStructure : IDisposable
type CompoundStructure =
    class
        interface IDisposable
    end
The CompoundStructure type exposes the following members.
Properties
Name | Description
CutoffHeight |  Horizontal segments below or at the cutoff height have their distance to the wall bottom fixed, those above have their distance to the wall top fixed.
EndCap |  Indicates the end cap condition defining which shell layers will participate in end wrapping.
HasStructuralDeck |  Checks if the compound structure has a structural deck.
IsEmpty |  Checks whether this CompoundStructure is empty.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
IsVerticallyCompound |  Identifies if this CompoundStructure represents a layout that is more complicated than a simple set of parallel layers.
LayerCount |  Returns the number of layers contained in this CompoundStructure.
MinimumSampleHeight |  The minimum sample height determined by the current sample height and the horizontal segments.
OpeningWrapping |  Indicates the opening wrapping condition defining which shell layers of a wall, in plan view, wrap at inserts and openings.
SampleHeight |  The sample height is the presumed height of the wall to which the data in this CompoundStructure is applied.
StructuralMaterialIndex |  Indicates the layer whose material defines the structural properties of the type for the purposes of analysis.
VariableLayerIndex |  Indicates the index of the layer which is designated as variable.
Top
Methods
Name | Description
AddWallSweep |  Adds a new wall sweep or reveal to the compound structure.
AssociateRegionWithLayer |  Associates a region with a layer.
CanLayerBeStructuralMaterial |  Identifies if the input layer can be designated as defining the structural material for this structure.
CanLayerBeVariable |  Identifies if the input layer can be designated as a variable thickness layer.
CanLayerWidthBeNonZero |  Identifies if changing the width of an existing layer from zero to a positive value will create a rectangular region.
CanSplitAndMergeRegionsBeUsed |  Checks whether split and merge regions operations can be used for this compound structure.
ChangeRegionWidth |  Adjust the width of an existing simple region.
ClearWallSweeps |  Removes all sweeps or reveals from the compound structure.
CreateSimpleCompoundStructure |  Creates a non-vertically compound structure comprised of parallel layers.
CreateSingleLayerCompoundStructure(MaterialFunctionAssignment, Double, ElementId) |  Creates a CompoundStructure containing a single layer.
CreateSingleLayerCompoundStructure(Double, MaterialFunctionAssignment, Double, ElementId) |  Creates a vertically compound CompoundStructure with one layer.
DeleteLayer |  Deletes the specified layer from this CompoundStructure.
Dispose | Releases all resources used by the CompoundStructure
FindEnclosingRegionAndSegments |  Given a pair of grid coordinates, and a direction for splitting, returns the enclosing region and the two segments intersected by a line through the grid point.
GetAdjacentRegions |  Gets the ids of region bound to a specified segment.
GetCoreBoundaryLayerIndex |  Returns the index of the layer just below the core boundary.
GetDeckEmbeddingType |  Retrieves the deck embedding type used for the specified structural deck.
GetDeckProfileId |  Retrieves the profile loop used for the specified structural deck.
GetExtendableRegionIds |  Gets the extendable region ids for the compound structure.
GetFirstCoreLayerIndex |  Gets the index of the first core layer.
GetLastCoreLayerIndex |  Gets the index of the last core layer.
GetLayerAssociatedToRegion |  Gets the layer associated to a particular region.
GetLayerFunction |  Retrieves the function of the specified layer.
GetLayerPriority |  Retrieves the priority of the specified layer. Index of a layer in the CompoundStructure. The layer index is zero based. It counts from the exterior of wall and from the top of roofs, floors and ceilings.
GetLayers |  A copy of the layers which define this compound structure.
GetLayerWidth |  Retrieves the width of a specified layer.
GetMaterialId |  Retrieves the material element id of a specified layer.
GetMinimumLayerThickness |  Get the minimum allowable layer thickness.
GetNumberOfShellLayers |  Retrieves the number of interior or exterior shell layers.
GetOffsetForLocationLine |  Returns the offset from the center of the compound structure to the given location line value.
GetPreviousNonZeroLayerIndex |  Returns the index of the nearest non-zero width layer before this layer.
GetRegionEnvelope |  Gets the envelope that a specified region spans.
GetRegionIds |  Gets the region ids of this compound structure.
GetRegionsAlongLevel |  Returns the ids of the regions encountered as the vertically compound structure is traversed at a constant height above the bottom a wall to which this structure is applied.
GetRegionsAssociatedToLayer |  Gets the set of region ids associated to a particular layer.
GetSegmentCoordinate |  Gets the coordinate of a segment.
GetSegmentEndPoints |  Gets the end points of a segment.
GetSegmentIds |  Gets the segment ids of this compound structure.
GetSegmentOrientation |  Gets the orientation of a segment.
GetSimpleCompoundStructure |  Takes a horizontal slice through a sample wall to which this CompoundStructure is applied and returns a simple compound structure which describes that slice, i.e. a series of parallel layers.
GetWallSweepsInfo |  Obtains a list of the intrinsic wall sweeps or reveals in this CompoundStructure.
GetWidth() |  The width implied by this compound structure.
GetWidth(Int32) |  Computes the width of the envelope (2d bounding box) of the specified region.
IsCoreLayer |  Checks if the specified layer is a core layer.
IsEqual |  Checks whether this CompoundStructure is the same as another CompoundStructure.
IsLayerValid |  Verifies that the data in this layer is internally consistent.
IsRectangularRegion |  Determines whether the specified region is rectangular.
IsSimpleRegion |  Determines whether the region is a simple region in this CompoundStructure.
IsStructuralDeck |  Determines whether a specified layer is a structural deck.
IsValid |  Checks for errors or inconsistencies in the data in this CompoundStructure.
IsValidLayerPriority |  Checks if the layer priority is valid to match the function.
IsValidRegionId |  Determines whether the specified integer is actually the id of a region in this CompoundStructure.
IsValidSampleHeight |  Is the specified height a valid sample height for this compound structure?
IsValidSegmentId |  Determines whether the specified integer is actually the id of a segment in this CompoundStructure.
IsVerticallyHomogeneous |  Indicates whether this CompoundStructure represents a single set of parallel layers.
MergeRegionsAdjacentToSegment |  Merges the two regions which share the specified segment.
ParticipatesInWrapping |  Identifies if a layer is included in wrapping at inserts and ends.
RemoveWallSweep |  Removes a single sweep or reveal from the compound structure.
ResetAllLayersPriorities |  Resets all the priorities of all layers to the default priorities defined by their functions.
ResetLayerPriority |  Resets the priority of the specific layer to the default priority defined by its function.
SetDeckEmbeddingType |  Sets the deck embedding type to use for the specified structural deck.
SetDeckProfileId |  Sets the profile loop to use for the specified structural deck.
SetExtendableRegionIds |  Sets the extendable region ids for the compound structure.
SetLayer |  Sets a single layer for this CompoundStructure.
SetLayerFunction |  Sets the function of the specified layer.
SetLayerPriority |  Sets the priority of the specific layer.
SetLayers |  Completely resets this CompoundStructure and applies a new set of layers.
SetLayerWidth |  Sets the width of a specified layer.
SetMaterialId |  Sets a material element for a specified layer.
SetNumberOfShellLayers |  Sets the number of interior or exterior shell layers.
SetParticipatesInWrapping |  Assigns if a layer is included in wrapping at inserts and ends.
SplitRegion(UV, RectangularGridSegmentOrientation) |  Splits the region which contains the specified grid point by a line with the specified direction.
SplitRegion(UV, RectangularGridSegmentOrientation, Int32) |  Splits the region which contains the specified grid point by a line with the specified direction.
Top
Remarks
 A compound structure consists a collection of ordered layers, proceeding from exterior to interior for a wall, or from top to bottom for a floor, roof or ceiling. The properties of these layers determine the thickness, material, function and priority of the overall structure of the associated wall, floor, roof or ceiling. Layers can be accessed via the GetLayers() method and completely replaced using SetLayers. Layers can also be accessed and modified individually using the "layer index", which is a value from in the range [0, LayerCount) identifying the layer in the structure.
 A structure supports the concept of "core layers" and "shell layers". There are two layer indices which identify where the boundary between core and shell layers occur in the list of layers. The boundaries between shell and core layers are identifiable using GetFirstCoreLayerIndex(), GetLastCoreLayerIndex(), GetCoreBoundaryLayerIndex(ShellLayerType) or GetNumberOfShellLayers(ShellLayerType). The core layer boundary can be changed with SetNumberOfShellLayers(ShellLayerType, Int32).
 Compound structures may be vertically compound. If IsVerticallyCompound is false, the CompoundStructure describes a series of parallel layers, each with specified width, function, priority, material and other properties. If IsVerticallyCompound is true (which should apply only for CompoundStructures assigned to walls) then horizontal sections at different elevations may have different layered structures. In this case, the structure describes a vertical section via a rectangle which is divided into polygonal regions whose sides are all vertical or horizontal segments. A map associates each of these regions with the index of a layer in the CompoundStructure which determines the properties of that region.
See Also
Reference
Autodesk.Revit.DB Namespace