Revit 2027 API
WallFoundationType Class
 An object that represents the type of a wall foundation in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.WallFoundationType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WallFoundationType : HostObjAttributes
Public Class WallFoundationType
	Inherits HostObjAttributes
public ref class WallFoundationType : public HostObjAttributes
type WallFoundationType =
    class
        inherit HostObjAttributes
    end
The WallFoundationType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace