Revit 2027 API
FamilySizeTableManager Class
 Manages importing, exporting, and querying size data through the FamilySizeTable class.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilySizeTableManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilySizeTableManager : IDisposable
Public Class FamilySizeTableManager
	Implements IDisposable
public ref class FamilySizeTableManager : IDisposable
type FamilySizeTableManager =
    class
        interface IDisposable
    end
The FamilySizeTableManager type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberOfSizeTables |  The number of FamilySizeTables in a family.
Top
Methods
Name | Description
CreateFamilySizeTableManager |  Adds FamilySizeTableManager to a Family. A FamilySizeTableManager and FamilySizeTables are only needed when importing, exporting, or removing size data previously stored in CSV files.
Dispose | Releases all resources used by the FamilySizeTableManager
ExportSizeTable |  Exports the size table to aCSV file.
GetAllSizeTableNames |  Get the FamilySizeTable names in a family.
GetFamilySizeTableManager |  Gets a FamilySizeTableManager from a Family
GetSizeTable |  Get a FamilySizeTable by name.
HasSizeTable |  Checks if a FamilySizeTable of a given name exists.
ImportSizeTable |  Imports a FamilySizeTable from a CSV file.
RemoveSizeTable |  Removes the FamilySizeTable of a given name.
Top
See Also
Reference
Autodesk.Revit.DB Namespace