Revit 2027 API
AnalysisDisplayLegendSettings Methods
The AnalysisDisplayLegendSettings type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Compares two legend settings objects.
Top
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace