Revit 2027 API
CombinableElementArray Class
An array that contains CombinableElement objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CombinableElementArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CombinableElementArray : APIObject,
	IEnumerable
Public Class CombinableElementArray
	Inherits APIObject
	Implements IEnumerable
public ref class CombinableElementArray : public APIObject,
	IEnumerable
type CombinableElementArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The CombinableElementArray type exposes the following members.
Constructors
Name | Description
CombinableElementArray | Initializes a new instance of the CombinableElementArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a CombinableElement at a specified index within the array.
Size | Returns the number of CombinableElements that are in the array.
Top
Methods
Name | Description
Append | Add the element to the end of the array.
Clear | Removes every CombinableElement from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified element into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace