Revit 2027 API
IFCPropertyMappingInfo Class
 Represents the IFC property mapping information stored in the template.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFCPropertyMappingInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCPropertyMappingInfo : IDisposable
Public Class IFCPropertyMappingInfo
	Implements IDisposable
public ref class IFCPropertyMappingInfo : IDisposable
type IFCPropertyMappingInfo =
    class
        interface IDisposable
    end
The IFCPropertyMappingInfo type exposes the following members.
Constructors
Name | Description
IFCPropertyMappingInfo() |  Constructs a new IFCPropertyMappingInfo with default values.
IFCPropertyMappingInfo(Boolean, String, ElementId, String) |  Constructs a new IFCPropertyMappingInfo with input values. The flag that indicates whether the property is included in export. The property name. The Revit property id. The Revit property name.
Top
Properties
Name | Description
ExportFlag |  Whether or not the property is included in export.
IFCPropertyName |  The IFC property name.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RevitPropertyId |  The Revit property id.
RevitPropertyName |  The Revit property name.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCPropertyMappingInfo
IsValidMappingInfo |  Defines whether the mapping info contains meaningful data.
Top
See Also
Reference
Autodesk.Revit.DB Namespace