Revit 2027 API
IFCParameterTemplate Class
 Represents an element that contains an IFC parameter mapping template stored in a Revit document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IFCParameterTemplate
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCParameterTemplate : Element
Public Class IFCParameterTemplate
	Inherits Element
public ref class IFCParameterTemplate : public Element
type IFCParameterTemplate =
    class
        inherit Element
    end
The IFCParameterTemplate type exposes the following members.
Constructors
Name | Description
IFCParameterTemplate |  Custom constructor for this element.
Top
Properties
Name | Description
ExportIFCBaseQuantities |  The option to export IFC base quantities for exported Revit elements. If true, then all IFC base quantities not excluded will be exported. If false, then no IFC base quantities will be exported.
ExportIFCCommonPropertySets |  The option to export IFC common property sets for exported Revit elements. If true, then all IFC Common Property Sets not excluded will be exported. If false, then no IFC Common Property Sets will be exported.
ExportRevitElementParameters |  The option to export Revit element parameters to IFC. If true, then all Revit element parameters not excluded will be exported. If false, then no Revit element parameters will be exported.
ExportRevitMaterialParameters |  The option to export Revit material parameters to IFC. If true, then all Revit material parameters not excluded will be exported. If false, then no Revit material parameters will be exported.
ExportRevitSchedules |  The option to export Revit schedules to IFC. If true, then all Revit schedules not excluded will be exported. If false, then no Revit schedules will be exported.
ExportUserDefinedPropertySets |  The option to export user-defined property sets. If true, then all user-defined property sets not excluded will be exported. If false, then no user-defined property sets will be exported.
IsValidParameterMappingFile |  Whether or not the parameter mapping file is valid.
Top
Methods
Name | Description
AddPropertyMappingInfo |  Adds a property mapping info to the property set.
AddPropertySet |  Adds a property set to the template.
ClearPropertySets |  Removes all property sets from the template.
CopyPropertySet |  Creates a copy of the property set and adds it to the template.
CopyTemplate |  Create copy of mapping template with new name.
Create |  Create an IFC parameter mapping template with default values.
ExportPropertySetupToFile |  Exports mapping information of the provided property setup to a text file.
ExportToFile |  Export mapping template to a text file.
FindByName |  Returns mapping template element by name.
FindPropertyMappingInfo(PropertySetupType, String, ElementId) |  Finds the property mapping info in the property set by id.
FindPropertyMappingInfo(PropertySetupType, String, String) |  Finds the property mapping info in the property set by name.
GetActiveTemplate |  Gets the active mapping template element in the document.
GetOrCreateInSessionTemplate |  Gets the in-session non-serializable template or create new.
GetPropertyMappingInfos |  Creates an array of property mappings contained in the property set according to provided selection type.
GetPropertySetApplicableEntities | Obsolete.
 Gets the list of IFC entities to which the property set is applicable.
GetPropertySetNames |  Creates an array of property set names contained in the template according to provided selection type.
ImportFromFile |  Import mapping template from a text file.
ImportPropertySetupFromFile |  Imports mapping information from a text file.
IsExportingPropertySet |  Determines whether the provided property set is included in export.
IsInSessionTemplate |  Returns true if this is an in-session template.
IsPropertySetAMemberOfTemplate |  Checks whether a property set exists in the template.
IsValidName |  Returns result that the proposed name is valid and not exist in the specified document.
ListNames |  Returns a list of names of IFC export parameter mapping templates.
RemovePropertyMappingInfo(PropertySetupType, String, ElementId) |  Removes the property mapping from the property set by id.
RemovePropertyMappingInfo(PropertySetupType, String, String) |  Removes the property mapping from the property set by name.
RemovePropertySet |  Removes provided property set from the template.
ResetActiveTemplate |  Removes the information about active mapping temple of the document.
SetActiveTemplate |  Sets the mapping template element to be the active mapping template for its document.
SetInSessionTemplateDocument |  Set document for in-session template.
SetPropertySetApplicableEntities | Obsolete.
 Sets the list of IFC entities to which the property set is applicable.
SetPropertySetExportingFlag |  Define whether the provided property set must be included in export.
Top
See Also
Reference
Autodesk.Revit.DB Namespace