Revit 2027 API
CurveIntersectResult Class
 Contains the result of intersecting two curves and, if requested, a description of points where the two curves overlap or intersect.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CurveIntersectResult
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveIntersectResult : IDisposable
Public Class CurveIntersectResult
	Implements IDisposable
public ref class CurveIntersectResult : IDisposable
type CurveIntersectResult =
    class
        interface IDisposable
    end
The CurveIntersectResult type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Result |  The classification of intersection or overlap between the two curves.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CurveIntersectResult
GetOverlaps |  Gets information about the points shared between the two curves.
Top
See Also
Reference
Autodesk.Revit.DB Namespace