Revit 2027 API
ContextMenu Methods
The ContextMenu type exposes the following members.
Methods
Name | Description
AddItem |  Add an item to the Context Menu.
Dispose
Top
See Also
Reference
ContextMenu Class
Autodesk.Revit.UI Namespace