Revit 2027 API
EdgeArrayArray Methods
The EdgeArrayArray type exposes the following members.
Methods
Name | Description
Append | Add the edge array to the end of the array.
Clear | Removes every edge array from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified edge array into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
EdgeArrayArray Class
Autodesk.Revit.DB Namespace