Revit 2027 API
IFCRange Class
 Typically for IFC export, this represents the lower and upper elevations for split wall and column geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCRange
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCRange : IDisposable
Public Class IFCRange
	Implements IDisposable
public ref class IFCRange : IDisposable
type IFCRange =
    class
        interface IDisposable
    end
The IFCRange type exposes the following members.
Constructors
Name | Description
IFCRange() |  Instantiates a default IFCRange object.
IFCRange(IFCRange) |  Instantiates an IFCRange object by copy.
IFCRange(Double, Double) |  Instantiates an IFCRange object.
Top
Properties
Name | Description
End |  The ending value of the range.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Start |  The starting value of the range.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCRange
Top
Remarks
 It contains two double values representing the starting and ending values as a range.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace