Revit 2027 API
FamilySizeTableErrorInfo Methods
The FamilySizeTableErrorInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace