Revit 2027 API
PropertySetElement Class
 An element that groups together a set of related parameters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.PropertySetElement
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PropertySetElement : Element
Public Class PropertySetElement
	Inherits Element
public ref class PropertySetElement : public Element
type PropertySetElement =
    class
        inherit Element
    end
The PropertySetElement type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create(Document, EmbodiedCarbonAsset) |  Creates a new PropertySetElement to contain the given asset.
Create(Document, StructuralAsset) |  Creates a new PropertySetElement to contain the given asset.
Create(Document, ThermalAsset) |  Creates a new PropertySetElement to contain the given asset.
Duplicate |  Creates a duplicate of this PropertySetElement.
GetEmbodiedCarbonAsset |  Gets a copy of the EmbodiedCarbonAsset.
GetStructuralAsset |  Gets a copy of the StructuralAsset.
GetThermalAsset |  Gets a copy of the ThermalAsset.
SetEmbodiedCarbonAsset |  Sets a copy of the given EmbodiedCarbonAsset to be used in the PropertySetElement.
SetStructuralAsset |  Sets a copy of the given StucturalAsset to be used in the PropertySetElement.
SetThermalAsset |  Sets a copy of the given ThermalAsset to be used in the PropertySetElement.
Top
See Also
Reference
Autodesk.Revit.DB Namespace