Revit 2027 API
PaperSourceSetIterator Class
An iterator to a set of paper source objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PaperSourceSetIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class PaperSourceSetIterator : APIObject,
	IEnumerator
Public MustInherit Class PaperSourceSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class PaperSourceSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type PaperSourceSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The PaperSourceSetIterator type exposes the following members.
Constructors
Name | Description
PaperSourceSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace