Revit 2027 API
ExternalDataManagerTool Methods
The ExternalDataManagerTool type exposes the following members.
Methods
Name | Description
Dispose
GetChildCommandIds |  Obtains the sub menu of the item.
SetChildCommandIds |  Sets the sub menu of the item
Top
See Also
Reference
ExternalDataManagerTool Class
Autodesk.Revit.UI Namespace