Revit 2027 API
AnalysisDisplayColorSettings Methods
The AnalysisDisplayColorSettings type exposes the following members.
Methods
Name | Description
AreIntermediateColorsValid |  Verify intermediate color entries
Colors |  Get number of colors, including min, max and intermediate.
Dispose
GetIntermediateColors |  Get intermediate color entries (other than the minimum and maximum settings).
IsEqual |  Compares two color settings objects.
SetIntermediateColors |  Set intermediate color entries (other than the minimum and maximum settings).
Top
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace