Revit 2027 API
PartMaker Methods
The PartMaker type exposes the following members.
Methods
Name | Description
GetSourceElementIds |  Get the source elements for the PartMaker.
IsSourceElement |  Is the element a source for this PartMaker
SetSourceElementIds |  Set the source elements for the PartMaker.
Top
See Also
Reference
PartMaker Class
Autodesk.Revit.DB Namespace