Revit 2027 API
DesignOption Properties
The DesignOption type exposes the following members.
Properties
Name | Description
IsPrimary |  Determines whether this is a primary design option.
Top
See Also
Reference
DesignOption Class
Autodesk.Revit.DB Namespace