Revit 2027 API
AssemblyInstance Methods
The AssemblyInstance type exposes the following members.
Methods
Name | Description
AddMemberIds |  Adds member element ids for the assembly instance.
AllowsAssemblyViewCreation |  Returns true if assembly views can be created for this Assembly Instance.
AreElementsValidForAssembly |  Identifies if provided assembly members are valid.
CanRemoveElementsFromAssembly |  Identifies if provided assembly members can be removed from the assembly instance.
CompareAssemblyInstances |  Compares two assembly instances and returns a result with details about the differences
Create |  Creates a new assembly instance.
Disassemble |  Removes the assembly instance and releases the member elements.
GetCenter |  Returns the center of the bounding box for the assembly instance. This is the default position for placed assembly instances.
GetMemberIds |  Gets member element ids for the assembly instance.
GetTransform |  Gets the origin of the assembly instance.
IsMember |  Determines whether the given ElementId is a member of this assembly
IsValidNamingCategory |  Identifies if the naming category is valid for an assembly instance.
PlaceInstance |  Places an assembly instance of a given assembly type at the specified location.
RemoveMemberIds |  Removes member element ids from the assembly instance.
SetMemberIds |  Sets member element ids for the assembly instance. All existing members are cleared.
SetTransform |  Sets the origin of the assembly instance.
Top
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace