Revit 2027 API
IDuctFittingAndAccessoryPressureDropServer Interface
 Interface class for external servers implementing duct fitting and duct accessory coefficient calculation.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IDuctFittingAndAccessoryPressureDropServer : IExternalServer
Public Interface IDuctFittingAndAccessoryPressureDropServer
	Inherits IExternalServer
public interface class IDuctFittingAndAccessoryPressureDropServer : IExternalServer
type IDuctFittingAndAccessoryPressureDropServer =
    interface
        interface IExternalServer
    end
The IDuctFittingAndAccessoryPressureDropServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the duct fitting and duct accessory coefficient.
GetDataSchema |  Obtains the schema of the ESEntity.
IsApplicable |  Check if the server is applicable for the duct fitting or duct accessory.
Top
Remarks
 A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service, see ExternalServiceRegistry.
Assign server to duct fitting instance.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace