Revit 2027 API
RebarHandlePositionData Class
 The class that contains data for the handle position calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarHandlePositionData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarHandlePositionData : IDisposable
Public Class RebarHandlePositionData
	Implements IDisposable
public ref class RebarHandlePositionData : IDisposable
type RebarHandlePositionData =
    class
        interface IDisposable
    end
The RebarHandlePositionData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarHandlePositionData
GetBarGeometry |  Returns the geometry for a bar at the specified index currently in the Rebar.
GetDistributionPath |  Gets the distribution path currently stored in the rebar.
GetNumberOfBars |  Gets the number of bars currently in the rebar.
GetRebarElement |  Gets the rebar element that will be updated by the server.
GetView |  Gets the view in which the handles position should be computed.
SetPosition |  Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace