Revit 2027 API
AnalyticalBusData Class
 Represents the data and parameters of analytical bus node.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalPowerDistributableNodeData
 Autodesk.Revit.DB.Electrical.AnalyticalBusData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalBusData : AnalyticalPowerDistributableNodeData
Public Class AnalyticalBusData
	Inherits AnalyticalPowerDistributableNodeData
public ref class AnalyticalBusData : public AnalyticalPowerDistributableNodeData
type AnalyticalBusData =
    class
        inherit AnalyticalPowerDistributableNodeData
    end
The AnalyticalBusData type exposes the following members.
Properties
Name | Description
CurrentRating |  The current rating value of the analytical bus.
TotalConnectedCurrent |  The total connected current of the analytical bus.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace