Revit 2027 API
TilePatterns Class
The TilePatterns object is an interface for retrieving the TilePattern objects within the Document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.TilePatterns
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TilePatterns : APIObject
Public Class TilePatterns
	Inherits APIObject
public ref class TilePatterns : public APIObject
type TilePatterns =
    class
        inherit APIObject
    end
The TilePatterns type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetTilePattern |  Retrieve a TilePattern object from a built-in type.
Top
See Also
Reference
Autodesk.Revit.DB Namespace