Revit 2027 API
RebarShape Methods
The RebarShape type exposes the following members.
Methods
Name | Description
Create |  Create a new instance of a Rebar Shape, which defines the shape of a rebar.
GetAllowed |  Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
GetCurvesForBrowser |  Generate curves for the shape, as used in the shape browser.
GetMultiplanarDefinition |  The optional 3D structure of the shape.
GetRebarShapeDefinition |  Return the definition of the RebarShape.
GetTerminationsData |  Gets the terminations (e.g. hook, crank) data.
HasEndTreatment |  Identifies if the rebar shape has end treatment at at least one end.
IsSameShapeIgnoringTerminations |  Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties.
RebarShapeMatchesCurvesAndTerminationsData |  Checks if rebarShape matches curves and terminations data. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will ignore the hook information. If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to false, then this method will ignore the end treatment information.
SetAllowed |  Specify which bar types can be used with this RebarShape. Bar types are allowed by default.
Top
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace