Revit 2027 API
Categories Methods
The Categories type exposes the following members.
Methods
Name | Description
Contains | Identifies if a category which has the specified name is in the list of top-level categories.
(Overrides CategoryNameMap.Contains(String))
ForwardIterator | Retrieves a forward moving iterator to the map.
(Overrides CategoryNameMap.ForwardIterator())
GetEnumerator | Retrieves a forward moving iterator to the map.
(Overrides CategoryNameMap.GetEnumerator())
Insert | Inserts the specified category with the specified name into the map.
(Overrides CategoryNameMap.Insert(String, Category))
NewSubcategory | Add a new subcategory into the Autodesk Revit document.
ReverseIterator | Retrieves a backward moving iterator to the map.
(Overrides CategoryNameMap.ReverseIterator())
Top
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace