Revit 2027 API
ServerInternalException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ServerInternalException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ServerInternalException : ApplicationException
<SerializableAttribute>
Public Class ServerInternalException
	Inherits ApplicationException
[SerializableAttribute]
public ref class ServerInternalException : public ApplicationException
[<SerializableAttribute>]
type ServerInternalException =
    class
        inherit ApplicationException
    end
The ServerInternalException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace