Revit 2027 API
LevelType Class
An object that represents a Level type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.LevelType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LevelType : LineAndTextAttrSymbol
Public Class LevelType
	Inherits LineAndTextAttrSymbol
public ref class LevelType : public LineAndTextAttrSymbol
type LevelType =
    class
        inherit LineAndTextAttrSymbol
    end
The LevelType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace