Revit 2027 API
RadioButtonGroup Methods
The RadioButtonGroup type exposes the following members.
Methods
Name | Description
AddItem | Adds a new ToggleButton to the RadioButtonGroup.
AddItems | Adds new ToggleButtons to the RadioButtonGroup.
GetItems | Gets the collection of ToggleButtons assigned to the RadioButtonGroup.
Top
See Also
Reference
RadioButtonGroup Class
Autodesk.Revit.UI Namespace