Revit 2027 API
DGNExportOptions Class
 The export options used by exporting DGN format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.DGNExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DGNExportOptions : BaseExportOptions
Public Class DGNExportOptions
	Inherits BaseExportOptions
public ref class DGNExportOptions : public BaseExportOptions
type DGNExportOptions =
    class
        inherit BaseExportOptions
    end
The DGNExportOptions type exposes the following members.
Constructors
Name | Description
DGNExportOptions() |  Constructs a new instance of DGNExportOptions with default values of all properties.
DGNExportOptions(DGNExportOptions) |  Constructs a new instance of DGNExportOptions as a copy of the export options.
Top
Properties
Name | Description
FileVersion |  The DGN file version. Default value of fileVersion is DGNFileFormat.Default.
MergedViews |  Whether to merge all views in one file (via XRefs). Default value of mergedViews is false.
SeedName |  The name of the DGN seed. Default value of seedName is empty.
WorkingUnits |  If true, Main Units will be used. If false, Sub Units will be used. Default value of WorkingUnits is true.
Top
Methods
Name | Description
GetExportLineweightTable |  Gets a copy of the line weight table.
GetPredefinedOptions |  Returns an instance DGNExportOptions containing settings from a predefined export setup.
GetPredefinedSetupNames |  Returns a list of names of predefined setups of DGN export options.
SetExportLineweightTable |  Sets the line weight table to use during export.
Top
See Also
Reference
Autodesk.Revit.DB Namespace