Revit 2027 API
RebarReinforcementData Properties
The RebarReinforcementData type exposes the following members.
Properties
Name | Description
End |  The end of the rebar. The end should be 0 or 1.
RebarId |  The id of the Rebar
Top
See Also
Reference
RebarReinforcementData Class
Autodesk.Revit.DB.Structure Namespace