Revit 2027 API
ContextualHelp Methods
The ContextualHelp type exposes the following members.
Methods
Name | Description
Launch | Launches and displays the help topic specified by the contents of this ContextualHelp object.
Top
See Also
Reference
ContextualHelp Class
Autodesk.Revit.UI Namespace