Revit 2027 API
PostPattern Methods
The PostPattern type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace