Revit 2027 API
ElementWorksetFilter Properties
The ElementWorksetFilter type exposes the following members.
Properties
Name | Description
WorksetId |  The workset id.
Top
See Also
Reference
ElementWorksetFilter Class
Autodesk.Revit.DB Namespace