Revit 2027 API
FamilyLoadedIntoDocumentEventArgs Properties
The FamilyLoadedIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
FamilyName |  The file name of the family that is loaded into the document.
FamilyPath |  The file path of the family that is loaded into the document.
NewFamilyId |  The newly loaded family id.
OriginalFamilyId |  The original family id that is overridden by the newly loaded family.
Top
See Also
Reference
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace