Revit 2027 API
AssetPropertyBoolean Properties
The AssetPropertyBoolean type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
See Also
Reference
AssetPropertyBoolean Class
Autodesk.Revit.DB.Visual Namespace