Revit 2027 API
FilteredElementIdIterator Class
 An iterator to a set of element ids filtered by the settings of a FilteredElementCollector.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredElementIdIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilteredElementIdIterator : IEnumerator<ElementId>
Public Class FilteredElementIdIterator
	Implements IEnumerator(Of ElementId)
public ref class FilteredElementIdIterator : IEnumerator<ElementId^>
type FilteredElementIdIterator =
    class
        interface IEnumerator<ElementId>
    end
The FilteredElementIdIterator type exposes the following members.
Properties
Name | Description
Current | Gets the item at the current position of the iterator.
CurrentObject
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FilteredElementIdIterator
GetCurrent |  The current element id found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next element id passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
Autodesk.Revit.DB Namespace