Revit 2027 API
RevitLinkGraphicsSettings Methods
The RevitLinkGraphicsSettings type exposes the following members.
Methods
Name | Description
Dispose
GetDiscipline |  The linked document discipline of RevitLinkGraphicsSettings.
GetDisciplineType |  The discipline type of RevitLinkGraphicsSettings.
GetPhaseFilterId |  The linked document phase filter id of RevitLinkGraphicsSettings, or InvalidElementId if there is no phase filter explicitly assigned.
GetPhaseFilterType |  The phase filter type of RevitLinkGraphicsSettings.
GetPhaseId |  The linked document phase id of RevitLinkGraphicsSettings, or InvalidElementId if there is no phase explicitly assigned.
GetPhaseType |  The phase type of RevitLinkGraphicsSettings.
GetViewDetailLevel |  The linked document view detail level of RevitLinkGraphicsSettings.
GetViewDetailLevelType |  The view detail level type of RevitLinkGraphicsSettings.
IsViewRangeSupported |  Returns true if the input view supports ViewRange settings of RevitLinkGraphicsSettings, false otherwise.
SetDiscipline |  Sets discipline and discipline type of RevitLinkGraphicsSettings.
SetPhase |  Sets phase id and phase type of RevitLinkGraphicsSettings.
SetPhaseFilter |  Sets phase filter id and phase filter type of RevitLinkGraphicsSettings.
SetViewDetailLevel |  Sets view detail level and detail level type of RevitLinkGraphicsSettings.
Top
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace