Revit 2027 API
DocumentReloadLatestProgressChangedEventArgs Class
 The event arguments used during the reload latest phase of [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged].
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
 Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentReloadLatestProgressChangedEventArgs : DataTransferProgressChangedEventArgs
Public Class DocumentReloadLatestProgressChangedEventArgs
	Inherits DataTransferProgressChangedEventArgs
public ref class DocumentReloadLatestProgressChangedEventArgs : public DataTransferProgressChangedEventArgs
type DocumentReloadLatestProgressChangedEventArgs =
    class
        inherit DataTransferProgressChangedEventArgs
    end
The DocumentReloadLatestProgressChangedEventArgs type exposes the following members.
Properties
Name | Description
IsMerging |  Indicates if it is merging downloaded data.
ReloadLatestFinished |  Indicates if current 'reload latest' progress is finished.
RetryTimes |  The number of times Revit has tried to Reload Latest. Its value is '0' at the first time.
Top
Methods
Name | Description
Top
Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time. Name correction - it is renamed from 'DocumentReloadLatestProgessChangedEventArgs' released since 2017 Subscription Update.
See Also
Reference
Autodesk.Revit.DB.Events Namespace