Revit 2027 API
ExportPatternTable Methods
The ExportPatternTable type exposes the following members.
Methods
Name | Description
Add |  Inserts a (key,info) pair into Export pattern table.
Clear |  Removes all contents stored in the table.
ContainsKey |  Checks whether a pattern key exists in the table.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetExportPatternInfo |  Gets a copy of the pattern info associated to the input pattern key.
GetKeys |  Gets all the keys stored in the map.
GetPatternTableIterator | Returns a PatternTableIterator that iterates through the collection.
GetValues |  Returns all the values stored in the map.
Remove |  Removes the pair (key, info) by pattern key.
Top
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace