Revit 2027 API
FluidTemperature Class
 Represents the dynamic viscosity and density properties as defined at a certain temperature.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.FluidTemperature
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FluidTemperature : IDisposable
Public Class FluidTemperature
	Implements IDisposable
public ref class FluidTemperature : IDisposable
type FluidTemperature =
    class
        interface IDisposable
    end
The FluidTemperature type exposes the following members.
Constructors
Name | Description
FluidTemperature |  Creates a new fluid temperature with given temperature, dynamic viscosity and density.
Top
Properties
Name | Description
Density |  The density value
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Temperature |  The temperature value
Viscosity |  The dynamic viscosity value
Top
Methods
Name | Description
Dispose | Releases all resources used by the FluidTemperature
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace