Revit 2027 API
FabricationPartBrowserChangedEventArgs Methods
The FabricationPartBrowserChangedEventArgs type exposes the following members.
Methods
Name | Description
GetAllSolutionsPartsTypeCounts |  Returns the total fabrication part type usage count in all routing solutions.
GetCurrentSolutionPartTypeIds |  Returns set of fabrication part types that are used in the currently selected solution.
GetFabricationPartTypeIds |  Returns set of fabrication part types in use in the routing solution mode.
GetFilteredSolutionsPartsTypeCounts |  Returns the active fabrication part type usage count in fitlered routing solutions.
GetRequiredFabricationPartTypeIds |  Returns set of required fabrication part types in use in routing solution mode.
Top
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace