Revit 2027 API
SystemZoneData Class
 Represents the specific domain requirements for a system-zone used in MEP design.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.GenericZoneDomainData
 Autodesk.Revit.DB.Mechanical.SystemZoneData
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SystemZoneData : GenericZoneDomainData
Public Class SystemZoneData
	Inherits GenericZoneDomainData
public ref class SystemZoneData : public GenericZoneDomainData
type SystemZoneData =
    class
        inherit GenericZoneDomainData
    end
The SystemZoneData type exposes the following members.
Properties
Name | Description
ZoneEquipmentId |  The id of the zone equipment related to the zone.
Top
Methods
Name | Description
Create |  Creates a new instance of a system-zone data domain class.
Top
Remarks
 A system-zone is used to specify what parts of a building are served by specific equipment, air systems and water loops without having to physically model them. A system-zone is represented as a GenericZone element with a domain data of type SystemZoneData, which contains specific domain requirements for the purpose of analysis.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace