Revit 2027 API
ElementSlowFilter Class
 A base class for a type of filter that operates on expanded elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementSlowFilter : ElementFilter
Public Class ElementSlowFilter
	Inherits ElementFilter
public ref class ElementSlowFilter : public ElementFilter
type ElementSlowFilter =
    class
        inherit ElementFilter
    end
The ElementSlowFilter type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple slow filters with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded in order to evaluate against the criteria set by this filter.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.Architecture.RoomFilter
 Autodesk.Revit.DB.Architecture.RoomTagFilter
 Autodesk.Revit.DB.AreaFilter
 Autodesk.Revit.DB.AreaTagFilter
 Autodesk.Revit.DB.CurveElementFilter
 Autodesk.Revit.DB.ElementIntersectsFilter
 Autodesk.Revit.DB.ElementLevelFilter
 Autodesk.Revit.DB.ElementParameterFilter
 Autodesk.Revit.DB.ElementPhaseStatusFilter
 Autodesk.Revit.DB.FamilyInstanceFilter
 Autodesk.Revit.DB.Mechanical.SpaceFilter
 Autodesk.Revit.DB.Mechanical.SpaceTagFilter
 Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter
 Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter
 Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter
 Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter
 Autodesk.Revit.DB.Structure.StructuralWallUsageFilter
 Autodesk.Revit.UI.Selection.SelectableInViewFilter