Revit 2027 API
HostedSweep Class
An object that represents an object hosted by an edge of a roof or floor within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.HostedSweep
 Autodesk.Revit.DB.Architecture.Fascia
 Autodesk.Revit.DB.Architecture.Gutter
 Autodesk.Revit.DB.SlabEdge
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class HostedSweep : HostObject
Public MustInherit Class HostedSweep
	Inherits HostObject
public ref class HostedSweep abstract : public HostObject
[<AbstractClassAttribute>]
type HostedSweep =
    class
        inherit HostObject
    end
The HostedSweep type exposes the following members.
Properties
Name | Description
Angle | Retrieve/set the angle of the hosted sweep object relative its references (Unit : Radian).
HorizontalFlipped | Retrieve the horizontal flip status of the hosted sweep object.
HorizontalOffset | Retrieve/set the horizontal offset of the hosted sweep object.
Length | Retrieve the length of the hosted sweep object.
ReferenceCurve | The curve on which the hosted sweep segment is created.
VerticalFlipped | Retrieve the vertical flip status of the hosted sweep object.
VerticalOffset | Retrieve/set the vertical offset of the hosted sweep object.
Top
Methods
Name | Description
AddSegment | Add segments to the hosted sweep object.
GetEndPointParameter | Retrieve segment's start point or end point parameter.
HorizontalFlip | Flip the hosted sweep object along horizontal line.
RemoveSegment | Remove segments from the hosted sweep object.
SetEndPointParameter | Set segment's start point or end point parameter.
VerticalFlip | Flip the hosted sweep object along vertical line.
Top
See Also
Reference
Autodesk.Revit.DB Namespace