Revit 2027 API
CableType Methods
The CableType type exposes the following members.
Methods
Name | Description
Create |  Creates a Cable Type.
Duplicate() |  Duplicates this Cable Type.
GetCableTypeId |  Gets the Cable Type id by given cable type name.
GetCableTypeIds |  Gets all the Cable Types in the given document, sorted by name.
GetUsableCableSizeIds |  Gets all the Cable Sizes that can be used by this Cable Type, sorted by name.
IsCableSizeUsable |  Checks whether the Cable Size can be used by this Cable Type or not.
SetCableSizeUsable |  Marks the Cable Size can be used by this Cable Type.
Top
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace