Revit 2027 API
PanelScheduleView Methods
The PanelScheduleView type exposes the following members.
Methods
Name | Description
AddSpace |  Add a space at specific cell.
AddSpare |  Add a spare at specific cell.
CanMoveSlotTo |  Verifies if can circuits in the source slot to the specific slot.
CreateInstanceView(Document, ElementId) |  Creates a new instance of this view (using default template)
CreateInstanceView(Document, ElementId, ElementId) |  Creates a new instance of this view (using specific template)
GenerateInstanceFromTemplate |  Assigns the data from the template to the instance and performs any tasks specific to the instance (3rd phase, borders, etc)
GetApparentPhaseValue |  Gets the apparent load for the given phase for the given slotted circuit
GetCellsBySlotNumber |  Gets cells for the given slot number
GetCircuitByCell |  Gets the circuit element for the given slot number
GetCircuitIdByCell |  Gets the circuit id for the given slot number
GetCombinedParamValue |  Returns the combined parameter text for instance view
GetLoadClassificationConnectedCurrent |  Gets the Total Current for given Load Classification
GetLoadClassificationConnectedLoad |  Gets the Total Load for given Load Classification
GetLoadClassificationDemandCurrent |  Gets the Demand Current for given Load Classification
GetLoadClassificationDemandFactor |  Gets the Demand Factor for given Load Classification
GetLoadClassificationDemandLoad |  Gets the Demand Load for given Load Classification
GetLoadClassificationId |  Gets the id of the associated Load Classification at the given row
GetLoadClassificationName |  Gets the name of the Load Classification at the given row/column
GetLoadClassificationParamValue |  Gets the load classification parameter value.
GetPanel |  Gets the panel for this view
GetParamValue |  Gets the cell's text based on its type
GetSectionData |  Gets section data that will be written to
GetSlotNumberByCell |  Gets the slot number in the circuit table
GetSpareCurrentValue |  Gets the value of the apparent current parameter for a spare
GetSpareLoadValue |  Gets the value of the apparent load parameter for a spare
GetTableData |  Gets table data that can be written to
GetTemplate |  Gets the template for this view (to set the template, you must go through generateInstanceFromTemplate)
IsCellInPhaseLoads |  Check if this cell in the phase loads
IsColumnInLoadSummary |  Check if this column in the load summary
IsPanelScheduleTemplate |  Check if this is a panel schedule template.
IsRowInCircuitTable |  Check if this row in the circuit table
IsSlotGrouped |  Check if the slot is in a group
IsSlotLocked |  Check if the circuit slot in this cell is locked.
IsSpace |  Check if the selected cell is a space
IsSpare |  Check if the circuit is a spare
MoveSlotTo |  Move the circuits in the source slot to the specific slot.
RemoveSpace |  Remove a space at specific cell.
RemoveSpare |  Remove a spare at specific cell.
RenumberIndexes |  Renumbers the Circuit Naming Index for the circuits in the panel.
SetLockSlot |  Set lock state for a circuit slot at specific cell.
SetParamValue |  Sets the text for the given cell, returns true if successful, false otherwise
SetSpareCurrentValue |  Sets the value of the apparent current parameter for a spare
SetSpareLoadValue |  Sets the value of the apparent load parameter for a spare
SwitchPhases |  Switches the circuit phases at the slot.
Top
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace