Revit 2027 API
InsufficientResourcesException Methods
The InsufficientResourcesException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
InsufficientResourcesException Class
Autodesk.Revit.Exceptions Namespace