Revit 2027 API
Truss Class
 Represents all kinds of Trusses.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.Truss
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Truss : Element
Public Class Truss
	Inherits Element
public ref class Truss : public Element
type Truss =
    class
        inherit Element
    end
The Truss type exposes the following members.
Properties
Name | Description
Curves | Get all the truss curves.
Members | Get all the members of truss.
TrussType | Retrieve/set an object that represents the type of the truss.
Top
Methods
Name | Description
AttachChord | Attach a truss's specific chord to a specified element, the element should be a roof or floor.
Create |  Creates a new Truss.
DetachChord | Detach a truss's specific chord from the element to which it is attached.
DropTruss | Drop truss Family, it will disassociate all members from the truss and delete the truss.
GetTrussMemberInfo | Query if a given element is a member of a truss, its lock status and its usage, etc.
RemoveProfile | Remove the profile of a truss.
SetProfile | Add or modify the profile of a truss.
TogglePinMember | Pin/Unpin a truss member.
Top
Remarks
 The Truss object represents all the kinds of Trusses in Revit. The TrussType property is used to distinguish the type of the Truss.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace