Revit 2027 API
ViewFamilyType Class
 Represents a type of a Revit view.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.ViewFamilyType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewFamilyType : ElementType
Public Class ViewFamilyType
	Inherits ElementType
public ref class ViewFamilyType : public ElementType
type ViewFamilyType =
    class
        inherit ElementType
    end
The ViewFamilyType type exposes the following members.
Properties
Name | Description
DefaultTemplateId |  The default template id assigned to this view type.
PlanViewDirection |  The PlanViewDirection of this view.
ViewFamily |  The ViewFamily for this view type.
Top
Methods
Name | Description
IsValidDefaultTemplate |  Verifies that the input can be used as a default template for this view type.
Top
Remarks
 ViewFamilyTypes represent possible types for a Revit view and contain view type related properties and options such as the default template associated to views created from this type. They are commonly input to new View creation methods in the Revit API.
See Also
Reference
Autodesk.Revit.DB Namespace