Revit 2027 API
GeometryObject Class
The common base class for all geometric primitives.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GeometryObject : APIObject
Public Class GeometryObject
	Inherits APIObject
public ref class GeometryObject : public APIObject
type GeometryObject =
    class
        inherit APIObject
    end
The GeometryObject type exposes the following members.
Properties
Name | Description
GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle
Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.
IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.
Visibility | The visibility.
Top
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the integer value of the geometry object as hash code
(Overrides Object.GetHashCode())
Top
Operators
Name | Description
Equality(GeometryObject, GeometryObject) | Determines whether two GeometryObjects are the same.
Inequality(GeometryObject, GeometryObject) | Determines whether two GeometryObjects are different.
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.Edge
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.GeometryElement
 Autodesk.Revit.DB.GeometryInstance
 Autodesk.Revit.DB.Mesh
 Autodesk.Revit.DB.Point
 Autodesk.Revit.DB.PolyLine
 Autodesk.Revit.DB.Profile
 Autodesk.Revit.DB.Solid