Revit 2027 API
KeynoteTable Class
 KeynoteTable represents the collection of keynotes (KeynoteEntries) for a document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.KeyBasedTreeEntryTable
 Autodesk.Revit.DB.KeynoteTable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeynoteTable : KeyBasedTreeEntryTable
Public Class KeynoteTable
	Inherits KeyBasedTreeEntryTable
public ref class KeynoteTable : public KeyBasedTreeEntryTable
type KeynoteTable =
    class
        inherit KeyBasedTreeEntryTable
    end
The KeynoteTable type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetKeynoteTable |  Gets the KeynoteTable from a Revit document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace