Revit 2027 API
SpatialElementDomainData Class
 A base class for specific domain requirements for a spatial element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpatialElementDomainData
 Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialElementDomainData : IDisposable
Public Class SpatialElementDomainData
	Implements IDisposable
public ref class SpatialElementDomainData : IDisposable
type SpatialElementDomainData =
    class
        interface IDisposable
    end
The SpatialElementDomainData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SpatialElementDomainData
Top
See Also
Reference
Autodesk.Revit.DB Namespace