Revit 2027 API
Subelement Methods
The Subelement type exposes the following members.
Methods
Name | Description
CanHaveTypeAssigned |  Identifies if the subelement can have a type assigned.
ChangeTypeId |  Changes the type of the subelement.
Create |  Creates an object representing element or subelement.
Dispose
GetAllParameters |  Returns all parameters of this subelement.
GetBoundingBox |  Retrieves a box that circumscribes all geometry of the subelement.
GetGeometryObject |  Retrieve one geometric primitive representing given subelement.
GetParameterValue |  Obtains the current parameter value of this subelement given a parameter id.
GetReference |  Obtains the reference to this subelement.
GetValidTypes |  Obtains a set of types that are valid for this subelement.
HasParameter |  Checks if this subelement have given parameter.
IsParameterModifiable |  Checks if given parameter of this subelement is modifiable.
IsValidSubelementReference |  Checks if given Reference identifies either a valid element or subelement.
IsValidType |  Checks if given type is valid for this subelement.
SetParameterValue |  Sets a new parameter value of this subelement given a parameter id.
Top
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace