Revit 2027 API
RebarShapeConstraintSagittaLength Class
 A constraint that can be applied to a RebarShapeDefinitionByArc and drives the height of the arc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintSagittaLength : RebarShapeConstraint
Public Class RebarShapeConstraintSagittaLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintSagittaLength : public RebarShapeConstraint
type RebarShapeConstraintSagittaLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintSagittaLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintSagittaLength |  Create a constraint to drive sagitta length.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace