Revit 2027 API
ZoneElementDomainData Methods
The ZoneElementDomainData type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ZoneElementDomainData Class
Autodesk.Revit.DB.Mechanical Namespace