Revit 2027 API
Transform2D Methods
The Transform2D type exposes the following members.
Methods
Name | Description
AlmostEqual |  Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Assign |  Assigns values from the input transformation to this transformation.
CreateIdentity |  Creates the identity transformation.
Dispose
GetInverse |  Gets the inverse transformation of this transformation.
Multiply |  Multiplies this transformation by the specified transformation and returns the result.
OfPoint |  Applies the transformation to the point and returns the result.
OfVector |  Applies the transformation to the vector and returns the result.
PostScale |  Scales both the linear and translational parts of this transformation and returns the result.
PreScale |  Scales the linear part of this transformation and returns the result.
SetToIdentity |  Set this TrfUV to the identity transform.
TransformUVDomainIfPossible |  Transforms an envelope (BoundingBoxUV) for one surface to an envelope for a coincident but differently parameterized surface.
Top
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace