Revit 2027 API
ThinLinesOptions Methods
The ThinLinesOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ThinLinesOptions Class
Autodesk.Revit.UI Namespace