Revit 2027 API
StructuralConnectionHandler Properties
The StructuralConnectionHandler type exposes the following members.
Properties
Name | Description
ApprovalTypeId |  Retrieves or changes approval type of the Structural Connection Handler.
CodeCheckingStatus |  Code checking status of the structural connection.
OverrideTypeParams |  Allow or disallow connection's type parameters to be overridden.
SingleElementEndIndex |  Element end index for single element connections (0: start, 1: end).
Top
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace