Revit 2027 API
ExtendedPropertiesLinkLoadContent Methods
The ExtendedPropertiesLinkLoadContent type exposes the following members.
Methods
Name | Description
SetExtendedPropertiesLinkData |  Sets the extended properties data from the external server.
Top
See Also
Reference
ExtendedPropertiesLinkLoadContent Class
Autodesk.Revit.DB.ExternalData Namespace