Revit 2027 API
ElectricalPerPhaseData Class
 This class represents per phase values including current and power.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalPerPhaseData : IDisposable
Public Class ElectricalPerPhaseData
	Implements IDisposable
public ref class ElectricalPerPhaseData : IDisposable
type ElectricalPerPhaseData =
    class
        interface IDisposable
    end
The ElectricalPerPhaseData type exposes the following members.
Properties
Name | Description
CurrentPhaseA |  The effective value of current on electrical phase A.
CurrentPhaseB |  The effective value of current on electrical phase B.
CurrentPhaseC |  The effective value of current on electrical phase C.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ElectricalPerPhaseData
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace