Revit 2027 API
ExtendedPropertiesLinkValues Class
 Holds information which can be converted to Revit parameter values
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtendedPropertiesLinkValues : IDisposable
Public Class ExtendedPropertiesLinkValues
	Implements IDisposable
public ref class ExtendedPropertiesLinkValues : IDisposable
type ExtendedPropertiesLinkValues =
    class
        interface IDisposable
    end
The ExtendedPropertiesLinkValues type exposes the following members.
Constructors
Name | Description
ExtendedPropertiesLinkValues |  Creates a new ExtendedPropertiesLinkValues.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddValue(ForgeTypeId, Double) |  Add a double value for a given schema id.
AddValue(ForgeTypeId, Int32) |  Add an integer value for a given schema id.
AddValue(ForgeTypeId, String) |  Add a string value for a given schema id.
Dispose | Releases all resources used by the ExtendedPropertiesLinkValues
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace