Revit 2027 API
ViewSheet Properties
The ViewSheet type exposes the following members.
Properties
Name | Description
IsPlaceholder |  Identifies whether or not the view sheet represents a placeholder sheet.
SheetCollectionId |  The ID of the sheet collection this sheet is associated with.
SheetNumber |  The sheet number of the document.
SheetTitleBlockId |  The Id of the title block this sheet is associated with.
Top
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace