Revit 2027 API
PaperSize Properties
The PaperSize type exposes the following members.
Properties
Name | Description
Name |  Retrieve the paper size name of current project.
Top
See Also
Reference
PaperSize Class
Autodesk.Revit.DB Namespace