Revit 2027 API
MEPHiddenLineSettings Methods
The MEPHiddenLineSettings type exposes the following members.
Methods
Name | Description
GetMEPHiddenLineSettings |  Gets the MEP hidden line settings in the document.
Top
See Also
Reference
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace