Revit 2027 API
ComboBoxDropDownClosedEventArgs Class
The event arguments used by ComboBox's DropDownClosed event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.UI.Events.RibbonItemEventArgs
 Autodesk.Revit.UI.Events.ComboBoxDropDownClosedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComboBoxDropDownClosedEventArgs : RibbonItemEventArgs
Public Class ComboBoxDropDownClosedEventArgs
	Inherits RibbonItemEventArgs
public ref class ComboBoxDropDownClosedEventArgs : public RibbonItemEventArgs
type ComboBoxDropDownClosedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
The ComboBoxDropDownClosedEventArgs type exposes the following members.
Constructors
Name | Description
ComboBoxDropDownClosedEventArgs | Initializes a new instance of the ComboBoxDropDownClosedEventArgs class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace