Revit 2027 API
LineLightShape Properties
The LineLightShape type exposes the following members.
Properties
Name | Description
EmitLength |  The emit length.
Top
See Also
Reference
LineLightShape Class
Autodesk.Revit.DB.Lighting Namespace