Revit 2027 API
FamilyLoadingIntoDocumentEventArgs Class
 The event arguments used by the FamilyLoadingInto event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.FamilyLoadingIntoDocumentEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyLoadingIntoDocumentEventArgs : RevitAPIPreDocEventArgs
Public Class FamilyLoadingIntoDocumentEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class FamilyLoadingIntoDocumentEventArgs : public RevitAPIPreDocEventArgs
type FamilyLoadingIntoDocumentEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The FamilyLoadingIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
FamilyName |  The file name of the family that is being loaded into the document.
FamilyPath |  The file path of the family that is being loaded into the document.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace