Revit 2027 API
Material Methods
The Material type exposes the following members.
Methods
Name | Description
ClearMaterialAspect |  Removes an aspect from the material.
Create |  Creates a new material.
Duplicate |  Duplicates the material
GetIdentityParameterIds |  Gets material identity parameter ids from the material.
IsMaterialOrValidDefault |  Validates whether the specified element id is a material element.
IsNameUnique |  Validates whether the material name is unique in document.
SetMaterialAspectByPropertySet |  Sets an aspect of the material to a shared property set.
Top
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace