Revit 2027 API
Face Class
A bounded face of a 3d solid or open shell.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Face : GeometryObject
Public Class Face
	Inherits GeometryObject
public ref class Face : public GeometryObject
type Face =
    class
        inherit GeometryObject
    end
The Face type exposes the following members.
Properties
Name | Description
Area | The area of this face.
EdgeLoops | A collection of edge loops. Each edge loop represents one of the closed boundaries of the face.
HasRegions | Identifies if the face contains regions (which can be created, for example, by the Split Face command).
IsCyclic | Indicates whether the underlying surface is periodic in the specified parametric direction.
IsTwoSided | Determines if a face is two-sided (degenerate).
MaterialElementId | The element ID of the material from which this face is composed.
OrientationMatchesSurfaceOrientation |  Returns true if this face's orientation matches the orientation of the face's surface, false if they have opposite orientations.
Period | The period of the underlying surface in the specified parametric direction.
Reference | Returns a stable reference to the face.
Top
Methods
Name | Description
ComputeDerivatives | Returns the first partial derivatives of the underlying surface at the specified point.
ComputeNormal | Returns the normal vector for the face at the given point.
ComputeSecondDerivatives | Returns the second partial derivatives of the face at the specified point.
Evaluate | Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.
GetBoundingBox | Returns the UV bounding box of the face.
GetEdgesAsCurveLoops | Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
GetRegions | Gets the face regions (created, for example, by the Split Face command) of the face.
GetSurface | Returns a copy of this face's surface.
Intersect(Curve) | Calculates the intersection of the specified curve with this face.
Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results.
Intersect(Curve, IntersectionResultArray) | Calculates the intersection of the specified curve with this face and returns the intersection results.
Intersect(Face, Curve) | Calculates the intersection of the specified face with this face and returns the intersection results.
IsInside(UV) | Indicates whether the specified point is within this face.
IsInside(UV, IntersectionResult) | Indicates whether the specified point is within this face and outputs additional information about the point location.
Project | Projects the specified point on the face.
Triangulate() | Returns a triangular mesh approximation to the face.
Triangulate(Double) | Returns a triangular mesh approximation to the face.
Top
Remarks
Faces are defined by surfaces (Surface) bounded by edge loops. The surfaces provide natural UV parameterization to the faces.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.ConicalFace
 Autodesk.Revit.DB.CylindricalFace
 Autodesk.Revit.DB.HermiteFace
 Autodesk.Revit.DB.PlanarFace
 Autodesk.Revit.DB.RevolvedFace
 Autodesk.Revit.DB.RuledFace