Revit 2027 API
ViewHVACLoadsReport Class
 Represents a loads report instance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.Analysis.ViewHVACLoadsReport
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewHVACLoadsReport : View
Public Class ViewHVACLoadsReport
	Inherits View
public ref class ViewHVACLoadsReport : public View
type ViewHVACLoadsReport =
    class
        inherit View
    end
The ViewHVACLoadsReport type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Factory method to create a new instance of DBViewHVACLoadsReport.
IsAnalysisCompleted |  Indicates if the heating and cooling loads analysis has completed or not.
RunLoadsAnalysis |  Performs a heating and cooling loads analysis for zones and spaces in the energy model.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace