Revit 2027 API
FieldDomainPointsByXYZ Class
 Represents a set of three-dimensional point coordinates
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.FieldDomainPoints
 Autodesk.Revit.DB.Analysis.FieldDomainPointsByXYZ
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FieldDomainPointsByXYZ : FieldDomainPoints
Public Class FieldDomainPointsByXYZ
	Inherits FieldDomainPoints
public ref class FieldDomainPointsByXYZ : public FieldDomainPoints
type FieldDomainPointsByXYZ =
    class
        inherit FieldDomainPoints
    end
The FieldDomainPointsByXYZ type exposes the following members.
Constructors
Name | Description
FieldDomainPointsByXYZ |  Creates object from an array of three-dimensional point coordinates
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace