Revit 2027 API
DocumentPreviewSettings Class
 Contains the settings related to the saving of preview images for a given document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DocumentPreviewSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentPreviewSettings : IDisposable
Public Class DocumentPreviewSettings
	Implements IDisposable
public ref class DocumentPreviewSettings : IDisposable
type DocumentPreviewSettings =
    class
        interface IDisposable
    end
The DocumentPreviewSettings type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
IsViewUpdateForced |  Identifies if Revit will update the preview view if necessary.
PreviewViewId |  The view id that will be used to generate the preview.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DocumentPreviewSettings
ForceViewUpdate |  Sets Revit to update the preview view if necessary.
IsViewIdValidForPreview |  Identifies if the view id is valid as a preview view id.
Top
Example
// Get the document's preview settings
DocumentPreviewSettings settings = document.GetDocumentPreviewSettings();
// Find a candidate 3D view
FilteredElementCollector collector = new FilteredElementCollector(document);
collector.OfClass(typeof(View3D));
Func<View3D, bool> isValidForPreview = v => settings.IsViewIdValidForPreview(v.Id);
View3D viewForPreview = collector.OfType<View3D>().First<View3D>(isValidForPreview);
// Set the preview settings
using (Transaction setTransaction = new Transaction(document, "Set preview view id"))
{
   setTransaction.Start();
   settings.PreviewViewId = viewForPreview.Id;
   setTransaction.Commit();
}
// Save the document
document.Save();
See Also
Reference
Autodesk.Revit.DB Namespace