Revit 2027 API
RevitServerCommunicationException Methods
The RevitServerCommunicationException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerCommunicationException Class
Autodesk.Revit.Exceptions Namespace