Revit 2027 API
StructuralConnectionType Class
 A type element that represents a connection symbol applied to structural members.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.StructuralConnectionType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralConnectionType : ElementType
Public Class StructuralConnectionType
	Inherits ElementType
public ref class StructuralConnectionType : public ElementType
type StructuralConnectionType =
    class
        inherit ElementType
    end
The StructuralConnectionType type exposes the following members.
Properties
Name | Description
ApplyTo |  Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns.
Top
Methods
Name | Description
Create |  Create a new StructuralConnectionType, allowing the specified annotation FamilySymbol to be applied to structural members.
GetAllStructuralConnectionTypeIds |  Collects the ids of all StructuralConnectionTypes in the document.
GetFamilySymbolId |  FamilySymbol of the annotation to use for this connection type.
SetFamilySymbolId |  FamilySymbol of the annotation to use for this connection type.
ValidFamilySymbolId |  Checks whether the family symbol id is allowed for StructuralConnectionTypes with the given value for the applyTo property.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace