Revit 2027 API
WireSetIterator Methods
The WireSetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
WireSetIterator Class
Autodesk.Revit.DB.Electrical Namespace