Revit 2027 API
Rebar Methods
The Rebar type exposes the following members.
Methods
Name | Description
AreBarIndicesValidForSplit
Verifies that all bar indices in the input set are within the valid range of [0, NumberOfBarPositions - 2].
For a 3D Path or Morphed Free Form Rebar, single layout Rebar sets cannot result from a split, so the bar indices in the input set must not be consecutive.
For a 3D Path Free Form Rebar, this also validates that each new set created by the split will have at least one bar plane intersecting a path edge.
CanApplyPresentationMode |  Checks if a presentation mode can be applied for this rebar in the given view.
CanBeMatchedWithMultipleShapes |  Checks if this Rebar can be matched with multiple Rebar Shapes.
CanElementBeSplit |  Checks if the element is a rebar that can be split.
CanSuppressFirstOrLastBar |  Checks if the first or last bar in rebar set can be hidden in the given view.
CanUseHookType |  Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType
ClearPresentationMode |  Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
ComputeSpacingsBetweenBars |  Computes the spacings between all bars as we would have a set with CustomSpacing layout, the customSpacingFormula and its length being distributionLength.
ConstraintsCanBeEdited
For ShapeDriven Rebar: returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. It will return false if Rebar is in Group
For FreeForm rebar: constraints can be edited if there is a valid external server Guid assigned to that Rebar
ContainsValidArcRadiiForStyleAndBarType |  Checks that all arcs in the chain of curves have radii that are not less than minimum bend radius for bar type and style
CreateFreeForm(Document, Guid, RebarBarType, Element) |  Creates a free form rebar that can have constraints.
CreateFreeForm(Document, RebarBarType, Element, IList<CurveLoop>, RebarStyle) |  Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
CreateFreeForm(Document, RebarBarType, Element, IList<IList<Curve>>, RebarStyle) |  Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
CreateFromCurves |  Creates a new instance of a shape driven Rebar element within the project.
CreateFromCurvesAndShape |  Creates a new instance of a shape driven Rebar element within the project. The instance will have the default shape parameters from the RebarShape. The curves and terminations data should match the rebar shape definition. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, the hooks and their rotation angles can be different than the defaults specified in the RebarShape. If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to false, the end treatments can be different than the defaults specified in the RebarShape.
CreateFromRebarShape |  Creates a new shape driven Rebar, as an instance of a RebarShape. The instance will have the default shape parameters from the RebarShape, and its location is based on the bounding box of the shape in the shape definition. Hooks and cranks are removed from the shape before computing its bounding box. If appropriate hooks and cranks can be found in the document, they will be assigned arbitrarily.
DoesBarExistAtPosition |  Checks whether a bar is included at the specified position.
EnableCrankLengthOverride |  Enables or disables the ability to override crank lengths for this rebar instance.
EnableHookLengthOverride |  Enables or disables the ability to override hook lengths for this rebar instance.
FindMatchingPredefinedPresentationMode |  Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
GetAllRebarShapeIds |  Gets the ids of the RebarShapes elements that defines the shapes of the rebar.
GetBarIndexFromReference |  Given a reference that represents a part of a bar, this method will return the bar index.
GetBendData |  Gets the RebarBendData, containing bar and hook information, of the instance.
GetCenterlineCurves |  A chain of curves representing the centerline of the rebar.
GetCouplerId |  Get the id of the Rebar Coupler that is applied to the rebar at the specified end.
GetCrankAngledLength |  Gets the crank angled length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
GetCrankLength |  Gets the crank length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
GetCrankOffsetLength |  Gets the crank offset length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
GetCrankRatio |  Gets the crank ratio at the indicated bar end.
GetCrankStraightLength |  Gets the crank straight length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
GetCrankTypeId |  Gets the id of the Crank Type id that is applied to the rebar.
GetEndTreatmentTypeId |  Get the id of the EndTreatmentType that is applied to the rebar.
GetFreeFormAccessor |  Returns an interface providing access to free-form properties and methods for this Rebar element.
GetFullGeometryForView |  Generates full geometry for the Rebar for a specific view.
GetHookTypeId |  Get the id of the RebarHookType that is applied to the rebar.
GetHostId |  The element that contains the rebar.
GetLapLength |  Gets the lap length that is used for the specified end - 0 for start, 1 for end.
GetLayoutFormula |  Gets the formula that is used to compute the spacings between bars.
GetMovedBarTransform |  Returns a transform representing the movement of the bar relative to its default position along the distribution path.
GetOverridableCrankParameters |  Gets the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
GetOverridableHookParameters |  Outputs the formula parameter ids defined in the RebarShape family which are associated with hook length and hook tangent length parameters.
GetParameterValueAtIndex |  Get the parameter value for a bar at the specified index.
GetPresentationMode |  Gets the presentation mode for this rebar set when displayed in the given view.
GetRebarConstraintsManager |  Returns an object for managing the external constraints on the Rebar element
GetRebarSplice |  Gets the rebar splice at the specified bar end - 0 for start, 1 for end.
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetShapeDrivenAccessor |  Returns an interface providing access to shape-driven properties and methods for this Rebar element.
GetShapeId |  Returns the id of the RebarShape element that defines the shape of the rebar.
GetSpacingsBetweenBars |  Gets the spacings between all bars in set that have CustomSpacing layout. It will consider that there are no moved or removed bars from the set.
GetSpliceStaggerLength |  Gets the stagger length that is used for the specified end - 0 for start, 1 for end.
GetTerminationOrientation |  Gets the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
GetTerminationRotationAngle |  Gets the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
GetTransformedCenterlineCurves |  A chain of curves representing the centerline of the rebar.
HasPresentationOverrides |  Identifies if this Rebar has overridden default presentation settings for the given view.
HookAngleMatchesRebarShapeDefinition |  Checks that the hook angle of the specified RebarHookType matches the hook angle used in the Rebar's RebarShape at the specified end of the bar.
IsBarHidden |  Identifies if a given bar in this rebar set is hidden in this view.
IsCrankLengthOverrideEnabled |  Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise.
IsCustomSpacingWithPredefinedNumberOfBars |  Checks if the layout is defined as a Custom Spacing Layout with a predefined number of bars. Custom Spacing layout will have a predefined number of bars if the formula is fixed (not variable and without percentage members).
IsHookLengthOverrideEnabled |  Returns True if the ability to override hook lengths is enabled for this rebar instance, False otherwise.
IsRebarFreeForm |  Returns true if the rebar is free form and false if shape driven.
IsRebarInSection |  Identifies if this Rebar is cut by the view plane of the given view.
IsRebarShapeDriven |  Returns true if the rebar is shape driven and false if free form.
IsUnobscuredInView |  Checks if this rebar element is shown unobscured in a view.
IsValidCustomSpacingFormula |  Checks if the specified formula is valid (has a valid syntax).
MoveBarInSet |  This method applies the transformation matrix to the rebar bar at the desired position in the rebar set. If the bar was already moved, the method will concatenate the transformation matrix with the existing movement.
RemoveSplice |  Removes the splice relation at the specified end and all the Rebar Constraints involved in splice.
ResetMovedBarTransform |  Reset the transformation representing the movement of the bar relative to its default position along the distribution path. The moved bar transform will be set to Identity.
SetBarHiddenStatus |  Sets the bar in this rebar set to be hidden or unhidden in the given view.
SetBarIncluded |  Sets if the bar at the desired index is included or not.
SetCrankAngledLengthOverride |  Sets the crank angled length at the indicated bar end as an override value.
SetCrankLengthOverride |  Sets the crank length at the indicated bar end as an override value.
SetCrankOffsetLengthOverride |  Sets the crank offset length at the indicated bar end as an override value.
SetCrankRatioOverride |  Sets the crank ratio at the indicated bar end as an override value.
SetCrankStraightLengthOverride |  Sets the crank straight length at the indicated bar end as an override value.
SetCrankTypeId |  Sets the id of the Crank Type to be applied to the rebar.
SetEndTreatmentTypeId |  Sets the id of the EndTreatmentType to be applied to the rebar. This can be done if and only if the end of the bar on which the end treatment is applied has no RebarCoupler on it, otherwise will throw an exception.
SetHookTypeId |  Set the id of the RebarHookType to be applied to the rebar.
SetHostId |  The element that contains the rebar.
SetLayoutFormula |  Sets the specified formula for custom spacing.
SetPresentationMode |  Sets the presentation mode for this rebar set when displayed in the given view.
SetTerminationOrientation |  Sets the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
SetTerminationRotationAngle |  Sets the termination's (e.g hook, crank) out of plane rotation angle at the specified end.
SetUnobscuredInView |  Sets this rebar element to be shown unobscured in a view.
SplitRebar |  Splits a rebar into multiple sets at specified bar indices. Given split indices (e.g., {ii, jj}) in barIndices, the function creates three rebar sets: from 0 to ii, ii+1 to jj, and jj+1 to NumberOfBarPositions - 1. Edge Case: A split at index 0 creates a first set with one bar; a split at the last index does nothing, as no bars follow. If a split is made at an index where the bar is not included, the split will still occur, and the unincluded bar will remain unchanged in the new set created after the split. This method applies to a Shape Driven Rebar whose definition is RebarShapeDefinitionBySegments, for 3D Path Free Form Rebar and for Morphed Free Form Rebar. For Morphed Free Form Rebar that targets Spiral or Lapped Circle shapes, split cannot be made.
Top
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace