Revit 2027 API
DuctLiningType Methods
The DuctLiningType type exposes the following members.
Methods
Name | Description
IsValidRoughness |  Identifies if the input roughness is valid.
Top
See Also
Reference
DuctLiningType Class
Autodesk.Revit.DB.Mechanical Namespace