Revit 2027 API
ConduitSettings Properties
The ConduitSettings type exposes the following members.
Properties
Name | Description
ConnectorSeparator |  The conduit connector separator string.
FittingAnnotationSize |  The value of fitting annotation size.
RiseDropAnnotationSize |  The rise drop annotation size.
SizePrefix |  The conduit size prefix string.
SizeSuffix |  The conduit size suffix string.
UseAnnotationScaleForSingleLineFittings |  Indicates whether use annotation scale for single line fittings or not.
Top
See Also
Reference
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace