Revit 2027 API
ScheduleFieldId Class
The ScheduleFieldId object is used as a unique identification for a field in a schedule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ScheduleFieldId
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ScheduleFieldId
Public Class ScheduleFieldId
public ref class ScheduleFieldId
type ScheduleFieldId = class end
The ScheduleFieldId type exposes the following members.
Constructors
Name | Description
ScheduleFieldId | Initializes a new instance of the ScheduleFieldId class
Top
Properties
Name | Description
IntegerValue |  Provides the value of the ScheduleFieldId as an integer.
InvalidScheduleFieldId |  Get the invalid ScheduleFieldId whose IntegerValue is -1.
Top
Methods
Name | Description
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the integer value of the id as hash code
(Overrides Object.GetHashCode())
ToString |  Gets a String representation of the integer value of the id.
(Overrides Object.ToString())
Top
Operators
Name | Description
Equality(ScheduleFieldId, ScheduleFieldId) | Determines whether two ScheduleFieldIds are the same.
Inequality(ScheduleFieldId, ScheduleFieldId) | Determines whether two ScheduleFieldId are different.
Top
See Also
Reference
Autodesk.Revit.DB Namespace