Revit 2027 API
WrongUserException Class
The exception thrown when a local model is manipulated under a different username than it was created with.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.WrongUserException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class WrongUserException : InvalidOperationException
<SerializableAttribute>
Public Class WrongUserException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class WrongUserException : public InvalidOperationException
[<SerializableAttribute>]
type WrongUserException =
    class
        inherit InvalidOperationException
    end
The WrongUserException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace