Revit 2027 API
PipingSystemType Methods
The PipingSystemType type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a piping system type and adds it to the document.
ValidateRiseDropSymbolType |  Confirms if the parameter is a valid piping rise/drop symbol type.
Top
See Also
Reference
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace