Revit 2027 API
StairsComponentConnection Class
 Represents information about a connection among stairs components(run to landing).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.StairsComponentConnection
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StairsComponentConnection : IDisposable
Public Class StairsComponentConnection
	Implements IDisposable
public ref class StairsComponentConnection : IDisposable
type StairsComponentConnection =
    class
        interface IDisposable
    end
The StairsComponentConnection type exposes the following members.
Properties
Name | Description
ConnectionType |  The connection type of the connected stairs component.
ElementId |  The element Id of connected stairs component in the stairs connection.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PeerConnectionType |  The connection type of the peer connected stairs component.
PeerElementId |  The element Id of peer connected stairs component in the stairs connection.
Top
Methods
Name | Description
Dispose | Releases all resources used by the StairsComponentConnection
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace