Revit 2027 API
AssetPropertyDoubleMatrix44 Class
 Represents a property consisting of an array of double values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyDoubleMatrix44 : AssetProperty
Public Class AssetPropertyDoubleMatrix44
	Inherits AssetProperty
public ref class AssetPropertyDoubleMatrix44 : public AssetProperty
type AssetPropertyDoubleMatrix44 =
    class
        inherit AssetProperty
    end
The AssetPropertyDoubleMatrix44 type exposes the following members.
Properties
Name | Description
Value | Get the value of the property
Top
Methods
Name | Description
Top
Remarks
 In virtually all cases, the array will contain exactly 16 values. It represents a 4x4 matrix.
See Also
Reference
Autodesk.Revit.DB.Visual Namespace