Revit 2027 API
VertexIndexPairArrayIterator Class
An iterator to an array of VertexIndex pairs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.VertexIndexPairArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class VertexIndexPairArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class VertexIndexPairArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class VertexIndexPairArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type VertexIndexPairArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The VertexIndexPairArrayIterator type exposes the following members.
Constructors
Name | Description
VertexIndexPairArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace