Revit 2027 API
FabricWireType Class
 A Fabric Wire Type object that is used in the generation of Fabric Wire.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.FabricWireType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricWireType : ElementType
Public Class FabricWireType
	Inherits ElementType
public ref class FabricWireType : public ElementType
type FabricWireType =
    class
        inherit ElementType
    end
The FabricWireType type exposes the following members.
Properties
Name | Description
BendDiameter |  Determines the bending diameter of the wire.
WireDiameter |  Determines the diameter of the wire.
Top
Methods
Name | Description
CreateDefaultFabricWireType |  Creates a new FabricWireType object with a default name.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace