Revit 2027 API
ExternalResourceLoadContext Methods
The ExternalResourceLoadContext type exposes the following members.
Methods
Name | Description
CallingDocumentHasModelPath |  Indicates whether the document requesting the external resource has a defined ModelPath.
Dispose
GetCallingDocumentModelPath |  Returns a copy of the ModelPath of the document that is requesting the external resource.
GetCurrentlyLoadedReference |  Returns a copy of the ExternalResourceReference currently in use by the containing element.
Top
See Also
Reference
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace