Revit 2027 API
GenericZone Properties
The GenericZone type exposes the following members.
Properties
Name | Description
Area |  The area for the zone, in square feet.
GeometricDefinition |  The geometric definition for this generic zone.
LevelOffset |  The offset distance from this zone to the associated level.
OccupiedArea |  The occupied area for the zone, in square feet.
OccupiedVolume |  The occupied volume for the zone, in cubic feet.
Perimeter |  The perimeter for the zone, in feet.
Volume |  The volume for the zone, in cubic feet.
Top
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace