Revit 2027 API
MultipleValuesIndicationSettings Methods
The MultipleValuesIndicationSettings type exposes the following members.
Methods
Name | Description
GetMultipleValuesIndicationSettings |  Returns the MultipleValuesIndicationSettings element for a given document.
Top
See Also
Reference
MultipleValuesIndicationSettings Class
Autodesk.Revit.DB Namespace