Revit 2027 API
BuildingPadType Properties
The BuildingPadType type exposes the following members.
Properties
Name | Description
ThermalProperties |  The calculated and settable thermal properties of the BuildingPadType
Top
See Also
Reference
BuildingPadType Class
Autodesk.Revit.DB Namespace