Revit 2027 API
VoltageTypeSetIterator Class
An iterator to a voltage type set.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class VoltageTypeSetIterator : APIObject,
	IEnumerator
Public MustInherit Class VoltageTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
public ref class VoltageTypeSetIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type VoltageTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The VoltageTypeSetIterator type exposes the following members.
Constructors
Name | Description
VoltageTypeSetIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace