Revit 2027 API
StructuralSectionConcreteCross Class
 Defines parameters for parameterized concrete cross structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionConcreteCross : StructuralSectionRectangular
Public Class StructuralSectionConcreteCross
	Inherits StructuralSectionRectangular
public ref class StructuralSectionConcreteCross : public StructuralSectionRectangular
type StructuralSectionConcreteCross =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionConcreteCross type exposes the following members.
Constructors
Name | Description
StructuralSectionConcreteCross |  Creates a new instance of Structural Section Concrete Cross shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
CantileverHeight |  Flange cantilever thickness.
CantileverLength |  Flange cantilever length.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace