Revit 2027 API
IndependentTag Class
 Represents tag annotations in Revit. getBBoxCorers in MultipleAlignmentHelper needs access to some protected members.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.SpanDirectionSymbol
 Autodesk.Revit.DB.Structure.FabricReinSpanSymbol
 Autodesk.Revit.DB.Structure.PathReinSpanSymbol
 Autodesk.Revit.DB.Structure.RebarSystemSpanSymbol
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IndependentTag : Element
Public Class IndependentTag
	Inherits Element
public ref class IndependentTag : public Element
type IndependentTag =
    class
        inherit Element
    end
The IndependentTag type exposes the following members.
Properties
Name | Description
HasLeader |  Identifies if a tag has at least one visible leader, or if all leaders are hidden.
IsMaterialTag |  Identifies if it is a material tag or not.
IsMulticategoryTag |  Identifies if it is a multi-category tag or not.
IsOrphaned |  Identifies if the tag is orphaned or not.
LeaderEndCondition |  The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
LeadersPresentationMode |  Identifies the Presentation Mode that is applied to tag leaders.
LeaderStartCondition |  The leader start condition of the tag, such as if the start of the leader is attached to the tag head or free floating.
MergeElbows |  Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.
MultiLeader |  Returns if the tag if referencing multiple elements and/or sub-elements.
MultiReferenceAnnotationId |  The multi-reference annotation which owns this tag.
RotationAngle |  The rotation angle of the tag relative to its view
TagHeadPosition |  The position of the head of tag in model coordinates.
TagOrientation |  The tag orientation of the tag's head, such as horizontal or vertical.
TagText |  The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
Top
Methods
Name | Description
AddReferences |  Adds the provided list of references to the tag's list of references.
CanLeaderEndConditionBeAssigned |  Checks whether the LeaderEndCondition can be changed.
CanLeaderStartConditionBeAssigned |  Checks whether the LeaderStartCondition can be changed.
Create(Document, ElementId, ElementId, Reference, Boolean, TagOrientation, XYZ) |  Places a tag on an element or subelement.
Create(Document, ElementId, Reference, Boolean, TagMode, TagOrientation, XYZ) |  Places a tag on an element or subelement.
GetLeaderElbow |  Returns the position of the elbow of the tag's leader that points to specified reference. Position of leader's elbow.
GetLeaderEnd |  Gets the free end point for the leader to the specified reference.
GetLeaderStart |  Gets the free leader start point for the leader to the specified reference.
GetTaggedElementIds |  Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each subelement that is being referenced by the tag.
GetTaggedLocalElementIds |  Returns a set of IDs for all tagged local elements, if any. A local element ID will be provided for each subelement that is being referenced by the tag. Set of all the element ids in the local file. For each subelement a local element id will be provided.
GetTaggedLocalElements |  Get the tagged local elements, if any. An Element will be provided for each subelement that is being referenced by the tag.
GetTaggedReferences |  Get the host references of the tag. An array of all the tagged references.
HasLeaderElbow |  Whether the tag's leader that points to the reference has an elbow point or not.
HasTagBehavior |  Checks if the IndependentTag has a tag behavior.
HasTagText |  Checks if the IndependentTag has a valid tag text.
IsLeaderVisible |  Returns if leader that points to specified reference is visible or not.
IsTaggedOnSubelement |  Returns true if the any of the tagged references is a subelement.
RemoveReferences |  Removes the provided list of references from the tag's list of references.
SetIsLeaderVisible |  Set tag's leader that points to specified reference to be visible or not. This option can be set only if the LeadersPresentationMode is ShowSpecificLeaders.
SetLeaderElbow |  Set the position of the elbow of the tag's leader that points to specified reference. If this tag is a multileader tag and the elbows are merged, the input position will be set to all leaders.
SetLeaderEnd |  Sets the free end point for the leader to the specified reference.
SetLeaderStart |  Sets the free leader start point for the leader to the specified reference.
Top
Remarks
 IndependentTag represents single-category tags, multi-category tags, material tags, and zone tags. IndependentTag is also the base class for other annotations like keynote tags and span symbols. Room, area and space tags are not derived from IndependentTag. [!:Autodesk::Revit::DB::SpatialElementTag] for more information.
See Also
Reference
Autodesk.Revit.DB Namespace