Revit 2027 API
ElementParameterFilter Methods
The ElementParameterFilter type exposes the following members.
Methods
Name | Description
GetRules |  Returns the set of rules contained in this filter.
Top
See Also
Reference
ElementParameterFilter Class
Autodesk.Revit.DB Namespace