Revit 2027 API
FilterStringLessOrEqual Class
 Tests whether string values from the document would sort before or match a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringLessOrEqual
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringLessOrEqual : FilterStringRuleEvaluator
Public Class FilterStringLessOrEqual
	Inherits FilterStringRuleEvaluator
public ref class FilterStringLessOrEqual : public FilterStringRuleEvaluator
type FilterStringLessOrEqual =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringLessOrEqual type exposes the following members.
Constructors
Name | Description
FilterStringLessOrEqual |  Constructs an instance of FilterStringLessOrEqual.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace