Revit 2027 API
DialogBoxShowingEventArgs Methods
The DialogBoxShowingEventArgs type exposes the following members.
Methods
Name | Description
OverrideResult |  Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Top
See Also
Reference
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace