Revit 2027 API
StructuralSectionGeneralH Properties
The StructuralSectionGeneralH type exposes the following members.
Properties
Name | Description
InnerFillet |  Inner Fillet - Corner fillet inner radius.
OuterFillet |  Outer Fillet - Corner fillet outer radius.
WallDesignThickness |  Represents wall design thickness of rectangle.
WallNominalThickness |  Represents wall nominal thickness of rectangle.
Top
See Also
Reference
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace