Revit 2027 API
CopyPasteOptions Methods
The CopyPasteOptions type exposes the following members.
Methods
Name | Description
Dispose
GetDuplicateTypeNamesHandler |  Returns current duplicate type names handler or null if none is set.
SetDuplicateTypeNamesHandler |  Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
Top
See Also
Reference
CopyPasteOptions Class
Autodesk.Revit.DB Namespace