Revit 2027 API
LoadUsage Methods
The LoadUsage type exposes the following members.
Methods
Name | Description
Create |  Creates a new LoadUsage.
Top
See Also
Reference
LoadUsage Class
Autodesk.Revit.DB.Structure Namespace