Revit 2027 API
TemperatureRating Class
 This class represents the definition of Conductor Temperature Rating data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.TemperatureRating
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TemperatureRating : IDisposable
Public Class TemperatureRating
	Implements IDisposable
public ref class TemperatureRating : IDisposable
type TemperatureRating =
    class
        interface IDisposable
    end
The TemperatureRating type exposes the following members.
Properties
Name | Description
Id |  The Conductor Temperature Rating id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The Conductor Temperature Rating name.
Top
Methods
Name | Description
Create |  Creates a Conductor Temperature Rating.
Dispose | Releases all resources used by the TemperatureRating
GetTemperatureRating |  Gets the Conductor Temperature Rating data by given Conductor Temperature Rating id.
GetTemperatureRatingIdByName |  Gets the Conductor Temperature Rating id by given Conductor Temperature Rating name.
GetTemperatureRatingIds |  Gets all the Conductor Temperature Rating ids in the given document, sorted by name.
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace