Revit 2027 API
DirectoryNotFoundException Class
The exception that is thrown when the specified directory could not be found.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.IOException
 Autodesk.Revit.Exceptions.DirectoryNotFoundException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class DirectoryNotFoundException : IOException
<SerializableAttribute>
Public Class DirectoryNotFoundException
	Inherits IOException
[SerializableAttribute]
public ref class DirectoryNotFoundException : public IOException
[<SerializableAttribute>]
type DirectoryNotFoundException =
    class
        inherit IOException
    end
The DirectoryNotFoundException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides IOException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace