Revit 2027 API
RouteAnalysisSettings Class
RouteAnalysisSettings is an element which contains project-wide settings for route calculations. The PathOfTravel element uses these settings to calculate a route between two points in a plan view.
By default, the route will go around the geometry of all visible model elements which have model geometry in the Route Analysis Zone.
The Route Analysis Zone, determined per view, is the space between these two horizontal planes: a top plane vertically offset by AnalysisZoneTopOffset above the view's level and a bottom plane vertically offset by AnalysisZoneBottomOffset ft above the view's level.
 By default, the route will ignore the following elements:
elements outside of the crop region of the view;
elements without any model geometry (annotations or view-specific elements);
model lines (category OST_Lines);
demolished elements;
elements displayed in the underlay of the view.
 There are a few ways to customize Route Analysis on a project-wide basis.
You can adjust the Route Analysis Zone using AnalysisZoneTopOffset and AnalysisZoneBottomOffset.
You can specify a set of model categories you would like ignored during route calculation. To enable ignoring the set of specified categories, set EnableIgnoredCategoryIds to true. To change the set of ignored categories, use SetIgnoredCategoryIds method and IgnoreImports and IgnorePointClouds properties. To query the set of ignored categories, use GetIgnoredCategoryIds.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.RouteAnalysisSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RouteAnalysisSettings : Element
Public Class RouteAnalysisSettings
	Inherits Element
public ref class RouteAnalysisSettings : public Element
type RouteAnalysisSettings =
    class
        inherit Element
    end
The RouteAnalysisSettings type exposes the following members.
Properties
Name | Description
AnalysisZoneBottomOffset |  The bottom plane offset, in ft, of the zone used in route calculation. Default value is 8".
AnalysisZoneTopOffset |  The top plane offset, in ft, for the zone used in route calculation. Default value is 6'8".
EnableIgnoredCategoryIds
When this setting is true, elements with category ids returned by GetIgnoredCategoryIds will be ignored in route calculation. default is true as all elements with the Door Category Id are ignored by default.
IgnoreImports |  If true, import instances are ignored by route calculation. For imports to be ignored, also EnableIgnoredCategoryIds must be set to true.
MinimumLength |  The constant storing minimum allowed length of path of travel
Top
Methods
Name | Description
GetExcludedCategoryIds |  Returns ElementIds for Category elements which are excluded (not taken into account) by route calculation. These categories are always excluded, regardless of the EnableIgnoredCategoryIds value. If an excluded category has sub-categories, then the sub-categories will be excluded as well.
GetIgnoredCategoryIds |  Returns ElementIds for Category elements which are ignored (not taken into account) route calculation. To enable ignoring of these categories, EnableIgnoredCategoryIds must be set to true. If an ignored category has sub-categories, then the sub-categories will be ignored as well.
GetRouteAnalysisSettings |  Returns the RouteAnalysisSettings element for a given document.
IsLargeGeometryAllowed |  Returns if large geometry is allowed for path of travel creation or not.
SetIgnoredCategoryIds |  Sets the ElementIds for Category elements which are ignored by route calculation.
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace