Revit 2027 API
AnalyticalElement Class
 Base class for a structural analytical elements. AnalyticalElement represents the analytical portion of a given Structural Element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalElement
 Autodesk.Revit.DB.Structure.AnalyticalMember
 Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalyticalElement : Element
Public Class AnalyticalElement
	Inherits Element
public ref class AnalyticalElement : public Element
type AnalyticalElement =
    class
        inherit Element
    end
The AnalyticalElement type exposes the following members.
Properties
Name | Description
AnalyzeAs |  This represents the Analyze As parameter assigned to Analytical Element.
ConnectorManager |  Retrieves the Connector Manager from this AnalyticalElement.
MaterialId |  Defines the Material Id for the Analytical Element.
StructuralRole |  The enum value depicting structural role asigned to the Analytical Element.
Top
Methods
Name | Description
GetCurve |  Returns the curve of the Analytical Element.
GetReference |  Returns a reference to a given curve within the Analytical Element.
GetTransform |  Returns the transform which reflects Analytical Element orientation.
IsSingleCurve |  Indicates if the Analytical Element can be expressed as a single curve.
IsValidAnalyzeAs |  Checks whether the value set for Analyze As is valid for an Analytical Element.
IsValidSelector |  Indicates if the input selector is valid for the Analytical Element.
IsValidStructuralRole |  Checks whether the value set for Analytical Structural Role is valid for an Analytical Element.
IsValidTransform |  Checks whether the value set for Local Coordinate System is valid for an Analytical Element.
SetTransform |  Sets the transform of Analytical Element Local Coordinate System.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace