Revit 2027 API
IFCLevelInfo Methods
The IFCLevelInfo type exposes the following members.
Methods
Name | Description
Create |  Creates an IFCLevelInfo.
Dispose
GetBuildingStorey |  Gets the IfcBuildingStorey handle.
GetLocalPlacement |  Gets the local placement.
GetRelatedElements |  Gets all building elements on this level.
GetRelatedProducts |  Gets all building products on this level.
Top
See Also
Reference
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace