Revit 2027 API
AdvancedLossFactor Properties
The AdvancedLossFactor type exposes the following members.
Properties
Name | Description
BallastLossFactor |  The ballast loss factor.
LampLumenDepreciation |  The lamp lumen depreciation loss factor.
LampTiltLossFactor |  The lamp tilt loss factor.
LuminaireDirtDepreciation |  The luminaire dirt depreciation loss factor.
SurfaceDepreciationLossFactor |  The surface depreciation loss factor.
TemperatureLossFactor |  The temperature loss factor.
VoltageLossFactor |  The voltage loss factor.
Top
See Also
Reference
AdvancedLossFactor Class
Autodesk.Revit.DB.Lighting Namespace