Revit 2027 API
StructuralConnectionSettings Class
 Provides access to project-wide structural connections settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.StructuralConnectionSettings
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralConnectionSettings : Element
Public Class StructuralConnectionSettings
	Inherits Element
public ref class StructuralConnectionSettings : public Element
type StructuralConnectionSettings =
    class
        inherit Element
    end
The StructuralConnectionSettings type exposes the following members.
Properties
Name | Description
IncludeWarningControls |  This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed.
Top
Methods
Name | Description
GetStructuralConnectionSettings |  Obtains the StructuralConnectionSettings object for the specified project document.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace