Revit 2027 API
KeyBasedTreeEntries Methods
The KeyBasedTreeEntries type exposes the following members.
Methods
Name | Description
Dispose
FindEntry |  Finds the KeyBasedTreeEntry associated with the given key value.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetKeyBasedTreeEntriesIterator |  Returns a KeyBasedTreeEntriesIterator that iterates through the collection.
Top
See Also
Reference
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace