Revit 2027 API
ElementSet Properties
The ElementSet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of elements that are in the set.
Top
See Also
Reference
ElementSet Class
Autodesk.Revit.DB Namespace