Revit 2027 API
Line Class
A line in space.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.Line
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Line : Curve
Public Class Line
	Inherits Curve
public ref class Line : public Curve
type Line =
    class
        inherit Curve
    end
The Line type exposes the following members.
Properties
Name | Description
Direction | Returns the direction of the line.
Origin | Returns the origin of the line.
Top
Methods
Name | Description
CreateBound |  Creates a new instance of a bound linear curve.
CreateUnbound |  Creates a new instance of an unbound linear curve.
Top
See Also
Reference
Autodesk.Revit.DB Namespace