Revit 2027 API
SpatialElement Class
 Represents an enclosed area or volume in the Revit model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElement
 Autodesk.Revit.DB.Architecture.Room
 Autodesk.Revit.DB.Area
 Autodesk.Revit.DB.Mechanical.Space
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialElement : Element
Public Class SpatialElement
	Inherits Element
public ref class SpatialElement : public Element
type SpatialElement =
    class
        inherit Element
    end
The SpatialElement type exposes the following members.
Properties
Name | Description
Area | The area.
Level | Gets the level of the room.
Location | The location of the element.
(Overrides Element.Location)
Name | A human readable name for the Element.
(Overrides Element.Name)
Number | The number.
Perimeter | The perimeter.
SpatialElementType |  The spatial element type.
Top
Methods
Name | Description
GetBoundarySegments | Returns the boundary segments.
GetDefaultLocation |  Gets the default location of the spatial element.
GetSpatialElementDomainData |  Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data.
Recenter |  Moves the spatial element to its default location.
Top
See Also
Reference
Autodesk.Revit.DB Namespace