Revit 2027 API
CylindricalHelix Methods
The CylindricalHelix type exposes the following members.
Methods
Name | Description
Create |  Create a cylindrical helix.
Top
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace