Revit 2027 API
JournalingAttribute Properties
The JournalingAttribute type exposes the following members.
Properties
Name | Description
Mode | Journaling mode.
Top
See Also
Reference
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace