Revit 2027 API
ConnectorManager Methods
The ConnectorManager type exposes the following members.
Methods
Name | Description
Dispose
Lookup |  Lookup the connector using the unique index value that identify this connector.
Top
See Also
Reference
ConnectorManager Class
Autodesk.Revit.DB Namespace