Revit 2027 API
TransferredProjectStandardsEventArgs Class
 The event arguments used by the TransferredProjectStandards event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.TransferredProjectStandardsEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TransferredProjectStandardsEventArgs : RevitAPISingleEventArgs
Public Class TransferredProjectStandardsEventArgs
	Inherits RevitAPISingleEventArgs
public ref class TransferredProjectStandardsEventArgs : public RevitAPISingleEventArgs
type TransferredProjectStandardsEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The TransferredProjectStandardsEventArgs type exposes the following members.
Properties
Name | Description
SourceDocument |  Source document.
TargetDocument |  Target document.
Top
Methods
Name | Description
GetSelectedExternalItems |  Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog.
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace