Revit 2027 API
CurtainSystemBase Class
Provides access to the CurtainSystemBase object in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.CurtainSystemBase
 Autodesk.Revit.DB.CurtainSystem
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurtainSystemBase : HostObject
Public Class CurtainSystemBase
	Inherits HostObject
public ref class CurtainSystemBase : public HostObject
type CurtainSystemBase =
    class
        inherit HostObject
    end
The CurtainSystemBase type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
This is the base class of CurtainSystem.
See Also
Reference
Autodesk.Revit.DB Namespace