Revit 2027 API
DocumentSavingEventArgs Class
 The event arguments used by the DocumentSaving event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSavingEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSavingEventArgs : RevitAPIPreDocEventArgs
Public Class DocumentSavingEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class DocumentSavingEventArgs : public RevitAPIPreDocEventArgs
type DocumentSavingEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The DocumentSavingEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace