Revit 2027 API
TableMergedCell Methods
The TableMergedCell type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
TableMergedCell Class
Autodesk.Revit.DB Namespace