Revit 2027 API
MultistoryStairs Methods
The MultistoryStairs type exposes the following members.
Methods
Name | Description
CanConnectLevel |  Checks if the given level can be connected into multistory stairs. You cannot connect levels between standard stairs top and bottom or already connected.
CanDisconnectLevel |  Checks if the given level can be disconnected from multistory stairs. You cannot disconnect the levels of standard stair (the stair associated with the Reference Level for the multistory stairs) or already disconnected.
ConnectLevels |  Extends the multistory stairs by connecting input levels.
Create |  Creates a multistory stairs from an existing component-based stairs.
DisconnectLevels |  Shrinks the multistory stairs by disconnecting input levels.
GetAllConnectedLevels |  Gets all connected level ids of this multistory stairs.
GetAllStairsIds |  Gets the ids of all the stairs in this multistory stairs.
GetStairsOnLevel |  Gets the individual stairs or stairs group on the given base level.
GetStairsPlacementLevels |  Gets all the levels the given stairs group placed on.
IsAcceptableForMultistoryStairs |  Checks if the given stairs can be used to create a multistory stairs.
IsPinned |  Checks if a stair is pinned.
Pin |  Restores an unpinned stairs element back into the group of stairs governed by level height.
Unpin |  Removes a particular story of the stairs (identified by its base level id) from a stairs group.
Top
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace