Revit 2027 API
DWFExportOptions Class
DWF Export options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CADExportOptions
 Autodesk.Revit.DB.DWFExportOptions
 Autodesk.Revit.DB.DWFXExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DWFExportOptions : CADExportOptions
Public Class DWFExportOptions
	Inherits CADExportOptions
public ref class DWFExportOptions : public CADExportOptions
type DWFExportOptions =
    class
        inherit CADExportOptions
    end
The DWFExportOptions type exposes the following members.
Constructors
Name | Description
DWFExportOptions | Default constructor. Sets all options to their default values.
Top
Properties
Name | Description
CropBoxVisible | Whether to export crop box.
ExportingAreas | Whether to also export areas and rooms' geometry.
ExportObjectData | Whether to include properties associated with elements.
ExportOnlyViewId | Only export the specified view.
ExportTexture | Whether to export texture.
ImageFormat | Controls the compression level of images embedded.
ImageQuality | Image quality level when compressed raster format(JPEG) is used.
MergedViews | Whether to merge all views in one file.
PaperFormat | Standard paper format.
PortraitLayout | Paper orientation - Portrait/Landscape.
StopOnError | Whether export process should stop when a view fails to export.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace