Revit 2027 API
Location Methods
The Location type exposes the following members.
Methods
Name | Description
Move | Move the element within the project by a specified vector.
Rotate | Rotate the element within the project by a specified angle around a given axis.
Top
See Also
Reference
Location Class
Autodesk.Revit.DB Namespace