Revit 2027 API
CurveLoopsProfile Class
Represents a curve loop based profile for sweep or swept blend elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SweepProfile
 Autodesk.Revit.DB.CurveLoopsProfile
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveLoopsProfile : SweepProfile
Public Class CurveLoopsProfile
	Inherits SweepProfile
public ref class CurveLoopsProfile : public SweepProfile
type CurveLoopsProfile =
    class
        inherit SweepProfile
    end
The CurveLoopsProfile type exposes the following members.
Properties
Name | Description
Profile | Returns the curve loops of the profile.
Top
Methods
Name | Description
Top
Remarks
Use objects of this type in methods as NewSweep() and NewSweptBlend() in FamilyItemFactory to create the profile.
See Also
Reference
Autodesk.Revit.DB Namespace