Revit 2027 API
BeamSystem Methods
The BeamSystem type exposes the following members.
Methods
Name | Description
BeamBelongsTo | Find out the BeamSystem to which the beam belongs.
Create(Document, IList<Curve>, SketchPlane, Int32) |  Creates a 2D BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, XYZ, Boolean) |  Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, Int32, Boolean) |  Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, SketchPlane, XYZ, Boolean) |  Creates a new BeamSystem with specified profile curves.
DropBeamSystem | Drop beam system, it will disassociate all members from the beam system and delete the beam system.
GetBeamIds | Gets all the beams of the BeamSystem.
Top
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace