Revit 2027 API
NonContinuousRailInfo Methods
The NonContinuousRailInfo type exposes the following members.
Methods
Name | Description
Dispose
IsValidNonContinuousRailHeight |  Checks whether the input height is valid for a non-continuous rail in its associated railing type.
IsValidNonContinuousRailMaterial |  Checks whether an ElementId is a valid material Id of a non-continuous rail.
IsValidNonContinuousRailName |  Checks whether the input name is valid for a non-continuous rail in its associated railing type.
IsValidNonContinuousRailProfile |  Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
Top
See Also
Reference
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace