Revit 2027 API
RebarBendingDetailType Methods
The RebarBendingDetailType type exposes the following members.
Methods
Name | Description
CreateRealistic |  Creates a new RebarBendingDetailType object for full representations.
CreateSchematic |  Creates a new RebarBendingDetailType object for schematic representations.
Top
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace