Revit 2027 API
VendorIdAttribute Properties
The VendorIdAttribute type exposes the following members.
Properties
Name | Description
Value | AddInId VendorId value.
Top
See Also
Reference
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace