Revit 2027 API
ImageType Properties
The ImageType type exposes the following members.
Properties
Name | Description
ExternalResourceType |  The type of external resources that represents images.
Height |  The vertical size of the image
HeightInPixels |  Number of pixels in the vertical direction of the image
PageNumber |  The number of the page in a multi-page file, that was used to create the image in the ImageType.
Path |  The path to the file from which the ImageType was loaded.
PathType |  The path type that was used to refer to the file from which the ImageType was loaded.
Resolution |  The size of the pixels in the image, expressed in dots-per-inch (dpi)
Source |  The source of the image in the ImageType.
Status |  The status of the image
Width |  The horizontal size of the image
WidthInPixels |  Number of pixels in the horizontal direction of the image
Top
See Also
Reference
ImageType Class
Autodesk.Revit.DB Namespace