Revit 2027 API
DocumentWorksharingEnabledEventArgs Class
 The event arguments used by the DocumentWorksharingEnabled event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.DocumentWorksharingEnabledEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentWorksharingEnabledEventArgs : RevitAPISingleEventArgs
Public Class DocumentWorksharingEnabledEventArgs
	Inherits RevitAPISingleEventArgs
public ref class DocumentWorksharingEnabledEventArgs : public RevitAPISingleEventArgs
type DocumentWorksharingEnabledEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The DocumentWorksharingEnabledEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetDocument |  Returns document associated with this event
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace