Revit 2027 API
WorksharingSaveAsOptions Methods
The WorksharingSaveAsOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace