Revit 2027 API
ProjectInfo Class
An object that represents a Project Information within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ProjectInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ProjectInfo : Element
Public Class ProjectInfo
	Inherits Element
public ref class ProjectInfo : public Element
type ProjectInfo =
    class
        inherit Element
    end
The ProjectInfo type exposes the following members.
Properties
Name | Description
Address | Get or Set the Project Address of the Project Information.
Author | Get or Set the Project Author of the Project Information.
BuildingName | Get or Set the Building Name of the Project Information.
ClientName | Get or Set the Client Name of the Project Information.
IssueDate | Get or Set the Project Issue Date of the Project Information.
Name | Get or Set the Project Name of the Project Information.
Number | Get or Set the Project Number of the Project Information.
OrganizationDescription | Get or Set the Organization Description of the Project Information.
OrganizationName | Get or Set the Organization Name of the Project Information.
Status | Get or Set the Project Status of the Project Information.
Top
Methods
Name | Description
Top
Remarks
This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.
Example
ProjectInfo projectInfo = document.ProjectInformation;
if (null != projectInfo)
{
    string message = "Project information:";
    //get the project name
    message += "\nName: " + projectInfo.Name;
    string newName = "My project";
    //set the project name
    projectInfo.Name = newName;
    message += "\nProject Name after set: " + projectInfo.Name;
    //get the project number
    message += "\nNumber: " + projectInfo.Number;
    string newNumber = "TestNumber";
    //set the project number
    projectInfo.Number = newNumber;
    message += "\nProject Number after set: " + projectInfo.Number;
    //get the status of the project
    message += "\nStatus: " + projectInfo.Status;
    string newStatus = "TestStatus";
    //set the project status
    projectInfo.Status = newStatus;
    message += "\nProject status after set: " + projectInfo.Status;
    //get the address of the project
    message += "\nAddress: " + projectInfo.Address;
    string newAddress = "TestAddress";
    //set the project address
    projectInfo.Address = newAddress;
    message += "\nProject address after set: " + projectInfo.Address;
    //get the client name of the project
    message += "\nClient Name: " + projectInfo.ClientName;
    string newClient = "TestClientName";
    //set the client name
    projectInfo.ClientName = newClient;
    message += "\nProject client name after set: " + projectInfo.ClientName;
    //get the gbXmlSetting of the project
    EnergyDataSettings energyDataSetting = EnergyDataSettings.GetEnergyDataSettings(document);
    message += "\nBuilding type: " + energyDataSetting.BuildingType.ToString();
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace