Revit 2027 API
Control Properties
The Control type exposes the following members.
Properties
Name | Description
Origin |  The control origin.
Shape |  The control shape.
View |  The view.
Top
See Also
Reference
Control Class
Autodesk.Revit.DB Namespace