Revit 2027 API
PrimarySizeCriterion Properties
The PrimarySizeCriterion type exposes the following members.
Properties
Name | Description
MaximumSize |  The maximum size of this criterion.
MinimumSize |  The minimum size of this criterion.
Top
See Also
Reference
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace