Revit 2027 API
PointLocationOnCurve Methods
The PointLocationOnCurve type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace