Revit 2027 API
StructuralConnectionHandlerType Class
 A StructuralConnectionHandlerType is used in StructuralConnectionHandler element generation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralConnectionHandlerType : ElementType
Public Class StructuralConnectionHandlerType
	Inherits ElementType
public ref class StructuralConnectionHandlerType : public ElementType
type StructuralConnectionHandlerType =
    class
        inherit ElementType
    end
The StructuralConnectionHandlerType type exposes the following members.
Properties
Name | Description
ConnectionGuid |  The GUID to use for identifying connection geometry generation algorithm.
Top
Methods
Name | Description
Create(Document, String, Guid, String) |  Creates a new StructuralConnectionHandlerType object.
Create(Document, String, Guid, String, ElementId) |  Creates a new StructuralConnectionHandlerType object.
Create(Document, String, Guid, String, ElementId, IList<ConnectionInputPointInfo>) |  Creates a new StructuralConnectionHandlerType object.
CreateDefaultStructuralConnectionHandlerType |  Creates a new StructuralConnectionHandlerType object with a default name.
FindGenericConnectionType |  Finds StructuralConnectionHandlerType which is Generic Connection type.
GetDefaultConnectionHandlerType |  Gets a default type id for Structural Connection.
IsCustom |  Checks if StructuralConnectionHandlerType is custom.
IsDetailed |  Checks if StructuralConnectionHandlerType is detailed.
IsGeneric |  Checks if StructuralConnectionHandlerType is generic.
IsTypeNameValidForCustomConnection |  Validates if the input name matches the criteria of StructuralConnectionHandlerType name. Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\/:*?";<>| or any of the non-printable characters.
UpdateCustomConnectionType |  Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler. Adds input elements or subelements. Removes input subelements.The subelements will be erased. Updates any geometrical, parametrical or location changes of existing subelements, regardless of whether elements or subelements are added or removed.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace