Revit 2027 API
UnauthenticatedException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.UnauthenticatedException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class UnauthenticatedException : ApplicationException
<SerializableAttribute>
Public Class UnauthenticatedException
	Inherits ApplicationException
[SerializableAttribute]
public ref class UnauthenticatedException : public ApplicationException
[<SerializableAttribute>]
type UnauthenticatedException =
    class
        inherit ApplicationException
    end
The UnauthenticatedException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace