Revit 2027 API
ArcLengthDimension Class
 An object that represents an ArcLengthDimension within the Revit Project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.AngularDimension
 Autodesk.Revit.DB.ArcLengthDimension
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ArcLengthDimension : AngularDimension
Public Class ArcLengthDimension
	Inherits AngularDimension
public ref class ArcLengthDimension : public AngularDimension
type ArcLengthDimension =
    class
        inherit AngularDimension
    end
The ArcLengthDimension type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of an Arc Length Dimension element within the project.
Top
See Also
Reference
Autodesk.Revit.DB Namespace