Revit 2027 API
ExternalCommandData Class
 A class contains reference to Application and View which are needed by external command.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.UI.ExternalCommandData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalCommandData : APIObject
Public Class ExternalCommandData
	Inherits APIObject
public ref class ExternalCommandData : public APIObject
type ExternalCommandData =
    class
        inherit APIObject
    end
The ExternalCommandData type exposes the following members.
Properties
Name | Description
Application |  Retrieves an object that represents the current Application for external command.
JournalData | A data map that can be used to read and write data to the Autodesk Revit journal file.
View |  Retrieves an object that represents the View external command work on.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace