Revit 2027 API
ElementStructuralTypeFilter Class
 A filter used to find elements matching a structural type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementStructuralTypeFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementStructuralTypeFilter : ElementQuickFilter
Public Class ElementStructuralTypeFilter
	Inherits ElementQuickFilter
public ref class ElementStructuralTypeFilter : public ElementQuickFilter
type ElementStructuralTypeFilter =
    class
        inherit ElementQuickFilter
    end
The ElementStructuralTypeFilter type exposes the following members.
Constructors
Name | Description
ElementStructuralTypeFilter(StructuralType) |  Constructs a new instance of a filter to match elements by structural type.
ElementStructuralTypeFilter(StructuralType, Boolean) |  Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type.
Top
Properties
Name | Description
StructuralType |  The structural type.
Top
Methods
Name | Description
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace