Revit 2027 API
BuildingEnvelopeAnalyzer Methods
The BuildingEnvelopeAnalyzer type exposes the following members.
Methods
Name | Description
Create |  Creates a new analyzer.
Dispose
GetBoundingElements |  Returns the collection of building elements exposed to the outside forming the building envelope.
GetBoundingElementsForSpaceVolume |  Returns the collection of bounding building elements for an enclosed space volume.
GetCenterPointsForConnectedGridCellsInSpaceVolume |  Returns the collection of connected cells in an enclosed space volume.
Top
See Also
Reference
BuildingEnvelopeAnalyzer Class
Autodesk.Revit.DB.Analysis Namespace