Revit 2027 API
GroupType Properties
The GroupType type exposes the following members.
Properties
Name | Description
Groups | Retrieve a set of all the groups that have this type.
Top
See Also
Reference
GroupType Class
Autodesk.Revit.DB Namespace