Revit 2027 API
ElementPhaseStatusFilter Methods
The ElementPhaseStatusFilter type exposes the following members.
Methods
Name | Description
GetPhaseStatuses |  Returns the phase statuses assigned to this filter.
Top
See Also
Reference
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace