Revit 2027 API
PathOfTravel Properties
The PathOfTravel type exposes the following members.
Properties
Name | Description
LineStyle |  The line style of the path.
PathEnd |  The end point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update.
PathMidpoint |  The midpoint of the path. The Z coordinate will equal the view's level elevation.
PathStart |  The start point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update.
Top
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace