Revit 2027 API
StairsRun Class
 Represents a stairs run element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.StairsRun
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StairsRun : Element
Public Class StairsRun
	Inherits Element
public ref class StairsRun : public Element
type StairsRun =
    class
        inherit Element
    end
The StairsRun type exposes the following members.
Properties
Name | Description
ActualRisersNumber |  The actual number of stairs risers in the stairs run.
ActualRunWidth |  Specifies the value of the tread width excluding the width of independent side supports.
ActualTreadsNumber |  The actual number of stairs treads in the stairs run.
BaseElevation |  The base elevation of the stairs run.
BeginsWithRiser |  True if the stairs run begins with a riser, false otherwise.
EndsWithRiser |  True if the stairs run ends with a riser, false otherwise.
ExtensionBelowRiserBase |  Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a riser.
ExtensionBelowTreadBase |  Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a tread.
Height |  The calculated height of the stairs run.
LocationLineJustification |  The position of the run relative to the Up-direction path used to create the run.
StairsRunStyle |  The style of the stairs run such as straight, winder, etc.
TopElevation |  The top elevation of the stairs run.
Top
Methods
Name | Description
CreateSketchedRun |  Creates a sketched run in the project document by providing a group of boundary curves and riser curves.
CreateSketchedRunWithSlopeData |  Creates a sketched run in the project document by providing a group of boundary curves and riser curves, specifying slope type and height for boundary curves.
CreateSpiralRun |  Creates a spiral run in the project document by providing the center, start angle and included angle.
CreateStraightRun |  Creates a straight run in the project document.
GetAllSupports |  Retrieves all supports hosted by the stair's run.
GetConnections |  Returns information about the connections in which the stairs run participates. The stairs run may have no connection, or have at maximum two connections at the lower and upper ends.
GetFootprintBoundary |  Returns the run's boundary curves which are projected on the stairs base level.
GetLeftSupports |  Retrieves all supports on the left side of run boundaries.
GetNumberSystemReference |  Gets the number system reference corresponding to the given reference options.
GetRightSupports |  Retrieves all supports on the right side of run boundaries.
GetStairs |  Returns the stairs to which the stairs run belongs.
GetStairsPath |  Returns the stairs path curves on the run. The curves are projected on base level of the stairs.
SetLocationPathForSpiralRun |  Set Location path for a spiral run.
SetLocationPathForStraightRun |  Set location path for a straight run by giving a line.
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace