Revit 2027 API
DocumentClosedEventArgs Class
 The event arguments used by the DocumentClosed event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.DocumentClosedEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentClosedEventArgs : RevitAPIPostEventArgs
Public Class DocumentClosedEventArgs
	Inherits RevitAPIPostEventArgs
public ref class DocumentClosedEventArgs : public RevitAPIPostEventArgs
type DocumentClosedEventArgs =
    class
        inherit RevitAPIPostEventArgs
    end
The DocumentClosedEventArgs type exposes the following members.
Properties
Name | Description
DocumentId |  Id of the document that has just been closed.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace