Revit 2027 API
DimensionSegmentArray Class
An array that can contain any number of DimensionSegment objects.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DimensionSegmentArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DimensionSegmentArray : APIObject,
	IEnumerable
Public Class DimensionSegmentArray
	Inherits APIObject
	Implements IEnumerable
public ref class DimensionSegmentArray : public APIObject,
	IEnumerable
type DimensionSegmentArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The DimensionSegmentArray type exposes the following members.
Constructors
Name | Description
DimensionSegmentArray | Initializes a new instance of the DimensionSegmentArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an item at a specified index within the array.
Size | Returns the number of objects that are in the array.
Top
Methods
Name | Description
Append | Add the item to the end of the array.
Clear | Removes every item from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified item into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace