Revit 2027 API
AreaReinforcementCurve Properties
The AreaReinforcementCurve type exposes the following members.
Properties
Name | Description
Curve | Returns the 3D curve forming part of the boundary of an Area Reinforcement element.
Top
See Also
Reference
AreaReinforcementCurve Class
Autodesk.Revit.DB.Structure Namespace