Revit 2027 API
CodeCheckingParameterServiceData Class
 The data needed by code checking server to perform code checking.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CodeCheckingParameterServiceData : IDisposable
Public Class CodeCheckingParameterServiceData
	Implements IDisposable
public ref class CodeCheckingParameterServiceData : IDisposable
type CodeCheckingParameterServiceData =
    class
        interface IDisposable
    end
The CodeCheckingParameterServiceData type exposes the following members.
Properties
Name | Description
Document |  The current document.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CodeCheckingParameterServiceData
GetCurrentElements |  Returns the list of Ids of the current elements.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace