Revit 2027 API
FolderItemInfo Methods
The FolderItemInfo type exposes the following members.
Methods
Name | Description
Dispose
GetGroupingParameterIdPath |  The parameter Id path used to determine the folder items in the browser.
Top
See Also
Reference
FolderItemInfo Class
Autodesk.Revit.DB Namespace