Revit 2027 API
PromptForFamilyInstancePlacementOptions Methods
The PromptForFamilyInstancePlacementOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace