Revit 2027 API
CombinableElementArray Methods
The CombinableElementArray type exposes the following members.
Methods
Name | Description
Append | Add the element to the end of the array.
Clear | Removes every CombinableElement from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert | Insert the specified element into the array.
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
CombinableElementArray Class
Autodesk.Revit.DB Namespace