Revit 2027 API
DialogBoxData Methods
The DialogBoxData type exposes the following members.
Methods
Name | Description
OverrideResult |  Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Top
See Also
Reference
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace