Revit 2027 API
RibbonItemData Class
Base class used to contain information necessary to construct a RibbonItem in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 More
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RibbonItemData : ItemData
Public Class RibbonItemData
	Inherits ItemData
public ref class RibbonItemData : public ItemData
type RibbonItemData =
    class
        inherit ItemData
    end
The RibbonItemData type exposes the following members.
Properties
Name | Description
LongDescription |  Long description of the command tooltip
ToolTipImage | The image to show as a part of the button extended tooltip
Top
Methods
Name | Description
GetContextualHelp | Gets the contextual help bound with this control.
SetContextualHelp | Sets the contextual help bound with this button data.
Top
See Also
Reference
Autodesk.Revit.UI Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.ComboBoxData
 Autodesk.Revit.UI.ComboBoxMemberData
 Autodesk.Revit.UI.RadioButtonGroupData
 Autodesk.Revit.UI.TextBoxData