Revit 2027 API
AreaLoadType Class
 AreaLoadType class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.LoadTypeBase
 Autodesk.Revit.DB.Structure.AreaLoadType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AreaLoadType : LoadTypeBase
Public Class AreaLoadType
	Inherits LoadTypeBase
public ref class AreaLoadType : public LoadTypeBase
type AreaLoadType =
    class
        inherit LoadTypeBase
    end
The AreaLoadType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace