Revit 2027 API
BackgroundSettings Class
 Represents the rendering background settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundSettings
 Autodesk.Revit.DB.ColorBackgroundSettings
 Autodesk.Revit.DB.GradientBackgroundSettings
 Autodesk.Revit.DB.ImageBackgroundSettings
 Autodesk.Revit.DB.SkyBackgroundSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BackgroundSettings : IDisposable
Public Class BackgroundSettings
	Implements IDisposable
public ref class BackgroundSettings : IDisposable
type BackgroundSettings =
    class
        interface IDisposable
    end
The BackgroundSettings type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the BackgroundSettings
Top
See Also
Reference
Autodesk.Revit.DB Namespace