Revit 2027 API
NumberedReferenceInfo Methods
The NumberedReferenceInfo type exposes the following members.
Methods
Name | Description
Dispose
GetReference |  The target reference for this object.
Top
See Also
Reference
NumberedReferenceInfo Class
Autodesk.Revit.DB Namespace