Revit 2027 API
TriangleInShellComponent Methods
The TriangleInShellComponent type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace