Revit 2027 API
VertexIndexPairArray Class
An array that contains VertexIndex pairs.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.VertexIndexPairArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexIndexPairArray : APIObject,
	IEnumerable
Public Class VertexIndexPairArray
	Inherits APIObject
	Implements IEnumerable
public ref class VertexIndexPairArray : public APIObject,
	IEnumerable
type VertexIndexPairArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The VertexIndexPairArray type exposes the following members.
Constructors
Name | Description
VertexIndexPairArray | Initializes a new instance of the VertexIndexPairArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a VertexIndex pair at a specified index within the array.
Size | Returns the number of VertexIndex pairs that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every VertexIndex pair from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace