Revit 2027 API
BoundingBoxContainsPointFilter Properties
The BoundingBoxContainsPointFilter type exposes the following members.
Properties
Name | Description
Point |  The XYZ point to use when matching element bounding boxes.
Tolerance |  Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
Top
See Also
Reference
BoundingBoxContainsPointFilter Class
Autodesk.Revit.DB Namespace