Revit 2027 API
FamilyInstanceFilter Class
 A filter used to find elements that are family instances of the given family symbol.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.FamilyInstanceFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyInstanceFilter : ElementSlowFilter
Public Class FamilyInstanceFilter
	Inherits ElementSlowFilter
public ref class FamilyInstanceFilter : public ElementSlowFilter
type FamilyInstanceFilter =
    class
        inherit ElementSlowFilter
    end
The FamilyInstanceFilter type exposes the following members.
Constructors
Name | Description
FamilyInstanceFilter |  Constructs a new instance of a filter to match family instances of the given family symbol.
Top
Properties
Name | Description
FamilySymbolId |  The family symbol id.
Top
Methods
Name | Description
Top
Remarks
 This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.
Example
// Creates a FamilyInstance filter for elements that are family instances of the given family symbol in the document
// Find all family symbols whose name is "W10X49"
FilteredElementCollector collector = new FilteredElementCollector(document);
collector = collector.OfClass(typeof(FamilySymbol));
// Get Element Id for family symbol which will be used to find family instances
var query = from element in collector where element.Name == "W10X49" select element;
List<Element> famSyms = query.ToList<Element>();
ElementId symbolId = famSyms[0].Id;
// Create a FamilyInstance filter with the FamilySymbol Id
FamilyInstanceFilter filter = new FamilyInstanceFilter(document, symbolId);
// Apply the filter to the elements in the active document
collector = new FilteredElementCollector(document);
ICollection<Element> familyInstances = collector.WherePasses(filter).ToElements();
See Also
Reference
Autodesk.Revit.DB Namespace