Revit 2027 API
RevitServerModelNameBreaksConventionException Class
The exception that is thrown when the model is breaking the project naming convention.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class RevitServerModelNameBreaksConventionException : RevitServerException
<SerializableAttribute>
Public Class RevitServerModelNameBreaksConventionException
	Inherits RevitServerException
[SerializableAttribute]
public ref class RevitServerModelNameBreaksConventionException : public RevitServerException
[<SerializableAttribute>]
type RevitServerModelNameBreaksConventionException =
    class
        inherit RevitServerException
    end
The RevitServerModelNameBreaksConventionException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace