Revit 2027 API
FilteredElementIterator Methods
The FilteredElementIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  The current element found by the iterator.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next element passing the filter.
Reset |  Resets the iterator to the beginning.
Top
See Also
Reference
FilteredElementIterator Class
Autodesk.Revit.DB Namespace