Revit 2027 API
HandRail Class
 Represents a hand rail element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.ContinuousRail
 Autodesk.Revit.DB.Architecture.HandRail
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HandRail : ContinuousRail
Public Class HandRail
	Inherits ContinuousRail
public ref class HandRail : public ContinuousRail
type HandRail =
    class
        inherit ContinuousRail
    end
The HandRail type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace