Revit 2027 API
PartMaker Class
 PartMaker is an element which takes some source elements (e.g., a wall with all its layers) and creates one or more Parts out of it. The logic according to which these Parts are created is non-trivial and PartMaker uses various PartMakerMethods which represents these logics. This element manages the strategy to make Part elements for one or more original elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.PartMaker
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PartMaker : Element
Public Class PartMaker
	Inherits Element
public ref class PartMaker : public Element
type PartMaker =
    class
        inherit Element
    end
The PartMaker type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetSourceElementIds |  Get the source elements for the PartMaker.
IsSourceElement |  Is the element a source for this PartMaker
SetSourceElementIds |  Set the source elements for the PartMaker.
Top
See Also
Reference
Autodesk.Revit.DB Namespace