Revit 2027 API
PolymeshFacet Methods
The PolymeshFacet type exposes the following members.
Methods
Name | Description
GetVertices |  Returns the three vertices that define this facet
ToString |  Returns formatted string showing (V1, V2, V3) with values formatted as regular integers
(Overrides Object.ToString())
Top
See Also
Reference
PolymeshFacet Class
Autodesk.Revit.DB Namespace