Revit 2027 API
FabricWireItem Class
 Provides implementation for FabricWires stored in a Custom Fabric Sheet
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.FabricWireItem
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricWireItem : IDisposable
Public Class FabricWireItem
	Implements IDisposable
public ref class FabricWireItem : IDisposable
type FabricWireItem =
    class
        interface IDisposable
    end
The FabricWireItem type exposes the following members.
Properties
Name | Description
Distance |  Distance to the next fabric wire item Can be 0 to be used with offset along wire.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OffsetAlongWire |  Offset along wire direction Wire distance should be 0 if we want to be along the same wire
WireLength |  Wire length for this wire item
WireType |  The wire type of this wire item
Top
Methods
Name | Description
Create |  Creates a new instance of a single Fabric wire.
Dispose | Releases all resources used by the FabricWireItem
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace