Revit 2027 API
DirectShapeType Properties
The DirectShapeType type exposes the following members.
Properties
Name | Description
UserAssignability |  An option controlling the ability of DirectShapes to assign this DirectShapeType as its type.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace