Revit 2027 API
ExternallyTaggedGeometryObject Methods
The ExternallyTaggedGeometryObject type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace