Revit 2027 API
ConnectionValidationWarning Methods
The ConnectionValidationWarning type exposes the following members.
Methods
Name | Description
Dispose
GetParts |  Get ElementIds of affected parts.
Top
See Also
Reference
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace