Revit 2027 API
FamilyParameter Methods
The FamilyParameter type exposes the following members.
Methods
Name | Description
GetUnitTypeId | Gets the identifier of the unit quantifying the parameter value.
Top
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace