Revit 2027 API
DimensionSegmentArrayIterator Methods
The DimensionSegmentArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
DimensionSegmentArrayIterator Class
Autodesk.Revit.DB Namespace