Revit 2027 API
FabricReinSpanSymbol Class
 Represents an instance of a Structural Fabric Reinforcement Symbol in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.FabricReinSpanSymbol
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricReinSpanSymbol : IndependentTag
Public Class FabricReinSpanSymbol
	Inherits IndependentTag
public ref class FabricReinSpanSymbol : public IndependentTag
type FabricReinSpanSymbol =
    class
        inherit IndependentTag
    end
The FabricReinSpanSymbol type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace