Revit 2027 API
DesignOption Class
 An element that represents a design alternative.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.DesignOption
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DesignOption : Element
Public Class DesignOption
	Inherits Element
public ref class DesignOption : public Element
type DesignOption =
    class
        inherit Element
    end
The DesignOption type exposes the following members.
Properties
Name | Description
IsPrimary |  Determines whether this is a primary design option.
Top
Methods
Name | Description
GetActiveDesignOptionId |  Gets the active design option id for the document.
Top
Remarks
 Design options enable the user to add alternative designs within the same project. Each element can either be in a design option or not at all, in which case it is considered to be part of the main model and have no design alternatives.
See Also
Reference
Autodesk.Revit.DB Namespace