Revit 2027 API
Sweep Class
A sweep solid or void form.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CombinableElement
 Autodesk.Revit.DB.GenericForm
 Autodesk.Revit.DB.Sweep
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Sweep : GenericForm
Public Class Sweep
	Inherits GenericForm
public ref class Sweep : public GenericForm
type Sweep =
    class
        inherit GenericForm
    end
The Sweep type exposes the following members.
Properties
Name | Description
IsTrajectorySegmentationEnabled | The trajectory segmentation option for the sweep.
MaxSegmentAngle | The maximum segment angle of the sweep in radians.
Path3d | The selected curves used for the sweep path.
PathSketch | The sketched path for the sweep.
ProfileSketch | The profile sketch of the sweep.
ProfileSymbol | The family symbol profile details for the sweep.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace