Revit 2027 API
FasciaType Class
An object that represents the fascia type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.HostedSweepType
 Autodesk.Revit.DB.Architecture.FasciaType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FasciaType : HostedSweepType
Public Class FasciaType
	Inherits HostedSweepType
public ref class FasciaType : public HostedSweepType
type FasciaType =
    class
        inherit HostedSweepType
    end
The FasciaType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace