Revit 2027 API
TilePattern Class
An object representing a tile pattern that may be applied to a DividedSurface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.TilePattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TilePattern : ElementType
Public Class TilePattern
	Inherits ElementType
public ref class TilePattern : public ElementType
type TilePattern =
    class
        inherit ElementType
    end
The TilePattern type exposes the following members.
Properties
Name | Description
TilePatternType | The built-in system tile pattern specified by this object.
TilesPerSeedNode | Get the number of tiles located at each seed node.
Top
Methods
Name | Description
Top
Remarks
TilePatterns cannot be created. A fixed selection is built into each Conceptual Mass family. TilePatterns can be retrieved by key from the Revit::DB::Document::Settings::TilePatternTable object.
See Also
Reference
Autodesk.Revit.DB Namespace