Revit 2027 API
DefinitionBindingMapIterator Properties
The DefinitionBindingMapIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the binding that is the current focus of the iterator.
Key | Retrieves the definition that is the current focus of the iterator.
Top
See Also
Reference
DefinitionBindingMapIterator Class
Autodesk.Revit.DB Namespace