Revit 2027 API
DuctFittingAndAccessoryPressureDropItem Class
 A flow path of the duct/pipe fitting and accessory. It is defined by the begin connector and end connector.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropItem
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctFittingAndAccessoryPressureDropItem : IDisposable
Public Class DuctFittingAndAccessoryPressureDropItem
	Implements IDisposable
public ref class DuctFittingAndAccessoryPressureDropItem : IDisposable
type DuctFittingAndAccessoryPressureDropItem =
    class
        interface IDisposable
    end
The DuctFittingAndAccessoryPressureDropItem type exposes the following members.
Properties
Name | Description
BeginConnectorIndex |  The index of the begin connector of the flow path.
Coefficient |  The coefficient between the begin connector and end connector, unitless.
EndConnectorIndex |  The index of the end conector of the flow path.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
VelocityPressure |  The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).
Top
Methods
Name | Description
Dispose | Releases all resources used by the DuctFittingAndAccessoryPressureDropItem
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace