Revit 2027 API
CableSize Methods
The CableSize type exposes the following members.
Methods
Name | Description
Create |  Creates a Cable Size.
Dispose
Duplicate |  Duplicates this Cable Size.
GetCableSize |  Gets the Cable Size data by given Cable Size id.
GetCableSizeIdByName |  Gets the Cable Size id by given Cable Size name.
GetCableSizeIds |  Gets all the Cable Size ids in the given document, sorted by name.
Top
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace