Revit 2027 API
RoofComponents Class
 A class that contains multiple roof slab infos of a roof.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.RoofComponents
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RoofComponents : IDisposable
Public Class RoofComponents
	Implements IDisposable
public ref class RoofComponents : IDisposable
type RoofComponents =
    class
        interface IDisposable
    end
The RoofComponents type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ScaledDepth |  The depth of the roof slab.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RoofComponents
GetAreasOfCurveLoops |  The areas of CurveLoops of roof slabs.
GetCurveLoops |  The CurveLoops of roof slabs.
GetLoopFaces |  The faces of the loops of roof slabs.
GetPlaneDirections |  The plane directions of roof slabs.
GetPlaneOrigins |  The plane origins of roof slabs.
Top
Remarks
 This class contains a series of collections that are all of the same length, and whose nth index corresponds to the nth slab of the roof.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace