Revit 2027 API
IExternalResourceUIServer Methods
The IExternalResourceUIServer type exposes the following members.
Methods
Name | Description
GetDBServerId |  Implement this method to return the id of the server which is associated with this UI server.
HandleBrowseResult |  Implement this method to handle results from browsing external resources in the UI. It is recommended that the server only respond in the case of a critical error.
HandleLoadResourceResults |  Implement this method to display any UI related to messages or errors that result when the DB server associated with this UI server attempts to load an external resource.
Top
See Also
Reference
IExternalResourceUIServer Interface
Autodesk.Revit.UI Namespace