Revit 2027 API
CurveByPointsArray Methods
The CurveByPointsArray type exposes the following members.
Methods
Name | Description
Append
Clear | Removes every curve from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
CurveByPointsArray Class
Autodesk.Revit.DB Namespace