Revit 2027 API
FilterStringEndsWith Class
 Tests whether string values from the document end with a certain string.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterStringRuleEvaluator
 Autodesk.Revit.DB.FilterStringEndsWith
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterStringEndsWith : FilterStringRuleEvaluator
Public Class FilterStringEndsWith
	Inherits FilterStringRuleEvaluator
public ref class FilterStringEndsWith : public FilterStringRuleEvaluator
type FilterStringEndsWith =
    class
        inherit FilterStringRuleEvaluator
    end
The FilterStringEndsWith type exposes the following members.
Constructors
Name | Description
FilterStringEndsWith |  Constructs an instance of FilterStringEndsWith.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 All string comparisons in this class are performed in the case-insensitive manner.
See Also
Reference
Autodesk.Revit.DB Namespace