Revit 2027 API
AlphanumericRevisionSettings Class
 Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AlphanumericRevisionSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AlphanumericRevisionSettings : IDisposable
Public Class AlphanumericRevisionSettings
	Implements IDisposable
public ref class AlphanumericRevisionSettings : IDisposable
type AlphanumericRevisionSettings =
    class
        interface IDisposable
    end
The AlphanumericRevisionSettings type exposes the following members.
Constructors
Name | Description
AlphanumericRevisionSettings() |  Constructs an AlphanumericRevisionSettings with a simple, default sequence.
AlphanumericRevisionSettings(AlphanumericRevisionSettings) |  Constructs a new copy of the input AlphanumericRevisionSettings object.
AlphanumericRevisionSettings(IList<String>, String, String) |  Constructs an AlphanumericRevisionSettings object.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Prefix |  The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType.
Suffix |  The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AlphanumericRevisionSettings
GetSequence |  Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType.
IsEqual |  Determines whether a specified AlphanumericRevisionSettings is the same as 'this'.
IsValid |  Determines whether the AlphanumericRevisionSettings object is in a valid state.
SetSequence |  Sets the sequence of strings to be used as numbers for revisions with the Alphanumeric RevisionNumberType.
Top
See Also
Reference
Autodesk.Revit.DB Namespace