Revit 2027 API
SpatialElementBoundaryOptions Class
 Options that can be passed to a SpatialElementBoundaryCalculator to influence the results of the calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpatialElementBoundaryOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialElementBoundaryOptions : IDisposable
Public Class SpatialElementBoundaryOptions
	Implements IDisposable
public ref class SpatialElementBoundaryOptions : IDisposable
type SpatialElementBoundaryOptions =
    class
        interface IDisposable
    end
The SpatialElementBoundaryOptions type exposes the following members.
Constructors
Name | Description
SpatialElementBoundaryOptions |  Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SpatialElementBoundaryLocation |  The boundary of spatial element for geometry calculation.
StoreFreeBoundaryFaces |  Indicates whether to include the free boundary faces in the result.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SpatialElementBoundaryOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace