Revit 2027 API
MemberForcesServiceData Methods
The MemberForcesServiceData type exposes the following members.
Methods
Name | Description
Dispose
GetCurrentElements |  Returns the list of Ids of the current elements.
Top
See Also
Reference
MemberForcesServiceData Class
Autodesk.Revit.DB.Structure Namespace