Revit 2027 API
ExternalDataManagerTool Class
 Represents an item of a content tool.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalDataManagerTool
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalDataManagerTool : IDisposable
Public Class ExternalDataManagerTool
	Implements IDisposable
public ref class ExternalDataManagerTool : IDisposable
type ExternalDataManagerTool =
    class
        interface IDisposable
    end
The ExternalDataManagerTool type exposes the following members.
Constructors
Name | Description
ExternalDataManagerTool(ExternalDataManagerCommandId) |  Constructor
ExternalDataManagerTool(ExternalDataManagerTool) |  Create a copy of the object.
Top
Properties
Name | Description
CommandId |  The id of the root command represented by this tool item.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalDataManagerTool
GetChildCommandIds |  Obtains the sub menu of the item.
SetChildCommandIds |  Sets the sub menu of the item
Top
Remarks
 A tool item represents either a single actionable command (leaf) or a container that owns one or more child commands (parent/branch). Tool items are returned by IExternalDataManagerServer.getContentTools and are used to populate the context-sensitive content tools panel or right-click menus. A typical workflow is: 1. The server constructs a tool item providing the id of the root command. 2. If the root command has sub-commands the server fills ChildCommandIds with the ids of those sub-commands. 3. Revit uses the ids to look-up command metadata in ExternalDataManagerCommand and builds the appropriate UI. All user-visible strings associated with commands (name, tooltip) should be localized by the server.
See Also
Reference
Autodesk.Revit.UI Namespace