Revit 2027 API
LineLoad Class
 An object that represents a force/moment applied in a linear manner.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadBase
 Autodesk.Revit.DB.Structure.LineLoad
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LineLoad : LoadBase
Public Class LineLoad
	Inherits LoadBase
public ref class LineLoad : public LoadBase
type LineLoad =
    class
        inherit LoadBase
    end
The LineLoad type exposes the following members.
Properties
Name | Description
EndPoint |  Returns the three dimensional location of the end point for the line load.
ForceVector1 |  The force vector applied to the start point of the line load, oriented according to OrientTo setting.
ForceVector2 |  The force vector applied to the end point of the line load, oriented according to OrientTo setting.
IsProjected |  Indicates if the load is projected.
IsUniform |  Indicates if the load is uniform.
MomentVector1 |  The moment vector applied to the start point of the line load, oriented according to OrientTo setting.
MomentVector2 |  The moment vector applied to the end point of the line load, oriented according to OrientTo setting.
StartPoint |  Returns the three dimensional location of the start point for the line load.
Top
Methods
Name | Description
Create(Document, ElementId, XYZ, XYZ, LineLoadType) |  Creates a new hosted line load within the project.
Create(Document, ElementId, Curve, XYZ, XYZ, LineLoadType) |  Creates a new custom line load within the project.
Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType) |  Creates a new hosted line load within the project.
GetCurve |  Returns curve that define geometry of the line load.
IsCurveInsideHostBoundaries |  Indicates if the curve is inside panel's boundaries or on panel's edges or if the curve is on the member's curve.
IsValidHostId |  Indicates if the provided host id can host line loads.
SetCurve |  Sets the curve for the line load.
SetPoints |  Sets start and end point of the line load.
Top
Remarks
 The load/moment may be uniform or it may vary between the two ends of the line.
Example
 private void LineLoadInformation(LineLoad lineLoad)
{
     StringBuilder information = new StringBuilder("Line Load: ");
     // Get the load case name
     information.Append("\nLoad case for load: " + lineLoad.LoadCaseName);
     //Get the three dimensional force applied to the start point and end point of the line load.
     information.Append("\nForce at the start of this line load: " + XYZToString(lineLoad.ForceVector1));
     information.Append("\nForce at the end of this line load: " + XYZToString(lineLoad.ForceVector2));
     //Get the three dimensional location of the start point and end point for the line load.
     information.Append("\nStart point of this line load: " + XYZToString(lineLoad.StartPoint));
     information.Append("\nEnd Point of this line load: " + XYZToString(lineLoad.EndPoint));
     //Get the three dimensional moment applied to the start point and end point of the line load.
     information.Append("\nMoment at the start of this line load: " + XYZToString(lineLoad.MomentVector1));
     information.Append("\nMoment at the end of this line load: " + XYZToString(lineLoad.MomentVector2));
     //Whether the load is projected or not
     if (lineLoad.IsProjected)
     {
         information.Append("\nThis line load is projected.");
     }
     else
     {
         information.Append("\nThis line load is not projected");
     }
     //Report if the load is uniform
     if (false != lineLoad.IsUniform)
     {
         information.Append("\nThis load is uniform.");
     }
     else
     {
         information.Append("\nThis load is not uniform.");
     }
     //show information of lineload in a MessageBox.
     TaskDialog.Show("Revit",information.ToString());
 }
 // output the point's three coordinates
 string XYZToString(XYZ point)
 {
     return "(" + point.X + ", " + point.Y + ", " + point.Z + ")";
 }
See Also
Reference
Autodesk.Revit.DB.Structure Namespace