Revit 2027 API
ConductorSize Methods
The ConductorSize type exposes the following members.
Methods
Name | Description
Create |  Creates a Conductor Size.
Dispose
GetConductorSize |  Gets the Conductor Size data by given Conductor Size id.
GetConductorSizeIdByName |  Gets the Conductor Size id by given Conductor Size name.
GetConductorSizeIds |  Gets all the Conductor Size ids in the given document, sorted by name.
Top
See Also
Reference
ConductorSize Class
Autodesk.Revit.DB.Electrical Namespace