Revit 2027 API
StructuralSectionRound Properties
The StructuralSectionRound type exposes the following members.
Properties
Name | Description
CentroidHorizontal |  Distance from centroid to the left extremites along horizontal axis.
CentroidVertical |  Distance from centroid to the upper extremites along vertical axis.
Diameter |  Pipe Diameter.
NameKey |  Name Key
Top
See Also
Reference
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace