Revit 2027 API
ClipPlane Class
 A set of parameters representing a clip plane in DirectContext3D.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.ClipPlane
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ClipPlane : IDisposable
Public Class ClipPlane
	Implements IDisposable
public ref class ClipPlane : IDisposable
type ClipPlane =
    class
        interface IDisposable
    end
The ClipPlane type exposes the following members.
Constructors
Name | Description
ClipPlane |  Constructs a copy of the clip plane.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Normal |  The plane's normal vector.
Origin |  The plane's origin.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ClipPlane
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace