Revit 2027 API
RadioButtonGroupData Class
This class contains information necessary to construct a ribbon gallery in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.RadioButtonGroupData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RadioButtonGroupData : RibbonItemData
Public Class RadioButtonGroupData
	Inherits RibbonItemData
public ref class RadioButtonGroupData : public RibbonItemData
type RadioButtonGroupData =
    class
        inherit RibbonItemData
    end
The RadioButtonGroupData type exposes the following members.
Constructors
Name | Description
RadioButtonGroupData | Constructs a new instance of RadioButtonGroupData.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.UI Namespace