Revit 2027 API
CommandMenuItem Methods
The CommandMenuItem type exposes the following members.
Methods
Name | Description
SetAvailabilityClassName |  Set availabilityClassName of CommandMenuItem
SetToolTip |  Set toolTip of CommandMenuItem
Top
See Also
Reference
CommandMenuItem Class
Autodesk.Revit.UI Namespace