Revit 2027 API
IFCCategoryTemplate Methods
The IFCCategoryTemplate type exposes the following members.
Methods
Name | Description
CopyTemplate |  Create copy of mapping template with new name.
Create |  Create a IFC category mapping template with default values.
ExportToFile |  Export mapping template to a text file.
FindByName |  Returns mapping template element by name.
GetActiveTemplate |  Gets the active mapping template element in the document.
GetCategoryMappingTable |  Gets the table that contains a mapping from Revit categories to IFC entities.
GetMappingInfoById |  Gets a copy of IFC mapping info by category id.
GetOrCreateInSessionTemplate |  Gets the in-session non-serializable template or create new.
ImportFromFile |  Import mapping template from a text file.
IsValidName |  Returns result that the proposed name is valid and not exist in the specified document.
ListNames |  Returns a list of names of IFC export mapping templates.
ResetActiveTemplate |  Removes the information about active mapping temple of the document.
ResetCategoryToDefault |  Reset one category, sub-category, or special category in the current mapping table to the default values defined in Revit
SetActiveTemplate |  Sets the mapping template element to be the active mapping template for its document.
SetMappingInfo(IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo>) |  Set the mapping info for multiple keys.
SetMappingInfo(ExportIFCCategoryKey, ExportIFCCategoryInfo) |  Set the mapping info for the key.
UpdateCategoryList |  Updates the mapping table with the categories from the document.
Top
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace