Revit 2027 API
ReferencePlane Properties
The ReferencePlane type exposes the following members.
Properties
Name | Description
BubbleEnd |  The bubble end of the reference plane.
Direction |  The direction of the reference plane.
FreeEnd |  The free end of the reference plane.
Name | The name property of the reference plane.
Normal |  The normal vector of the reference plane.
Top
See Also
Reference
ReferencePlane Class
Autodesk.Revit.DB Namespace