Revit 2027 API
SpaceTag Class
Provides access to the space tag in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementTag
 Autodesk.Revit.DB.Mechanical.SpaceTag
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpaceTag : SpatialElementTag
Public Class SpaceTag
	Inherits SpatialElementTag
public ref class SpaceTag : public SpatialElementTag
type SpaceTag =
    class
        inherit SpatialElementTag
    end
The SpaceTag type exposes the following members.
Properties
Name | Description
Space | The space that the tag is associated with.
SpaceTagType | The tag type.
Top
Methods
Name | Description
Top
Remarks
The space Tag object can be queried for space information.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace