Revit 2027 API
FluidType Methods
The FluidType type exposes the following members.
Methods
Name | Description
AddTemperature |  Adds a fluid temperature to the set.
ClearAllTemperatures |  Clears all fluid temperatures in the set.
Create(Document, String) |  Creates a new empty fluid type and adds it to the document.
Create(Document, String, FluidType) |  Creates a new fluid type and adds it to the document.
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetFluidTemperatureSetIterator | Returns a FluidTemperatureSetIterator that iterates through the collection.
GetFluidType |  Gets a fluid type by name.
GetTemperature |  Gets a copy of the FluidTemperature object matching a given temperature value.
IsFluidInUse |  Identifies if the fluid type is in use.
RemoveTemperature |  Removes a fluid temperature via the temperature value from the set.
Top
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace