Revit 2027 API
DocumentVersion Methods
The DocumentVersion type exposes the following members.
Methods
Name | Description
Dispose
IsEqual |  Checks whether two DocumentVersions are identical. They are identical if both the GUID and number of saves are equal. If two DocumentVersions are identical, they come from the same document, with the same set of changes.
Top
See Also
Reference
DocumentVersion Class
Autodesk.Revit.DB Namespace