Revit 2027 API
FolderItemInfo Class
 Contains data for each folder item in the organization settings of the project browser including grouping parameter Id path and folder name.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FolderItemInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FolderItemInfo : IDisposable
Public Class FolderItemInfo
	Implements IDisposable
public ref class FolderItemInfo : IDisposable
type FolderItemInfo =
    class
        interface IDisposable
    end
The FolderItemInfo type exposes the following members.
Properties
Name | Description
ElementId | Obsolete.
 The folder parameter Id
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The folder name
Top
Methods
Name | Description
Dispose | Releases all resources used by the FolderItemInfo
GetGroupingParameterIdPath |  The parameter Id path used to determine the folder items in the browser.
Top
Remarks
 FolderItemInfo is the return value of BrowserOrganization.GetFolderItems().
See Also
Reference
Autodesk.Revit.DB Namespace