Revit 2027 API
RebarShapeVertex Class
 A bend between segments of a rebar shape definition.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeVertex
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeVertex : IDisposable
Public Class RebarShapeVertex
	Implements IDisposable
public ref class RebarShapeVertex : IDisposable
type RebarShapeVertex =
    class
        interface IDisposable
    end
The RebarShapeVertex type exposes the following members.
Properties
Name | Description
BendAngle |  The range of permissible angles at this bend.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Turn |  The sense of the turn. The Turn property must be set to Left or Right on each internal vertex before the RebarShapeDefinitionBySegments is used. Default is permissible for the first and last vertex, since they do not correspond to bends.
Top
Methods
Name | Description
Dispose | Releases all resources used by the RebarShapeVertex
GetConstraints |  Retrieve the list of constraints associated with this vertex.
SetConstraints |  Assign a new list of constraints to this vertex.
Top
Remarks
 A RebarShapeVertex is part of a RebarShapeDefinitionBySegments object. There is one vertex between each pair of adjacent segments, plus one at each end of the overall shape. The end vertices currently are ignored by the shape definition, even if they have constraints.
 A bend may have the default radius of the bar type referenced by the Rebar element, or it may have a radius defined by a parameter.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace