Revit 2027 API
PaperSizeSetIterator Properties
The PaperSizeSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
PaperSizeSetIterator Class
Autodesk.Revit.DB Namespace