Revit 2027 API
MechanicalSystem Class
 A mechanical system element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MEPSystem
 Autodesk.Revit.DB.Mechanical.MechanicalSystem
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MechanicalSystem : MEPSystem
Public Class MechanicalSystem
	Inherits MEPSystem
public ref class MechanicalSystem : public MEPSystem
type MechanicalSystem =
    class
        inherit MEPSystem
    end
The MechanicalSystem type exposes the following members.
Properties
Name | Description
BaseEquipmentConnector | The connector within the base equipment which is used to connect with the system.
DuctNetwork |  The ducts and fittings contained within the system.
IsWellConnected |  Indicates if the system is well connected or not.
SystemType | The type of this duct system.
Top
Methods
Name | Description
Create(Document, ElementId) |  Creates a new instance of a mechanical system and adds it to the document.
Create(Document, ElementId, String) |  Creates a new instance of a mechanical system and adds it to the document.
GetFlow |  Gets the flow of this mechanical system.
GetStaticPressure |  Gets the static pressure of this mechanical system.
IsPressureDropServerMissing |  Indicates if any pressure drop server which was used in the mechanical system is not available.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace