Revit 2027 API
MEPNetworkIterator Class
 An iterator to traverse the MEP analytical network.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.MEPNetworkIterator
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPNetworkIterator : IDisposable
Public Class MEPNetworkIterator
	Implements IDisposable
public ref class MEPNetworkIterator : IDisposable
type MEPNetworkIterator =
    class
        interface IDisposable
    end
The MEPNetworkIterator type exposes the following members.
Constructors
Name | Description
MEPNetworkIterator(Document, MEPAnalyticalSegment) |  Creates an iterator to visit the connected segments on both sides.
MEPNetworkIterator(Document, MEPAnalyticalModelData, ConnectorDomainType) |  Creates an iterator by the analytical model data to visit all connected components in the network.
MEPNetworkIterator(Document, MEPAnalyticalNode, MEPAnalyticalSegment) |  Creates an iterator to visit the connected segments on one side of the network.
Top
Properties
Name | Description
CurrentElementId |  The element id at the current iteration step.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SystemClassification |  The optional MEP system classification where the iterations are restricted.
SystemId |  The optional MEP system element id where the iterations are restricted.
Top
Methods
Name | Description
Dispose | Releases all resources used by the MEPNetworkIterator
End |  Checks if the network iteration has completed.
GetAnalyticalModelData |  Gets the analytical model data at the current iteration step.
GetAnalyticalNode |  Gets the analytical node at the current iteration step.
GetAnalyticalSegment |  Gets the analytical segment at the current iteration step.
GetOtherAnalyticalNode |  Gets the other analytical node at the current iteration step.
Next |  Moves this iterator to the next step of network iteration.
Start |  Gets the first step of network iteration.
Top
Remarks
 The iterator will visit the entire MEP analytical network in the depth-first order. For evert next step, one analytical node and one analytical segment are typically visited. Sometimes an extra node is provided if the iteration reaches the end on one side and restarts at the previous intersect node. Also note that the start step may not contain any segment.
Example
// Create a new MEPNetworkIterator to traverse a piping network in the depth-first order.
int segmentCount = 0;
MEPNetworkIterator netIter = new MEPNetworkIterator(doc, modelData, ConnectorDomainType.Piping);
for(netIter.Start(); !netIter.End(); netIter.Next())
{
   MEPAnalyticalSegment segment = netIter.GetAnalyticalSegment();
   if (segment != null)
      segmentCount++;
}
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace