Revit 2027 API
ExternalResourceMatchOptions Methods
The ExternalResourceMatchOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace