Revit 2027 API
BRepBuilderGeometryId Methods
The BRepBuilderGeometryId type exposes the following members.
Methods
Name | Description
Dispose
InvalidGeometryId |  Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.
Top
See Also
Reference
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace