Revit 2027 API
StairsType Class
 A type element containing the properties for a component-based stair.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.StairsType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StairsType : ElementType
Public Class StairsType
	Inherits ElementType
public ref class StairsType : public ElementType
type StairsType =
    class
        inherit ElementType
    end
The StairsType type exposes the following members.
Properties
Name | Description
ConstructionMethod |  The construction method of the stairs.
EndConnectionType |  The join style between a run and landing.
HasMiddleSupports |  True if the stairs type has middle supports, False otherwise.
LandingType |  The type for all landings in the stair element.
LeftLateralOffset |  The offset for the left support from the edge of the run in a horizontal direction.
LeftSideSupportType |  The type of left support used in the stair.
MaxRiserHeight |  The maximum height of each riser on the stair element.
MiddleSupportsNumber |  The number of middle supports used in the stair.
MiddleSupportType |  The type of middle supports used in the stair.
MinRunWidth |  The initial value for the width of a common run.
MinTreadDepth |  The minimum tread width along the center path for all common runs (winder, arc, and straight).
NotchExtension |  The horizontal length of the notch profile.
NotchHorizontalGap |  The width of the horizontal gap in the stairs notch.
NotchThickness |  The vertical length of the notch profile from the top.
NotchVerticalGap |  The width of the vertical gap in the stairs notch.
RightLateralOffset |  The offset for the right support from the edge of the run in a horizontal direction.
RightSideSupportType |  The type of right support used in the stair.
RunType |  The type for all runs in the stair element.
Top
Methods
Name | Description
Top
Example
private void GetStairsType(Stairs stairs)
{
    StairsType stairsType = stairs.Document.GetElement(stairs.GetTypeId()) as StairsType;
    // Format stairs type info for display
    string info = "Stairs Type:  " + stairsType.Name;
    info += "\nLeft Lateral Offset:  " + stairsType.LeftLateralOffset;
    info += "\nRight Lateral Offset:  " + stairsType.RightLateralOffset;
    info += "\nMax Riser Height:  " + stairsType.MaxRiserHeight;
    info += "\nMin Run Width:  " + stairsType.MinRunWidth;
    TaskDialog.Show("Revit", info);
}
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace