Revit 2027 API
GlobalParameter Properties
The GlobalParameter type exposes the following members.
Properties
Name | Description
IsDrivenByDimension |  Indicates whether this parameter is driven by a dimension or not.
IsDrivenByFormula |  Indicates whether this parameter is driven by a formula or not.
IsReporting |  Indicates whether this is a reporting global parameter or not.
Top
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace