Revit 2027 API
GeometryElement Methods
The GeometryElement type exposes the following members.
Methods
Name | Description
GetBoundingBox | Retrieves a box that encloses the geometry element.
GetEnumerator | Returns an enumerator that iterates through the collection.
GetEnumeratorNG | Returns an enumerator that iterates through the collection.
GetTransformed | Returns a transformed copy of the geometry in this element.
Top
See Also
Reference
GeometryElement Class
Autodesk.Revit.DB Namespace