Revit 2027 API
FileOpenDialog Class
 This class allows an add-in to prompt the user with the Revit dialog used to navigate to and select an existing file path. This dialog is typically used to select a file for opening or importing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.FileDialog
 Autodesk.Revit.UI.FileOpenDialog
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FileOpenDialog : FileDialog
Public Class FileOpenDialog
	Inherits FileDialog
public ref class FileOpenDialog : public FileDialog
type FileOpenDialog =
    class
        inherit FileDialog
    end
The FileOpenDialog type exposes the following members.
Constructors
Name | Description
FileOpenDialog |  Constructs a new instance of a File Open dialog.
Top
Properties
Name | Description
ShowPreview |  Identifies if the dialog should include a region showing a preview of the selected file.
Top
Methods
Name | Description
Top
Remarks
The behavior and appearance of this dialog matches the Revit "Open" dialog. This is a general-purpose dialog for opening any given file type, and options to configure settings like worksharing options will not be included.
The user will be prompted to select an existing file that matches one of the provided filters. The user may not enter a file name that does not exist.
The folder location shown when the dialog is displayed defaults to the most recently used file location for opening or importing.
Use of this dialog does not actually open an existing file, but it will provide the selected file path back to the caller to take any action necessary.
See Also
Reference
Autodesk.Revit.UI Namespace