Revit 2027 API
DetailCurveArray Class
An array that can contain any type of object.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DetailCurveArray
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DetailCurveArray : APIObject,
	IEnumerable
Public Class DetailCurveArray
	Inherits APIObject
	Implements IEnumerable
public ref class DetailCurveArray : public APIObject,
	IEnumerable
type DetailCurveArray =
    class
        inherit APIObject
        interface IEnumerable
    end
The DetailCurveArray type exposes the following members.
Constructors
Name | Description
DetailCurveArray | Initializes a new instance of the DetailCurveArray class
Top
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an item at a specified index within the array.
Size | Returns the number of objects that are in the array.
Top
Methods
Name | Description
Append
Clear | Removes every item from the array, rendering it empty.
ForwardIterator | Retrieve a forward moving iterator to the array.
GetEnumerator | Retrieve a forward moving iterator to the array.
Insert
ReverseIterator | Retrieve a backward moving iterator to the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace