Revit 2027 API
IFCBuiltInCategoryKey Class
 A key used to represent an item stored in a template.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFCBuiltInCategoryKey
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IFCBuiltInCategoryKey : IDisposable
Public Class IFCBuiltInCategoryKey
	Implements IDisposable
public ref class IFCBuiltInCategoryKey : IDisposable
type IFCBuiltInCategoryKey =
    class
        interface IDisposable
    end
The IFCBuiltInCategoryKey type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the IFCBuiltInCategoryKey
Top
See Also
Reference
Autodesk.Revit.DB Namespace