Revit 2027 API
AssetPropertyDoubleArray3d Class
 Represents a vector or point property.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssetPropertyDoubleArray3d : AssetProperty
Public Class AssetPropertyDoubleArray3d
	Inherits AssetProperty
public ref class AssetPropertyDoubleArray3d : public AssetProperty
type AssetPropertyDoubleArray3d =
    class
        inherit AssetProperty
    end
The AssetPropertyDoubleArray3d type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetValueAsDoubles |  Get the value property as doubles.
GetValueAsXYZ |  Get the value property as a vector or point XYZ.
IsValidValue |  Checks that the value is a valid value for this property.
SetValueAsXYZ |  Sets the value property as a vector or point XYZ.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace