Revit 2027 API
EdgeArrayIterator Methods
The EdgeArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
EdgeArrayIterator Class
Autodesk.Revit.DB Namespace