Revit 2027 API
ElectricalSetting Properties
The ElectricalSetting type exposes the following members.
Properties
Name | Description
CircuitLoadCalculationMethod |  The method to calculate circuit load
CircuitNamePhaseA |  Circuit Naming by Phase - Phase A Label.
CircuitNamePhaseB |  Circuit Naming by Phase - Phase B Label.
CircuitNamePhaseC |  Circuit Naming by Phase - Phase C Label.
CircuitPathOffset |  The default circuit path offset for newly created circuit.
CircuitRating |  The default circuit rating for newly created circuit.
CircuitSequence |  The sequence in which power circuits are created.
DistributionSysTypes |  Get all distribution system types of the project.
VoltageTypes |  Get all voltage type definitions information of the project.
WireConduitTypes |  Get electrical conduit types information of the project.
WireTypes |  Get all wire type definition information of the project.
Top
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace