Revit 2027 API
StructuralSectionCSlopedFlange Class
 Defines parameters for C-channel Sloped Flange structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionCSlopedFlange : StructuralSectionGeneralU
Public Class StructuralSectionCSlopedFlange
	Inherits StructuralSectionGeneralU
public ref class StructuralSectionCSlopedFlange : public StructuralSectionGeneralU
type StructuralSectionCSlopedFlange =
    class
        inherit StructuralSectionGeneralU
    end
The StructuralSectionCSlopedFlange type exposes the following members.
Constructors
Name | Description
StructuralSectionCSlopedFlange |  Creates a new instance of Structural Section C Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Top
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace