Revit 2027 API
ProjectInfo Properties
The ProjectInfo type exposes the following members.
Properties
Name | Description
Address | Get or Set the Project Address of the Project Information.
Author | Get or Set the Project Author of the Project Information.
BuildingName | Get or Set the Building Name of the Project Information.
ClientName | Get or Set the Client Name of the Project Information.
IssueDate | Get or Set the Project Issue Date of the Project Information.
Name | Get or Set the Project Name of the Project Information.
Number | Get or Set the Project Number of the Project Information.
OrganizationDescription | Get or Set the Organization Description of the Project Information.
OrganizationName | Get or Set the Organization Name of the Project Information.
Status | Get or Set the Project Status of the Project Information.
Top
See Also
Reference
ProjectInfo Class
Autodesk.Revit.DB Namespace