Revit 2027 API
ViewScheduleExportOptions Class
 The export options used to export schedule views.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewScheduleExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ViewScheduleExportOptions : IDisposable
Public Class ViewScheduleExportOptions
	Implements IDisposable
public ref class ViewScheduleExportOptions : IDisposable
type ViewScheduleExportOptions =
    class
        interface IDisposable
    end
The ViewScheduleExportOptions type exposes the following members.
Constructors
Name | Description
ViewScheduleExportOptions() |  Constructs a new instance of the ViewScheduleExportOptions class
ViewScheduleExportOptions(ViewScheduleExportOptions) |  Constructs a new copy of the input ViewScheduleExportOptions object.
Top
Properties
Name | Description
ColumnHeaders |  How to export column headers. Default is MultipleRows.
FieldDelimiter |  How to delimit fields. Default is Tab.
HeadersFootersBlanks |  Whether to export group headers, footers, and blank lines. Default is true.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TextQualifier |  How to qualify text fields. Default is DoubleQuote.
Title |  Whether or not to export the schedule title. Default is true.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ViewScheduleExportOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace