Revit 2027 API
IFCUserDefinedPropertySet Methods
The IFCUserDefinedPropertySet type exposes the following members.
Methods
Name | Description
AddProperty |  Adds a property to the property set.
ClearPropertySet |  Removes all properties from the property set.
CopyPropertySet |  Create copy of property set with new name.
Create |  Create an IFC user-defined property set with default values.
ExportToFile |  Export property sets to a text file.
FindPropertyByName |  Returns property by name.
FindPropertySetByName |  Returns property set element by name.
GetApplicableEntities |  Returns the list of IFC entities to which the property set is applicable.
GetProperties |  Returns the collection of properties in the property set.
ImportFromFile |  Import property sets from a text file.
IsPropertyAMemberOfPropertySet |  Checks whether a property exists in the property set.
IsValidName |  Checks whether the proposed name is valid and not exist in the specified document.
ListPropertySetNames |  Returns a list property set names stored in the document.
RemoveProperty |  Removes a property from the property set.
SetApplicableEntities |  Sets the list of IFC entities to which the property set is applicable.
Top
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace