Revit 2027 API
FailureResolution Methods
The FailureResolution type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FailureResolution Class
Autodesk.Revit.DB Namespace