Revit 2027 API
PipeFittingAndAccessoryConnectorData Class
 The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PipeFittingAndAccessoryConnectorData : IDisposable
Public Class PipeFittingAndAccessoryConnectorData
	Implements IDisposable
public ref class PipeFittingAndAccessoryConnectorData : IDisposable
type PipeFittingAndAccessoryConnectorData =
    class
        interface IDisposable
    end
The PipeFittingAndAccessoryConnectorData type exposes the following members.
Properties
Name | Description
Angle |  The angle of the fitting, Units:(rad).
Diameter |  The connector diameter, Units:(ft).
Flow |  The connector flow, Units:(ft³/s)
FlowDirection |  The flow direction of this connector, In or Out.
Height |  The connector height, Units:(ft).
Index |  Return the index of this connector
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LinkIndex |  The index of the connector which is linked with this connector
Profile |  The connector profile.
VelocityPressure |  The connector velocity pressure. Units: (kg/(ft·s²)).
Width |  The connector width, Units:(ft).
Top
Methods
Name | Description
Dispose | Releases all resources used by the PipeFittingAndAccessoryConnectorData
GetCoordination |  Gets the coordination of the connector
Top
Remarks
 width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace