Revit 2027 API
TableMergedCell Class
 The TableMergedCell class defines a merged area of the upper-left and lower-right of a table grid.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TableMergedCell
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TableMergedCell : IDisposable
Public Class TableMergedCell
	Implements IDisposable
public ref class TableMergedCell : IDisposable
type TableMergedCell =
    class
        interface IDisposable
    end
The TableMergedCell type exposes the following members.
Constructors
Name | Description
TableMergedCell() |  Default constructor.
TableMergedCell(Int32, Int32, Int32, Int32) |  Constructor.
Top
Properties
Name | Description
Bottom |  Specifies the row index of the bottom-right corner of a table grid.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Left |  Specifies the column index of the top-left corner of a table grid.
Right |  Specifies the column index of the bottom-right corner of a table grid.
Top |  Specifies the row index of the top-left corner of a table grid.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TableMergedCell
Top
Remarks
 A TableMergedCell contains member variables that define the top-left and bottom-right row and column indexes of a table grid. A TableMergedCell object can be passed as a function parameter wherever a TableMergedCell can be passed.
See Also
Reference
Autodesk.Revit.DB Namespace