Revit 2027 API
BarTerminationsData Methods
The BarTerminationsData type exposes the following members.
Methods
Name | Description
AsRebarShapeTerminationsData |  Creates a new instance of RebarShapeTerminationsData from this.
Dispose
GetDocument |  Gets the document containing the hook type ids, end treatment ids and crank type ids.
Top
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace