Revit 2027 API
PointElementReference Class
Base class for objects defining a way to constrain a ReferencePoint to one or more other objects in a document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointElementReference
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class PointElementReference
Public MustInherit Class PointElementReference
public ref class PointElementReference abstract
[<AbstractClassAttribute>]
type PointElementReference = class end
The PointElementReference type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointElementReference
 Autodesk.Revit.DB.PointOnEdge
 Autodesk.Revit.DB.PointOnEdgeEdgeIntersection
 Autodesk.Revit.DB.PointOnEdgeFaceIntersection
 Autodesk.Revit.DB.PointOnFace
 Autodesk.Revit.DB.PointOnPlane
 Autodesk.Revit.DB.PointRelativeToPoint