Revit 2027 API
Hub Methods
The Hub type exposes the following members.
Methods
Name | Description
GetHubConnectorManager |  Retrieves the ConnectorManager of the Hub.
GetOrigin |  Retrieves position of a Hub if such position is a 3D point.
GetPointId |  Returns ElementId of the associated Point element.
HasOrigin |  Provides information if Hub has a specific location at point in 3D space.
Top
See Also
Reference
Hub Class
Autodesk.Revit.DB.Structure Namespace