Revit 2027 API
ModelCurve Class
 A model element that exists in 3D space and is visible in all views of a Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.ModelCurve
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ModelCurve : CurveElement
Public Class ModelCurve
	Inherits CurveElement
public ref class ModelCurve : public CurveElement
type ModelCurve =
    class
        inherit CurveElement
    end
The ModelCurve type exposes the following members.
Properties
Name | Description
IsReferenceLine | Indicates if this curve is a reference curve.
Subcategory | The subcategory.
TrussCurveType | The truss curve type of this model curve.
Top
Methods
Name | Description
ChangeToReferenceLine | Changes this curve to a reference curve.
GetVisibility | Gets the visibility for the model curve in a family document.
SetVisibility | Sets the visibility for the model curve in a family document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.CurveElement
 Autodesk.Revit.DB.ModelCurve
 Autodesk.Revit.DB.ModelArc
 Autodesk.Revit.DB.ModelEllipse
 Autodesk.Revit.DB.ModelHermiteSpline
 Autodesk.Revit.DB.ModelLine
 Autodesk.Revit.DB.ModelNurbSpline