Revit 2027 API
FamilySymbolProfile Properties
The FamilySymbolProfile type exposes the following members.
Properties
Name | Description
Angle | The angle of the rotation of the profile in radians.
IsFlipped | Indicates if the symbol profile is flipped or not.
Profile | Returns the family symbol of the profile.
XOffset | The offset of the profile to the origin of the sketch plane in the X direction.
YOffset | The offset of the profile to the origin of the sketch plane in the Y direction.
Top
See Also
Reference
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace