Revit 2027 API
StructuralSectionIWideFlange Properties
The StructuralSectionIWideFlange type exposes the following members.
Properties
Name | Description
BoltDiameter |  Maximum bolt hole diameter, in. (mm)
BoltSpacing |  Standard bolt spacing, in. (mm)
BoltSpacingBetweenRows |  Standard bolt spacing between rows, in. (mm)
BoltSpacingTwoRows |  Standard bolt spacing for two rows , in. (mm)
ClearWebHeight |  Detailing depth between the web toes of the fillets, in.(mm)
FlangeToeOfFillet |  Detailing distance from center of web to flange toe of fillet, in. (mm)
WebToeOfFillet |  Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Top
See Also
Reference
StructuralSectionIWideFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace