Revit 2027 API
ApplicationEntryPoint Class
For Revit Macros use only.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.ApplicationServices.Application
 Autodesk.Revit.DB.Macros.ApplicationEntryPoint
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ApplicationEntryPoint : Application,
	IEntryPoint
Public MustInherit Class ApplicationEntryPoint
	Inherits Application
	Implements IEntryPoint
public ref class ApplicationEntryPoint abstract : public Application,
	IEntryPoint
[<AbstractClassAttribute>]
type ApplicationEntryPoint =
    class
        inherit Application
        interface IEntryPoint
    end
The ApplicationEntryPoint type exposes the following members.
Constructors
Name | Description
ApplicationEntryPoint | Initializes a new instance of the ApplicationEntryPoint class
Top
Properties
Name | Description
AddinFolder |  The full path to the Revit Macros module.
Top
Methods
Name | Description
FinishInitializationEO |  For Revit Macros internal use only.
Initialize |  For Revit Macros internal use only.
OnShutdownEO |  For Revit Macros internal use only.
Top
Events
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace