Revit 2027 API
ConfigurationReloadInfo Class
 This object contains information returned by a reload of the fabrication configuration.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ConfigurationReloadInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConfigurationReloadInfo : IDisposable
Public Class ConfigurationReloadInfo
	Implements IDisposable
public ref class ConfigurationReloadInfo : IDisposable
type ConfigurationReloadInfo =
    class
        interface IDisposable
    end
The ConfigurationReloadInfo type exposes the following members.
Constructors
Name | Description
ConfigurationReloadInfo |  Constructor.
Top
Properties
Name | Description
Disconnects |  The number of disconnections caused by the reload.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OutOfDatePartCount |  The number of fabrication part instances that had newer versions and were out of date.
ProfileNotAvailable |  The current profile is not available in the disk configuration.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ConfigurationReloadInfo
GetConnectivityValidation |  Returns information about the post-reload connectivity validation.
GetCustomDataChangedElements |  Gets a list of ElementIds of fabrication parts that had custom data updated during the reload.
GetOutOfDatePartStatus |  Access reload information for out of date part.
Top
See Also
Reference
Autodesk.Revit.DB Namespace