Revit 2027 API
RebarShape Properties
The RebarShape type exposes the following members.
Properties
Name | Description
HigherEnd |  Defines the higher end of rebar shape.
RebarStyle |  Whether the shape represents a standard bar or a stirrup.
ShapeFamilyId |  Get and return the rebar shape family id.
SimpleArc |  Check whether this shape consists of a single arc, possibly with hooks.
SimpleLine |  Check whether this shape consists of a single straight segment, possibly with hooks.
StirrupTieAttachment |  The attachment type of stirrup ties and rebars.
Top
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace