Revit 2027 API
ColorOptions Methods
The ColorOptions type exposes the following members.
Methods
Name | Description
Dispose
GetColorOptions |  Returns the current Revit instance's ColorOptions.
Top
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace