Revit 2027 API
ElementArray Properties
The ElementArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets an element at a specified index within the array.
Size | Returns the number of elements that are in the array.
Top
See Also
Reference
ElementArray Class
Autodesk.Revit.DB Namespace