Revit 2027 API
PlanTopology Methods
The PlanTopology type exposes the following members.
Methods
Name | Description
GetRoomIds | Retrieves room ElementIds of the PlanTopology in the last phase.
Top
See Also
Reference
PlanTopology Class
Autodesk.Revit.DB Namespace