Revit 2027 API
BooleanOperationsUtils Methods
The BooleanOperationsUtils type exposes the following members.
Methods
Name | Description
CutWithHalfSpace |  Creates a new Solid which is the intersection of the input Solid with the half-space on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.
CutWithHalfSpaceModifyingOriginalSolid |  Modifies the input Solid preserving only the volume on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.
Dispose
ExecuteBooleanOperation |  Perform a boolean geometric operation between two solids, and return a new solid to represent the result.
ExecuteBooleanOperationModifyingOriginalSolid |  Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Top
See Also
Reference
BooleanOperationsUtils Class
Autodesk.Revit.DB Namespace