Revit 2027 API
DWFImportOptions Methods
The DWFImportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetSheetViews |  Get sheet views where DWF markups are imported.
SetSheetViews |  Set sheet views where DWF markups are imported.
Top
See Also
Reference
DWFImportOptions Class
Autodesk.Revit.DB Namespace