Revit 2027 API
PipeSettings Methods
The PipeSettings type exposes the following members.
Methods
Name | Description
AddPipeSlope |  Add a pipe slope value.
GetFlowConvertionServerInfo |  Get the MEPServerInfo of the current plumbing flow convertion server.
GetPipeSettings |  Get the pipe settings of the project.
GetPipeSlopes |  Get pipe slopes.
GetSpecificFittingAngles |  Gets the list of specific fitting angles.
GetSpecificFittingAngleStatus |  Gets the status of given specific angle.
IsAnalysisForClosedLoopHydronicPipingNetworksEnabled |  Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.
IsValidSpecificFittingAngle |  Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
SetFlowConvertionServerInfo |  Set the MEPServerInfo of the current plumbing flow convertion server.
SetPipeSlopes |  Set pipe slope values.
SetSpecificFittingAngleStatus |  Sets the status of given specific angle.
Top
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace