Revit 2027 API
TableCellCombinedParameterData Class
 The TableCellCombinedParameterData stores the data for combined parameters
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TableCellCombinedParameterData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TableCellCombinedParameterData : IDisposable
Public Class TableCellCombinedParameterData
	Implements IDisposable
public ref class TableCellCombinedParameterData : IDisposable
type TableCellCombinedParameterData =
    class
        interface IDisposable
    end
The TableCellCombinedParameterData type exposes the following members.
Properties
Name | Description
CategoryId |  Category id for this parameter
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParamId |  The parameter id
Prefix |  The prefix for this parameter
SampleValue |  The sample/example value for the parameter in text form
Separator |  The separator for this parameter
Suffix |  The suffix for this parameter
Top
Methods
Name | Description
Create |  construct a TableCellCombinedParameterData
Dispose | Releases all resources used by the TableCellCombinedParameterData
Top
See Also
Reference
Autodesk.Revit.DB Namespace