Revit 2027 API
MultipleValuesIndicationSettings Class
 MultipleValuesIndicationSettings is an element which contains project-wide settings for multiple values indication in Properties Palette and schedules.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MultipleValuesIndicationSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MultipleValuesIndicationSettings : Element
Public Class MultipleValuesIndicationSettings
	Inherits Element
public ref class MultipleValuesIndicationSettings : public Element
type MultipleValuesIndicationSettings =
    class
        inherit Element
    end
The MultipleValuesIndicationSettings type exposes the following members.
Properties
Name | Description
Custom |  If true, CustomValue is used as multiple values indication, otherwise a hardcoded standard value.
CustomValue |  Value used as multiple values indication if Custom is set to true.
Value |  Value to be used as multiple values indication in the document. If Custom is true, returns CustomValue, otherwise returns a hardcoded standard value.
Top
Methods
Name | Description
GetMultipleValuesIndicationSettings |  Returns the MultipleValuesIndicationSettings element for a given document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace