Revit 2027 API
AccessDeniedException Class
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.AccessDeniedException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class AccessDeniedException : ApplicationException
<SerializableAttribute>
Public Class AccessDeniedException
	Inherits ApplicationException
[SerializableAttribute]
public ref class AccessDeniedException : public ApplicationException
[<SerializableAttribute>]
type AccessDeniedException =
    class
        inherit ApplicationException
    end
The AccessDeniedException type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace