Revit 2027 API
MassLevelData Properties
The MassLevelData type exposes the following members.
Properties
Name | Description
ConceptualConstructionId |  The ElementId of the conceptual construction associated with the MassLevelData (Mass Floor).
ConceptualConstructionIsByEnergyData |  Indicates if the ConceptualConstructionType of the MassLevelData (Mass Floor) is synchronized with the EnergyDataSettings or if it overrides those settings.
MaterialId |  The ElementId of the visualization material used for the MassLevelData (Mass Floor)
NExteriorSurfaceArea |  The exterior surface area of the volume of the mass between the level of this MassLevelData (Mass Floor) to the next in the mass.
NLevelFafArea |  The surface area of the intersection of the MassLevelData's level with the mass geometry.
NLevelPerimeter |  The perimeter of the intersection of the MassLevelData's level with the mass geometry.
NVolume |  The volume of from the level of this MassLevelData (Mass Floor) to the next in the mass.
OwningMassId |  The ElementId of the mass that the MassLevelData (Mass Floor) is associated with.
StrUsage |  A String which describes the usage or occupancy type of the level of the MassLevelData.
Top
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace