Revit 2027 API
GroupLoadOptions Class
 A class containing options for loading a group from a file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GroupLoadOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GroupLoadOptions : IDisposable
Public Class GroupLoadOptions
	Implements IDisposable
public ref class GroupLoadOptions : IDisposable
type GroupLoadOptions =
    class
        interface IDisposable
    end
The GroupLoadOptions type exposes the following members.
Constructors
Name | Description
GroupLoadOptions |  Creates a new instance of a GroupLoadOptions object.
Top
Properties
Name | Description
IncludeAttachedDetails |  True if attached detail groups should be included, false otherwise. The default value is true.
IncludeGrids |  True if grids should be brought in from the input file, false otherwise. The default value is false.
IncludeLevels |  True if levels should be brought in from the input file, false otherwise. The default value is false.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ReplaceDuplicatedGroups |  If there are groups with the same names in source and destination documents set this property to true to replace existing groups, otherwise the operation will be canceled. The default value is false.
Top
Methods
Name | Description
Dispose | Releases all resources used by the GroupLoadOptions
GetDuplicateTypeNamesHandler |  Returns current duplicate type names handler or null if none is set.
SetDuplicateTypeNamesHandler |  Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
Top
See Also
Reference
Autodesk.Revit.DB Namespace