Revit 2027 API
CurveArrayIterator Class
An iterator to a curve array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurveArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class CurveArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class CurveArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class CurveArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type CurveArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The CurveArrayIterator type exposes the following members.
Constructors
Name | Description
CurveArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace