Revit 2027 API
CoordinationModelElementProperty Methods
The CoordinationModelElementProperty type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
CoordinationModelElementProperty Class
Autodesk.Revit.DB.ExternalData Namespace