Revit 2027 API
ObjectAccessException Methods
The ObjectAccessException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
ObjectAccessException Class
Autodesk.Revit.Exceptions Namespace