Revit 2027 API
FilterStringRuleEvaluator Methods
The FilterStringRuleEvaluator type exposes the following members.
Methods
Name | Description
Dispose
Evaluate |  Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.
Top
See Also
Reference
FilterStringRuleEvaluator Class
Autodesk.Revit.DB Namespace