Revit 2027 API
RevisionsOnSheetUIServiceData Methods
The RevisionsOnSheetUIServiceData type exposes the following members.
Methods
Name | Description
Dispose
GetParentHwnd | Obsolete.
 return the parent handle
GetRevitElementIds | Obsolete.
 return the list of revit Element Ids
Top
See Also
Reference
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace