Revit 2027 API
LightType Methods
The LightType type exposes the following members.
Methods
Name | Description
Dispose
GetInitialColor |  Return a copy of an object derived from InitialColor
GetInitialIntensity |  Return a copy of an object derived from InitialIntensity
GetLightDistribution |  Return a copy of an object derived from LightDistribution
GetLightShape |  Return a copy of an object derived from LightShape
GetLightType |  Creates a light type object from the given document and family type ID
GetLightTypeFromInstance |  Creates a light type object from the given document and element ID
GetLossFactor |  Return a copy of an object derived from LossFactor
SetInitialColor |  Replace the current initial color object with the given object
SetInitialIntensity |  Replace the current initial intensity object with the given object
SetLightDistribution |  Replace the current LightDistribution object with the given object
SetLightShape |  Replace the current LightShape object with the given object
SetLossFactor |  Replace the current loss factor object with the given object
Top
See Also
Reference
LightType Class
Autodesk.Revit.DB.Lighting Namespace