Revit 2027 API
AreaBasedLoadType Properties
The AreaBasedLoadType type exposes the following members.
Properties
Name | Description
ApparentPowerDensity |  The apparent power density of area based load type.
LoadClassification |  The load classification of area based load type.
LoadDensity |  The load density of area based load type.
PowerFactor |  The power factor of area based load type.
PowerFactorState |  The power factor state of the area based load type.
Top
See Also
Reference
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace