Revit 2027 API
DefinitionGroup Class
The DefinitionGroup is a container that is used to hold shared parameter definitions on disk.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DefinitionGroup
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DefinitionGroup : APIObject
Public Class DefinitionGroup
	Inherits APIObject
public ref class DefinitionGroup : public APIObject
type DefinitionGroup =
    class
        inherit APIObject
    end
The DefinitionGroup type exposes the following members.
Properties
Name | Description
Definitions | The Definitions property returns an object that contains all the shared parameter definitions within the group.
Name | Returns the name of the parameter group.
Top
Methods
Name | Description
Top
Remarks
Groups are used for logical arrangement of the shared parameters into meaningful sets. Through the DefinitionGroup object new shared parameter definitions can be made.
See Also
Reference
Autodesk.Revit.DB Namespace