Revit 2027 API
TopographyEditScope Methods
The TopographyEditScope type exposes the following members.
Methods
Name | Description
Start |  Starts a topography surface edit mode for an existing TopographySurface element.
Top
See Also
Reference
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace