Revit 2027 API
ReinforcementSettings Methods
The ReinforcementSettings type exposes the following members.
Methods
Name | Description
GetFabricRoundingManager |  Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
GetRebarRoundingManager |  Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
GetReinforcementAbbreviationTag |  Gets one abbreviation tag for desired ReinforcementAbbreviationTagType.
GetReinforcementAbbreviationTags |  Gets a list of abbreviation tags for desired reinforcement object type.
GetReinforcementSettings |  Obtains the ReinforcementSettings object for the specified project document.
IsEqual |  Checks if Reinforcement Settings is equal to other
SetReinforcementAbbreviationTag |  Sets one abbreviation tag for desired ReinforcementAbbreviationTagType.
Top
See Also
Reference
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace