Revit 2027 API
ImageView Properties
The ImageView type exposes the following members.
Properties
Name | Description
ImageInstanceId |  Id of the image in the view.
Top
See Also
Reference
ImageView Class
Autodesk.Revit.DB Namespace