Revit 2027 API
SpotDimension Class
 Object representing various types of SpotDimension
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Dimension
 Autodesk.Revit.DB.SpotDimension
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpotDimension : Dimension
Public Class SpotDimension
	Inherits Dimension
public ref class SpotDimension : public Dimension
type SpotDimension =
    class
        inherit Dimension
    end
The SpotDimension type exposes the following members.
Properties
Name | Description
LeaderHasShoulder |  True is dimension has leader with shoulder, false otherwise.
LeaderShoulderPosition |  Position of spot dimension's leader shoulder point.
SpotDimensionType |  The dimension style of this dimension.
Top
Methods
Name | Description
CanFlip |  Verifies that the direction of the dimension can be flipped.
Flip |  Flips dimension to the other side of the host.
Top
Example
private void Getinfo_SpotDimension(SpotDimension spotDimension)
{
    string message = "SpotDimension's Location : ";
    Location location = spotDimension.Location;
    if (location is LocationPoint)
    {
        LocationPoint point = location as LocationPoint;
        message += "\n" + location.GetType().Name + " : ";
        message += "(" + point.Point.X + ", " + point.Point.Y + ", " + point.Point.Z + ")";
    }
    else
    {
        LocationCurve locCurve = location as LocationCurve;
        Curve curve = locCurve.Curve;
        message += "\n" + location.GetType().Name + " : ";
        message += "\nStart Point : " + "(" + curve.GetEndPoint(0).X + ", "
                    + curve.GetEndPoint(0).Y + ", " + curve.GetEndPoint(0).Z + ")";
        message += "\nEnd point : " + "(" + curve.GetEndPoint(1).X + ", "
                    + curve.GetEndPoint(1).Y + ", " + curve.GetEndPoint(1).Z + ")";
    }
    TaskDialog.Show("Revit",message);
}
See Also
Reference
Autodesk.Revit.DB Namespace