Revit 2027 API
PolyLine Class
A polyline.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.PolyLine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PolyLine : GeometryObject
Public Class PolyLine
	Inherits GeometryObject
public ref class PolyLine : public GeometryObject
type PolyLine =
    class
        inherit GeometryObject
    end
The PolyLine type exposes the following members.
Properties
Name | Description
NumberOfCoordinates | Gets the number of the coordinate points.
Top
Methods
Name | Description
Clone | Returns a copy of this polyline.
Create | Creates a polyline with coordinate points provided.
Evaluate | Evaluates a parameter on the polyline.
GetCoordinate | Gets the coordinate point of the specified index.
GetCoordinates | Gets the coordinate points of the polyline.
GetOutline | Gets the outline of the polyline.
GetTransformed | Gets the copy of the polyline which is applied the specified transformation.
Top
Remarks
A polyline in space is defined by a set of coordinate points.
See Also
Reference
Autodesk.Revit.DB Namespace