Revit 2027 API
SkyBackgroundSettings Class
 Represents the rendering sky background settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundSettings
 Autodesk.Revit.DB.SkyBackgroundSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SkyBackgroundSettings : BackgroundSettings
Public Class SkyBackgroundSettings
	Inherits BackgroundSettings
public ref class SkyBackgroundSettings : public BackgroundSettings
type SkyBackgroundSettings =
    class
        inherit BackgroundSettings
    end
The SkyBackgroundSettings type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace