Revit 2027 API
CurveNode Class
 An output node that represents a model curve.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.CurveNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CurveNode : ModelCurveNode
Public Class CurveNode
	Inherits ModelCurveNode
public ref class CurveNode : public ModelCurveNode
type CurveNode =
    class
        inherit ModelCurveNode
    end
The CurveNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetCurve |  Returns the geometric curve object corresponding to the node.
Top
Remarks
 See also: OnCurve(CurveNode).
See Also
Reference
Autodesk.Revit.DB Namespace