Revit 2027 API
WireType Class
 Represents a specific wire type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.WireType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WireType : ElementType
Public Class WireType
	Inherits ElementType
public ref class WireType : public ElementType
type WireType =
    class
        inherit ElementType
    end
The WireType type exposes the following members.
Properties
Name | Description
Conduit |  The conduit type of the wire type.
Insulation |  The conductor insulation material of the wire type.
IsInUse |  Indicates whether the wire type is in use.
MaxSize |  The max conductor size name of the wire type.
NeutralMultiplier |  The neutral multiplier type of the wire type.
NeutralRequired |  Whether or not the neutral point is required.
NeutralSize |  The maximum neutral size of the wire type.
TemperatureRating |  The conductor temperature rating of the wire type.
WireMaterial |  The conductor material of the wire type.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace