Revit 2027 API
SpatialElementCalculationLocation Class
 The Spatial Element Calculation Location is used to specify the room/space where an element should be considered as placed.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElementCalculationLocation
 Autodesk.Revit.DB.SpatialElementCalculationPoint
 Autodesk.Revit.DB.SpatialElementFromToCalculationPoints
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SpatialElementCalculationLocation : Element
Public Class SpatialElementCalculationLocation
	Inherits Element
public ref class SpatialElementCalculationLocation : public Element
type SpatialElementCalculationLocation =
    class
        inherit Element
    end
The SpatialElementCalculationLocation type exposes the following members.
Properties
Name | Description
MarkerPosition |  The position of the spatial element calculation location marker.
Top
Methods
Name | Description
Top
Remarks
 It currently has two types of calculation location: SpatialElementCalculationPoint and SpatialElementFromToCalculationPoints A user can turn on the Spatial Element Calculation Location in the family editor by setting the family's ROOM_CALCULATION_POINT parameter. A user can move the location of the Spatial Element Calculation Location in the family editor. A user can visually verify the location of the Spatial Element Calculation Point by selecting the fixture in the project.
See Also
Reference
Autodesk.Revit.DB Namespace