Revit 2027 API
TypeBinding Class
TypeBinding objects are used to bind a property to a Revit type, such as a wall type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Binding
 Autodesk.Revit.DB.ElementBinding
 Autodesk.Revit.DB.TypeBinding
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TypeBinding : ElementBinding
Public Class TypeBinding
	Inherits ElementBinding
public ref class TypeBinding : public ElementBinding
type TypeBinding =
    class
        inherit ElementBinding
    end
The TypeBinding type exposes the following members.
Constructors
Name | Description
TypeBinding() | Constructs an empty type binding.
TypeBinding(CategorySet) | Constructs a type binding with the set of categories passed.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
This differs from Instance bindings in that the property is then shared by all instances that use that type. Changing the parameter for one type affects all other instances that use that type.
Example
public bool SetNewParameterToTypeWall(UIApplication app, DefinitionFile myDefinitionFile)
{
    // Create a new group in the shared parameters file
    DefinitionGroups myGroups = myDefinitionFile.Groups;
    DefinitionGroup myGroup = myGroups.Create("MyParameters");
    // Create a type definition
    ExternalDefinitionCreationOptions option = new ExternalDefinitionCreationOptions("CompanyName", SpecTypeId.String.Text);
    Definition myDefinition_CompanyName = myGroup.Definitions.Create(option);
    // Create a category set and insert category of wall to it
    CategorySet myCategories = app.Application.Create.NewCategorySet();
    // Use BuiltInCategory to get category of wall
    Category myCategory = Category.GetCategory(app.ActiveUIDocument.Document, BuiltInCategory.OST_Walls);
    myCategories.Insert(myCategory);
    //Create an object of TypeBinding according to the Categories
    TypeBinding typeBinding = app.Application.Create.NewTypeBinding(myCategories);
    // Get the BingdingMap of current document.
    BindingMap bindingMap = app.ActiveUIDocument.Document.ParameterBindings;
    // Bind the definitions to the document
    bool typeBindOK = bindingMap.Insert(myDefinition_CompanyName, typeBinding,
      GroupTypeId.Text);
    return typeBindOK;
}
See Also
Reference
Autodesk.Revit.DB Namespace