Revit 2027 API
Family Class
 An element that represents a custom family (not a system family) in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Family
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Family : Element
Public Class Family
	Inherits Element
public ref class Family : public Element
type Family =
    class
        inherit Element
    end
The Family type exposes the following members.
Properties
Name | Description
CurtainPanelHorizontalSpacing |  For Curtain Panel families, the horizontal spacing of the driving mesh.
CurtainPanelTilePattern |  For Curtain Panel families, the choice of tile pattern.
CurtainPanelVerticalSpacing |  For Curtain Panel families, the vertical spacing of the driving mesh.
FamilyCategory | Retrieves or sets a Category object that represents the category or sub category in which the elements ( this family could generate ) reside.
FamilyCategoryId |  The id of the category or sub category in which the elements that this family could generate reside.
FamilyPlacementType |  Identifies the type of placement required by a given family.
IsConceptualMassFamily |  Whether the Family is a Conceptual Mass family.
IsCurtainPanelFamily |  Whether the Family is a Curtain Panel family. Curtain Panel family symbols are used as the ObjectTypes of DividedSurface elements.
IsEditable |  True if the family supports editing, false otherwise.
IsInPlace |  True if the family is an in-place family, false if the family is a loadable family.
IsOwnerFamily |  True if the family is the owner family for its own editable document, false otherwise.
IsParametric |  Identifies whether the family contains parametric relations between some of its elements.
IsUserCreated |  Determine whether the family has been defined by the user.
ShowSpatialElementCalculationPoint |  For families that can have a calculation point for spatial elements, hide or show the calculation point. SpatialElementCalculationPoint elements.
StructuralCodeName |  The family's structural code name.
StructuralFamilyNameKey |  The family's structural section shape name key.
StructuralMaterialType |  The family's structural material type.
StructuralSectionShape |  The family's structural section shape.
Top
Methods
Name | Description
CanHaveStructuralSection |  Identifies if this Family can have a structural section.
CanLoadFamilies |  Checks whether the document is in a state that allows the loading of families.
ExtractPartAtom |  Writes a PartAtom XML from the contents of a family object.
GetFamilySymbolIds |  Gets the ids of the FamilySymbols owned by this Family.
GetFamilyTypeParameterValues |  Returns all applicable values for a FamilyType parameter of this family.
HasLargeSketches |  Checks whether the family contains sketches with a large number of elements.
IsAppropriateCategoryId |  Identifies if the input category id can be assigned as the new category for this family.
Top
Remarks
 Custom families within the Revit API represented by three objects - Family, FamilySymbol and FamilyInstance. Each object plays a significant part in the structure of families. The Family element represents the entire family that consists of a collection of types, such as an 'I Beam'. You can think of that object as representing the entire family file. The Family object contains a number of FamilySymbol elements. The FamilySymbol object represents a specific set of family settings within that Family and represents what is known in the Revit user interface as a Type, such as 'W14x32'. The FamilyInstance object represents an actual instance of that type placed the Autodesk Revit project. For example the FamilyInstance would be a single instance of a W14x32 column within the project.
Example
public void GetInfoForSymbols(Family family)
{
    StringBuilder message = new StringBuilder("Selected element's family name is : " + family.Name);
    ISet<ElementId> familySymbolIds = family.GetFamilySymbolIds();
    if (familySymbolIds.Count == 0)
    {
        message.AppendLine("Contains no family symbols.");
    }
    else
    {
        message.AppendLine("The family symbols contained in this family are : ");
        // Get family symbols which is contained in this family
        foreach (ElementId id in familySymbolIds)
        {
            FamilySymbol familySymbol = family.Document.GetElement(id) as FamilySymbol;
            // Get family symbol name
            message.AppendLine("\nName: " + familySymbol.Name);
            foreach (ElementId materialId in familySymbol.GetMaterialIds(false))
            {
                Material material = familySymbol.Document.GetElement(materialId) as Material;
                message.AppendLine("\nMaterial : " + material.Name);
            }
        }
    }
    TaskDialog.Show("Revit",message.ToString());
}
See Also
Reference
Autodesk.Revit.DB Namespace