Revit 2027 API
KeyBasedTreeEntriesLoadResults Class
 This class contains the results and status information regarding an attempt to load the KeyBasedTreeEntries from an External Resource.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class KeyBasedTreeEntriesLoadResults : IDisposable
Public Class KeyBasedTreeEntriesLoadResults
	Implements IDisposable
public ref class KeyBasedTreeEntriesLoadResults : IDisposable
type KeyBasedTreeEntriesLoadResults =
    class
        interface IDisposable
    end
The KeyBasedTreeEntriesLoadResults type exposes the following members.
Constructors
Name | Description
KeyBasedTreeEntriesLoadResults |  Creates an empty KeyBasedTreeEntriesLoadResults.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the KeyBasedTreeEntriesLoadResults
GetFailureMessages |  Get all error or warnings created while attempting to load KeyBasedTreeEntries.
GetFileReadErrors |  Gets the names of any files which could not be read due to access errors.
GetFileSyntaxErrors |  Gets all the records in the key-based tree data text file that could not be parsed into KeyBasedTreeEntries.
GetKeyBasedTreeEntryErrors() |  Gets information about KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors.
GetKeyBasedTreeEntryErrors(KeyBasedTreeEntryErrorType) |  Gets information about specific KeyBasedTreeEntry objects that could not be included in the KeyBasedTreeEntries object due to errors of a particular type.
Top
Remarks
A KeyBasedTreeEntriesLoadResults object is returned by the KeynoteTable or AssemblyCodeTable API methods LoadFrom() and Reload() so that callers can determine whether the KeynoteTable or AssemblyCodeTable was updated successfully and what, if any, errors occurred.
See Also
Reference
Autodesk.Revit.DB Namespace