Revit 2027 API
AssemblyMemberDifference Class
 Class that describes difference between two assembly members
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentCategory
 Autodesk.Revit.DB.AssemblyMemberDifferentGeometry
 Autodesk.Revit.DB.AssemblyMemberDifferentParameters
 Autodesk.Revit.DB.AssemblyMemberDifferentType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AssemblyMemberDifference : IDisposable
Public Class AssemblyMemberDifference
	Implements IDisposable
public ref class AssemblyMemberDifference : IDisposable
type AssemblyMemberDifference =
    class
        interface IDisposable
    end
The AssemblyMemberDifference type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the AssemblyMemberDifference
Top
Remarks
 Different sub-classes of this class represent different kinds of differences between assembly members and contain additional data for each particular kind of difference.
See Also
Reference
Autodesk.Revit.DB Namespace