Revit 2027 API
CableTrayRun Class
 This class represents a cable tray run in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase
 Autodesk.Revit.DB.Electrical.CableTrayRun
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CableTrayRun : CableTrayConduitRunBase
Public Class CableTrayRun
	Inherits CableTrayConduitRunBase
public ref class CableTrayRun : public CableTrayConduitRunBase
type CableTrayRun =
    class
        inherit CableTrayConduitRunBase
    end
The CableTrayRun type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
Remarks
 This class is mainly for calculating length of a cable tray run. A cable tray run contains connected straight cable tray segments and bends between the straight segments with same type and size.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace