Revit 2027 API
GridType Class
An object that represents a grid type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.GridType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GridType : LineAndTextAttrSymbol
Public Class GridType
	Inherits LineAndTextAttrSymbol
public ref class GridType : public LineAndTextAttrSymbol
type GridType =
    class
        inherit LineAndTextAttrSymbol
    end
The GridType type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace