Revit 2027 API
SizingCalculator Class
 Calculates the required duct or pipe size based on the specified parameters and constraints.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.SizingCalculator
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SizingCalculator : IDisposable
Public Class SizingCalculator
	Implements IDisposable
public ref class SizingCalculator : IDisposable
type SizingCalculator =
    class
        interface IDisposable
    end
The SizingCalculator type exposes the following members.
Constructors
Name | Description
SizingCalculator |  Constructs an SizingCalculator instance.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
CalculateSizeByFriction |  Calculates the duct or pipe size based on the specified flow and friction.
CalculateSizeByVelocity |  Calculates the duct or pipe size based on the specified flow and velocity.
Dispose | Releases all resources used by the SizingCalculator
EquivalentDiameter |  Calculates the equivalent diameter based on the specified profile type, width, and height.
Friction |  Calculates the friction based on the specified parameters.
Velocity |  Calculates the velocity based on the specified parameters.
Top
Remarks
 This class calculates duct and pipe sizes based on various constraints such as flow friction, and velocity. Other parameters are often included in SizingOptions. The size result is also stored in the SizingOptions after the calculation.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace