Revit 2027 API
ExportIFCCategoryKey Methods
The ExportIFCCategoryKey type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ExportIFCCategoryKey Class
Autodesk.Revit.DB Namespace