Revit 2027 API
DocumentSavingAsEventArgs Properties
The DocumentSavingAsEventArgs type exposes the following members.
Properties
Name | Description
IsSavingAsCentralFile |  Indicates whether the document is to be saved as central file.
PathName |  Target path to which the document is to be saved.
Top
See Also
Reference
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace