Revit 2027 API
AddInIdAttribute Class
 The custom AddInId attribute for Macros macros use only.
Inheritance Hierarchy
System.Object
 System.Attribute
 Autodesk.Revit.DB.Macros.AddInIdAttribute
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AddInIdAttribute : Attribute
Public Class AddInIdAttribute
	Inherits Attribute
public ref class AddInIdAttribute : public Attribute
type AddInIdAttribute =
    class
        inherit Attribute
    end
The AddInIdAttribute type exposes the following members.
Constructors
Name | Description
AddInIdAttribute | Constructs a new AddInIdAttribute.
Top
Properties
Name | Description
Value | AddInId guid value.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace