Revit 2027 API
RevitAPIPreEventArgs Methods
The RevitAPIPreEventArgs type exposes the following members.
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
Top
See Also
Reference
RevitAPIPreEventArgs Class
Autodesk.Revit.DB.Events Namespace