Revit 2027 API
CylindricalFace Properties
The CylindricalFace type exposes the following members.
Properties
Name | Description
Axis | Axis of the surface.
Origin | Origin of the surface.
Radius | Radii of the surface.
Top
See Also
Reference
CylindricalFace Class
Autodesk.Revit.DB Namespace