Revit 2027 API
StructuralSettings Properties
The StructuralSettings type exposes the following members.
Properties
Name | Description
BoundaryConditionAreaAndLineSymbolSpacing |  Symbol spacing for boundary conditions.
BoundaryConditionFamilySymbolFixed |  The id of the FamilySymbol to represent a fixed boundary condition.
BoundaryConditionFamilySymbolPinned |  The id of the FamilySymbol to represent a pinned boundary condition.
BoundaryConditionFamilySymbolRoller |  The id of the FamilySymbol to represent a roller boundary condition.
BoundaryConditionFamilySymbolUserDefined |  The id of the FamilySymbol to represent a user-defined boundary condition.
BoundarySetbackDisabledForSteelElements |  Disallow shortening (setbacks) to joined element boundaries for beams and braces. If enabled, then beams and braces will have the setbacks set to 0 by default. Explicit setbacks to references will still be allowed.
BraceAboveSymbol |  The id of the ElementType to represent a brace above a beam in plan view.
BraceBelowSymbol |  The id of the ElementType to represent a brace below a beam in plan view.
BraceParallelLineOffset |  The distance by which brace symbols in plan views will be offset.
KickerBraceSymbol |  The id of the ElementType to represent a kicker brace.
ShowBraceAbove |  Whether to show brace symbols above beams in plan views.
ShowBraceBelow |  Whether to show brace symbols below beams in plan views.
SymbolicCutbackForBeamAndTruss |  Symbolic cutback distance to be applied to all beams and trusses.
SymbolicCutbackForBrace |  Symbolic cutback distance to be applied to all braces.
SymbolicCutbackForColumn |  Symbolic cutback distance to be applied to all columns.
UseLoadsDisplayScaling |  Whether to use loads display scaling. If disabled then loads are displayed according to force scale type parameters.
Top
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace