Revit 2027 API
LevelAssociationData Class
 This class holds information related to Level.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LevelAssociationData
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LevelAssociationData : IDisposable
Public Class LevelAssociationData
	Implements IDisposable
public ref class LevelAssociationData : IDisposable
type LevelAssociationData =
    class
        interface IDisposable
    end
The LevelAssociationData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LevelAssociationData
GetAssociatedLevel |  Returns the Associated Level id.
GetLevelAssociationData |  Returns LevelAssociationData associated with this element, if it exists.
GetLevelOffset |  Returns the offset from the Associated Level.
SetAssociatedLevel |  Sets the Associated Level.
Top
See Also
Reference
Autodesk.Revit.DB Namespace