Revit 2027 API
FilterStringRule Properties
The FilterStringRule type exposes the following members.
Properties
Name | Description
RuleString |  The user-supplied string against which strings from a Revit document will be tested.
Top
See Also
Reference
FilterStringRule Class
Autodesk.Revit.DB Namespace