Revit 2027 API
IFCParameterTemplate Methods
The IFCParameterTemplate type exposes the following members.
Methods
Name | Description
AddPropertyMappingInfo |  Adds a property mapping info to the property set.
AddPropertySet |  Adds a property set to the template.
ClearPropertySets |  Removes all property sets from the template.
CopyPropertySet |  Creates a copy of the property set and adds it to the template.
CopyTemplate |  Create copy of mapping template with new name.
Create |  Create an IFC parameter mapping template with default values.
ExportPropertySetupToFile |  Exports mapping information of the provided property setup to a text file.
ExportToFile |  Export mapping template to a text file.
FindByName |  Returns mapping template element by name.
FindPropertyMappingInfo(PropertySetupType, String, ElementId) |  Finds the property mapping info in the property set by id.
FindPropertyMappingInfo(PropertySetupType, String, String) |  Finds the property mapping info in the property set by name.
GetActiveTemplate |  Gets the active mapping template element in the document.
GetOrCreateInSessionTemplate |  Gets the in-session non-serializable template or create new.
GetPropertyMappingInfos |  Creates an array of property mappings contained in the property set according to provided selection type.
GetPropertySetApplicableEntities | Obsolete.
 Gets the list of IFC entities to which the property set is applicable.
GetPropertySetNames |  Creates an array of property set names contained in the template according to provided selection type.
ImportFromFile |  Import mapping template from a text file.
ImportPropertySetupFromFile |  Imports mapping information from a text file.
IsExportingPropertySet |  Determines whether the provided property set is included in export.
IsInSessionTemplate |  Returns true if this is an in-session template.
IsPropertySetAMemberOfTemplate |  Checks whether a property set exists in the template.
IsValidName |  Returns result that the proposed name is valid and not exist in the specified document.
ListNames |  Returns a list of names of IFC export parameter mapping templates.
RemovePropertyMappingInfo(PropertySetupType, String, ElementId) |  Removes the property mapping from the property set by id.
RemovePropertyMappingInfo(PropertySetupType, String, String) |  Removes the property mapping from the property set by name.
RemovePropertySet |  Removes provided property set from the template.
ResetActiveTemplate |  Removes the information about active mapping temple of the document.
SetActiveTemplate |  Sets the mapping template element to be the active mapping template for its document.
SetInSessionTemplateDocument |  Set document for in-session template.
SetPropertySetApplicableEntities | Obsolete.
 Sets the list of IFC entities to which the property set is applicable.
SetPropertySetExportingFlag |  Define whether the provided property set must be included in export.
Top
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace