Revit 2027 API
CircleLightShape Properties
The CircleLightShape type exposes the following members.
Properties
Name | Description
EmitDiameter |  The emit diameter.
Top
See Also
Reference
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace