Revit 2027 API
ProjectLocationSet Class
An set that contains project locations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ProjectLocationSet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ProjectLocationSet : APIObject,
	IEnumerable
Public Class ProjectLocationSet
	Inherits APIObject
	Implements IEnumerable
public ref class ProjectLocationSet : public APIObject,
	IEnumerable
type ProjectLocationSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The ProjectLocationSet type exposes the following members.
Constructors
Name | Description
ProjectLocationSet | Initializes a new instance of the ProjectLocationSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of project locations that are in the set.
Top
Methods
Name | Description
Clear | Removes every project location from the set, rendering it empty.
Contains | Tests for the existence of a project location within the set.
Erase | Removes a specified project location from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified project location into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB Namespace