Revit 2027 API
SchemaException Methods
The SchemaException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
SchemaException Class
Autodesk.Revit.Exceptions Namespace