Revit 2027 API
RebarShapeConstraintRadius Properties
The RebarShapeConstraintRadius type exposes the following members.
Properties
Name | Description
ArcReferenceType |  The choice of rule for measuring the radius.
Top
See Also
Reference
RebarShapeConstraintRadius Class
Autodesk.Revit.DB.Structure Namespace