Revit 2027 API
ReferenceArray Properties
The ReferenceArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a reference at a specified index within the array.
Size | Returns the number of references that are in the array.
Top
See Also
Reference
ReferenceArray Class
Autodesk.Revit.DB Namespace