Revit 2027 API
PointCloudType Properties
The PointCloudType type exposes the following members.
Properties
Name | Description
ColorEncoding |  The color encoding used by points extracted from instances of this point cloud.
EngineIdentifier |  The identifier of the engine responsible for handling of the point cloud.
FoundStatus |  Shows whether the Point Cloud external file could be found.
Offset |  Returns the offset stored in the point cloud.
Scale |  The multiplier applied to the points in all instances of this point cloud.
Top
See Also
Reference
PointCloudType Class
Autodesk.Revit.DB Namespace