Revit 2027 API
FabricationVersionInfo Methods
The FabricationVersionInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace