Revit 2027 API
NurbSpline Properties
The NurbSpline type exposes the following members.
Properties
Name | Description
CtrlPoints | Returns the control points of the nurb spline.
Degree | Returns the degree of the nurb spline.
isRational | Returns whether the nurb spline is rational or not.
Knots | Return/set the knots of the nurb spline.
Weights | Returns the weights of the nurb spline.
Top
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace