Revit 2027 API
CoordinationModelLinkOptions Class
 A class containing link options for Coordination Models.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CoordinationModelLinkOptions : IDisposable
Public Class CoordinationModelLinkOptions
	Implements IDisposable
public ref class CoordinationModelLinkOptions : IDisposable
type CoordinationModelLinkOptions =
    class
        interface IDisposable
    end
The CoordinationModelLinkOptions type exposes the following members.
Constructors
Name | Description
CoordinationModelLinkOptions |  Constructs a default instance of Coordination Model link options with the default CoordinationModelPositioning.
 The default CoordinationModelPositioning is OriginToInternalOrigin.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Positioning |  Placement option for Coordination Model linking.
Top
Methods
Name | Description
Dispose | Releases all resources used by the CoordinationModelLinkOptions
Top
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace