Revit 2027 API
CoordinationModelLinkOptions Methods
The CoordinationModelLinkOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
CoordinationModelLinkOptions Class
Autodesk.Revit.DB.ExternalData Namespace