Revit 2027 API
SpatialFieldManager Properties
The SpatialFieldManager type exposes the following members.
Properties
Name | Description
AllowInteractiveSettings |  If true interactive settings dialog and pick deletion are allowed.
CurrentMeasurement |  Stores the currently displayed measurement
LegendPosition |  Stores current position of analysis results legend element in view
LegendShowConfigurationName |  If true legend contains analysis configuration name.
LegendShowDescription |  If true legend contains analysis description.
LegendTextTypeId |  Stores element id of text associated with common (result-independent) part of legend in view.
NumberOfMeasurements |  Stores the total number of measurements
ResultsVisibleInView |  Enables analysis results visibility in the view.
UseRangeForAllMeasurements |  Governs how minimum and maximum values (the data range) are calculated.
Top
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace