Revit 2027 API
Fascia Properties
The Fascia type exposes the following members.
Properties
Name | Description
FasciaType | Retrieves/set an object that represents the type of the Fascia.
Top
See Also
Reference
Fascia Class
Autodesk.Revit.DB.Architecture Namespace