Revit 2027 API
PanelTypeSetIterator Properties
The PanelTypeSetIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
PanelTypeSetIterator Class
Autodesk.Revit.DB Namespace