Revit 2027 API
WallFoundation Methods
The WallFoundation type exposes the following members.
Methods
Name | Description
Create |  Creates a new wall foundation within the project.
Top
See Also
Reference
WallFoundation Class
Autodesk.Revit.DB Namespace