Revit 2027 API
FabricationConfiguration Class
 This element contains the information about the fabrication configuration settings used by the project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.FabricationConfiguration
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FabricationConfiguration : Element
Public Class FabricationConfiguration
	Inherits Element
public ref class FabricationConfiguration : public Element
type FabricationConfiguration =
    class
        inherit Element
    end
The FabricationConfiguration type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AirturnExists |  Checks to see if the specified air turn exists in the fabrication database.
AncillaryExists |  Checks to see if the specified ancillary exists.
AreItemFilesLoaded |  Checks if the fabrication item files have been loaded.
CanBeSwapped |  Checks if the fabrication configuration can be swapped.
CanUnloadItemFiles |  Checks if the fabrication item files are already in use and should not be unloaded.
CheckConnectionsForAllFabricationParts |  Checks the connections for all fabrication parts in the current project. It will create reviewable warnings for all bad connections found. The checks are looking for bad alignments or gaps, incompatible connection types, mismatches of size, mismatches of shapes.
CustomDataExists |  Checks to see if the specified custom data exists.
DamperExists |  Checks to see if the specified damper exists.
GetAirturnName |  Gets the airturn name from its database identifier.
GetAllAirturnIds |  Gets all available air turn identifiers.
GetAllDampers |  Gets all damper identifiers in the fabrication configuration.
GetAllFabricationConnectorDefinitions |  Gets fabrication connector identifiers from the fabrication configuration, filtered by shape and domain.
GetAllInsulationSpecifications |  Gets all insulation specification identifiers in the fabrication configuration.
GetAllLoadedItemFiles |  Get list of all loaded fabrication item files.
GetAllLoadedServices |  Returns all the loaded fabrication services.
GetAllMaterials |  Gets all material identifiers in the fabrication configuration.
GetAllPartCustomData |  Gets all possible fabrication part custom data identifiers.
GetAllPartStatuses |  Gets all possible fabrication part status identifiers.
GetAllSeamIds |  Gets all available seam identifiers.
GetAllServices |  Returns all fabrication services in the fabrication configuration.
GetAllSpecifications |  Gets all specification identifiers in the fabrication configuration.
GetAllStiffenerIds |  Gets all available stiffener identifiers.
GetAllUsedItemFiles |  Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it.
GetAllUsedServices |  Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user.
GetAncillaries |  Gets fabrication ancillaries of the specified type.
GetAncillaryGroup |  Gets the fabrication ancillary group of the specified fabrication ancillary identifier.
GetAncillaryGroupName |  Gets the fabrication ancillary group and name for the specified fabrication ancillary identifier.
GetAncillaryName |  Gets the fabrication ancillary name for the specified fabrication ancillary identifier.
GetDamperName |  Gets the damper name from its identifier.
GetFabricationConfiguration |  Gets the fabrication configuration element in the document.
GetFabricationConfigurationInfo |  Gets the information about the fabrication configuration of the project.
GetFabricationConnectorDomain |  Gets the fabrication connector domain from its identifier.
GetFabricationConnectorGroup |  Gets the fabrication connector group from its identifier.
GetFabricationConnectorName |  Gets the fabrication connector name from its identifier.
GetFabricationConnectorShape |  Gets the fabrication connector shape from its identifier.
GetInsulationSpecificationAbbreviation |  Gets insulation specification abbreviation.
GetInsulationSpecificationGroup |  Gets the insulation specification group from its identifier.
GetInsulationSpecificationName |  Gets the insulation specification name from its identifier.
GetItemFolders |  Gets a list of fabrication item folders in the fabrication item folder structure.
GetMaterialAbbreviation |  Gets the abreviation of the material or the insulation or the double wall material.
GetMaterialByGUID |  Gets the material identifier by its GUID.
GetMaterialGaugeByGUID |  Gets the material gauge identifier by its GUID and material identifier.
GetMaterialGaugeGUID |  Gets the material gauge GUID by its material/gauge identifiers.
GetMaterialGroup |  Gets material group from its identifier.
GetMaterialGUID |  Gets the material GUID by its identifier.
GetMaterialName |  Gets material name from its identifier.
GetPartCustomDataName |  Gets the custom data name from its identifier.
GetPartCustomDataType |  Gets the custom data type from its identifier. See FabricationCustomDataType enumerator.
GetPartStatusDescription |  Gets the status description from its identifier.
GetProfile |  Return the profile of the loaded fabrication configuration. Return empty string for global profile.
GetSeamName |  Gets the seam name from its database identifier.
GetService |  Get the service based on the service identifier from the fabrication configuration in the current document.
GetServiceByGUID |  Gets the service identifier by its GUID.
GetServiceGUID |  Gets the service GUID by its identifier.
GetServiceTypeName |  Gets the service type name.
GetSpecificationAbbreviation |  Gets specification abbreviation.
GetSpecificationByGUID |  Gets the specification identifier by its GUID.
GetSpecificationGroup |  Gets the specification group from its identifier.
GetSpecificationGUID |  Gets the specification GUID by its identifier.
GetSpecificationName |  Gets the specification name from its identifier.
GetStiffenerName |  Gets the stiffener name from its database identifier.
GetUpdatedStraightsFromValidateConnections |  Get the set of element identifiers of fabrication part straights that were previously updated. If there were no straights were updated it will return an empty set of element identifiers.
HasValidConfiguration |  Checks whether a valid fabrication configuration has been set for the project.
IsAncillaryKit |  Gets whether the specified fabrication ancillary identifier is an ancillary kit or not.
LoadItemFiles |  Loads the specified fabrication item files into the project.
LoadServices |  Loads the specified fabrication services into the project.
LocateFabricationConnector |  Gets the fabrication connector identifiers by group and name, filtered by shape and domain.
LocateInsulationSpecification |  Gets the insulation specification by group and name.
LocateMaterial |  Gets material by group and name.
LocateSpecification |  Gets the specification identifier by group and name.
PostReviewableWarningsForBadConnections |  Reviewable warnings are created for all entries contained in the connection validation information.
ReloadConfiguration |  Reloads the fabrication configuration from its source fabrication configuration.
SeamExists |  Checks to see if the specified seam exists in the fabrication database.
SetConfiguration(FabricationConfigurationInfo) |  Set the fabrication configuration with global profile.
SetConfiguration(FabricationConfigurationInfo, String) |  Set the fabrication configuration with specific profile.
SetServicesToLoad |  Sets the services which are to be loaded or not next time reloadConfiguration is called. If a service is not included but is currently loaded then it will be unloaded then.
StiffenerExists |  Checks to see if the specified stiffener exists in the fabrication database.
UnloadItemFiles |  Unload the specified fabrication item files from the project.
UnloadServices |  Unload the specified fabrication services from the project.
ValidateConnectionsForAllFabricationParts |  Validates all fabrication part connections in the current project. Invalid connections found will be added to the connection validation information class. The validation checks for bad alignments or gaps, incompatible connection types, mismatches of size, mismatches of shapes.
Top
Remarks
 The element provides information about the location of the fabrication database, its properties, and settings related to fabrication items.
See Also
Reference
Autodesk.Revit.DB Namespace