Revit 2027 API
ReleaseConditions Class
 An object that represents a Release Conditions on analytical element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReleaseConditions
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReleaseConditions : IDisposable
Public Class ReleaseConditions
	Implements IDisposable
public ref class ReleaseConditions : IDisposable
type ReleaseConditions =
    class
        interface IDisposable
    end
The ReleaseConditions type exposes the following members.
Constructors
Name | Description
ReleaseConditions(Boolean) |  Creates a new instance of ReleaseConditions.
ReleaseConditions(Boolean, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean) |  Creates a new instance of ReleaseConditions.
Top
Properties
Name | Description
Fx |  Gets or Sets the Fx of the release type.
Fy |  Gets or Sets the Fy of the release type.
Fz |  Gets or Sets the Fz of the release type.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Mx |  Gets or Sets the Mx of the release type.
My |  Gets or Sets the My of the release type.
Mz |  Gets or Sets the Mz of the release type.
Start |  Gets or Sets the position of release type. True for start, false for end.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReleaseConditions
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace