Revit 2027 API
RebarSystemSpanSymbol Class
 Represents a Rebar System Span Symbol element in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.RebarSystemSpanSymbol
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarSystemSpanSymbol : IndependentTag
Public Class RebarSystemSpanSymbol
	Inherits IndependentTag
public ref class RebarSystemSpanSymbol : public IndependentTag
type RebarSystemSpanSymbol =
    class
        inherit IndependentTag
    end
The RebarSystemSpanSymbol type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of RebarSystemSpanSymbol in the project.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace