Revit 2027 API
RevitServerInternalException Methods
The RevitServerInternalException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides RevitServerException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
RevitServerInternalException Class
Autodesk.Revit.Exceptions Namespace