Revit 2027 API
ExportFontTable Methods
The ExportFontTable type exposes the following members.
Methods
Name | Description
Add |  Inserts a (key,info) pair into Export font table.
Clear |  Removes all contents stored in the table.
ContainsKey |  Checks whether a font key exists in the table.
Dispose
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetExportFontInfo |  Gets a copy of the font info associated to the input font key.
GetFontTableIterator | Returns a FontTableIterator that iterates through the collection.
GetKeys |  Returns a collection of the keys stored in this table.
GetValues |  Returns a collection of the values stored in this table.
Remove |  Removes the pair (key, info) by font key.
Top
See Also
Reference
ExportFontTable Class
Autodesk.Revit.DB Namespace