Revit 2027 API
StructuralSectionColdFormed Class
 Defines parameters for Hot Formed structural section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 More
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionColdFormed : StructuralSectionRectangular
Public Class StructuralSectionColdFormed
	Inherits StructuralSectionRectangular
public ref class StructuralSectionColdFormed : public StructuralSectionRectangular
type StructuralSectionColdFormed =
    class
        inherit StructuralSectionRectangular
    end
The StructuralSectionColdFormed type exposes the following members.
Properties
Name | Description
InnerFillet |  Inner Fillet - Corner fillet inner radius.
WallDesignThickness |  Represents wall design thickness of rectangle.
WallNominalThickness |  Represents wall nominal thickness of rectangle.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips