Revit 2027 API
RibbonPanel Methods
The RibbonPanel type exposes the following members.
Methods
Name | Description
AddItem |  Adds a Ribbon item to the panel.
AddSeparator | Adds a new Separator to the panel.
AddSlideOut |  Adds a slideout to the current panel.
AddStackedItems(RibbonItemData, RibbonItemData) |  Adds two stacked items to the panel.
AddStackedItems(RibbonItemData, RibbonItemData, RibbonItemData) |  Adds three stacked items to the panel.
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetItems | Gets a copy of the collection of RibbonItems assigned to the RibbonPanel.
Top
See Also
Reference
RibbonPanel Class
Autodesk.Revit.UI Namespace