Revit 2027 API
RibbonButton Properties
The RibbonButton type exposes the following members.
Properties
Name | Description
Image | The image of the button.
IsEnabledByContext | Indicates if this button can be executed. True if the pushbutton is permitted to be executed based on the current Revit context (active document, active view and active tool). False if the pushbutton is disabled because of the active context.
LargeImage | The large image shown on the button.
Top
See Also
Reference
RibbonButton Class
Autodesk.Revit.UI Namespace