Revit 2027 API
StructuralElementDefinitionData Class
 Class containing information about section and position of the structural element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralElementDefinitionData : IDisposable
Public Class StructuralElementDefinitionData
	Implements IDisposable
public ref class StructuralElementDefinitionData : IDisposable
type StructuralElementDefinitionData =
    class
        interface IDisposable
    end
The StructuralElementDefinitionData type exposes the following members.
Constructors
Name | Description
StructuralElementDefinitionData |  Creates empty StructuralElementDefinitionData object.
Top
Properties
Name | Description
CenterCurve |  The curve lying in the geometrical center of the element.
Curve |  The definition curve of the element.
EndShortening |  Cutback or extension at element curve end.
IsMirrored |  States if the structural section of the element is mirrored.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Normal |  The local Z direction of the element section in the start point of the curve.
Section |  Structural section of the element.
StartShortening |  Cutback or extension at element curve start.
YJust |  Y justification (ref axis).
YOffset |  Y offset.
ZJust |  Z justification (ref axis).
ZOffset |  Z offset.
Top
Methods
Name | Description
Dispose | Releases all resources used by the StructuralElementDefinitionData
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace