Revit 2027 API
ExportLinetypeInfo Class
 A value used to represent the info stored in the ExportLinetypeTable.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExportLinetypeInfo
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExportLinetypeInfo : IDisposable
Public Class ExportLinetypeInfo
	Implements IDisposable
public ref class ExportLinetypeInfo : IDisposable
type ExportLinetypeInfo =
    class
        interface IDisposable
    end
The ExportLinetypeInfo type exposes the following members.
Constructors
Name | Description
ExportLinetypeInfo() |  Constructs a new default ExportLinetypeInfo.
ExportLinetypeInfo(ExportLinetypeInfo) |  Constructs a new copy of the input ExportLinetypeInfo object.
ExportLinetypeInfo(String) |  Constructs a new ExportLinetypeInfo using the destination linetype name as input.
Top
Properties
Name | Description
DestinationLinetypeName |  The destination linetype name (the name of the linetype in the exported format).
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExportLinetypeInfo
Top
See Also
Reference
Autodesk.Revit.DB Namespace