Revit 2027 API
DuctInsulation Class
 Represents insulation applied to the outside of a given duct , fitting or accessory.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.InsulationLiningBase
 Autodesk.Revit.DB.Mechanical.DuctInsulation
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DuctInsulation : InsulationLiningBase
Public Class DuctInsulation
	Inherits InsulationLiningBase
public ref class DuctInsulation : public InsulationLiningBase
type DuctInsulation =
    class
        inherit InsulationLiningBase
    end
The DuctInsulation type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create |  Creates a new instance of duct insulation.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace