Revit 2027 API
CableTray Properties
The CableTray type exposes the following members.
Properties
Name | Description
CurveNormal |  The up-direction vector of the cable tray.
RungSpace |  Distance between two rungs for the ladder cable tray.
Top
See Also
Reference
CableTray Class
Autodesk.Revit.DB.Electrical Namespace