Revit 2027 API
LinkLoadResult Class
 This class stores the results of trying to load a single linked model.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkLoadResult
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LinkLoadResult : IDisposable
Public Class LinkLoadResult
	Implements IDisposable
public ref class LinkLoadResult : IDisposable
type LinkLoadResult =
    class
        interface IDisposable
    end
The LinkLoadResult type exposes the following members.
Constructors
Name | Description
LinkLoadResult() |  Constructs a new uninitialized LinkLoadResult object.
LinkLoadResult(LinkLoadResult) |  Constructs a new copy of the input LinkLoadResult object.
Top
Properties
Name | Description
ElementId |  The id of the created or loaded linked model.
IsCircularLink |  True if these results are part of a link cycle.
IsNested |  True if these results represent a nested link; false otherwise.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LoadResult |  Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded for success, or a variety of errors. See LinkLoadResultType for the full list.
Top
Methods
Name | Description
Dispose | Releases all resources used by the LinkLoadResult
GetCentralModelName |  Gets the central model's name. If the link is not workshared, this returns an empty FilePath. If the link is itself a central model, this returns the link's name.
GetExternalResourceReference |  Gets a copy of the ExternalResourceReference corresponding to the link.
GetExternalResourceReferencesFromFailedLoads |  Searches this and all nested LinkLoadResults, and returns a list of ExternalResourceReferences for the links that failed to load.
GetLinkLoadResult |  Searches this LinkLoadResult and all nested LinkLoadResults for the load operation results of a specified ExternalResourceReference.
GetModelName |  Gets the name of the model.
GetNestedLinkLoadResults |  Gets the results for this link's nested links.
GetParentModelName |  Returns the name of the parent of the linked model, or an empty FilePath if the link is a top-level link.
IsCodeSuccess |  Check if load result code signifies success.
Top
See Also
Reference
Autodesk.Revit.DB Namespace