Revit 2027 API
LeaderArrayIterator Properties
The LeaderArrayIterator type exposes the following members.
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
See Also
Reference
LeaderArrayIterator Class
Autodesk.Revit.DB Namespace