Revit 2027 API
Duct Properties
The Duct type exposes the following members.
Properties
Name | Description
DuctType |  The duct type of this duct.
IsPlaceholder |  Identifies if the duct is a placeholder or not.
Top
See Also
Reference
Duct Class
Autodesk.Revit.DB.Mechanical Namespace