Revit 2027 API
DeleteElements Class
 Deletes element(s) related to the failure.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureResolution
 Autodesk.Revit.DB.DeleteElements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DeleteElements : FailureResolution
Public Class DeleteElements
	Inherits FailureResolution
public ref class DeleteElements : public FailureResolution
type DeleteElements =
    class
        inherit FailureResolution
    end
The DeleteElements type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Create(Document, ElementId) |  Creates an instance of the DeleteElements resolution.
Create(Document, IList<ElementId>) |  Creates an instance of the DeleteElements resolution.
Create(Document, ISet<ElementId>) |  Creates an instance of the DeleteElements resolution.
Top
See Also
Reference
Autodesk.Revit.DB Namespace