Revit 2027 API
ElementSet Methods
The ElementSet type exposes the following members.
Methods
Name | Description
Clear | Removes every item element the set, rendering it empty.
Contains | Tests for the existence of an element within the set.
Erase | Removes a specified element from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified element into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
ElementSet Class
Autodesk.Revit.DB Namespace