Revit 2027 API
SaveAsOptions Class
 This class contains options available for saving a document to disk with a new filename.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SaveAsOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SaveAsOptions : IDisposable
Public Class SaveAsOptions
	Implements IDisposable
public ref class SaveAsOptions : IDisposable
type SaveAsOptions =
    class
        interface IDisposable
    end
The SaveAsOptions type exposes the following members.
Constructors
Name | Description
SaveAsOptions |  Default constructor.
Top
Properties
Name | Description
Compact |  Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MaximumBackups |  The maximum number of backups to keep on disk.
OverwriteExistingFile |  Identifies if the operation should be able to overwrite an existing file.
PreviewViewId |  The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SaveAsOptions
GetWorksharingOptions |  Gets Worksharing options for SaveAs.
SetWorksharingOptions |  Sets Worksharing options for SaveAs.
Top
See Also
Reference
Autodesk.Revit.DB Namespace