Revit 2027 API
StairsLandingType Class
 Represents a stairs landing type in Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.StairsLandingType
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StairsLandingType : ElementType
Public Class StairsLandingType
	Inherits ElementType
public ref class StairsLandingType : public ElementType
type StairsLandingType =
    class
        inherit ElementType
    end
The StairsLandingType type exposes the following members.
Properties
Name | Description
IsMonolithic |  True if the stairs landing is monolithic, false otherwise.
Thickness |  Thickness of the stairs landing.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace