Revit 2027 API
AreaBasedLoadType Methods
The AreaBasedLoadType type exposes the following members.
Methods
Name | Description
Create |  Creates an area based load type.
Top
See Also
Reference
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace