Revit 2027 API
CorruptModelException Methods
The CorruptModelException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
CorruptModelException Class
Autodesk.Revit.Exceptions Namespace