Revit 2027 API
AssetProperties Methods
The AssetProperties type exposes the following members.
Methods
Name | Description
FindByName |  Gets the property with the given name.
Get |  Gets the property at the given index.
IsValidIndex |  Returns true if the provided index is valid.
Top
See Also
Reference
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace