Revit 2027 API
LayoutRuleMaximumSpacing Class
This class indicate the layout rule of a Beam System is Max-Spacing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleMaximumSpacing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class LayoutRuleMaximumSpacing : LayoutRule
Public Class LayoutRuleMaximumSpacing
	Inherits LayoutRule
public ref class LayoutRuleMaximumSpacing : public LayoutRule
type LayoutRuleMaximumSpacing =
    class
        inherit LayoutRule
    end
The LayoutRuleMaximumSpacing type exposes the following members.
Constructors
Name | Description
LayoutRuleMaximumSpacing | Constructor of LayoutRuleMaximumSpacing.
Top
Properties
Name | Description
Spacing | Get or set the spacing of the beam system.
Top
Methods
Name | Description
Top
Remarks
To use this type of LayoutRule, only the maximum spacing must be set and it must be in (0, 30000).
Example
private bool LayoutRuleMaximumSpacingInformation(BeamSystem beamSystem)
{
    //get the layoutRule of the beamsystem
    Autodesk.Revit.DB.LayoutRule layoutRule = beamSystem.LayoutRule;
    string message = "BeamSystem layout rule : " + layoutRule;
    //create a new instance of the LayoutRuleClearSpacing class
    LayoutRuleMaximumSpacing myLayoutRuleMaximumSpacing =
                        new LayoutRuleMaximumSpacing(10.0);
    //set the new layoutRule to the beamsystem
    beamSystem.LayoutRule = myLayoutRuleMaximumSpacing;
    LayoutRuleMaximumSpacing maximunSpacing = beamSystem.LayoutRule as LayoutRuleMaximumSpacing;
    if (null == maximunSpacing)
    {
        return false;
    }
    //try to get the property value of the beamsystem LayoutRule
    double spacing = maximunSpacing.Spacing;
    message += "\nNew BeamSystem layout rule: " + maximunSpacing;
    message += "\nNew BeamSystem maximum spacing: " + spacing;
    TaskDialog.Show("Revit",message);
    return true;
}
See Also
Reference
Autodesk.Revit.DB Namespace