Revit 2027 API
AssetSetIterator Properties
The AssetSetIterator type exposes the following members.
Properties
Name | Description
Current
Top
See Also
Reference
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace