Revit 2027 API
ExternallyTaggedGeometryObject Class
 Base class for ExternallyTaggedGeometryObject and ExternallyTaggedSolid.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternallyTaggedGeometryObject
 Autodesk.Revit.DB.ExternallyTaggedBRep
 Autodesk.Revit.DB.ExternallyTaggedNonBRep
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternallyTaggedGeometryObject : IDisposable
Public Class ExternallyTaggedGeometryObject
	Implements IDisposable
public ref class ExternallyTaggedGeometryObject : IDisposable
type ExternallyTaggedGeometryObject =
    class
        interface IDisposable
    end
The ExternallyTaggedGeometryObject type exposes the following members.
Properties
Name | Description
ExternalId |  The external Id of the geometry object.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternallyTaggedGeometryObject
Top
See Also
Reference
Autodesk.Revit.DB Namespace