Revit 2027 API
ColorFillLegend Methods
The ColorFillLegend type exposes the following members.
Methods
Name | Description
Create |  Creates new instance of ColorFillLegend.
GetColumnWidths |  Returns array of column widths in the legend.
SetColumnWidths |  Sets array of column widths.
Top
See Also
Reference
ColorFillLegend Class
Autodesk.Revit.DB Namespace