Revit 2027 API
DuctSizeIterator Methods
The DuctSizeIterator type exposes the following members.
Methods
Name | Description
Dispose
GetCurrent |  Returns the current MEPSize.
HasCurrent |  Identifies if the iterator has a current item.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
Top
See Also
Reference
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace