Revit 2027 API
StructuralSectionSigmaProfileWithFold Properties
The StructuralSectionSigmaProfileWithFold type exposes the following members.
Properties
Name | Description
BendWidth |  Bend segment width.
FoldWidth |  Fold segment width.
LipLength |  Lip segment length.
MiddleBendLength |  Middle Bend segment length.
TopBendLength |  Top Bend segment length.
Top
See Also
Reference
StructuralSectionSigmaProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace