Revit 2027 API
STEPExportOptions Class
 The export options used by exporting STEP format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BIMExportOptions
 Autodesk.Revit.DB.STEPExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class STEPExportOptions : BIMExportOptions
Public Class STEPExportOptions
	Inherits BIMExportOptions
public ref class STEPExportOptions : public BIMExportOptions
type STEPExportOptions =
    class
        inherit BIMExportOptions
    end
The STEPExportOptions type exposes the following members.
Constructors
Name | Description
STEPExportOptions |  Constructs a new instance of STEPExportOptions with default values of all properties.
Top
Properties
Name | Description
ApplicationProtocol |  The Application Protocol of the exported STEP file.
TargetUnit |  The unit type of geometry in the resultant STEP file. Default value is ExportUnit::Default.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace