Revit 2027 API
ConnectionInputPointInfo Methods
The ConnectionInputPointInfo type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace