Revit 2027 API
BeforeExecutedEventArgs Class
 The event arguments used by AddInCommandBinding's BeforeExecuted event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.UI.Events.CommandEventArgs
 Autodesk.Revit.UI.Events.BeforeExecutedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BeforeExecutedEventArgs : CommandEventArgs
Public Class BeforeExecutedEventArgs
	Inherits CommandEventArgs
public ref class BeforeExecutedEventArgs : public CommandEventArgs
type BeforeExecutedEventArgs =
    class
        inherit CommandEventArgs
    end
The BeforeExecutedEventArgs type exposes the following members.
Properties
Name | Description
UsingCommandData |  Indicates whether or not the Revit journal will include custom data populated by the application associated with this command.
Top
Methods
Name | Description
Top
Remarks
 This event is cancellable. If your callback sets the Cancel property to true, the command will not execute.
See Also
Reference
Autodesk.Revit.UI.Events Namespace