Revit 2027 API
RelinquishOptions Methods
The RelinquishOptions type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
RelinquishOptions Class
Autodesk.Revit.DB Namespace