Revit 2027 API
StructuralSectionSigmaProfileWithLips Properties
The StructuralSectionSigmaProfileWithLips type exposes the following members.
Properties
Name | Description
BendWidth |  Bend segment width.
LipLength |  Lip segment length.
MiddleBendLength |  Middle Bend segment length.
TopBendLength |  Top Bend segment length.
Top
See Also
Reference
StructuralSectionSigmaProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace