Revit 2027 API
AXMImportOptions Class
Note: This API is now obsolete.
 The import options used to import AXM format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.AXMImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This class is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public class AXMImportOptions : BaseImportOptions
<ObsoleteAttribute("This class is deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Class AXMImportOptions
	Inherits BaseImportOptions
[ObsoleteAttribute(L"This class is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public ref class AXMImportOptions : public BaseImportOptions
[<ObsoleteAttribute("This class is deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
type AXMImportOptions =
    class
        inherit BaseImportOptions
    end
The AXMImportOptions type exposes the following members.
Constructors
Name | Description
AXMImportOptions() |  Constructs a new instance of AXMImportOptions with default values of all properties.
AXMImportOptions(AXMImportOptions) |  Constructs a new instance of AXMImportOptions as a copy of the provided import options.
Top
Properties
Name | Description
ImportLevels |  Indicate if levels are to be imported. False by default.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace