Revit 2027 API
WorksetFilter Class
 A base class for a type of filter that accepts or rejects worksets based upon criteria.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetFilter
 Autodesk.Revit.DB.WorksetKindFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksetFilter : IDisposable
Public Class WorksetFilter
	Implements IDisposable
public ref class WorksetFilter : IDisposable
type WorksetFilter =
    class
        interface IDisposable
    end
The WorksetFilter type exposes the following members.
Properties
Name | Description
IncludeStandaloneWorksetsOnly |  True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected.
Inverted |  True if the results of the filter are inverted; worksets that would normally be accepted by this filter will be rejected, and worksets that would normally be rejected will be accepted.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the WorksetFilter
Top
See Also
Reference
Autodesk.Revit.DB Namespace