Revit 2027 API
CategoryNameMapIterator Class
An iterator to a category name map.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CategoryNameMapIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class CategoryNameMapIterator : APIObject,
	IEnumerator
Public MustInherit Class CategoryNameMapIterator
	Inherits APIObject
	Implements IEnumerator
public ref class CategoryNameMapIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type CategoryNameMapIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The CategoryNameMapIterator type exposes the following members.
Constructors
Name | Description
CategoryNameMapIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the category that is the current focus of the iterator.
Key | Retrieves the category name that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the map.
Top
See Also
Reference
Autodesk.Revit.DB Namespace