Revit 2027 API
CitySetIterator Methods
The CitySetIterator type exposes the following members.
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the set.
Top
See Also
Reference
CitySetIterator Class
Autodesk.Revit.DB Namespace