Revit 2027 API
TargetHostEdgeAndTransform Class
 This class stores the target host edge and the transform that is associated to the host edge's geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.TargetHostEdgeAndTransform
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TargetHostEdgeAndTransform : IDisposable
Public Class TargetHostEdgeAndTransform
	Implements IDisposable
public ref class TargetHostEdgeAndTransform : IDisposable
type TargetHostEdgeAndTransform =
    class
        interface IDisposable
    end
The TargetHostEdgeAndTransform type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the TargetHostEdgeAndTransform
GetHostEdgeTransform |  Gets the transform that is associated to the host edge's geometry.
GetTargetHostEdge |  Gets the target host edge.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace