Revit 2027 API
TransactionAttribute Class
 The custom transaction attribute to control the transaction behavior of the external command.
Inheritance Hierarchy
System.Object
 System.Attribute
 Autodesk.Revit.Attributes.TransactionAttribute
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TransactionAttribute : Attribute
Public Class TransactionAttribute
	Inherits Attribute
public ref class TransactionAttribute : public Attribute
type TransactionAttribute =
    class
        inherit Attribute
    end
The TransactionAttribute type exposes the following members.
Constructors
Name | Description
TransactionAttribute | Constructs a new TransactionAttribute.
Top
Properties
Name | Description
Mode | Transaction mode.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.Attributes Namespace