Revit 2027 API
AssetPropertyFloat Properties
The AssetPropertyFloat type exposes the following members.
Properties
Name | Description
Value |  The value of the property.
Top
See Also
Reference
AssetPropertyFloat Class
Autodesk.Revit.DB.Visual Namespace