Revit 2027 API
FamilyElementVisibility Class
Provides access to the visibility parameters of family elements in family document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyElementVisibility
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FamilyElementVisibility : APIObject
Public Class FamilyElementVisibility
	Inherits APIObject
public ref class FamilyElementVisibility : public APIObject
type FamilyElementVisibility =
    class
        inherit APIObject
    end
The FamilyElementVisibility type exposes the following members.
Constructors
Name | Description
FamilyElementVisibility | Initializes a new instance of the FamilyElementVisibility class
Top
Properties
Name | Description
IsShownInCoarse | Indicates if the instance is display with Coarse detail level in the view of project document.
IsShownInFine | Indicates if the instance is display with Fine detail level in the view of project document.
IsShownInFrontBack | Indicates if the instance is display in Front/Back view of project document.
IsShownInLeftRight | Indicates if the instance is display in Left/Right view of project document.
IsShownInMedium | Indicates if the instance is display with Medium detail level in the view of project document.
IsShownInPlanRCPCut | Indicates if the instance is displayed when cut in Plan/RCP (if the category permits).
IsShownInTopBottom | Indicates if the instance is display in Plan/RCP view of project document.
IsShownOnlyWhenCut | Indicates if the instance is displayed only if it has been cut.
VisibilityType | Indicates if the instance is Model or View specific.
Top
Methods
Name | Description
Top
Example
public void CreateAndSetVisibility(Autodesk.Revit.DB.Document familyDocument, SketchPlane sketchPlane)
{
    // create a new ModelCurve in the family document
    XYZ p0 = new XYZ(1, 1, 0);
    XYZ p1 = new XYZ(5, 1, 0);
    Line line1 = Line.CreateBound(p0, p1);
    ModelCurve modelCurve1 = familyDocument.FamilyCreate.NewModelCurve(line1, sketchPlane);
    // create a new ModelText along ModelCurve line
    ModelText text = familyDocument.FamilyCreate.NewModelText("Hello World", null, sketchPlane, p0, HorizontalAlign.Center, 0.1);
    // set visibility for text
    FamilyElementVisibility textVisibility = new FamilyElementVisibility(FamilyElementVisibilityType.Model);
    textVisibility.IsShownInTopBottom = false;
    text.SetVisibility(textVisibility);
    // set visibility for line
    FamilyElementVisibility curveVisibility = new FamilyElementVisibility(FamilyElementVisibilityType.Model);
    curveVisibility.IsShownInCoarse = false;
    modelCurve1.SetVisibility(curveVisibility);
}
See Also
Reference
Autodesk.Revit.DB Namespace