Revit 2027 API
VertexStreamPositionNormal Methods
The VertexStreamPositionNormal type exposes the following members.
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPositionNormal into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPositionNormal instances into the stream and associated buffer.
Top
See Also
Reference
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace