Revit 2027 API
FBXExportOptions Class
3D-Studio Max (FBX) Export options.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FBXExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FBXExportOptions
Public Class FBXExportOptions
public ref class FBXExportOptions
type FBXExportOptions = class end
The FBXExportOptions type exposes the following members.
Constructors
Name | Description
FBXExportOptions | Default constructor. Sets all options to their default values.
Top
Properties
Name | Description
LevelsOfDetailValue | The value of the levels of detail.
StopOnError | Whether export process should stop when a view fails to export.
UseLevelsOfDetail | True to use levels of detail, false otherwise.
WithoutBoundaryEdges | True to export without boundary edges, false otherwise.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace