Revit 2027 API
ViewSet Methods
The ViewSet type exposes the following members.
Methods
Name | Description
Clear | Removes every view from the set, rendering it empty.
Contains | Tests for the existence of a view within the set.
Erase | Removes a specified view from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified view into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
ViewSet Class
Autodesk.Revit.DB Namespace