Revit 2027 API
MultiServerService Properties
The MultiServerService type exposes the following members.
Properties
Name | Description
ExecutionPolicy |  Specifies how a multi-server service executes servers during its execution.
Top
See Also
Reference
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace