Revit 2027 API
PointCloudColorSettings Methods
The PointCloudColorSettings type exposes the following members.
Methods
Name | Description
Assign |  Assigns values of the source settings to this object.
Dispose
IsEqual |  Check if the contents of two settings are equal.
Top
See Also
Reference
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace