Revit 2027 API
RebarFreeFormAccessor Methods
The RebarFreeFormAccessor type exposes the following members.
Methods
Name | Description
AddUpdatingSharedParameter |  Add existing shared parameter as a dependency for the calculation of the rebar curves.
CanBeTerminationPlaneNormal |  A vector can be termination (e.g. hook, crank) plane normal if for a bar specified by index, the bar direction is not parallel with the vector.
DisconnectFromServer |  Sets the GUID of the API server to invalid value and removes all the server related data from the Rebar (ex. the current constraints and the handle tags are removed). Calling this method will result in a Rebar that will not react to host changes anymore, however it will still have all the properties that it used to have.
Dispose
Flip3dPathSet |  For a free form set distributed along a 3D path, this method flips the distribution path. The set should not have Single layout rule.
GetComputationDataFor3DPathSet |  For a free form set distributed along a 3D path, this method gets the computation data.
GetCouplerIdAtIndex |  Gets the id of the Rebar Coupler that is applied to the bar with index barPositionIndex at the specified end.
GetCrankTypeIdAtIndex |  Gets the id of the Rebar Crank Type that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetCustomDistributionPath |  Gets the custom distribution path for free form rebar set.
GetDefaultPositiveDirectionForMorphedTargetEdgesHandle |  Gets the default positive direction of the specified target rebar edge in terms of how Morphed Free Form Rebar is defining the default positive direction.
GetEndTreatmentTypeIdAtIndex |  Gets the id of the EndTreatmentType that is applied to the bar with index barPositionIndex at the specified end.
GetHookTypeIdAtIndex |  Gets the id of the RebarHookType that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetServerGUID |  Returns the GUID of the API server.
GetShapeIdAtIndex |  Gets the Rebar Shape id for the bar with index barPositionIndex.
GetTerminationOrientationAtIndex |  Gets the termination's (e.g. hook, crank ) orientation that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetTerminationPlaneNormalForBarIndex |  Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
GetTerminationRotationAngleAtIndex |  Gets the termination (e.g hook,crank) rotation angle that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
GetUpdatingSharedParameters |  Get the shared parameters listed as dependencies in the calculation of the rebar curves
HasValid3DPathServer |  Returns true if the current rebar is created with the 3D Path Free Form rebar server, false otherwise.
HasValidAlignedServer |  Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.
HasValidMorphedServer |  Returns true if the current rebar is created with the Morphed Free Form rebar server, false otherwise.
HasValidServer |  Returns true if the current rebar contains a valid server GUID, false otherwise.
HasValidSurfaceServer |  Returns true if the current rebar is created with the Surface Free Form rebar server, false otherwise.
IsBarMatchedWithShapeInReverseOrder |  Checks if the bar at index barPositionIndex it's matched in reversed order with its shape.
IsUnconstrained |  Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints.
IsValidRebarTargetForMorphedRebar |  Checks if the rebar can be used as a target for morphed rebar. A rebar is a valid target for morphed rebar if all the bars in set have the same number of segments and all are planar. Multiplanar bars are considered invalid.
RemoveUpdatingSharedParameter |  Remove existing shared parameter as a dependency for the calculation of the rebar curves.
SetComputationDataFor3DPathSet |  For a free form set distributed along a 3D path, this method sets the computation data.
SetCurves(IList<CurveLoop>) |  Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetCurves(IList<IList<Curve>>) |  Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
SetLayoutAsCustomSpacing |  Sets the Layout Rule property of rebar set to Custom Spacing.
SetLayoutAsFixedNumber |  Sets the Layout Rule property of rebar set to Fixed Number.
SetLayoutAsMaximumSpacing |  Sets the Layout Rule property of rebar set to Maximum Spacing.
SetLayoutAsMinimumClearSpacing |  Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
SetLayoutAsNumberWithSpacing |  Sets the Layout Rule property of rebar set to Number With Spacing.
SetLayoutAsSingle |  Sets the Layout Rule property of rebar set to Single.
SetReportedShape |  This method changes the RebarShape of a Free Form Rebar that is using RebarWorkInstructions.Straight property to the provided RebarShape.
SetTerminationPlaneNormalForBarIndex |  Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay. Will throw exception if the rebar has valid constraints.
Top
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace