Revit 2027 API
FaceNode Class
 An output node that represents a Face.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceNode : RenderNode
Public Class FaceNode
	Inherits RenderNode
public ref class FaceNode : public RenderNode
type FaceNode =
    class
        inherit RenderNode
    end
The FaceNode type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
GetFace |  Returns the Face object corresponding to the node.
Top
Remarks
 See also: OnFaceBegin(FaceNode).
See Also
Reference
Autodesk.Revit.DB Namespace