Revit 2027 API
MEPBuildingConstructionSet Class
A set that contains MEPBuildingConstructions.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class MEPBuildingConstructionSet : APIObject,
	IEnumerable
Public Class MEPBuildingConstructionSet
	Inherits APIObject
	Implements IEnumerable
public ref class MEPBuildingConstructionSet : public APIObject,
	IEnumerable
type MEPBuildingConstructionSet =
    class
        inherit APIObject
        interface IEnumerable
    end
The MEPBuildingConstructionSet type exposes the following members.
Constructors
Name | Description
MEPBuildingConstructionSet | Initializes a new instance of the MEPBuildingConstructionSet class
Top
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
Size | Returns the number of MEPBuildingConstructions that are in the set.
Top
Methods
Name | Description
Clear | Removes every MEPBuildingConstruction from the set, rendering it empty.
Contains | Tests for the existence of a MEPBuildingConstruction within the set.
Erase | Removes a specified MEPBuildingConstruction from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified MEPBuildingConstruction into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace