Revit 2027 API
ContourSetting Methods
The ContourSetting type exposes the following members.
Methods
Name | Description
AddContourRange |  Add a set of contours as a contour setting item to the current contour setting.
AddSingleContour |  Add a single contour as a contour setting item to the current contour setting.
DisableItem |  Disable a contour setting item of the current contour setting so that the item will not be used to draw contours.
Dispose
EnableItem |  Enable a contour setting item of the current contour setting so that the item will be used to draw contours.
GetContourSettingItems |  Get all contour setting items.
GetItemIndex |  Get the index of a contour setting item of the current contour setting
IsItemEnabled |  Check if a ContourSettingItem is enabled
RemoveItem |  Remove a contour setting item from the current contour setting.
Top
See Also
Reference
ContourSetting Class
Autodesk.Revit.DB Namespace