Revit 2027 API
StructuralSectionRectangular Class
 Defines common set of parameters for structural section rectangular contour.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 More
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class StructuralSectionRectangular : StructuralSection
Public Class StructuralSectionRectangular
	Inherits StructuralSection
public ref class StructuralSectionRectangular : public StructuralSection
type StructuralSectionRectangular =
    class
        inherit StructuralSection
    end
The StructuralSectionRectangular type exposes the following members.
Properties
Name | Description
CentroidHorizontal |  Distance from centroid to the left extremites along horizontal axis.
CentroidVertical |  Distance from centroid to the upper extremites along vertical axis.
Height |  Section height, depth.
NameKey |  Name Key
Width |  Section width.
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteCross
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteL
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangle
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUserDefined