Revit 2027 API
CombinableElementArray Properties
The CombinableElementArray type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the array is empty.
Item | Gets or sets a CombinableElement at a specified index within the array.
Size | Returns the number of CombinableElements that are in the array.
Top
See Also
Reference
CombinableElementArray Class
Autodesk.Revit.DB Namespace