Revit 2027 API
ElementArrayIterator Class
An iterator to an element array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ElementArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class ElementArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class ElementArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class ElementArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type ElementArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The ElementArrayIterator type exposes the following members.
Constructors
Name | Description
ElementArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
Top
Methods
Name | Description
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
Top
See Also
Reference
Autodesk.Revit.DB Namespace