Revit 2027 API
FabricationPartType Methods
The FabricationPartType type exposes the following members.
Methods
Name | Description
Create |  Creates a fabrication part type element based on a specific fabrication servic button and condition.
Lookup |  Looks up an existing fabrication part type based on a specfic fabrication service button and condition.
ResetAssemblyTypes |  Resets the assembly types of all assembly instances with one or more FabricationPart element. The document where the assemblies with FabricationPart will be reset.
Top
See Also
Reference
FabricationPartType Class
Autodesk.Revit.DB Namespace