Revit 2027 API
VertexStreamPositionNormal Class
 A stream that can be used to write vertices of type VertexPositionNormal into a buffer (see VertexBuffer).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexStream
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexStreamPositionNormal : VertexStream
Public Class VertexStreamPositionNormal
	Inherits VertexStream
public ref class VertexStreamPositionNormal : public VertexStream
type VertexStreamPositionNormal =
    class
        inherit VertexStream
    end
The VertexStreamPositionNormal type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPositionNormal into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPositionNormal instances into the stream and associated buffer.
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace