Revit 2027 API
DWGImportOptions Class
 The import options used by importing DWG or DXF format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.DWGImportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DWGImportOptions : BaseImportOptions
Public Class DWGImportOptions
	Inherits BaseImportOptions
public ref class DWGImportOptions : public BaseImportOptions
type DWGImportOptions =
    class
        inherit BaseImportOptions
    end
The DWGImportOptions type exposes the following members.
Constructors
Name | Description
DWGImportOptions() |  Constructs a new instance of DWGImportOptions with default values of all properties.
DWGImportOptions(DWGImportOptions) |  Constructs a new instance of DWGImportOptions as a copy of the import options.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetLineWeights |  Gets array of line weights.
SetLineWeights |  Set array of line weights.
Top
See Also
Reference
Autodesk.Revit.DB Namespace