Revit 2027 API
Gutter Methods
The Gutter type exposes the following members.
Methods
Name | Description
AddSegment | Add segments to the gutter.
(Overrides HostedSweep.AddSegment(Reference))
Top
See Also
Reference
Gutter Class
Autodesk.Revit.DB.Architecture Namespace