Revit 2027 API
ReferenceWithContext Class
 An object including a reference to a geometric object and related context, as instance transform etc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ReferenceWithContext
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ReferenceWithContext : IDisposable
Public Class ReferenceWithContext
	Implements IDisposable
public ref class ReferenceWithContext : IDisposable
type ReferenceWithContext =
    class
        interface IDisposable
    end
The ReferenceWithContext type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Proximity |  The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReferenceWithContext
GetInstanceTransform |  Gets the transform of the instance.
GetReference |  Gets the reference of the geometric object.
Top
Remarks
 The ReferenceWithContext is used as the returned value from the method [!:Autodesk::Revit::DB::Document::FindReferencesWithContextByDirection], ReferenceIntersector.Find(XYZ, XYZ), or ReferenceIntersector.FindNearest(XYZ, XYZ). It includes a reference intersecting a line extended in a certain direction from an origin point and the context of the geometric object, as the transform and proximity.
See Also
Reference
Autodesk.Revit.DB Namespace