Revit 2027 API
VectorAtPoint Class
 Stores vectors at one domain point. Each vector corresponds to a "measurement" for which this vector was calculated.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueAtPointBase
 Autodesk.Revit.DB.Analysis.VectorAtPoint
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VectorAtPoint : ValueAtPointBase
Public Class VectorAtPoint
	Inherits ValueAtPointBase
public ref class VectorAtPoint : public ValueAtPointBase
type VectorAtPoint =
    class
        inherit ValueAtPointBase
    end
The VectorAtPoint type exposes the following members.
Constructors
Name | Description
VectorAtPoint(IList<XYZ>) |  Creates object from an array of vectors
VectorAtPoint(VectorAtPoint) |  Creates a copy of the given VectorAtPoint instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Example
// Place analysis results in the form of vectors at each of a beam or column's analytical model curve
Transform transform = analyticalElem.GetTransform();
int index = spatialFieldManager.AddSpatialFieldPrimitive(curve, Transform.Identity);
IList<double> doubleList = new List<double>();
doubleList.Add(curve.GetEndParameter(0)); // vectors will be at each end of the analytical model curve
doubleList.Add(curve.GetEndParameter(1));
FieldDomainPointsByParameter pointsByParameter = new FieldDomainPointsByParameter(doubleList);
List<XYZ> xyzList = new List<XYZ>();
xyzList.Add(curve.ComputeDerivatives(0, true).BasisX.Normalize()); // vectors will be tangent to the curve at its ends
IList<VectorAtPoint> vectorList = new List<VectorAtPoint>();
vectorList.Add(new VectorAtPoint(xyzList));
xyzList.Clear();
xyzList.Add(curve.ComputeDerivatives(1, true).BasisX.Normalize().Negate());
vectorList.Add(new VectorAtPoint(xyzList));
FieldValues fieldValues = new FieldValues(vectorList);
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace