Revit 2027 API
FilterNumericLess Class
 Tests whether numeric values from the document are less than a certain value
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterNumericRuleEvaluator
 Autodesk.Revit.DB.FilterNumericLess
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterNumericLess : FilterNumericRuleEvaluator
Public Class FilterNumericLess
	Inherits FilterNumericRuleEvaluator
public ref class FilterNumericLess : public FilterNumericRuleEvaluator
type FilterNumericLess =
    class
        inherit FilterNumericRuleEvaluator
    end
The FilterNumericLess type exposes the following members.
Constructors
Name | Description
FilterNumericLess |  Constructs an instance of FilterNumericLess.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace