Revit 2027 API
AnalysisDisplayColoredSurfaceSettings Class
 Contains colored surface settings for analysis display style element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class AnalysisDisplayColoredSurfaceSettings : IDisposable
Public Class AnalysisDisplayColoredSurfaceSettings
	Implements IDisposable
public ref class AnalysisDisplayColoredSurfaceSettings : IDisposable
type AnalysisDisplayColoredSurfaceSettings =
    class
        interface IDisposable
    end
The AnalysisDisplayColoredSurfaceSettings type exposes the following members.
Constructors
Name | Description
AnalysisDisplayColoredSurfaceSettings() |  Constructs a default instance of colored surface settings.
AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings) |  Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.
Top
Properties
Name | Description
GridColor |  Color of grid lines.
GridLineWeight |  Line weight of grid lines.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShowContourLines |  If true, show contour lines in the analysis display.
ShowGridLines |  If true, show grid lines in the analysis display.
Transparency |  Transparency percentage of colored surface
Top
Methods
Name | Description
Dispose | Releases all resources used by the AnalysisDisplayColoredSurfaceSettings
IsEqual |  Compares two colored surface settings objects.
Top
Example
AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings = new AnalysisDisplayColoredSurfaceSettings();
coloredSurfaceSettings.ShowGridLines = true;
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace