Revit 2027 API
SolidCurveIntersectionOptions Class
 This class contains the options used to calculate the intersection between a solid and a curve.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SolidCurveIntersectionOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SolidCurveIntersectionOptions : IDisposable
Public Class SolidCurveIntersectionOptions
	Implements IDisposable
public ref class SolidCurveIntersectionOptions : IDisposable
type SolidCurveIntersectionOptions =
    class
        interface IDisposable
    end
The SolidCurveIntersectionOptions type exposes the following members.
Constructors
Name | Description
SolidCurveIntersectionOptions |  Constructs a new SolidCurveIntersectionMode with default settings.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ResultType |  The type of results expected by the calculation. The default is CurveSegmentsInside.
Top
Methods
Name | Description
Dispose | Releases all resources used by the SolidCurveIntersectionOptions
Top
See Also
Reference
Autodesk.Revit.DB Namespace