Revit 2027 API
ElementClassFilter Methods
The ElementClassFilter type exposes the following members.
Methods
Name | Description
GetElementClass |  The class for the filter.
Top
See Also
Reference
ElementClassFilter Class
Autodesk.Revit.DB Namespace