Revit 2027 API
WireConduitType Properties
The WireConduitType type exposes the following members.
Properties
Name | Description
Name
Top
See Also
Reference
WireConduitType Class
Autodesk.Revit.DB.Electrical Namespace