Revit 2027 API
PointCloudType Methods
The PointCloudType type exposes the following members.
Methods
Name | Description
Create |  Creates a new point cloud type for a given point cloud engine.
GetPath |  Gets the path of the link source from which the points are loaded.
GetReCapProject |  This method provides a direct entry point to get access to an object from the ReCap SDK (ReCapWrapper.RCProject) from Revit. This object represents the point cloud from the RC file path stored in PointCloudType. The ReCap assembly AdskRcManaged.dll will need to be included into code using this method.
Top
See Also
Reference
PointCloudType Class
Autodesk.Revit.DB Namespace