Revit 2027 API
CategorySet Methods
The CategorySet type exposes the following members.
Methods
Name | Description
Clear | Removes every item from the set, rendering it empty.
Contains | Tests for the existence of a category within the set.
Erase | Removes a specified category from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified category into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace