Revit 2027 API
ModelPath Methods
The ModelPath type exposes the following members.
Methods
Name | Description
Compare |  Compares this ModelPath with another
Dispose
GetModelGUID |  A GUID identifying the Revit cloud model.
GetProjectGUID |  A GUID identifying Cloud Model project to which the cloud model is associated.
Top
See Also
Reference
ModelPath Class
Autodesk.Revit.DB Namespace