Revit 2027 API
CylindricalHelix Class
A cylindrical helix.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.CylindricalHelix
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CylindricalHelix : Curve
Public Class CylindricalHelix
	Inherits Curve
public ref class CylindricalHelix : public Curve
type CylindricalHelix =
    class
        inherit Curve
    end
The CylindricalHelix type exposes the following members.
Properties
Name | Description
BasePoint | The base point of the axis of the cylindrical helix.
Height |  Height of the cylindrical helix.
IsRightHanded | True if the helix is right handed, false if the helix is left handed.
Pitch | The pitch of the cylindrical helix.
Radius | The radius of the cylindrical helix.
XVector | The X direction vector.
YVector | The Y direction vector.
ZVector | The Z direction vector, which is same as the axis direction vector.
Top
Methods
Name | Description
Create |  Create a cylindrical helix.
Top
Remarks
 The helix winds around a cylinder making constant angle with the axis of the cylinder. In this release, CylindricalHelix curves are used only in specific applications in stairs and railings, and should not be used or encountered when accessing curves of other Revit elements and geometry.
See Also
Reference
Autodesk.Revit.DB Namespace