Revit 2027 API
Railing Methods
The Railing type exposes the following members.
Methods
Name | Description
Create(Document, CurveLoop, ElementId, ElementId) |  Creates a new railing by specifying the railing path in the project document.
Create(Document, ElementId, ElementId, RailingPlacementPosition) |  Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element.
Create(Document, ElementId, ElementId, ElementId, RailingPlacementPosition) |  Creates new railings with the specified railing type on all sides of a stairs instance in a MultistoryStairs element.
Flip |  Flips the railing.
GetHandRails |  Get all the handrails of the railing.
GetMultistoryStairsPlacementLevels |  Gets the ids of the base levels of the stairs upon which this railing is placed.
GetPath |  Gets the railing path.
GetSubelementOnLevel |  Gets the subelement on given level.
IsValidHostForNewRailing |  Checks whether new railing can be created and placed on the specified host.
IsValidPathForRailing |  Checks whether a railing can be created along a railing path.
RailingCanBeHostedByElement |  Checks whether the specified element can be used as a host for the railing. The host can be:
stairs
stairs component
ramp
floor
slab edge
wall
roof
RemoveHost |  Removes the association between the railing and its host.
Reset |  Resets the railing to the default one that the system generates.
ResetSupportPosition |  Resets the continuous rails support subelements position data.
SetMultistoryStairsPlacementLevels |  Sets the ids of the base levels of the stairs upon which this railing is placed.
SetPath |  Sets the railing path.
Top
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace