Revit 2027 API
NullParameterValue Class
 A class that represent an empty (null) value of a parameter element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterValue
 Autodesk.Revit.DB.NullParameterValue
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NullParameterValue : ParameterValue
Public Class NullParameterValue
	Inherits ParameterValue
public ref class NullParameterValue : public ParameterValue
type NullParameterValue =
    class
        inherit ParameterValue
    end
The NullParameterValue type exposes the following members.
Constructors
Name | Description
NullParameterValue |  Default constructor
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB Namespace