Revit 2027 API
FilledRegion Methods
The FilledRegion type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, IList<CurveLoop>) |  Creates a view-specific filled region from the given boundaries.
Create(Document, ElementId, SketchPlane, IList<CurveLoop>) |  Creates a filled region on a sketch plane in a 3d model family.
CreateMaskingRegion(Document, ElementId, IList<CurveLoop>) |  Creates a view-specific masking region from the given boundaries.
CreateMaskingRegion(Document, SketchPlane, IList<CurveLoop>) |  Creates a masking region on a sketch plane in a 3d model family.
GetBoundaries |  Gets the boundaries.
GetValidLineStyleIdsForFilledRegion |  Gets the line style Ids which are permitted to be assigned to a filled region.
IsValidFilledRegionTypeId |  Indicates whether the given Id is a valid filled region type Id.
IsValidLineStyleIdForFilledRegion |  Indicates whether the given Id is a valid line style Id.
SetLineStyleId |  Sets the line style Id for all boundaries.
Top
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace