Revit 2027 API
AssemblyMemberDifferentType Properties
The AssemblyMemberDifferentType type exposes the following members.
Properties
Name | Description
TypeId1 |  Type id of the first assembly member
TypeId2 |  Type id of the second assembly member
Top
See Also
Reference
AssemblyMemberDifferentType Class
Autodesk.Revit.DB Namespace