Revit 2027 API
GeometryInstance Class
An instance of another element (symbol), specially positioned by this element.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.GeometryInstance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class GeometryInstance : GeometryObject
Public Class GeometryInstance
	Inherits GeometryObject
public ref class GeometryInstance : public GeometryObject
type GeometryInstance =
    class
        inherit GeometryObject
    end
The GeometryInstance type exposes the following members.
Properties
Name | Description
SymbolGeometry | The geometric representation of the symbol which generates this instance.
Transform | The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance.
Top
Methods
Name | Description
GetDocument | Gets the document that contains the symbol of this instance.
GetInstanceGeometry() | Computes the geometric representation of the instance.
GetInstanceGeometry(Transform) | Computes a transformation of the geometric representation of the instance.
GetSymbolGeometry() | Computes the geometric representation of the symbol which generates this instance.
GetSymbolGeometry(Transform) | Computes a transformation of the geometric representation of the symbol which generates this instance.
GetSymbolGeometryId | Gets the SymbolGeometryId that contains data about the symbol of this instance.
Top
Remarks
 A GeometryInstance represents a set of geometry stored by Revit in a default configuration, and then transformed into the proper location as a result of the properties of the element. The most common situation where GeometryInstances are encountered is in Family instances. Revit uses GeometryInstances to allow it to store a single copy of the geometry for a given family and reuse it in multiple instances. Note that not all Family instances will include GeometryInstances. When Revit needs to make a unique copy of the family geometry for a given instance (because of the effect of local joins, intersections, and other factors related to the instance placement) no GeometryInstance will be encountered; instead the Solid geometry will be found at the top level of the hierarchy. Another example of GeometryInstance usage is in Rebar element visible in fine 3D Views. Here, each segement of a rebar is a GeometryInstance. In this case the Symbol Element is contaning all the geometries that are instanced. A GeometryInstance offers the ability to read its geometry through the GetSymbolGeometry() and GetInstanceGeometry() methods. These methods return another Autodesk.Revit.DB.GeometryElement which can be parsed just like the first level return.
See Also
Reference
Autodesk.Revit.DB Namespace