Revit 2027 API
GroupSet Methods
The GroupSet type exposes the following members.
Methods
Name | Description
Clear | Removes every group from the set, rendering it empty.
Contains | Tests for the existence of a group within the set.
Erase | Removes a specified group from the set.
ForwardIterator | Retrieve a forward moving iterator to the set.
GetEnumerator | Retrieve a forward moving iterator to the set.
Insert | Insert the specified group into the set.
ReverseIterator | Retrieve a backward moving iterator to the set.
Top
See Also
Reference
GroupSet Class
Autodesk.Revit.DB Namespace