Revit 2027 API
StringParameterValue Properties
The StringParameterValue type exposes the following members.
Properties
Name | Description
Value |  The stored value
Top
See Also
Reference
StringParameterValue Class
Autodesk.Revit.DB Namespace