Revit 2027 API
ElevationMarker Methods
The ElevationMarker type exposes the following members.
Methods
Name | Description
CreateElevation |  Creates a new elevation ViewSection on the ElevationMarker at the desired index.
CreateElevationMarker |  Creates a new ElevationMarker.
CreateReferenceElevation |  Creates a reference elevation on the ElevationMarker at the desired index.
CreateReferenceElevationMarker |  Creates a new ElevationMarker.
GetViewId |  Returns the ViewSection id for the index of the ElevationMarker.
HasElevations |  Returns true if the ElevationMarker has at least one elevation view, false otherwise.
IsAvailableIndex |  Returns true if a new elevation ViewSection can be placed at %index%, returns false otherwise.
Top
See Also
Reference
ElevationMarker Class
Autodesk.Revit.DB Namespace