Revit 2027 API
RebarShapeTerminationsData Methods
The RebarShapeTerminationsData type exposes the following members.
Methods
Name | Description
Dispose
GetDocument |  Gets the document containing the end treatment ids.
Top
See Also
Reference
RebarShapeTerminationsData Class
Autodesk.Revit.DB.Structure Namespace