Revit 2027 API
AnalyticalBusData Properties
The AnalyticalBusData type exposes the following members.
Properties
Name | Description
CurrentRating |  The current rating value of the analytical bus.
TotalConnectedCurrent |  The total connected current of the analytical bus.
Top
See Also
Reference
AnalyticalBusData Class
Autodesk.Revit.DB.Electrical Namespace