Revit 2027 API
InvalidOperationException Methods
The InvalidOperationException type exposes the following members.
Methods
Name | Description
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
Top
See Also
Reference
InvalidOperationException Class
Autodesk.Revit.Exceptions Namespace