Revit 2027 API
PolymeshTopology Class
 A class representing topology of a polymesh.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PolymeshTopology
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PolymeshTopology : IDisposable
Public Class PolymeshTopology
	Implements IDisposable
public ref class PolymeshTopology : IDisposable
type PolymeshTopology =
    class
        interface IDisposable
    end
The PolymeshTopology type exposes the following members.
Properties
Name | Description
DistributionOfNormals |  Indicates the distribution of normal vectors along the tessellated polymesh surface.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberOfFacets |  The number of facet in the polymesh.
NumberOfNormals |  The number of normals associated with the polymesh
NumberOfPoints |  The number of points in the polymesh
NumberOfUVs |  The number of UV coordinates available for the polymesh.
Top
Methods
Name | Description
Dispose | Releases all resources used by the PolymeshTopology
GetFacet |  Returns a definition of one facet
GetFacets |  Returns a definitions of all facets of the polymesh
GetNormal |  Returns a normal vector at the given index
GetNormals |  Returns all normals assigned to the polymesh
GetPoint |  Returns one point at the given index.
GetPoints |  Returns all points of the polymesh.
GetUV |  Returns one UV coordinate at the given index.
GetUVs |  Returns all UV coordinates assigned to the polymesh
Top
Remarks
 Topology of a polymesh consists of a number of points and triangular facets formed by the points. Each facet is determined by three indices to the array of points. A polymesh may have UV coordinates assigned, and always has at least one normal associated. There may be more than one normal available for a non-planar polymesh; there may be as many normals as there are either facets or points in the polymesh. The DistributionOfNormals property indicates how normals are distributed along the polymesh.
See Also
Reference
Autodesk.Revit.DB Namespace