Revit 2027 API
ConfigurationReloadInfo Methods
The ConfigurationReloadInfo type exposes the following members.
Methods
Name | Description
Dispose
GetConnectivityValidation |  Returns information about the post-reload connectivity validation.
GetCustomDataChangedElements |  Gets a list of ElementIds of fabrication parts that had custom data updated during the reload.
GetOutOfDatePartStatus |  Access reload information for out of date part.
Top
See Also
Reference
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace