Revit 2027 API
DocumentSynchronizedWithCentralEventArgs Class
 The event arguments used by the DocumentSynchronizedWithCentralEventArgs event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentSynchronizedWithCentralEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentSynchronizedWithCentralEventArgs : RevitAPIPostDocEventArgs
Public Class DocumentSynchronizedWithCentralEventArgs
	Inherits RevitAPIPostDocEventArgs
public ref class DocumentSynchronizedWithCentralEventArgs : public RevitAPIPostDocEventArgs
type DocumentSynchronizedWithCentralEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
The DocumentSynchronizedWithCentralEventArgs type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace