Revit 2027 API
HemisphericalLightDistribution Class
 This class encapsulates a hemispherical light distribution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class HemisphericalLightDistribution : LightDistribution
Public Class HemisphericalLightDistribution
	Inherits LightDistribution
public ref class HemisphericalLightDistribution : public LightDistribution
type HemisphericalLightDistribution =
    class
        inherit LightDistribution
    end
The HemisphericalLightDistribution type exposes the following members.
Constructors
Name | Description
HemisphericalLightDistribution() |  Creates a hemispherical light distribution object.
HemisphericalLightDistribution(HemisphericalLightDistribution) |  Creates a copy of the given hemispherical light distribution
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace