Revit 2027 API
RebarShapeParameters Methods
The RebarShapeParameters type exposes the following members.
Methods
Name | Description
Dispose
GetAllRebarShapeParameters |  List all shape parameters used by all the existing RebarShapes in the specified document.
GetElementIdForExternalDefinition |  Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, return InvalidElementId.
GetExternalDefinitionForElementId |  Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document.
GetOrCreateElementIdForExternalDefinition |  Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, add the parameter to the document and generate a new ElementId.
IsValidExternalDefinition |  Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter.
Top
See Also
Reference
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace