Revit 2027 API
MEPSpaceConstruction Methods
The MEPSpaceConstruction type exposes the following members.
Methods
Name | Description
DeleteConstruction | Remove an existing construction from Space constructions.
DuplicateConstruction | Create a new construction for Space constructions.
NewConstruction | Create a new construction for Space constructions.
Top
See Also
Reference
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace