Revit 2027 API
TopographySurface Properties
The TopographySurface type exposes the following members.
Properties
Name | Description
ArePointsEditable |  Identifies whether the points of this topography surface can be edited independently. Topography surfaces created from external data will not allow editing of individual points.
AssociatedBuildingPadId |  The element id of the building pad which causes this topography surface to be formed.
IsAssociatedWithBuildingPad |  Identifies if this element represents a topography surface associated with a building pad.
IsSiteSubRegion |  Identifies if this element represents a subregion.
MaterialId |  The id of the material applied to this element.
Top
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace