Revit 2027 API
DefinitionGroups Class
A specialized set of definition groups that allows creation of new groups.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DefinitionGroups
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DefinitionGroups : IEnumerable<DefinitionGroup>,
	IDisposable
Public Class DefinitionGroups
	Implements IEnumerable(Of DefinitionGroup), IDisposable
public ref class DefinitionGroups : IEnumerable<DefinitionGroup^>,
	IDisposable
type DefinitionGroups =
    class
        interface IEnumerable<DefinitionGroup>
        interface IDisposable
    end
The DefinitionGroups type exposes the following members.
Properties
Name | Description
IsEmpty | Identifies if the definition groups collection is empty.
Item | Retrieve a definition group by name.
Size | The number of definition groups in the collection.
Top
Methods
Name | Description
Contains | Tests for the existence of a definition group within the collection.
Create | Create a new parameter definition group using the name provided.
Dispose | Releases all resources used by the DefinitionGroups
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Retrieves an enumerator to the collection.
Top
See Also
Reference
Autodesk.Revit.DB Namespace