Revit 2027 API
ParameterMap Class
A map that can contain a mapping of a parameter name (a String) to a parameter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ParameterMap
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ParameterMap : APIObject,
	IEnumerable
Public Class ParameterMap
	Inherits APIObject
	Implements IEnumerable
public ref class ParameterMap : public APIObject,
	IEnumerable
type ParameterMap =
    class
        inherit APIObject
        interface IEnumerable
    end
The ParameterMap type exposes the following members.
Constructors
Name | Description
ParameterMap | Initializes a new instance of the ParameterMap class
Top
Properties
Name | Description
IsEmpty | Test to see if the map is empty.
Item | Gets or sets an item at a specified key within the map.
Size | Returns the number of objects that are in the map.
Top
Methods
Name | Description
Clear | Removes every item from the map, rendering it empty.
Contains | Tests for the existence of a key within the map.
Erase | Removes a object with the specified key from the map.
ForwardIterator | Retrieve a forward moving iterator to the map.
GetEnumerator | Retrieve a forward moving iterator to the map.
Insert | Insert the specified item with the specified key into the map.
ReverseIterator | Retrieve a backward moving iterator to the map.
Top
See Also
Reference
Autodesk.Revit.DB Namespace