Revit 2027 API
NestedFamilyTypeReference Class
 A proxy element representing a nested family type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.NestedFamilyTypeReference
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class NestedFamilyTypeReference : Element
Public Class NestedFamilyTypeReference
	Inherits Element
public ref class NestedFamilyTypeReference : public Element
type NestedFamilyTypeReference =
    class
        inherit Element
    end
The NestedFamilyTypeReference type exposes the following members.
Properties
Name | Description
CategoryId |  Category Id of the referenced family
FamilyName |  Name of the referenced family
TypeName |  Type of the referenced family
Top
Methods
Name | Description
Top
Remarks
This element represents a value of a FamilyType Parameter of a Loaded Family. Each such element corresponds to a nested FamilyType Element in the original Family Document where the family was defined.
This element stores only basic information about the nested FamilyType, such as the name of the Type, name of the Family, and a Category.
These elements are very low-level and thus bypassed by standard element filters. However, it is possible to obtain a set of applicable elements of this class for a FamilyType parameter of a family by calling [!:Autodesk::Revit::DB::Family::GetFamilyTypeParameterValues]
See Also
Reference
Autodesk.Revit.DB Namespace