Revit 2027 API
ImageInstance Class
 An element that represents an instance of an image placed in a view
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ImageInstance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ImageInstance : Element
Public Class ImageInstance
	Inherits Element
public ref class ImageInstance : public Element
type ImageInstance =
    class
        inherit Element
    end
The ImageInstance type exposes the following members.
Properties
Name | Description
CanHaveSnaps |  When true the ImageInstance has snaps that can be enabled with the EnableSnaps property
DrawLayer |  The layer the ImageInstance will be drawn in.
EnableSnaps |  When true the ImageInstance will have its snaps enabled, but only if CanHaveSnaps is true
Height |  The height of the ImageInstance.
HeightScale |  The factor applied to the ImageType to calculate the Height of the ImageInstance.
LockProportions |  When true the proportion of Width to Height will be maintained
Width |  The width of the ImageInstance.
WidthScale |  The factor applied to the width of the ImageType to calculate the Width of the ImageInstance.
Top
Methods
Name | Description
Create |  Creates a new ImageInstance element placed in a view.
GetLocation |  Returns the location of one of the points of the ImageInstance
IsValidView |  Check that the view is a valid view for ImageInstance elements
SetLocation |  Moves the ImageInstance to the specified location
Top
See Also
Reference
Autodesk.Revit.DB Namespace