Revit 2027 API
FabricationHostedInfo Methods
The FabricationHostedInfo type exposes the following members.
Methods
Name | Description
DisconnectFromHost |  Disconnects the part from the host.
Dispose
GetBearerCenterline |  Gets the centerline of the bearer. The method is applicable only for bearer hanger.
PlaceOnHost(ElementId, Connector, Double) |  Places the part on the specified host.
PlaceOnHost(ElementId, Connector, Double, Double) |  Places the part on the specified host.
Top
See Also
Reference
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace