Revit 2027 API
DuctFittingAndAccessoryPressureDropItem Methods
The DuctFittingAndAccessoryPressureDropItem type exposes the following members.
Methods
Name | Description
Dispose
Top
See Also
Reference
DuctFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Mechanical Namespace