Revit 2027 API
TableView Methods
The TableView type exposes the following members.
Methods
Name | Description
GetAvailableParameterCategories |  Get all available parameter categories.
GetAvailableParameters |  Gets a list of valid parameters for the specified category that can be used in the table view.
GetCalculatedValueName |  Gets the calculated value name for a cell from the template view.
GetCalculatedValueText |  Gets the calculated value text for a cell from the instance view.
GetCellText |  Gets the cell's text based on its type
IsValidSectionType |  Identifies if the section type is valid for this view.
Top
See Also
Reference
TableView Class
Autodesk.Revit.DB Namespace