Revit 2027 API
ElementType Class
 Base class for all Types within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementType : Element
Public Class ElementType
	Inherits Element
public ref class ElementType : public Element
type ElementType =
    class
        inherit Element
    end
The ElementType type exposes the following members.
Properties
Name | Description
CanBeCopied |  Determine if this ElementType can create a copy
CanBeDeleted |  Determine if this ElementType can be deleted
CanBeRenamed |  Determine if this ElementType can be renamed
FamilyName |  Gets the family name of this element type.
Name | Set the name for the ElementType.
(Overrides Element.Name)
Top
Methods
Name | Description
Duplicate |  Duplicates an existing element type and assigns it a new name.
GetPreviewImage | Get the preview image of an element. This image is similar to what is seen in the Revit UI when selecting the type of an element.
GetSimilarTypes |  Obtains a set of types that are similar to this type.
IsSimilarType |  Checks if given type is similar to this type.
IsValidDefaultFamilyType |  Identifies if this type is a valid default family type for the given family category id.
Top
Remarks
 Element types are usually non user visible elements that define instances. For example a wall type is a type that is not visible until an instance of the wall is created.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Analysis.ConceptualConstructionType
 Autodesk.Revit.DB.Architecture.ContinuousRailType
 Autodesk.Revit.DB.Architecture.CutMarkType
 Autodesk.Revit.DB.Architecture.NumberSystemType
 Autodesk.Revit.DB.Architecture.RailingType
 Autodesk.Revit.DB.Architecture.StairsLandingType
 Autodesk.Revit.DB.Architecture.StairsPathType
 Autodesk.Revit.DB.Architecture.StairsRunType
 Autodesk.Revit.DB.Architecture.StairsType
 Autodesk.Revit.DB.Architecture.TopographyLinkType
 Autodesk.Revit.DB.AssemblyType
 Autodesk.Revit.DB.BeamSystemType
 Autodesk.Revit.DB.BrowserOrganization
 Autodesk.Revit.DB.CADLinkType
 Autodesk.Revit.DB.DimensionType
 Autodesk.Revit.DB.DirectShapeType
 Autodesk.Revit.DB.Electrical.CableType
 Autodesk.Revit.DB.Electrical.DistributionSysType
 Autodesk.Revit.DB.Electrical.VoltageType
 Autodesk.Revit.DB.Electrical.WireType
 Autodesk.Revit.DB.FabricationPartType
 Autodesk.Revit.DB.GroupType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.ImageType
 Autodesk.Revit.DB.InsertableObject
 Autodesk.Revit.DB.LineAndTextAttrSymbol
 Autodesk.Revit.DB.Mechanical.DuctInsulationType
 Autodesk.Revit.DB.Mechanical.DuctLiningType
 Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType
 Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction
 Autodesk.Revit.DB.Mechanical.SystemZoneElementType
 Autodesk.Revit.DB.MEPAnalyticalConnectionType
 Autodesk.Revit.DB.MEPSystemType
 Autodesk.Revit.DB.ModelTextType
 Autodesk.Revit.DB.MultiReferenceAnnotationType
 Autodesk.Revit.DB.Plumbing.FluidType
 Autodesk.Revit.DB.Plumbing.PipeInsulationType
 Autodesk.Revit.DB.Plumbing.PipeScheduleType
 Autodesk.Revit.DB.PointCloudType
 Autodesk.Revit.DB.RevitLinkType
 Autodesk.Revit.DB.SiteLocation
 Autodesk.Revit.DB.Structure.AnalyticalLinkType
 Autodesk.Revit.DB.Structure.AreaReinforcementType
 Autodesk.Revit.DB.Structure.EndTreatmentType
 Autodesk.Revit.DB.Structure.FabricAreaType
 Autodesk.Revit.DB.Structure.FabricSheetType
 Autodesk.Revit.DB.Structure.FabricWireType
 Autodesk.Revit.DB.Structure.LoadTypeBase
 Autodesk.Revit.DB.Structure.PathReinforcementType
 Autodesk.Revit.DB.Structure.RebarBarType
 Autodesk.Revit.DB.Structure.RebarBendingDetailType
 Autodesk.Revit.DB.Structure.RebarContainerType
 Autodesk.Revit.DB.Structure.RebarCoverType
 Autodesk.Revit.DB.Structure.RebarHookType
 Autodesk.Revit.DB.Structure.RebarShape
 Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
 Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType
 Autodesk.Revit.DB.Structure.StructuralConnectionType
 Autodesk.Revit.DB.TilePattern
 Autodesk.Revit.DB.ViewFamilyType