Revit 2027 API
TransferringProjectStandardsEventArgs Class
 The event arguments used by the TransferringProjectStandards event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.UI.Events.TransferringProjectStandardsEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TransferringProjectStandardsEventArgs : RevitAPIPreDocEventArgs
Public Class TransferringProjectStandardsEventArgs
	Inherits RevitAPIPreDocEventArgs
public ref class TransferringProjectStandardsEventArgs : public RevitAPIPreDocEventArgs
type TransferringProjectStandardsEventArgs =
    class
        inherit RevitAPIPreDocEventArgs
    end
The TransferringProjectStandardsEventArgs type exposes the following members.
Properties
Name | Description
SourceDocument |  Source document.
TargetDocument |  Target document.
Top
Methods
Name | Description
GetExternalItems |  Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
SetExternalItems |  Sets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace