Revit 2027 API
EdgeEndPoint Methods
The EdgeEndPoint type exposes the following members.
Methods
Name | Description
Dispose
Equals(EdgeEndPoint) |  Determines whether this EdgeEndPoint is equal to another.
Evaluate |  Evaluate the end point of the edge in 3d coordinates.
Top
See Also
Reference
EdgeEndPoint Class
Autodesk.Revit.DB Namespace