Revit 2027 API
InitialFluxIntensity Properties
The InitialFluxIntensity type exposes the following members.
Properties
Name | Description
Flux |  The flux intensity value.
Top
See Also
Reference
InitialFluxIntensity Class
Autodesk.Revit.DB.Lighting Namespace