Revit 2027 API
DocumentOpeningEventArgs Properties
The DocumentOpeningEventArgs type exposes the following members.
Properties
Name | Description
DocumentType |  Type of the document, e.g. Project or Template.
PathName |  Path of the document to be opened.
Top
See Also
Reference
DocumentOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace